{
  "markdown": "\n\nWelcome\nThe National Security Agency (NSA) formed a \nCybersecurity Directorate in 2019 with the charge \nto prevent and eradicate threats to the United \nStates National Security Systems and critical \ninfrastructure, with an initial focus on the Defense \nIndustrial Base and its service providers. \nDrawing on NSAs rich information assurance \nlegacy, the Cybersecurity Directorate refocused \nto meet the demands of the present and the future. \nIt integrated key parts of NSAs cybersecurity \nmission such as threat intelligence, vulnerability \nanalysis, cryptographic expertise and defensive \noperations into a more public-facing organization \ndetermined to raise the cybersecurity bar across \ngovernment and industry while also imposing cost \non U.S. adversaries. \nWhile much of the critical work that NSA does to \nsecure the nation cannot be publicly disclosed, this \nyear in review shares a wealth of information on \ncybersecurity efforts that have better equipped \nthe U.S. to defend against the highest priority cyber \nthreats from November 1, 2020 through October \n31, 2021. \nVisit NSA.gov/cybersecurity to access the report \ndigitally. Provide NSA Cybersecurity with feedback \nor ask questions by emailing cybersecurity@nsa.govNSA Cybersecurity \nProtects and Defends\nNational Security Systems (NSS)\nNetworks that contain classified \ninformation or are otherwise \ncritical to United States military \nand intelligence activities. It is vital \nthat these networks remain secure \nto ensure mission readiness of U.S. \nwarfighting capabilities as well as \nprotect the nations most sensitive \ninformation.\nThe Department of Defense (DoD)\nU.S. military services and \ncombatant commands as well as \nU.S. government agencies and \ndepartments related to national \nsecurity. \nThe Defense Industrial Base (DIB)\nCompanies that design, develop \nand produce the Department \nof Defenses critical systems, platforms and technologies \nrequired to defend the nation. If \nthese networks are at risk, so \nis the U.S.\n\nContents3Letter from the NSA Cybersecurity \nDirector\n4Responding to National Threats \nand Priorities\n7Partnering to Secure Today and \nTomorrow\n10Sharing Timely, Actionable \nGuidance\n12Protecting the Warfighter and \nSupporting the Combatant \nCommands\n16Creating Cryptography to Protect \nData, Communications\n19Defending National Security \nSystems\n22Building a Diverse Workforce That \nCan Tackle Any Challenge\n\n2021 NSA Cybersecurity Year In Reviewwww.NSA.gov/cybersecurity  |  @NSACyber \n\nLetter from the NSA \nCybersecurity Director\nWhen our insights are brought into a feedback loop with industry and government \npartners, amazing outcomes are achieved. We create impact far beyond what any \nof us can do alone. \nCyber threats to our nation rose to national consciousness Signals intelligence (SIGINT) is one of our competitive \nthis past year. We felt the real-world consequences that advantages and a primary reason why our partners seek \nmalicious cyber actors can inflict from cyberspace. We saw our insights. We can look into foreign space and see what \nhow malicious cyber actors will infiltrate global supply chains threat actors are doing, including sophisticated nation-state \nas well as exploit popular applications for ransomware. We actors. We use that information to inform how we manage our \neven saw how ransomware attacks can restrict our travel and resources and secure our systems, but also to create technical \naffect our food supply chain. It hit home that cybersecurity is guidance that helps others secure their systems at scale. \nnational security. \nSince the standup of NSAs Cybersecurity Directorate in 2019, \nOur adversaries and cyber criminals continue to push limits weve released more than 50 actionable cybersecurity reports. \nin cyberspace, creating more national security threats than We often collaborate with our U.S. Government and Five Eyes \nwe have ever seen. partners to create guidance that stands out from the rest. \nOur Cybersecurity Advisories have even been implemented \nOur adversaries are targeting all levels of U.S. Government, in national-level strategies to impose cost on our adversaries. \ncritical infrastructure, industry, academia, private citizens and \nour allies. This is a shared threat that requires us all to work as When our insights are brought into a feedback loop with industry \na coalition with a common goal. As our National Cyber Director and government partners, amazing outcomes are achieved. We \nChris Inglis likes to say, If you are an adversary, you will need create impact far beyond what any of us can do alone.\nto defeat all of us to defeat one of us.\nI also want to mention our one competitive advantage above all \nNowhere is that more evident than at NSAs Cybersecurity others: Our people. Our success in evolving NSAs cybersecurity \nCollaboration Center. In the last year, we opened the door to a mission to meet today and tomorrows demands is a credit \nnew facility where experts from NSA, other U.S. Government to their expertise and their dedication to securing our nation. \nagencies and industry partners work side by side outside Their creativity, persistence and audacity make a difference. \nthe NSA fence line to combat cyber intrusions that threaten Thats what truly stands out to me when I read this Year in \nour nations military capabilities, intellectual property and Review. Thank you to everyone who made this possible. \ntechnology. \nRegards,\nNSA is no longer No Such Agency, but an open leader in the \ncybersecurity community facilitating actionable, bidirectional \ninformation sharing with more than 100 Defense Industrial \nBase partners. These efforts align with our partners at Rob Joyce\nthe Department of Homeland Security Cybersecurity and Rob Joyce \nInfrastructure Security Agency (CISA), U.S. Cyber Command, Director, NSA Cybersecurity\nFBI, elsewhere in the Department of Defense (DoD) and across \nmany other departments and agencies.\n3 Letter from the NSA Cybersecurity Director\n\nResponding to National Threats  \nand Priorities\nExposing a Supply Chain Threat Early collaboration and information sharing allowed NSA \nand industry partners to truly understand the scope NSA continues to provide partners with unique of the threat and protect the nations most sensitive cybersecurity insights through its foreign signals systems. NSA analyzed adversary intent and tradecraft, intelligence (SIGINT) mission. When the cybersecurity informed detection and mitigation efforts of U.S. firm FireEye  now known as Mandiant  first discovered Government and DIB partners, provided cybersecurity the highly sophisticated SolarWinds cyber espionage guidance and conducted hunt operations. It also shared campaign in November 2020, Chief Executive Officer adversary indicators, behaviors and detection guidance.Kevin Mandia and his colleagues made NSA among their \nfirst calls. On the same day the U.S. Government attributed the \ncampaign to the Russian SVR  also known as APT29 Mandiant had great insight on what U.S. adversaries and and Cozy Bear  NSA, the FBI and the Department of cybercriminals were doing in public space, but wanted Homeland Securitys Cybersecurity and Infrastructure to learn what NSA was seeing in SIGINT to build a fuller Security Agency (CISA) publicly released a Cybersecurity picture of adversary and cybercriminal activity. Advisory detailing how the SVR was exploiting five publicly \nknown vulnerabilities. \nLess than a month later, the National Cyber Security \nCentre (UK), NSA, FBI and CISA publicly attributed \nthe SVR to several additional tactics, techniques and \nprocedures (TTPs), further degrading their activities by \ndrawing network defenders attention to the SVR threat \nand how to mitigate it.\nNSAs Cybersecurity Collaboration Center also worked \nwith CISA and industry partners through the Enduring \nSecurity Framework (ESF) to reduce the risk of future \nsupply chain compromises. \nThe partners developed a comprehensive product on how Piecing those components together can really help paint \nto secure a supply chain by identifying best practices for a picture of not only attribution, but exact tradecraft and \nsoftware suppliers, developers and users. whats occurring during a particular campaign, said Ron \nBushar, Mandiants senior vice president and government \nchief technology officer, during a visit to NSA. \nThe scale of the SolarWinds cyberespionage campaign \nhighlighted the need for the public and private sector \nto do more to collaborate. More than 16,000 SolarWinds \nOrion customers across both sectors were victims of \ninstalled malware in the global supply chain compromise. \nMandiant representatives, right, chat with Morgan Adamski, NSA Cybersecurity \nCollaboration Center Chief, during an event at NSA-Washington.\n2021 NSA Cybersecurity Year In Review\nwww.NSA.gov/cybersecurity  |  @NSACyber \n\nCountering Ransomware\nGeneral Paul M. Nakasone, Commander of U.S. Cyber \nCommand and Director of NSA, declared ransomware a \nnational security threat in 2021 following compromises to \nU.S. critical infrastructure and key resources. The Colonial \nPipeline ransomware attack in May created a fuel shortage \non the East Coast and the JBS attack in June briefly halted \nproduction on nearly one fifth of the nations beef, pork \nand poultry. \nIn response, the White House announced a coordinated \nU.S. Government campaign to counter ransomware. NSA \nCybersecurity has played a prominent role by analyzing \nthe threat and sharing insights through its foreign signals \nintelligence about the cyber criminals profiting from ransomware and their infrastructure. NSA has worked \nclosely with U.S. Cyber Command and other government \nand industry partners to pursue the actors, capabilities \nand finances fueling this global threat. \nThroughout the effort, NSA ensured that its threat \nintelligence was disseminated at the lowest possible \nclassification level, so that it generated outcomes. \nNSA joined forces with the FBI and CISA to publicly expose \ncyber actor tactics, techniques and procedures associated \nwith a pair of ransomware variants  BlackMatter and \nConti   that were being increasingly employed against \nU.S. organizations, including some that oversee critical \ninfrastructure. \nThe three U.S. Government agencies also teamed up with \nthe Environmental Protection Agency (EPA) to highlight \nmalicious cyber activity targeting the information \ntechnology (IT) and operational technology (OT) networks, \nsystems and devices of U.S. Water and Wastewater \nSystems (WWS) Sector facilities. Each of these publicly \nreleased Cybersecurity Advisories outlined malicious \ncyber actor activities and provided network defenders \nwith actionable mitigations. \nWe saw cyber incidents continually evolve this past year. Today, cybersecurity is national \nsecurity. We continue to posture ourselves to maintain a competitive advantage as our \nadversaries persistently attempt to up their game.\nGeneral Paul M. Nakasone, Commander, U.S. Cyber Command, Director, NSA/Chief, CSSColonial Pipeline fell victim to a ransomware attack in May 2021.\n5 Responding to National Threats and Priorities\n\nStrategic Competition\nCyberspace has created a setting where cyber adversaries can \nincrease their power, degrade the power of others and gain a \nstrategic advantage  all with a relatively low barrier to entry. \nChina and Russia continue to conduct persistent malicious \ncyber campaigns designed to erode democracy, threaten U.S. \ninfrastructure and reduce U.S. economic prosperity. Their TTPs \nhave evolved, enabling them to advance the scope, scale and \nsophistication of their cyber campaigns. \nPart of NSAs role in characterizing these foreign cyber \nthreats is to provide foundational knowledge for the U.S. \nGovernment to defend its networks, which include degrading \nthe capabilities of U.S. adversaries. Two key examples \ninclude Joint Cybersecurity Advisories published by NSA, CISA \nand the FBI: \n1. The Russian GRU Conducting Global Brute Force Campaign to Compromise Enterprise and Cloud Environments Joint \nCybersecurity Advisory detailed techniques the GRU has used when targeting hundreds of organizations around the world. \nIt also recommended actions defenders can take to make this access method useless, degrading malicious cyber actor \ncapabilities and making it that much more difficult to even begin cyber operations against U.S. networks.\n2. The Chinese State-Sponsored Cyber Operations: Observed TTPs Cybersecurity Advisory provided a comprehensive view of \nhow Chinese actors conduct their cyber activities while targeting U.S. and allied networks. The advisory mapped nearly 100 \nTTPs to the MITRE ATT&CK and D3FEND frameworks which helped network defenders understand the precise mitigation \ntechniques to implement to counter these cyber actors.\n2021 NSA Cybersecurity Year In Review\nwww.NSA.gov/cybersecurity  |  @NSACyberSecuring COVID-19 Vaccine Data\nNSA played a key role in guaranteeing the security of U.S. government efforts to rapidly develop a COVID-19 vaccine \nthrough its direct support of Operation Warp Speed. NSAs experts collected and analyzed data using classified \nintelligence and indicators of compromise in the cloud hunting operation. This mission validated that nation-state \nactors were not able to tamper with the research data related to the safety or effectiveness of the vaccines under \ndevelopment.\n\nPartnering to Secure Today  \nand Tomorrow\nProtecting our Defense Industrial Base\nIn late 2020, NSA moved into a 36,000-square-foot unclassified Cybersecurity Collaboration Center in an open \nbusiness park outside NSAs fence line, breaking down barriers between the agency and the outside world. The NSA \nCybersecurity Collaboration Center (CCC) rapidly grew its industry partner base from less than 10 to more than 110 \npartners in 12 months by teaming up with Defense Industrial Base (DIB) companies and their cybersecurity service \nproviders that support Department of Defense (DoD) programs for cryptography, weapons and space, and nuclear \ncommand and control.\nThe U.S. military and DIB are still the best in the world, which makes them a top target. This past year, the CCC team \nworked with industry and interagency partners to reduce the attack surface across the DIB and ensure U.S.  sensitive \nintellectual property, military research, and innovative technical economy are protected at scale in cyberspace. \nBy sharing actionable, contextualized threat intelligence derived from NSAs foreign signals intelligence (SIGINT) \nmission, the CCC engaged in thousands of analytic exchanges with industry partners and helped identify and prioritize \nremediation against critical threats. The insights shared by NSA enabled partners to detect adversary targeting of \ntheir infrastructure and mitigate the activity to protect their networks and customers. These analytic collaborations \nsuccessfully occurred across multiple DIB companies and service providers. The results of these interactions are \noften seen in the blogs, information releases and research published by leading cybersecurity firms.\nThe NSA Cybersecurity Collaboration Center.\n7 Partnering to Secure Today and Tomorrow\n\nDefending the DIB at Scale\nWhile the Cybersecurity Collaboration Center leverages \ndeep insights to disrupt foreign actors attempting to \nsteal critical national security information from DIB \nnetworks, it is also providing low-cost, commercial \ncybersecurity services to scale protection to small and \nmedium-sized businesses for broad impact. Through \nthe Protective Domain Name System (PDNS) pilot, the \nCCC has processed more than 3.8B queries and blocked \nmore than 6.5M malicious domains, including known \nnation-state spear-phishing, botnets and malware. \nTo date, the CCC has provided PDNS services to 40 DIB \ncontractors and expects to scale to hundreds more in \nthe coming year. NSA publicly published a Cybersecurity \nInformation Sheet, Selecting a Protective DNS Service \nand released a Cybersecurity Speaker Series video on \nPDNS, advising how to implement this low-cost service, \nwhich NSA analysis indicates can block the significant \nmajority of malicious activity. Visit NSAs YouTube \nchannel to watch the video.\nExposing Vulnerabilities\nNSA continues to discover and disclose critical \nvulnerabilities to private industry. In 2021, the CCC \ndisclosed a series of critical vulnerabilities in Microsoft \nExchange that were patched by Microsoft. These efforts \nwere timely and important: Microsoft Exchange is used \nbroadly throughout National Security Systems, DoD and \nDIB networks, and Chinese actors have been conducting \nwidespread exploitation of Microsoft Exchange servers.\nNSA has unique insights on cyber \nthreats and nation-state actors \nbecause of our global signals \nintelligence mission. Likewise, the \nprivate sector has unique capabilities, \npreeminent research, and intellectual \nproperty we need to protect.\nWe each only see part of the picture. \nWe see something in SIGINT; our \npartners see activity on their networks. \nThe only way to mitigate the threat is to \ncommunicate and collaborate in real-\ntime to drive outcomes.\nWe dont expect small businesses to \ndefend against nation states alone. \nTogether, we empower a community \nresponse.\nMorgan Adamski, NSA Cybersecurity  \nCollaboration Center Chief\nNSA Cybersecurity experts can collaborate with industry and government in an \nunclassified setting at the NSA Cybersecurity Collaboration Center.\n2021 NSA Cybersecurity Year In Review\nwww.NSA.gov/cybersecurity  |  @NSACyber\n\nPartnering to Extend Impact\nThe Cybersecurity Collaboration Center (CCC) has also brought NSA closer to interagency partners. Through the \nEnduring Security Framework (ESF), NSA and the Department of Homeland Security Cybersecurity and Infrastructure \nSecurity Agency (CISA) worked across sectors to explore cyber threats to 5G. As a result of these efforts and extensive \nresearch, a series of five threat-informed papers were publicly published on NSA.gov. The papers are intended to \nadvise network defenders and policymakers on how to secure 5G moving forward: \n Potential Threat Vectors to 5G Infrastructure\n Detect and Prevent Lateral Movement in 5G Cloud Infrastructures\n Securely Isolate Network Resources\n Data Protection\n Ensure Integrity of Cloud Infrastructure\nIn 2021, NSA also began actively participating in CISAs Joint Cyber Defense Collaborative (JCDC), and likewise CISA \nbegan participating in the CCC. By doing so, each agency brings its unique expertise and capabilities to the table, \ndriving greater outcomes than either could achieve alone.\nIN THE LAST YEAR \nNSA HAS INCREASED  ITS PARTNERSHIPS  \nAND ANALYTICAL  \nEXCHANGES\n9 Partnering to Secure Today and Tomorrow\nSetting the Standards\nThe CCC consolidated NSAs important work on standards into one home, elevating it and aligning its work with \ninteragency and international partners. These efforts have never been more important, as foreign adversaries are \nseeking to use standards bodies as forums to push standards hostile to an open, interoperable, secure and reliant \ninternet. To counter this and ensure a more secure future, NSA authored 15 international standards submissions: \nsix in secure internet protocols, five in 5G security and four in enterprise IT security. A dozen were accepted; they all \nspurred greater debate about security issues in the standards.\nAs commercial products are increasingly relied on to secure National Security Systems, through the National \nInformation Assurance Program (NIAP), the CCC certified 91 commercial components for use in protecting NSS. \nAdditionally, NIAP published 14 Protection Profiles to raise security in those products. Protection Profiles are vendor-\nagnostic guidelines that raise security in commercial products by defining proper configurations. NIAP continued \nto strengthen the overall global IT security posture through ongoing partnerships with 30 other nations within the \nCommon Criteria Recognition Arrangement (CCRA). It has positioned the United States as a leader within the global \ncommunity through further adoption of its standards and by certifying more products than any other nation within \nthe CCRA. \n\nSharing Timely, Actionable Guidance\nBy releasing guidance against tactics and techniques our adversaries \nare currently using, we empower net defenders to prioritize endless \npatching and mitigation efforts against the most current threats and \nraise the cost on our adversaries by exposing their activities.\nDave Luber, NSA Cybersecurity Deputy Director\nReporting to Secure Systems,  \nDegrade Actor CapabilitiesFrom selecting and securing virtual private networks \n(VPNs) to safely using the Kubernetes open-source \ncontainer orchestration system, NSA developed \nNSAs public cybersecurity releases exposed malicious pragmatic, timely preventative guidance. NSAs experts \nadversary activity and provided actionable mitigations captured best practices and top recommendations based \nthat helped net defenders secure their systems. NSA on real-world experiences. For example:\npartnered with one or more U.S. and allied partners on \n12 of its 23 reports this past year. Collaborating on topics  Selecting and Hardening Remote Access VPN Solutions \nrelevant across the U.S. Government and private sector highlights key factors when choosing a VPN and \nenabled NSA and partners to share more comprehensive implementing configurations  all useful guidance for \nthreat understanding and top defensive actions with a organizations looking to standardize and mature their \ncoordinated voice. telework capabilities and keep sensitive data secure.\nSeveral releases included attribution on active cyber  Kubernetes Hardening Guidance assists organization \ncampaigns. By articulating the full threat in a concise leaders and network administrators in grasping some \nmanner, these reports helped arm defenders globally to of the core security needs when migrating services to a \nprioritize actions and remove adversary capabilities one cloud environment and using Kubernetes to manage the \nat a time. This work disrupts malicious activities and virtual, decentralized infrastructure. The guide walks \nhelps make it more difficult and more costly for any through the architecture, top threats and various security \nadversary to target U.S. or allied networks. policies and control, along with example configurations to \naid those looking to better protect their data and still enjoy \nRegardless of attribution, NSA continued to detail the benefits of advancing technologies, such as software \nmalicious tactics, techniques and procedures (TTPs) to containers. \nconvey threat knowledge in a uniform manner for public \nand private organizations to understand and use. \n100,000+\n2021 NSA Cybersecurity Year In Review\nwww.NSA.gov/cybersecurity  |  @NSACyberThe amount of views the Kubernetes \nHardening Guidance Technical Report \nreceived online in the first 24 hours\n\nCreating a Standard Framework\nNSAs unique mission makes it challenging to find \ncommon language that can be used with government, \nprivate sector and commercial partners. Adoption of a \ncommon lexicon enables the sharing of unclassified \nintelligence products that allow network defenders \nto execute specific actions to detect or defeat cyber \nadversaries in the public domain. NSA Cybersecurity \nofficially adopted the MITRE Adversarial Tactics, \nTechniques & Common Knowledge (ATT&CK) framework \ncommonly used in the commercial and public sectors \nthis past year to report and characterize observed cyber \nadversary tactics and techniques. \nThis has enabled NSA to structure, tag and enrich its cyber \nthreat analysis products, which are now easier to discover \nand manage  and most importantly  more actionable to \npartners and customers across the government, private \nand commercial sectors. \nNSA and MITRE also released the complement to ATT&CK: \nD3FEND . The NSA-funded, MITRE-developed framework \nprovides defensive countermeasures against common \noffensive cyber techniques. \nD3FEND organizes countermeasures and techniques to \nenable information sharing and operational collaboration, \ndriving more effective design, deployment and better \ndefense of networked systems. This significant body of \nwork captures the complex interplay between threats \nagainst computer networks and ways to protect computer \nnetworks from cyberattack.\nNSA has started incorporating ATT&CK and D3FEND \nin its public cybersecurity reports. By sharing D3FEND \nbroadly, NSA and MITRE hope to receive contributions \nfrom the cybersecurity community to further refine \nD3FEND and to promote the adoption of this vocabulary \nby cybersecurity professionals across government, \nindustry and academia.\n \nIn the first 24 hours after NSA and \nMITRE release D3FEND, more than \n27K users viewed over 35K pages  \non d3fend.mitre.org\n11 Sharing Timely, Actionable Guidance \n\n\nProtecting the Warfighter and \nSupporting the Combatant Commands\nThe Strategic Cybersecurity Program is one example of how we are \nprioritizing our efforts. We are focusing on specific weapons and \nspace systems because either our threat intelligence indicated they \nwere being targeted or because they are critical to warfighting.\nBrigadier General Lorna Mahlock, NSA Cybersecurity Deputy Director for Combat Support\nEvaluating Key Weapons, Space Systems\nU.S. Government leaders recognized the threat to key \nweapons and space systems when creating the Strategic \nCybersecurity Program as part of the National Defense \nAuthorization Act for Fiscal Year 2021. \nNSA partnered closely with the Department of Defense \nCIO, Joint Staff, Undersecretary of Defense for Acquisition \n& Sustainment, and the military services to structure, \ndesign and execute the Strategic Cybersecurity Program. \nNSA operates the DoD Strategic Cybersecurity Program \n(SCP) Program Management Office, which oversees the \nproduction of cybersecurity scorecards and remediation \nplans to ensure that critical U.S. weapons and space \nsystems are not vulnerable to cyber adversaries. The plans \ninclude both mitigations and monitoring, and cover all \nwarfighting domains  air, land, sea, space and cyber. \nNSA successfully worked in concert with the DoD and \nU.S. military services to assess, prioritize and mitigate \nvulnerabilities in key capabilities across DoD and are \npostured to build on those successes in 2022.\nNSA also partnered with U.S. Cyber Command and Joint \nForce Headquarters-Department of Defense Information \nNetworks (JFHQ-DODIN) on efforts to further modernize \nencryption across U.S. combatant commands. This \nsignificantly reduces the chance that U.S. adversaries \ncan access the nations most sensitive information.\nU.S. weapons and space systems.\n2021 NSA Cybersecurity Year In Review\nwww.NSA.gov/cybersecurity  |  @NSACyber\n\n\n13 Protecting the Warfighter and Supporting the Combatant Commands\n\nSecuring Communications\nNSAs Commercial Solutions for Classified (CSfC) expanded secure telework capabilities for DoD civilians and service \nmembers at the unclassified and secret levels using modern, mobile commercial products, such as mobile phones \nand laptops. This has been critical to ensuring the health and welfare of the DoD workforce while maintaining mission \nreadiness during the COVID-19 pandemic. Over the past year, thousands deployed CSfC cybersecurity solutions that \nprovide secure, remote access to National Security Systems (NSS) on classified networks across their enterprise. \nCSfC empowers customers to design and build secure solutions to their needs using NSAs preapproved system designs \nthat cover a variety of communications, including site-to-site connections as well as mobile and tactical telework \napplications. It has tapped the diversity, speed and agility of commercial markets. In the past year, the National \nInformation Assurance Program (NIAP) added 418 modern, commercial products to the CSfC Approved Components \nList, significantly expanding CSfC offerings for the DoD workforce.\nStrategizing to Secure Nuclear Command, Control and Communications\nBy preventing and eradicating threats to U.S. Nuclear Command and Control Systems (NCCS) and the National Leadership \nCommand Capability (NLCC), NSA helps ensure command and control of strategic forces and communication between \nsenior leaders.\nIn 2021, NSA partnered closely with U.S. Strategic Command (USSTRATCOM), which deters strategic attack and \nemploys forces, as directed, to guarantee the security of the U.S. and its allies. \nNSA created a Nuclear Command, Control and Communications (NC3) strategy and framework for the USSTRATCOM NC3 Enterprise Center (NEC). The strategy outlines the direction for cyber resiliency and assuring NC3 systems and \ninformation. The framework provides an organizational structure for discussing key cybersecurity principles and \ncapabilities required for an assured, reliable and cyber-resilient NC3 enterprise.\nU.S. Strategic Command (USSTRATCOM) headquarters.\n2021 NSA Cybersecurity Year In Review\nwww.NSA.gov/cybersecurity  |  @NSACyber\n\nSupporting the Afghanistan Retrograde\nIn August, NSA supported the U.S. withdrawal from Afghanistan by providing direct cybersecurity support to operations. \nThe agency also aided efforts to protect tactical and strategic cryptographic equipment and equities.\nNSA leveraged the full range of its authorities, expertise and partnerships to provide direct support to the U.S. \nmilitary, protect operations and improve their cybersecurity posture as they evacuated personnel from the country. \nNSA Cybersecurity teams provided recommendations to the U.S. military on methods to ensure that its networks \nwere protected against adversary targeting during the \nwithdrawal and provided threat assessments to shape \nmilitary communications plans. \nWithin 24 hours of receiving the request, NSA also \nprovided the U.S. military with a one-page visual guide \nto quickly identify 27 current and commonly fielded forms \nof high assurance communications security (COMSEC) \ndevices used by the U.S. military and intelligence \nagencies. It enabled U.S. military and civilian personnel \non the ground in Afghanistan to identify, remove and \nensure safe disposition during the withdrawal, so that it \ndidnt end up in the wrong hands. \n \nThe 816th Expeditionary Airlift Squadron prepare to load qualified evacuees aboard a U.S Air Force C-17 Globemaster III at Hamid Karzai International Airport.A U.S. Marine carries a child to a plane at Al Udeid Air Base, Qatar.  \n15 Protecting the Warfighter and Supporting the Combatant Commands\n\nwww.NSA.gov/cybersecurity  |  @NSACyberCreating Cryptography to Protect  \nData, Communications\nWe build strong cryptography that prevents our adversaries from \naccessing our nations most sensitive systems and data. Our signals \nintelligence mission, where we break our adversaries cryptography, \nand our many decades of experience provide us with a distinct \nadvantage.\nNeal Ziring, NSA Cybersecurity Technical Director\nProvisioning Codes, Keys and Cryptographic Solutions\nThe U.S. Government and U.S. military rely on NSA to produce and distribute the codes, keys and cryptographic \nmaterials they use to protect sensitive data from adversary intrusions and protect communications from adversary \neavesdropping. This includes the nuclear launch codes and related materials that would be used should the president \never authorize the launch of U.S. nuclear weapons.\n145,411 Tamper-indicating products  \nthat NSA delivered globally in 2021. \nThese technologies prevent or detect \nphysical exploitation of cryptographic \nequipment and classified material by \nadversaries or insiders during shipping \nor deployment around the world. \n2021 NSA Cybersecurity Year In Review\nNSA provides communications security best practices to ensure secure handling of cryptographic material as well as \nto secure networks, systems and communications devices used by the Department of Defense to provide command \nand control, and battlefield awareness.  \n\n17 Creating Cryptography to Protect Data, Communications\n\nCryptographic Modernization\nTechnology advancements, the theoretical quantum computing threat and escalating adversary aggression have driven \nNSAs cryptographic modernization efforts for the Department of Defense. A few 2021 modernization successes include:\n For the first time, NSA solely used a modernized key management infrastructure system to more efficiently key the U.S. Air \nForce F-22 Raptor fleet. The cryptographic devices on all 186 jets secure communications and telemetry.  \n NSA, in partnership with the National Reconnaissance Office (NRO), certified the smallest crypto unit ever produced for \nspace applications, enabling cube and small satellites to provide certified, crypto-secured support for the warfighter in a \nhighly contested space environment. \n NSA delivered the first set of updated cryptographic devices to protect National Security Systems (NSS) from potential \nadversarial quantum computing attacks. While a cryptographically relevant quantum computer remains theoretical, the \ndevelopment and use of one could make key portions of the U.S. cryptographic inventory obsolete. \n NSA is collaborating with foreign partners to develop common key management infrastructure that supports cryptographic \ninteroperability.\nIn addition to code making, NSA provides technical services and guidance to program managers during the development \nof cryptographic devices.\nThe U.S. Air Force relies on NSA Cybersecurity to secure communications and telemetry for its F-22 Raptors.\nwww.NSA.gov/cybersecurity   |   @NSACyber 2021 NSA Cybersecurity Year In Review\nNSA released a detailed set of frequently asked questions (FAQs) addressing the \nquantum threat and post-quantum solutions for National Security Systems\nVisit NSA.gov/cybersecurity/post-quantum-cybersecurity-resources\n\nDefending Critical Systems  \nand Networks\nInformation vital to maintaining our security lives on National Security \nSystems and the nation relies on NSA Cybersecurity to provide the \nleadership, practices and policies that keep these systems protected \nfrom our adversaries.\nRob Joyce, NSA Cybersecurity Director\nEmbracing a Zero Trust Model and Mindset\nThe U.S. Government and the Department of Defense (DoD) continued developing Zero Trust architectures. The \nZero Trust model assumes that a breach is inevitable or has likely already occurred, so it constantly limits access \nto only what is needed and continuously looks for anomalous or malicious activity. Leveraging Zero Trust principles \nenables system administrators to control how users, processes and devices engage with data. These principles can \nprevent the abuse of compromised user credentials, remote exploitation, or insider threats and even mitigate effects \nof supply chain compromises.\nNSA has been at the forefront of this effort, leading \nthe development of the DoDs Zero Trust Reference \nArchitecture and the National Security Systems \n(NSS) Zero Trust Reference Architecture. The Agency \nestablished the Zero Trust Working Group within the \nCommittee on National Security Systems to standardize \npolicy and guidance across the NSS community. NSAs \nexperts also developed an unclassified Zero Trust test \nbed that enabled collaboration with partners from \nacross the DoD, U.S. Government, industry, academia \nand foreign partners.\nNSA publicly released a Cybersecurity Information Sheet on Embracing a Zero Trust Model to outline the concept, \nbenefits and implementation challenges for cybersecurity leaders, enterprise network owners and administrators \nwho are considering embracing the Zero Trust model. It followed up with an NSA Cybersecurity Collaboration Center \nSpeaker Series video to discuss concepts and dispel common myths and misconceptions.  \nEmbracing a Zero Trust Mindset is available on YouTube.\n19 Defending Critical Systems and Networks\n\n2021 NSA Cybersecurity Year In Reviewwww.NSA.gov/cybersecurity  |  @NSACyber\n\nDefending National Security Systems\nIn the wake of the SolarWinds global supply chain intrusion \nand Microsoft Exchange compromise, NSA played a \nsignificant role in the development and implementation \nof the Executive Order (EO) on Improving the Nations \nCybersecurity. Signed by the president in May, EO 14028 \nestablished that the U.S. Government must lead by \nexample to improve its own efforts to protect against \nand respond to malicious cyber activity through bold \nchanges and significant investments in cybersecurity. The \nEO focused on modernizing the cybersecurity defenses \nof federal networks, improving information sharing \nbetween the U.S. government and the private sector on \ncyber issues and strengthening the United States ability \nto respond to incidents when they occur.  \nNSA led, coordinated and supported several efforts \nrelated to the Executive Order, most notably drafting \na National Security Memorandum that captures the \nresponsibilities of the National Manager  the NSA Director \n in implementing cybersecurity modernization efforts for \nNSS. NSA held these same network owners accountable \nfor keeping the United States most sensitive information \nsecure by issuing National Manager Memos that advise \nnetwork owners to take action to protect against threats \nand vulnerabilities. \nIn 2021, NSA developed collaboration forums to share \nthreats, vulnerabilities and mitigations with NSS and \ncritical infrastructure and key resources communities \nat the unclassified, secret and top secret levels. NSA \ndrew strong attendance from across the Intelligence \nCommunity, Department of Defense and federal civilian \nagencies. These information exchanges have firmly \nestablished NSAs role as a community leader for \nconversations on NSS threat intelligence and high-\npriority topics. \nNational Security Systems are networks that contain classified information or \nare otherwise critical to military and intelligence activities.\n21 Defending Critical Systems and Networks\nProtecting Critical Software\nIn response to EO 14028, NSA coordinated with the \nNational Institute of Standards and Technologies (NIST) \nto better define critical software, issue security measures \nfor critical software and its associated platforms and \ncreate minimal standards for vendors testing of their \nsource code. \nNSA also created an Implementation Plan for National \nSecurity Systems to develop processes and workflows for \nmore effective threat sharing, direct mitigations efforts \nand to capture the current cybersecurity state of NSS. \nThese efforts culminated in the Office of Management \nand Budgets memorandum to executive departments and \nagencies, titled, Protecting Critical Software Through \nEnhanced Security Measures, which sets out a phased \napproach for agency implementation of the NIST guidance.\nThe Office of Management and Budget followed that \nmemo with another in October, which directs federal \ndepartments and agencies to adopt a robust endpoint \ndetection and response (EDR) solution. This will \nimprove the federal governments ability to detect and \nrespond to increasingly sophisticated threat activity on \nfederal networks.\n\nBuilding a Diverse Workforce  \nThat Can Tackle Any Challenge\nWe have to invest in recruiting and retaining talented people with \ndiverse perspectives because they have the skills necessary to tackle \nour most complex issues.\nRob Joyce, NSA Cybersecurity Director\nStanding for Diversity, Equality  \nand Inclusion\nNSA Cybersecurity leaders are committed to building a \ndiverse workforce that reflects the nation in which NSA \nserves and protects. It filled critical mission needs and \nexceeded NSA diversity hiring goals in diversity and \ndisability hires in 2021. These efforts were facilitated \nthrough NSAs relationships with the National Centers \nfor Academic Excellence in Cybersecurity (NCAE-C),  \nincluding Historically Black Colleges and Universities. \nNSA participated in the global #ShareTheMicInCyber \ncampaign this year to amplify African American voices \nin the cybersecurity community, providing a platform to \nshare their perspectives, stories and accomplishments \non a variety of cybersecurity issues and challenges. \nNSA Cybersecurity Director Rob Joyce handed his \nofficial Twitter handle @NSA_CSDirector  and large \nfollowing  over to Talya Parker, founder of a non-profit \norganization designed to increase awareness and \ndiversity in cybersecurity, STEM and private industries. \nParkers posts reached 20 countries and 23 million views \non Twitter with more than 600 likes. \nRob Joyces Twitter handle was taken over by Talya Parker for a day.\n2021 NSA Cybersecurity Year In Review\nwww.NSA.gov/cybersecurity  |  @NSACyber\n\nPromoting and Enhancing Cybersecurity Expertise\nU.S. adversaries are constantly improving their capabilities and so must \nNSA in this era of strategic competition. Cyberspace is an evolving threat \nenvironment, forcing its practitioners to learn and adapt or get left behind. \nBecause of this, NSA prioritizes building foundational cybersecurity expertise \nin its workforce, especially in the areas of security engineering, cryptography \nand cybersecurity analysis. NSA provides cybersecurity development \nprograms for new employees and those looking to change career paths. \nAs part of NSAs efforts to continuously develop agile cybersecurity \nprofessionals, it promotes higher education and research in cybersecurity. \nThe NCAE-C program, managed by NSAs National Cryptologic School, works \nwith two- and four-year colleges and universities interested in advancing the \nstudy of cybersecurity.\nNSA and its federal partners, including the Department of Homeland \nSecurity Cybersecurity and Infrastructure Security Agency (CISA), the FBI, \nthe National Institute of Standards and Technology (NIST)/National Initiative \non Cybersecurity Education (NICE), the National Science Foundation (NSF), \nthe Department of Defense Office of the Chief Information Officer and U.S. \nCyber Command combined to execute $83 million in grants to more than 300 \nparticipating schools in the past year. \nAttracting the Next Generation of Cyber Warriors\nThrough programs such as GenCyber and the NSA Codebreaker Challenge, \nNSA is dedicated to inspiring the cyber warriors of tomorrow:\n GenCyber: NSA and the NSF funded 156 K-12 summer cybersecurity camps \nin 2021 that were used to educate around 3,500 students and more than 800 \nteachers. Camps were held in 47 states as well the District of Columbia and \nPuerto Rico. The program strives to be a part of the solution to the nations \nshortfall of skilled cybersecurity professionals by increasing awareness for \nstudents and teachers about K-12 educational cybersecurity content as well as \nsecondary and career opportunities. The program also aims to increase student \ndiversity in cybersecurity college and career pathways. \n The NSA Codebreaker Challenge: Started in 2013, the challenge provides \nstudents attending U.S.-based academic institutions the chance to sharpen \ntheir cyber skills and get a feel for NSAs critical work to the nation. More than \n5,400 students from more than 600 schools participated in 2021s challenge, \nwhich focused on a scenario affecting the U.S. Government and critical \ninfrastructure, including the Defense Industrial Base. The tasks involved \nrealistic NSA mission-centric scenarios that tested skills in reverse engineering, \ncomputer programming, forensics and vulnerability analysis. Students who \nperform well in the Codebreaker Challenge are often encouraged to apply to \nNSA. Across the country, many colleges and universities have incorporated \nthe Codebreaker Challenge into their curriculums, promoting intercampus \nengagement which helps strengthen U.S. cybersecurity education nationwide.NSA recommended that \nstudents in this years \nCodebreaker Challenge  \ndownload Ghidra, NSAs \nopen source reverse \nengineering tool, to have a \nleg up on the competition.\nGhidra 10.0, released in \n2021, integrates a Dynamic \nAnalysis Framework for the \nfirst time, better known \nas a debugger. This allows \nusers to perform static and \ndynamic analysis with the \nsame platform.\nVisit Ghidra-sre.org/\nBuilding a Diverse Workforce That Can Tackle Any Challenge 23\n\n2021 NSA Cybersecurity Year In Reviewwww.NSA.gov/cybersecurity  |  @NSACyber\n\nSee What NSAs Cybersecurity \nExpertise Can Do For You\nRecommendations for securely implementing:\n \n5G in the cloud\nRemote access VPNs to reach data when working anywhere\nProtective DNS or encrypted DNS on enterprise networks\nContainerized environments with Kubernetes\n \nMitiga\ntions to counter current threats, including:\nGlobal brute force campaigns\nAbuse of authentication mechanisms\nRansomware targeting U.S. infrastructure \nMalicious cyber activity against operational technology\nFind these and more at NSA.gov/cybersecurity.\n25 NSA Cybersecurity Year In Review\n\n\n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "2021_nsa_cybersecurity_year_in_review_20220203",
  "source": "nsa",
  "id": "91d078f037efd50de220c6fb2661dbe248e058ba6fb7b726f5a5fbceb14be92a"
}