{
  "markdown": "  \n \n \n \n \n   \n \nThis document was developed by the FBI, NSA, and CISA in furtherance of their respective cybersecurity \nmissions, including their responsibilities to develop and issue cybersecurity specifications and mitigations.  \nThis document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information \ncarries minimal or no foreseeable risk of misuse, in accordan ce wit h applicable rules and procedures for public \nrelease. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction. For \nmore information on the Traffic Light Protocol, see https://www.cisa.gov/tlp . \nTLP:WHITE  \n Product ID: A A22-047A     \n February  16, 2022 TLP:WHITE  \n Co-Authored by:  \nRussian  State -Sponsored Cyber Actors Target \nCleared Defense Contractor  Networks to \nObtain Sensitive U.S. Defense Information and \nTechnology  \nSUMMARY  \nFrom at least January 2020 , through February  2022 , the \nFederal Bureau of Investigation (FBI), N ational Secu rity \nAgency (NSA), and Cybersecurity and Infrastructure \nSecurity Agency (CISA) have observed regular  targeting \nof U.S. cleared defense contractors (CDCs) by  Russian \nstate -sponsored cyber actors. The actors have targeted \nboth large and small C DCs and subcon tractors with  \nvarying levels of cybersecurity protocols and resources.  \nThese CDCs s upport contracts for the U.S. Department \nof Defense  (DoD)  and Intelligence Community in the \nfollowing areas:  \n Command, control,  communications , and combat systems;  \n Intellige nce, surveillance, reconnaissance , and targeting;  \n Weapons and missile development ; \n Vehicle and aircraft design ; and \n Software development , data analytics , computers,  and logistics.  \nHistorically, Russian state -sponsored cyber a ctors have used common but eff ective tactics to gain \naccess to target networks , including  spearphishin g, credential harvesting, brute force/password spray \ntechniques, and known vulnerability exploitation against accounts and networks with weak security. \nThese a ctors take advantage of s imple passwords, unpatched systems, and unsuspecting employees \nto gain initial access before moving laterally through the network to establish persistence and \nexfiltrate data.  Actions to Help Protect Against  \nRussian State -Sponsored M alicious \nCyber Activity:  \n Enforce multifactor authentication . \n Enforce strong, unique passwords . \n Enable  M365 Unifi ed Audit Logs . \n Implement  endpoint detection and \nresponse tools . \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 2 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n In many attempted compromises, these actors have employed similar tactics to ga in access to \nenterprise and cloud networks, prioritiz ing their efforts against the widely  used Microsoft 365 (M365)  \nenvironment. The actors often maintai n persistence by using legitimate credentials  and a variety of \nmalware wh en exfiltrating  emails and dat a. \nThese continued intrusions  have enabled the actors to acquire sensitive , unclassified  information , as \nwell as CDC -proprietary and export -controlled technology . The acquired information  provid es \nsignificant insight into U.S. weapons platforms development  and deployment timelines, vehicle \nspecifications, and plans for communications infrastructure and information technology . By acquiring \nproprietary internal documents and email communications, adve rsaries may be able to adjust their \nown military plans and priorities, hasten technological development efforts, inform foreign \npolicymakers of U.S. intentions, and target potential sources for recruitment. Given  the sensitivity of \ninformation widely avail able on unclassified CDC networks, the FBI, NSA, and CISA a nticipate that \nRussian state -sponsored cyber actors will continue to target CDCs for U.S. defense information in the \nnear future. These agencies encourage all CDCs to apply the recommended mitigati ons in this \nadvisory, regardless of evidence of compromise.  \nFor additional information on Russian state -sponsored cyber activity, see CISA's webpage,  Russia \nCyber Threat Overview and Advisories . \nTHREAT  DETAILS  \nTargeted Industries and Assessed Motive  \nRussian state -sponsored cyber actors have targeted U.S.  CDCs from at least January 2020 , through \nFebruary 2022. The actors levera ge access to CDC networks t o obtain sensitive data about U.S. \ndefense and intelligence programs and capabilities.  Compromised entities  have included CDCs \nsupporting the U.S. Army, U.S. Air Force, U.S. Navy, U.S. Space Force, and DoD and Intelligence \nprograms.  \nDuring this two -year period, these actors have maintain ed persisten t access to multiple CDC \nnetworks, in some cases for at least six mon ths. In instances when the actors have successfully \nobtained access, the FBI, NSA, and CISA have noted regular and recurring exfiltration of emails and \ndata.  For example, during a compromise  in 2021, threat actors exfiltrated hundreds of documents \nrelated to the companys products, relationships with other countries, and internal personnel and legal \nmatters.  \nThrough these intrusions, th e threat actors have acquired unclassified CDC -proprietar y and export -\ncontrolled information. This  theft has granted the ac tors significant insight into U.S. weapons \nplatforms development and deployment timelines, plans for communications infrastructure, and \nspecific technologies employed  by the U.S. government and military . Although  many contract awards \nand descriptions are p ublicly a ccessible, program developments  and internal company \ncommunications remain sensitive. Unclassified  emails among employees or with government \ncustomers often contain proprietary details about technological and scientific research, in addition to \nprogram updates and funding statuse s. See figures 1 and 2 for information on targeted customers, \nindustries, and information.   \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 3 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n      \nWeapons and  \nMissile Development  Vehicle and  \nAircraft Design  Software Development and \nInformation Technology  Data Analyti cs Logistics  \nFigure 1. Targeted Industries  \n      \nEmail Communications  Contract Details  Product Development  Tests and Timelines  Foreign Partnerships  Funding  \nFigure 2. Exfiltrated Information  \nThreat Actor Activity  \nNote : This advisory uses the MITRE ATT&CK for Enterprise framework, version 10. See the  ATT&CK for \nEnterprise  for all referenced threat actor tactics and techniques. See the Tactics, Techniques, and Procedures \n(TTPs) section for a table of the threat actors activi ty mapped to MITRE ATT&CK tactics and techniques.   \nInitial Access   \nRussian  state -sponsored  cyber actors use brute force methods, spearphishing, harvested credentials, \nand known vulnerabilities to gain  initial access to CDC networks.  \n Threat actors use brut e force techniques [ T1110 ] to identify valid account credentials \n[T1589.001 ] for domain and M365 accounts. After obtaining domain credentials, the actors \nuse them to gain initial access to the networks. Note : For more information, see joint NSA -\nFBI-CISA Cybersecurity Advisory: Russian GRU Conducting Global Brute Force Campaign to \nCompromise Enterprise and Cloud Environment s. \n Threat actors sen d spearphishing emails with links to ma licious domains [ T1566.002 ] and  use \npublicly available URL shortening services  to mask the link [ T1027 ]. Embed ding shortened \nURLs instead of actor -controlled malicious domain s is an obfuscation technique meant to \nbypass virus and spam scanning tools. The technique often promotes a false legitimacy to the \nemail recipient , increasing the probability of a victims cl icking  on the link.  \n The threat actors use harvested credentials in conjunction with known vulnerabilities for \nexample, CVE -2020 -0688 and CVE -2020 -17144 on public -facing applications [ T1078 , \nT1190 ], such as virtual private networks (VPNs) , to escalate privileges and gain remote code \nexecution (RCE) on the exposed applications.1 In addition, threat actors have exploited CVE-\n2018 -13379 on FortiClient to obtain  credentials to access networks.  \n As CDCs find and patch known  vulnerabilities  on their networks , the actors alter their \ntradecraft to see k new means of access . This activity necessitates  CDCs maintain  const ant \n\n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 4 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n vigilance for  software vulnerabilities and out-of-date security configurations, especially in \ninternet -facing systems.  \nCredential Access  \nAfter gaining access to networks, the threat actors map the Active Directory (AD) and connect to \ndomain controller s, from which they exfiltrate credentials and export copies of the AD database \nntds.dit  [T1003.003 ]. In mult iple instances, the threa t actors  have used Mimikatz to dump admin \ncredentials from the domain controllers .  \nCollection   \nUsing compromised M365 credentials, including global admin accounts, the threat actors can gain \naccess to M365 resources, including SharePoint pages [ T1213.002 ], user profiles, and user emails \n[T1114.002 ]. \nCommand and Control   \nThe threat  actors routinely use virtual private servers ( VPSs) as an encryp ted proxy. The actors use \nVPSs, as well as small office and home office (SOHO) devices , as operational nodes to evade \ndetection  [T1090.003 ].  \nPersistence   \nIn multiple inst ances,  the threat actors  maintained persistent  access for at least six months . Although \nthe actors have used a variety of malware to maintain persistence, the FBI, NSA, and CISA have also \nobserved intrusions that did not rely on malware or other persistence mech anisms. In these cases, it \nis likely the threat actors relied on possession of legitimate credentials for persistence [ T1078 ], \nenabling them to pivot to other accounts, as needed, t o maintain access to the compromised \nenvironments.  \nTactics, Techniques, and Procedures  \nThe following table maps observed Russian state -sponsored cyber activity to the MITRE ATT&CK for \nEnterprise framework. Several of the techniques listed in the table are based on observed procedures \nin contextual order. Therefore, some of the tactics and techniques listed in t heir respective columns \nappear more than once. See Appendix A  for a functional breakdown of TTPs.  Note : For specific \ncountermeasures related to each ATT&CK technique, see the Enterprise Mitigations  section and \nMITRE D3FEND . \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 5 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Table 1: Observed Tactics, Techniques, and Procedures  (TTPs)  \nTACTIC  TECHNIQUE  PROCEDURE  \nReconnaissance \n[TA0043 ] \nCredential Access \n[TA0006 ] Gather Victim Identity \nInformation: Credentials \n[T1589.001 ]  \nBrute Force [ T1110 ] Threat actors used brute force  \ntechniques  to identify valid account \ncredentials for domain and M365 \naccounts. After obtaining domain \ncredentials, the actors used them to gain \ninitial access.  \nInitial Access [ TA0001 ] External Remote Services \n[T1133 ] Threat actors continue to research \nvulnerabilities in Fortinet s FortiGate \nVPN devices, conducting  brute force \nattacks and leveraging  CVE-2018 -13379 \nto gain credentials to access victim \nnetworks.2 \nInitial Access [ TA0001 ] \nPrivilege Escalation \n[TA0004 ] \n Valid Acco unts [ T1078 ] \nExploit Public -Facing \nApplication [ T1190 ] Threat actors used credentials in \nconjunction with known vu lnerabilities on \npublic -facing applications, such as \nvirtual private networks (VPNs) CVE-\n2020 -0688 and CVE -2020 -17144 to \nescalate privileges and gain remote \ncode execution (RCE) on the exposed \napplications.3 \nInitial Access [TA0001 ] \nDefense Evasion \n[TA0005 ] Phishing: Spearphishing \nLink [ T1566.002 ] \nObfuscated Files or \nInformation [ T1027 ] Threat actors sen t spear phishing emails \nusing  publicly available URL shortening \nservices. Embedding shortened URLs \ninstead of the actor -control led malicious \ndomain is an obfuscation technique \nmeant to bypass virus and spam \nscanning tools. The technique often \npromotes a false legitimacy to the email \nrecipient and thereby incre ases the \npossibility that a victim clicks on the link.  \nInitial Access [TA0001 ] \nCredential Access \n[TA0006 ] \n OS Credential Dumping: \nNTDS [ T1003.003 ] \nValid Accounts: Domain \nAccounts [ T1078.002 ] Threat actors logged into a victims VPN \nserver and connected to the domain \ncontrollers, from which they exfiltrated \ncredentials and exported copies of the \nAD database ntds.dit . \nInitial Access [ TA0001 ] Valid Accounts: Cloud \nAccounts [ T1078.004]  In one case, the actors used valid \ncredentials of a global admin account \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 6 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n TACTIC  TECHNIQUE  PROCEDURE  \nPrivilege Escalation \n[TA0004 ] \nCollection [ TA0009 ] Data f rom Information \nRepositories: SharePoint \n[T1213.002 ] \n within the M365 tenant to log into the \nadministrati ve portal and change \npermissions of an existing enterprise \napplication to give read access to all \nSharePoint pages in  the environment, as \nwell as tenant user profiles and email \ninboxes.  \nInitial Access [ TA0001 ] \n \nCollection [ TA0009] Valid Accounts: Domain \nAccounts [ T1078.002 ] \nEmail Colle ction [ T1114 ] In one case, the threat actors used \nlegitimate credentials to exfiltrate emails \nfrom the victim's enterprise email \nsystem.  \nPersistence [ TA0003 ] \nLateral Movement \n[TA0008 ] Valid Accounts [ T1078 ] Threat actors us ed valid accounts for \npersistence. After some victims reset \npasswords for individually compromised \naccounts, the actor s pivoted to other \naccounts, as needed, to maintain \naccess.  \nDiscovery [ TA0007 ] File and Network \nDiscovery [ T1083 ] After gaining access to networks, the \nthreat actors used BloodHound to map \nthe Active Directory.   \nDiscovery [ TA0007 ] Domain Trust Discovery \n[T1482 ] Threat actors gathered information on \ndomain trust relationships that were \nused to identify lateral movement \nopportu nities.  \nCommand and Control \n[TA0011 ] Proxy: Multi -hop Proxy \n[T1090.003 ] Threat actor s used multiple dis parate \nnodes, such as VPSs , to route traffic to \nthe target.  \n \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 7 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n DETECTION  \nThe FBI, NSA, and CISA urge all CDCs to investigate suspicious activity in their enterprise and cloud \nenvironment s. Note : For additional approaches on uncovering malicious cyber acti vity, see joint \nadvisory  Technical Approaches to Uncovering and Remediating Malicious Activity , auth ored by CISA \nand the cybers ecurity authorities of Australia, Canada, New Zealand, and the United Kingdom.  \nDetect Unusual Activity  \nImplement r obust log collection and retention . Robust logging  is critical for detecting unusual \nactivity. Without a centralize d log collection and  monito ring capability, organizations have limited \nability to investigate incidents or detect the threat actor behavior described in this advisory.  \nDepending on the environment, tools and solutions include:  \n Cloud native solutions , such as cloud -native security incident and event management (SIEM) tools.  \n Third -party tools , such as Sparrow , to review Microsoft cloud environments and to detect \nunusual activity, service principals, and application activity.  Note : For guidance on using these \nand other detection tools, refer to CISA Cybersecurity Advisory  Detecting Post -Compromise \nThreat Activity in Microsoft Cloud Environments . \nLook for Evidence of Known TTPs  \n Look for behavioral evidence or network and host -based artifacts  from known TTPs \nassociated with this activity. To detec t password spray  activity, review authentication logs for \nsystem and application login fa ilures of valid accounts. Look for frequent , failed authentication \nattempt s across multiple accounts.  \n To detect use of compromised credentials in  combination with a VPS, follow the steps below:  \no Review  logs for suspicious imp ossible logins,  such as login s with changing \nusername s, user agent strings, and IP address combinations or logins where IP \naddresses do not align to the expected users geographic location . \no Look for one IP used for multiple accounts,  excluding expected logins.  \no Search  for impossible t ravel , which occurs when a user logs in from multiple IP \naddresses that are a significant geographic distance apart (i.e., a person could not \nrealistically travel between the geographic locations of the two IP a ddresses in the time \nbetween logins). Note:  This detection opportunity can result in false positives if \nlegitimate users apply VP N solutions before connecting to networks.  \no Evaluate  processes and program execution command -line arguments  that may \nindicate credential dumping, especially attempts to acc ess or copy the ntds.dit  file \nfrom a domain controller.   \no Identify  suspicious privileged account use after resetting passwords or applying \nuser account mitigations.  \no Review  logs for unusual activity  in typically dormant accounts.  \no Look for unusual user agent  strings , such as strings not typically associated with \nnormal user activity, which may indicate bot activ ity. \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 8 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n INCIDENT RESPONSE AND REMEDIATION  \nOrganizations with evidence of compromise should assume full identity compromise and initiate a full \nidentity reset.  \n Reset passwords for all local accounts.  These accounts should include Guest, \nHelpAssistant, DefaultAccount, System, Administrator, and krbtgt. It is essential to reset the \npassword for the krbtgt account, as this account is responsible for handling Kerberos ticket \nrequests as well as encrypting and signing them. Note:  Reset the krbtgt account twice and \nconsecutively with a 10 -hour waiting period between resets  (i.e., perform the first krbtgt  \npassword reset, wait 10 hours, and then follow with a secon d krbtgt password reset ). The \nkrbtgt password resets may take a long time to propagate fully on large AD environments. \nRefer to Microsofts  AD Forest Recovery - Resetting the krbtgt password  guidance and \nautomation script for additional information .4,5 \n Reset all domain user, admin, and service account passwords.  \nNote : For guidance on evicting advanced persistent threat (APT ) actors from cloud and enterprise \nenvironments, refer to CISA Analysis Report Eviction Guidance for Networks Affected by the SolarWinds and \nActive Directory/Microsoft 365 (M365) Co mpromise . Although this guidance was drafted for federal agencies \ncompromised by the Russian Foreign Intelligence Service (SVR) via the SolarWinds Orion supply chain \ncompromis e, the steps provided in the Eviction Phase are applicable for all organizations crafting eviction plans \nfor suspected APT actors.  \nMITIGATION S \nThe FBI, NSA, and CISA encourage all CDCs,  with or without evidence of compromise, to apply the \nfollowing mitiga tions to reduce the risk of compromise by this threat actor. While these mitigations are \nnot intended to be all -encompassing, they address common TTPs observed in these intrusions and \nwill help to mitigate against common malicious activity.  \nImplement Cred ential Hardening  \nEnable Multi factor Authentication  \n Enable multifactor authentication (MFA)  for all users, without exception. Subsequent \nauthentication may not require MFA, enabling the p ossibility to bypass MFA by reusing single \nfactor authentication asser tions (e.g., Kerberos authentication). Reducing the lifetime of \nassertions will cause account re -validation of their MFA requirements.6 Service accounts \nshould not use MFA. Automation a nd platform features (e.g., Group Managed Service \nAccounts, gMSA) can p rovide automatic and periodic complex password management for \nservice accounts, reducing the threat surface against single factor authentication assertions.7 \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 9 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Enforce Strong, Unique P asswords  \n Require accounts to have strong, unique passwords.  Passwords sh ould not be reused \nacross multiple accounts or stored on the system where an adversary may have access.  \n Enable password management functions , such as Local Administrator Password Solution \n(LAPS), for local administrative accounts. This will re duce the burd en of users  managing \npasswords and encourage them to have strong passwords.  \nIntroduce Account Lockout and Time -Based Access Features  \n Implement time -out and lock -out features  in response to repeated failed login attempts.  \n Configure  time -based access for ac counts set at the admin  level and higher . For \nexample , the Just-In-Time (JIT) a ccess method provisions privileged access when \nneeded and can support enforcement of the principle of least privilege (as well as the \nZero Trust model).  This is a process  where a network -wide policy  is set in place  to \nautomatically  disable admin istrator  accounts at the AD level when the account is not in \ndirect need. When the account is needed, individual users submit their requests through \nan automated process that enables acces s to a system  but only for a set timeframe  to \nsupport  task completion.  \nReduce Credential Exposure  \n Use virtualization solution s on modern hardware  and software  to ensure credentials are \nsecurely stored , and protect credentials via capabilities , such as Wind ows Defender \nCredential Guard (CredGuard) and Trusted Platform Module (TPM).8 Protecting domain \ncredentials with CredGuard requires configuration and has lim itations in protecting other types \nof credentials (e.g., WDigest and local accounts).9,10 CredGuard uses TPMs to protect stored \ncredentials. TPMs function as a system integrity observer and trust anchor ensuring the \nintegrity of the boot sequence and mech anisms (e.g., UEFI Secure Boot). Installation of \nWindows 11 requires TPM v2.0.11 Disabling WDigest and  rolling expiring NTLM secrets in \nsmartcards will further protect other credentials not protected by CredGuard.12,13 \nEstablish Centralized Log Management  \n Create a centralized log management system . Centralized logging applications allow \nnetwork defenders to look for anomalous activity, such as out -of-place communications \nbetween devices or unaccountable login failures, in the network environment.  \no Forward a ll logs to a SIEM tool.  \no Ensure logs are searchable.  \no Retain critical and historic network activity logs f or a minimum of 180 days.  \n If using M365, enable Unified Audit Log (UAL) M365s logging capability which contains \nevents from Exchange Online, SharePoint online, OneDrive, Azure AD, Microsoft Teams, \nPowerBI, and other M365 services.  \n Correlate logs, includ ing M365 logs, from network and host security devices . This \ncorrelation will help with detecting anomalous activity in the network environment and \nconnecting it with potential anomalous activity in M365.  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 10 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n In addition to setting up centralized logging, orga nizations should:  \n Ensure PowerShell logging is turned on . Threat actors often use PowerShell to hide their \nmalicious activities.14 \n Update PowerShell instances to version 5.0 or later  and uninstall all earlier versions of \nPowerShell. Logs from prior versions  are either non -existent or do not record enough detail to \naid in enter prise monitoring and incident response activities.  \n Confirm  PowerShell 5.0 instances have module, script block, and transcription logging \nenabled.  \n Monitor remote access/Remote Desktop P rotocol (RDP) logs  and disable unused remote \naccess/RDP ports.  \nInitiate  a Software and Patch Management Program  \n Consider using a centralized patch management system . Failure to deploy software \npatches in a timely manner makes an organization a target of o pportunity, increasing its risk of \ncompromise. Organizations can ensure timely patching of software vulnerabilities by \nimplementing an enterprise -wide software and patch management program.15 \no If an organization is unable to update all software shortly after  a patch is released, \nprioritize patches for C VEs that are already known  to be exploited or that would be \naccessible to the largest number of potential adversaries (such as internet -facing \nsystems).  \no Subscribe to CISA cybersecurity notifications and adv isories  to keep up with \nknown exploited vulnerabilities, security updates, and threats. This will assist \norganizations in maintaining situational awareness of critical software vulnerabilities \nand, if applicabl e, associated exploitation.  \n Sign up for CISA s cyber hygiene services , including vulnerability scanning, to help reduce \nexposure to threats. CISAs vulnerability scanning service evaluates ext ernal network \npresence by executing continuous  scans of public, static IPs for accessible services and \nvulnerabilities.  \nEmploy Antivirus Programs  \n Ensure that antivirus applications are installed on all organizations computers  and are \nconfigured to preven t spyware, adware, and malware as part of the operating system security \nbaseline.  \n Keep virus definitions up to date . \n Regularly monitor antivirus scans .  \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 11 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Use Endpoint Detection and Response Tools  \n Utilize endpoint detection and response (EDR) tools . Thes e tools allow a high degree of \nvisibility into the security status of endpoints and can be an effective defense against threat \nactors. EDR tools are particularly useful for detecting lateral movement, as they have insight \ninto common and uncommon net work c onnections for each host.  \nMaintain Rigorous Configuration Management Programs   \n Audit configuration management programs  to ensure they can track and mitigate emerging \nthreats. Review system configurations for misconfigurations and security weaknesse s. Hav ing \na robust configuration program hinders sophisticated threat operations by limiting the \neffectiveness of opportunistic attacks.16 \nEnforce the Principle of Least Privilege  \n Apply the principle of least privilege.  Administrator accounts should have the mini mum \npermissions they need to do their tasks. This can reduce the impact if an administrator \naccount is compromised.   \n For M365, assign administrator roles to role-based access control  (RBAC) to implement \nthe prin ciple of least privilege. Given its high lev el of default privilege, you should only use the \nGlobal Administrator account when absolutely necessary. Using Azure ADs numerous other \nbuilt-in administrator roles instead of the Global Administrator account ca n limit assigning \nunnecessary privileges. Note: Refer to  the Microsoft documentation, Azure AD built -in roles , \nfor more information abou t Azure AD.   \n Remove privileges not expressly  required by an accounts function or role.  \n Ensure there are unique and distinct administrative accounts  for each set of \nadministrative tasks.  \n Create non -privileged accounts for privileged users, and ensure the y use the non - \nprivileged accounts for all n on-privileged access (e.g., web browsing, email access).  \n Reduce the number of domain and enterprise administrator accounts, and remove all \naccounts that are unnecessary.  \n Regularly audit administrative user accoun ts. \n Regularly audit logs to ensure new accou nts are legitimate users.  \n Institute a group policy that disables remote interactive logins, and use Domain \nProtected Users Group.  \nTo assist with identifying suspicious behavior with administrative accounts:  \n Create privileged role tracking.  \n Create a change control process  for all privilege escalations and role changes on user \naccounts.  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 12 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n  Enable alerts on privilege escalations and role changes.  \n Log privileged user changes in the network environment, and  create an alert for unusual \nevents.  \nReview Trust Relations hips  \n Review existing trust relationships with IT service providers, such as managed service \nproviders (MSPs) and cloud service providers (CSPs). Threat actors are known to exploit trust \nrelationshi ps between providers and their customers to gain access to customer networks and \ndata.   \n Remove unnecessary trust relationships.   \n Review contractual relationships with all service providers, and ensure contracts include:  \no Security controls the customer de ems appropriate.  \no Appropriate monitoring and logging of pro vider -managed customer systems.  \no Appropriate monitoring of the service providers presence, activities, and connections \nto the customer network.  \no Notification of confirmed or suspected security event s and incidents occurring on the \nproviders infrastructure and administrative networks.  \nNote : Review CISAs page on APTs Targeting IT Service Provider Customers  and CISA Insights: Mitigations \nand Hardening Guidance for MSPs and Small and Mi d-sized Businesses  for additional recommendations for \nMSP and CSP customers.  \nEncourage Remote  Work Environment Best Practices  \nWith the increase in remote work and use of  VPN servi ces due to COVID -19, the FBI,  NSA, and CISA  \nencourage regularly monitoring remote network traffic , along with employing the following best \npractices . Note:  For additional  information, see joint NSA -CISA Cybersecurity Information Sheet: \nSelecting and Hardening Remote Access VPN Solutions . \n Regularl y update VPNs, network infrastructure devices, and devices  used for remote \nwork environments  with the latest software patches and security configurations.  \n When possible, require  MFA  on all VPN connections . Physical security tokens are the \nmost secure form of MFA , followed by authenticator applications. When MFA is unavaila ble, \nmandate  that emplo yees engaging in remote work use strong passwords.  \n Monitor network traffic for unapproved and unexpected protocols . \n Reduce potential attack surfaces by discontinuing  unused VPN servers that may be \nused as a point of entry by adversar ies. \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 13 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Establish User Awareness Best Practices  \nCyber actors frequently use unsophisticated methods to gain initial access, which can often be \nmitigated by stronger employee awareness of in dicators of malicious activity. The FBI, NSA, and \nCISA recommend the following best practices to improve employee operational security when \nconducting business:  \n Provide end user awareness and training . To help prevent targeted social engi neering and \nspearp hishing scams,  ensure that employees and stakeholders a re aware of potential cyber \nthreats and how they are delivered. Also, provide users with training on information security \nprinciples and techniques.  \n Inform employees of the risks of social engineering attacks , e.g., risks associated with \nposting detailed c areer information to social or professional networking sites.  \n Ensure that employees are aware of what to do and who m to contact when they see \nsuspicious activity or suspect a cyber  intrusion  to help qu ickly and efficiently identify \nthreats and employ mitig ation strategies.  \nApply Additional Best Practice Mitigations  \n Deny atypical inbound activity from known anonymization services , includ ing \ncommercial VPN services and The Onion Router (TOR).  \n Impose  listing policies for applications and remote access  that onl y allow systems to \nexecute known and permitted programs under an established security policy.  \n Identify and create offline backups for critical assets . \n Implement network segmentation . \n Review CISA Alert  AA20 -120A: Microsoft Office 365 Security Recommendations  for \nadditional recommendations on hardening M365 cloud environments.  \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 14 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n REWARDS FOR JUSTICE PROGRAM  \nIf you have information on state -sponsored Russian cyber operations targeting U.S. critic al \ninfrastructure, contact the Department of States Rewards for Justice Program. You may be eligible \nfor a reward of up to $10 million, which the Department is offering for information leading to the \nidentification or location of any person who, while act ing under the direction or control of a foreign \ngovernment, participates in malicious cyber activity against U.S. critical infrastructure in violation of \nthe Computer Fraud and Abuse Act (CFAA). Contac t (202) 702-7843 on WhatsApp, Signal, or \nTelegram, or send information via the Rewards for Justice secure Tor -based tips line located on the \nDark Web. For more details, refer to rewardsforjustice.net . \nCAVEATS  \nThe information you have accessed or received is being provided as is for informational purposes \nonly. The FBI, NSA, a nd CISA do not endorse any commercial product or service, including any \nsubjects of analysis. Any reference to specific commercial products, processes, or services by service \nmark, trademark, manufacturer, or otherwise, does not constitute or imply their endorsement, \nrecommendation,  or favoring by the FB I, NSA, or CISA.  \nCONTACT  \nTo report suspicious activity related to information found in this Joint Cybersecurity Advisory, contact \nyour local FBI field office at www.fbi.gov/contact -us/field -offices  or the FBIs 24/7 Cyber Watch \n(CyWatch) at (855) 292 -3937 or by email at CyWatch@fbi.gov . When available, please include the \nfollowing information regarding the incident: date, time, and location of the incident; ty pe of activity; \nnumber of people affected; type of equipment used for the activity; the name of the submitting \ncompany or organization; and a designated point of contact. To request incident response resources \nor technical assistance related to these threa ts, contact CISA at Central@cisa.gov . For NSA client \nrequirements or general cybersecurity inquiries, contact the NSA Cybersecurity Require ments Center \nat (410) 854-4200 or Cybersecurity_Req uests@nsa.gov . Defense Industrial Base companies may \nadditionally sign up for NSAs free cybersecurity services, including Protective DNS, vulnerability \nscanning, and threat intelligence collaboration at dib_defense@cyber.nsa.gov .  \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 15 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Appendix : Detailed Tactics, Techniques, and Procedures  \nReconnaissance [ TA0043 ] \nReconnaissance consists of techniques that involve adversaries ac tively or passively gathering \ninformation that can be used to support targeting. The adversary is known for harvesting login \ncredentials [ T1589.001 ].17 \nID Name Description  \nT1589.001  Gather Victi m Identity \nInformat ion: Credentials  Adversaries may gather credentials that can be used \nduring targeting.  \nInitial Access [ TA0001 ] \nInitial Access consists of techniques that use various entry vectors to gain their initial foothold within a \nnetwork. For example, the adversary may obtain and abuse credentials of existing accounts as a \nmeans of gaining Initial Access, Persistence, Privil ege Escalation, or Defense Evasion  [T1078 ].18 \nThese specific actors obtained and abused credentials of domain [T1078.002 ] and cloud account s \n[T1078.004 ].19 The actors also used external remote services to gain access to systems [ T1133 ].20 \nThe adversary took advantage of weakness es in i nternet -facing servers  and conducted SQL inj ection \nattacks against organizations' external websites [ T1190 ].21 Finally, they sent spearphishing emails \nwith a malicious link in an attempt to gain access  [T1566.002 ].22 \nID Name  Description  \nT1078  Valid Accounts  Adversaries may obtain and abuse credentials of existing \naccounts as a means of gaining Initial Access . \nT1078.002  Valid Accounts: \nDomain Accounts  Adversaries may obtain and abuse  credentials of a domain \naccount as a means of gaining Initial Access, Persistence, \nPrivilege Escalation , or Defense Evasion.  \nT1078.00 4 Valid Accounts: Cloud \nAccounts  Adversaries may obtain and abuse credentials of a cloud \naccount as a means of gaining In itial Access, Persistence, \nPrivilege Escalation, or Defense Evasion.  \nT1133  External Remote \nServices  Adversaries may leverage external -facing remote services \nto initially access and/or persist within a network . \nT1190  Exploit Public -Facing \nApplication  Adve rsaries may attempt to take  advantage of a weakness \nin an i nternet -facing computer or program using software, \ndata, or commands , in order to cause unintended or \nunanticipated behavior . \nT1566.002  Phishing: \nSpearphishing Link  Adversaries may send spearphish ing emails with a \nmalicious link in an attempt to gain access to victim \nsystems.  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 16 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Persistence [ TA0003 ] \nPersistence consists of techniques that adversaries use to keep access to systems across restart s, \nchanged credentials, and other interruptions that could cut off their access. The adversary obtai ns \nand abuse s credentials of existing accounts as a means of gaining Initial Access, Persistence, \nPrivilege Escalation, or Defense Evasion  [T1078 ].23 \nID Name  Description  \nT1078  Valid Accounts  Adversaries may obtain and abuse credentials of \nexisting accounts as a means of gaining Initial Access, \nPersistence, Privilege Escalation, or D efense Evasion.  \nPrivilege Escalation [ TA0004 ] \nPrivilege Escalation consists of techniques that adversaries use to gain higher -level permissions on a \nsystem or network. The adversary obtain s and abuse s credentials of exi sting accounts as a means of \ngaining Initial Access, Persistence, Privilege Escalati on, or Defense Evasion  [T1078 ].24 Specifically in \nthis case, credentials of cloud account s [T1078.004 ] were obtain ed and abuse d.25   \nID Name  Description  \nT1078  Valid Accounts  Adversaries may obtain and abuse credentials of \nexisting accounts as a means of gaining Initial Access . \nT1078.00 4 Valid Accounts: Cloud \nAccounts  Adversaries may obtain and abuse credentials of a \ncloud account as a means of gaining Initial Access, \nPersistence, Privilege Escalation, or Defense Evasion.  \nDefense Evasion [ TA0005 ] \nDefens e Evasion consists of techniques that adversaries use to avoid detection throughout their \ncompromise. The adversary made its executable s and files difficult to discover or analyze by \nencrypting, encoding, or otherwise obfuscating its contents on the system  or in transit  [T1027 ].26 \nID Name  Description  \nT1027  Obfuscated Files or \nInformation  Adversaries may attempt to make an executable or file \ndifficult to discover or analyze by encrypting, encod ing, \nor otherwise obfuscating its conten ts on the system or \nin transit.  \n \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 17 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Credential Access [ TA0006 ] \nCredential Access consists of techniques for stealing credentials like account names and passwords. \nThe adversary attempt ed to access or create a copy of the Active Directory (AD) domain database to \nsteal credential information, as well as obtain other inf ormation about domain members such as \ndevices, users, and access rights  [T1003.003 ].27 The adversary also used a single or small list of \ncommonly used passwords against many different accounts t o attempt to ac quire valid account \ncredentials [ T1110.003 ].28 \nID Name  Description  \nT1003.003  OS Credential Dumping: \nNTDS  Adversaries may attempt to access or create a copy of \nthe Active Directory domain database to steal credential \ninformation, as well as obtain other information about \ndomain member s such as devices, users, and access \nrights.  \nT1110.003  Brute Force: Passwor d \nSpraying  Adversaries may use a single or small list of commonly \nused passwords against many different accounts to \nattempt to acquire valid account credentials.  \nDiscovery [ TA0007 ] \nDiscovery consists of techniques an adversary may use to gain knowledge about the system and \ninternal network. The adversary enumerate d files and directories or search ed in specific locations of  a \nhost or network share for certain informa tion within a file system [ T1083 ].29 In addition, the adversary \nattempt ed to gather information on domain trust relationships that may be used to identify  lateral \nmovement opportunities in Windows multi -domain  or forest environments  [T1482 ].30 \nID Name  Description  \nT1083  File and Directory \nDiscovery  Adversaries may enumerate files and directories or may \nsearch in specific locations of a host or network share \nfor certain information within a file system.  \nT1482 Domain Trust Discovery  Adversaries may attempt to gather information on \ndomain trust relati onships that may be used to identify \nlateral movement op portunities in Windows multi -\ndomain/forest environments.  \n \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 18 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n Collection [ TA0009 ] \nCollection consists of both the techniques adversaries may use to gather information and the sources \nfrom which informa tion is collected  that are relevant to the adversary's objectives. The adversary \nleverage s information repositories , such as SharePoint,  to mine valuable information  [T1213.002 ].31   \nID Name  Desc ription  \nT1213.002  Data from Information \nRepositories: SharePoint  Adversaries may leverage the SharePoint repository as \na source to mine valuable information.  \nCommand and Control [ TA0011 ] \nCommand an d Control (C2) consists of techniques that adversaries may use to communicate with \nsystems under their control within a victim network. The adversary chain ed together multiple proxies \nto disguise the source of m alicious traffic. In this case, TOR and VPN s ervers are used as multi -hop \nproxies to route C2 traffic and obfuscate their activities [ T1090.003 ].32 \nID Name  Description  \nT1090.003  Proxy: Multi -hop Proxy  To disguise the source of malicious tr affic, adversaries \nmay chain together multiple proxies.  \n \n  \n\n \n   FBI | NSA | CISA  TLP:WHITE  \n \nPage 19 of 19 | Product ID : AA22-047A \nTLP:WHITE  \n ADDITIONAL RESOURCES  \n \n1 NSA, CISA, FBI, NCSC  | Cybersecurity Advisory | Russian GRU Conducting Global Brute Force Campaign to \nCompromise Enterprise and Cloud Environments  | 1 July 2021. \n2 NSA | Cybersecur ity Advisory | Mitigating Recent VPN Vulnerabilities  | 7 October 2019.  \n3 NSA, CISA, FBI, NCSC | Cybersecurity Advisory  | Russian GRU Conducting Global Brute Force Campaign to \nCompromise Enterprise and Cloud Environments  | 1 July 2021. \n4 Microsoft | Arti cle | AD Forest Recovery  Resetting the krbtgt passwo rd | 29 July 2021.   \n5 Microsoft | GitHub | New-KrbtgtKeys.ps1  | 14 May 2020.   \n6 NSA | Cybersecurity Information  | Defend Privileges an d Accounts  | August 2019.  \n7 Microsoft | Article | Group Managed Service Accounts Overview  | 29 July 2021.  \n8 NSA | Cybersecurity Information  | Leverage Modern Hard ware Security Features  | August 2019.  \n9 Microsoft | Article | Protect derived domain credentials with Windows Defender Credential Guard  | 3 December \n2021.  \n10 Microsoft | Article | Windows Defender Credential Guard protection limits  | 3 December 2021.  \n11 Microsoft | Article | Windows 11 requirements  | 30 November 2021.  \n12 Microsoft | Blog Post | The Importance of  KB2871997 and KB2928120 for Credential Protection  | 20 \nSeptember 2021.  \n13 Microsoft | Article | Whats New in Credential Protection  | 7 January 2022.  \n14 NSA | Cybersecurity Factsheet | PowerShell: Security Risks and Defenses  | 1 December 2016.  \n15 NSA | Cybersecurity Information  | Update and Upgrade Software Immediately  | August 2019.  \n16 NSA | Cybersecurity Information  | Activel y Manage Systems and Configurations  | August 2019.  \n17 MITRE | Groups | APT28  | 18 October 2021.  \n18 MITRE | Groups | APT28  | 18 October 2021.  \n19 MITRE | Software | Cobalt Strike  | 18 October 2021.  \n20 Based on technical information shared by Mandiant.  \n21 MITRE | Groups | APT28  | 18 October 2021.  \n22 Based on technical information shared by Mandiant.  \n23 MITRE | Groups | APT28  | 18 October 2021.  \n24 MITRE | Groups | APT28  | 18 October 2021.  \n25 MITRE |  Software | Cobalt Strike  | 18 October 2021.  \n26 MITRE | S oftware | Fysbis  | 6 November 2020.  \n27 MITRE | Software | Koadic  | 30 March 2020.  \n28 MITRE | Groups | APT28  | 18 October 2021.  \n29 Based on technical information shared by Mandiant.  \n30 Based on technical information shared by Mandiant . \n31 MITRE | Groups | APT28  | 18 October 2021.  \n32 MITRE | Groups | APT28  | 18 October 2021.  \n\n",
  "cves": [],
  "techniques": [
    "T1027",
    "T1090.003",
    "T1078",
    "T1213.002",
    "T1114.002",
    "T1078.002",
    "T1114",
    "T1190",
    "T1083",
    "T1589.001",
    "T1003.003",
    "T1110",
    "T1078.004",
    "T1566.002",
    "T1133",
    "T1482",
    "T1110.003"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "aa22-047a_russian_state_sponsored_cyber_actors_target_cdc_networks_20220216",
  "source": "nsa",
  "id": "1eaf4a6fe704232ace8812c7ea56b0079e92372925307b8ffdd0406676810eac"
}