{
  "markdown": " \n \nU/OO/181144 -19          PP -19-1018          AUGUST 2019  1 ACTIVELY MANAGE SYSTEMS AND CONFIGURATIONS  \nCHANGE IS A CONSTANT  \nNetworks are often complex, and in a constant state of change. Devices are connected and removed. Software is \nupdated. Attackers can use knowledge of network systems and configurations to compromise them. Without a clear \npicture of network status, mitigating cyber threats becomes difficult. In a world of ever -escalating threats, it is critical to \nensure visibility into the systems and configurations of enterprise networks.  \nActive management of these systems  and configurations  is vital to a n etworks security posture. It provides visibility and \nenables decisive defensive action. Other critical  mitigations  directly depend on active management , such as hunting for \nintrusions and exercising a system recovery plan. Enterprises that actively manage their networks also save resources \nand improve their network availability [1].  \nTo achieve this, an enterprise first discovers and inventories all systems on the network.  Next, the enterprise establishes  \nthe ability to manage the configuration of systems  on the network . Finally, the enterprise engages  in continuous and \ndynamic management of systems in the face of ever -evolving threats.  \nDISCOVER AND INVENTORY  NETWORK SYSTEMS  \nBefore systems can be managed, they must be identified. Surveys discover  and document the location of wired systems \nsuch as servers, desktops, and network devices including routers, switches, and  unified communications devices.  \nNetwork discovery and mapping tools can help supplement this information by locat ing any unknown systems  and also \ndiscover ing wireless devices or any new systems that appear unexpectedly on the network.  Administrators can then \nremove any such syst ems that are unwanted, unneeded,  or unexpected.  Port Security and Network Access Control \ntechnologies can also be used to limit or discover any unexpected systems, although there is overhead in these \napproaches and t hey may not be appropriate for all networks.  \nOnce the system inventory  is documented, administrators should establish a process to update  the inventory as needed  \nbased on changes in the network . This ensures the inventory remains current. The inventory should minimally capture the \nphysical location, owner,  and purpose of the device.  Some parts of networks cannot be effectively inventoried, such as \nthose that support guest devices like mobile devices.  These network  segments  should be segregated from the rest of the \nnetwork and enterprise resources.  \nMANAGE CONFIGURATION  \nAfter all systems are identified, administrators can manage their configurations. Managing the configuration of systems \nprovides administrators visibility and control over ongoing network operations and ensures changes can be made when \nneeded. Systems management tools not only provide the ability to manage configurations, but also to query other \nimportant aspects of the system, such as determining currently installed software. Enterprises can choose from a variety \nof commercially -available offerings to achieve management of systems.  \nTraditionally, configuration management solutions only offered the ability to control servers and workstations. Now, many \nIT endpoints are mobile devices [2]. Alternative Mobile Device Management ( MDM)  solutions exist, supporting the \nmanagement of mobile devices that connect to and process enterprise data. Because of their mobile nature, these \ndevices do not have a consistent location and instead their physical protection is the responsibility of the pr imary user. \nMDM- style management is also available for desktop and laptop platforms that serve a single user or handful of users. \nWhile this approach does not provide the single sign- on capability an integrated directory system provides, it does \nseparate authentication and management in a way that eliminates some risks inherent in single sign- on architectures.  \n\n \n \nU/OO/181144 -19          PP -19-1018          AUGUST 2019  \n2 At first, managing security configurations began with a focus on one- time hardening of settings to reduce  \nthe attack surface.  Over the last 20 years , the industry has  largely  transitioned from shipping enterprise- class  \nproducts with permissive and vulner able configurations to shipping products whose configurations are largely secure by \ndefault. Yet managing security -relevant settings still constitutes due diligence, and a small number of settings have \nsignificant preventive cybersecurity impact. These inc lude enabling automatic software updates, disabling removable \nmedia access if the operational environment permits, and enforcing software execution policies.1 Industry  often provides \nconfiguration checklists  for popular products, and enterprises can adopt these with confidence that they will track with the \nproducts and introduce little to no overhead.  \nA configuration control process must also be established to manage the enterprises configuration for each type of \nsystem. Network s takeholders supported by Subject Matter Experts  should be involved in decision- making regarding \nconfigurations and play an essential role in the enterprises configuration management plan. At the same time, this \nprocess must be agile and establish contingencies to make decisions w ithin minutes if operationally needed.  \nMONITOR AND MANAGE S YSTEMS AND SOFTWARE  \nTo quickly respond to any threats , administrators must  continue to monitor systems and software on the network, and \npromptly take action when  needed. Continuous management  allow s cybersecurity and IT operation teams to truly control \nthe network and contest adversary actions.  \nEffective m onitoring and management includes  continuous discovery  of new systems , vulnerability assessments, \nmanagement of configurations, immediate patching , and analytics that leverage security information and event \nmanagement services . Implementation of continuous monitoring enables  a real -time view of the current state of the \nnetwork , even as configurations change and devices connect to and disconnect from  the network . The real -time view \nestablished by continuous monitoring can then inform everyday management of servers, workstations, and network \ndevices. This ensures all systems are in the intended state. The ability to access current information about all  systems on \nthe network, as well as historical information, is also critical to effective incident response.  \nCONCLUSION  \nNetworks continue to grow in complexity , as does the risk from adversaries. Establishing control of the network lays the \ngroundwork for countering adversary behavior as well as implementing proactive network defense. To actively manage its \nnetworks, an enterprise regularly inventories its systems, evaluates configurations, tracks changes, monitors behaviors, \nand conducts regular assessment s, assuring its understanding of the network is current and comprehensive. This \napproach results in reduced costs for the enterprise, increased network availability, and better preparedness against \nnetwork attacks.  \nREFERENCES \n[1]  Configuration Management: Best Practices White Paper, Cisco, Doc. ID 15111, 2006. [Online] Available: \nhttps://www.cisco.com/c/en/us/support/do cs/availability/high- availability/15111- configmgmt.html  \n[2]  What Is Mobile Device Security? Cisco. [Online] Available: https://ww w.cisco.com/c/en/us/solutions/small -business/resource-\ncenter/security/mobile- device- security.html  \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees .  Reference herein to any \nspecific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nCONTACT INFORMATION  \nClient Requirements and General Cybersecurity Inquiries  \nCybersecurity Requirements Center (CRC),  410-854-4200, email: Cybersecurity_Requests@nsa.gov  \n                                                \n1 For more information on these settings, please refer to  Enforce Signed Software Execution Policies  and  Update and Upgrade Software Immediately , part of  the NSA Cybersecurity \nTop 10 Mitigations.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "actively manage systems and configurations.docx - copy",
  "source": "nsa",
  "id": "91896047b85ffe53ca81e8a011fff027f9aaffffdcfc1dfa208ff70bbcc11d38"
}