{
  "markdown": " \n \n   \n7 December  202 3 \n Crown Copyright 202 3 \nAdvisory  \nRussian FSB cyber actor Star \nBlizzard continues worldwide spear -phishing campaigns.\nUpdated and new research, updated \nvulnerabilities, security updates  and revised \nactors.  \n\n\nRussian FSB cyber actor Star \nBlizzard continue s worldwide \nspear- phishing campaigns  \nThe Russia- based actor is  targeting organisations and \nindividuals in the UK and other geographical areas of \ninterest\nOverview  \nThe Russia -based actor Star Blizzard (formerly known as SEABORGIUM, also \nknown as  Callisto Group/TA446/COLDRIVER/TAG -53/BlueCharlie ) continue s \nto successfully use spear- phishing attacks  against targeted organisations \nand individuals in the UK , and other geographical areas of interest, for \ninformation- gathering activity.  \nThe UK National Cyber Security Centre (NCSC), the US Cybersecurity and \nInfrastructure Security Agency (CISA), the US Federal Bureau of \nInvestigation (FBI), the US National Security Agency (NSA), the US Cyber National Mission Force (CNMF), the Australian Signals Directorates Australian Cyber Security Centre (ASDs ACSC), the Canadian Centre for \nCyber Security (CCCS), and the New Zealand National Cyber Security Centre (NCSC -NZ) assess that Star Blizzard is almost certainly subordinate \nto the Russian Federal Security Service (FSB) Centre 18.  \nIndustry has previously published details of Star Blizzard.  This advisory \ndraws on that body of information.  \n\n   \n \nThis advisory  raises awareness of the spear- phishing techniques Star \nBlizzard uses to target indi viduals  and organisations . This activity is \ncontinuing through 2023.  \nTargeting p rofile  \nSince 2019, Star Blizzard has targeted sectors including academia, defence, \ngovernmental organisations , NGOs, think  tanks  and politicians. \nTargets in the U K and US appear to have been most affected by  Star \nBlizzard activity, however activity has also been observed against targets in \nother  NATO countries , and countries neighbouring Russia . \nDuring 2022, Star Blizzard activity appeared to expand further, to include  \ndefence- industrial targets , as well as US Department of Energy facilities.  \nOutline of the attacks  \nThe activity is typical of spear- phishing campaigns, where an actor target s \na specific individual or group using information known to be of interest to the targets. In a spear- phishing  campaign, an actor perceives their target \nto have direct access to information of interest, be an access vector to another target, or both.  \nResearch and preparation   \nUsing open -source resources to conduct reconnaissance, including social \nmedia and professional networking platforms, Star Blizzard identifies  hooks \nto engage their target. They take the time to research their interests and identify their real -world social or professional contacts.  [T1589 ; T1593\n] \nStar Blizzard creates email accounts impersonating known contacts of \ntheir targets to help appear legitimate . They also create fake social media \nor networking profiles that impersonate respected experts [ T1585.001 ] and \nhave used supposed conference or event invitations as lures.    \n\n   \n \nStar Blizzard uses webmail addresses from different providers , including \nOutlook, Gmail , Yahoo and Proton mail  in their initial approach  [T1585.002 ], \nimpersonating known contacts of the target or  well -known names in the \ntargets field of interest or sector.  \nTo appear authentic, t he actor  also creates malicious domains resembl ing \nlegitimate organisations [ T1583.001 ].  \nMicrosoft Threat Intelligence Center (MSTIC) provides a list of observed \nIndicators of Compromise (IOCs) in their SEABORGIUM blog1, but this is not \nexhaustive.  \nPreference for personal email addresses  \nStar Blizzard has predominantly sent spear- phishing emails to targets \npersonal email addresses, although they have also used targets corporate \nor business email addresses . The actors may  intentionally  use personal \nemails to circumvent security controls in place on corporate networks.  \nBuilding a rapport  \nHaving taken the time to research their targets interests and contacts to create a believable approach, Star Blizzard now start s to build trust. They \noften begin by establishing benign contact on a topic they hope will engage their targets. There is often some correspondence between attacker and target, sometimes over an extended period, as the attacker builds rapport.  \nDelivery of malicious link  \nOnce trust is established, the attacker uses typical phishing tradecraft and shares a link [ T1566.002\n], apparently to a document or website of interest. \n \n \n\n   \n \nThis leads the target to an actor- controlled server, prompting the target to \nenter account credentials.  \nThe malicious link may be a URL in an email message, or the actor may \nembed a link in a document [ T1566.001 ] on OneDrive,  Google Drive, or other \nfile-sharing platforms.  \nStar Blizzard uses  the open -source framework EvilGinx in their spear -\nphish ing activity,  which allows them  to harvest credentials and session \ncookies to successfully bypass the use of two- factor authentication [T1539;  \nT1550.004 ].  \nExploitation and further activity   \nWhichever delivery method is used, once the target clicks on the malicious URL, they are directed to an actor- controlled server that mirrors the sign -in \npage for a legitimate service. Any credentials entered at this point are now compromised.  \nStar Blizzard then uses the stolen credentials to log in to a target s email \naccount [ T1078\n], where they are known to access and steal emails and \nattachments from the victims inbox [ T1114.002 ]. They have also set  up mail -\nforwarding rules, giving them ongoing visibility of victim correspondence [\nT1114.003 ]. \nThe actor has also used their access to a victim email account to access \nmailing -list data and a victims contacts list , which they then use for follow -\non targeting . They have also  used compromised email accounts for further \nphishing activity [ T1586.002 ]. \nConclusion  \nSpear -phishing is an established technique used by many actors , and Star \nBlizzard uses it successfully , evolving  the technique to maintain their \nsuccess.  \n\n   \n \nIndividuals and organisations from previously targeted sectors  should be \nvigilant of the techniques described in this advisory .  \nIn the UK you can report related suspicious activity to the NCSC  \nInformation on effective defence against spear- phishing is included in the \nMitigation section below.  \n \nMITRE ATT&CK \nThis report has been compiled with respect to the MITRE ATT&CK framework, a \nglobally accessible knowledge base of adversary tactics and techniques based on real -world observations.  \nTactic  ID Technique  Procedure  \nReconnaissanc e T1593  Search Open \nWebsites/Domains  Star Blizzard use s open- source \nresearch and social media to identify information about victims to use  in \ntargeting.  \nReconnaissance  T1589  Gather Victim Identity Information  Star Blizzard use s online data sets \nand open -source resources to \ngather information about their \ntargets.  \nResource \nDevelopment  T1585.0\n01 Establish Accounts: Social Media Accounts Star Blizzard has  been observed \nestablish ing fraudulent profiles on \nprofessional networking sites to \nconduct reconnaissance.  \nResource \nDevelopment  T1585.0\n02 Establish Accounts: Email Accounts  Star Blizzard registers consumer \nemail accounts matching the names of individuals they are impersonating \nto conduct spear -phishing activity.  \nResource \nDevelopment  T1583.0\n01 Acquire Infrastructure: \nDomains  Star Blizzard registers domains to \nhost their phishing framework.  \n\n   \n \nTactic  ID Technique  Procedure  \nResource \nDevelopment  T1586.0\n02 Compromise Accounts: \nEmail Accounts  Star Blizzard has  been observed \nusing  compromised victim email \naccounts to conduct spear -phishing \nactivity against contacts of the \noriginal victim.  \nInitial Access  T1078  Valid Accounts Star Blizzard use s compromised \ncredentials, captured from fake log-in pages, to log in to valid victim user \naccounts.   \nInitial Access  T1566.0\n01 Phishing: Spear -phishing \nAttachment  Star Blizzard use s malicious links \nembedded in email  attachment s to \ndirect victims to their credential -\nstealing sites.  \nInitial Access  T1566.0\n02 Phishing: Spear -phishing \nLink Star Blizzard sends spear- phishing \nemails with malicious links directly to credential -stealing sites, or to \ndocuments hosted on a file -sharing \nsite, which then direct victims to \ncredential -stealing sites.  \nDefence Evasion  T1550.0\n04 Use Alternate Authentication Material: Web Session Cookie  Star Blizzard bypasses  multi -factor \nauthentication on victim email accounts by using session cookies stolen using EvilGinx\n. \nCredential \nAccess  T1539  Steal Web Session Cookie  Star Blizzard use s EvilGinx to steal the \nsession cookies of victims directed to their fake log -in domains.  \nCollection T1114.00\n2 Email Collection: Remote Email Collection  Star Blizzard interact s directly with \nexternally facing Exchange services, Office 365  and  Google Workspace to \naccess email and steal information using compromised credentials or \naccess tokens.  \nCollection T1114 .0 0\n3 Email Collection: Email Forwarding Rule  Star Blizzard abuse s email -\nforwarding rules to monitor the activities of a victim, steal information, and maintain persistent access to victim's emails, even after \ncompromised credentials are reset.  \n \n\nMitigation \nA number of mitigations will be useful in defending against the activity \ndescribed in this advisory . \n>Use strong passwords. Use a separa te password for email accounts and  \navoid password re-u se ac ross multip le services. See NCSC guidance: \nhttps://www.ncsc.gov.uk/c ollection/top-t ips-for-s taying-s ecure-\nonline/use-a-s trong-a nd-sepa rate-p assword-for-e mail\n>Use multi-f actor authentic ation (/2-f actor authentication/two-s tep \nauthentication) to re duce the impact of  password compromises. See  \nNCSC guidance: https://www.ncsc.gov .uk/guidance/m ulti-factor-\nauthentication-o nline-s ervices  and\nhttps://www.ncsc.gov .uk/gu idance/setting-t wo-f acto r-authentication-2 fa\n>Protect your devices and networks by kee ping them up to da te: use the \nlatest supported ver sions, apply security upd ates promptly, use a nti-virus \nand scan regularly to guard against know n malware threats. See N CSC \nguidance: htt ps://www.ncsc.gov.uk /collection/mobile-d evice-g uidance/\nantivirus-a nd-o ther-s ecurity-s oftware\n>Exercise vigila nce. Spear-p hishing emails are tailored  to a void suspicion.  \nYou may recognise the  send ers name, but has t he email come from an  \nadd ress that you re cognise? Would you expect  contact from this persons  \nwebmail address rat her than their corporate em ail address? Has the  \nsuspicious email come t o your personal/webmail ad dres s, rather than  \nyour corporate one ? Can  you verify tha t the email is legitimate vi a anoth er \nmeans? See NCSC guidance: https://www.ncsc.g ov.uk/phishing and  http s://\nwww.ic3.gov/Home/Industry Alerts\n>Enable your em ail providers aut omated email scanning feature s. These \nare turned on by defa ult for consumer mail providers. See NCSC guida nce:\n\n   \n \nhttps://www.ncsc.gov.uk/blog -post/telling -users -to-avoid- clicking -bad-\nlinks- still- isnt-working  \n \n> Disable mail- forwarding.  Attackers have been observed to set up mail -\nforwarding rules to maintain visibility of target emails. If you cannot \ndisable mail -forwarding, then monitor settings regularly to ensure that a \nforwarding rule has not been set up by an external malicious acto r. \n\n   \n \nDisclaimer  \nThis report draws on information derived from NCSC and industry sources. Any \nNCSC findings and recommendations made have not been provided with the intention of avoiding all risks and following the recommendations will not remove all such risk. Ownership o f information risks remains with the relevant system \nowner at all times.  \nThis information is exempt under the Freedom of Information Act 2000 (FOIA) and \nmay be exempt under other UK information legislation.  \nRefer any FOIA queries to ncscinfoleg@ncsc.gov.uk\n.  \nAll material is UK Crown Copyright   \n\n",
  "cves": [],
  "techniques": [
    "T1550.004",
    "T1585.001",
    "T1583.001",
    "T1114.002",
    "T1566.002",
    "T1114.003",
    "T1586.002",
    "T1566.001",
    "T1585.002"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "advisory-russian-fsb-cyber-actor-star-blizzard-continues-worldwide-spear-sphishing-campaigns",
  "source": "nsa",
  "id": "16f710311a4bf5ae1dfe8c600022059e370a2d5b145684aa7b36bd93e10f303a"
}