{
  "markdown": "  \nU/OO/198854 -20 | PP-20-1485 | Dec 2020  Rev 1.0 \n \nNational Security Agency | Cybersecurity Advisory  \nDetecting Abuse  of Authentication Mechanisms  - Abridged  \nSummary  \nMalicious cyber  actors are abusing trust in federated authentication environments to access protected data. An on \npremises  federated identity provider or single  sign-on (SSO) system lets an organization use the authentication systems \nthey already own (e.g. tokens, authentication apps, one -time passwords, etc.) to grant  access to resources, including \nresources in off premises  cloud services. These systems often use  cryptographically signed automated messages called \nassertions  shared via Security Assertion Markup Language (SAML) to show that users have been authenticated.   When \nan actor can subvert authentication mechanisms,  they can gain illicit access to a wide range of an organizations assets.  \nIn some cases, actors have stolen keys  from the SSO system  that allow them to sign assertions  and impersonate any \nlegitimate user who could be authenticated by the system . On 7 Decem ber, NSA  reported on an example where a zero -\nday vulnerability was being used to compromise VMware Access1 and VMware Identity Manager2 servers , allowing \nactors to forge authentication assertions and thus gain access to the victims protected data . In other cases, actors have \ngained enough privileges to create their own keys and identities  such as service principals  (cloud applications that act on \nbehalf of a user)  or even their own fake SSO system . According to public reporting, i n some cases, t he So larWinds \nOrion3 code compromise provided actors initial access to an on -premises network which led to access  within the cloud.     \nNote that these techniques alone do not constitute vulnerabilities in the design principles of federated identity \nmanagement, t he SAML protocol, or on -premises and cloud identity services. The security of identity federation in any \ncloud environment directly depends on trust in the on -premises components that perform authentication, assign privileges, \nand sign SAML tokens. If any of these components is  compromised, then the trust in  the federated identity system  can be \nabused for unauthorized access.  \nTo defend against these techniques , organizations should pay careful attention to locking down SSO configuration and \nservice principa l usage, as well as hardening the systems that run on -premises identity and federation services. \nMonitoring the use of SSO tokens and the use of service principals in the cloud can help detect the compromise of identity \nservices. While these techniques app ly to all cloud environments that support on -premises federated authentication, the \nfollowing specific mitigations are focused on Microsoft Azure4 federation. Many of the techniques can be generalized to \nother environments  as well . \n \nDisclaimer of Endorsem ent \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does no t constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecuri ty missions, including its responsibilities to identify and disseminate threats to \nNational Security Systems, Department of Defense, and Defense Industrial Base information systems, and to develop and issue c ybersecurity \nspecifications and mitigations. Thi s information may be shared broadly to reach all appropriate stakeholders.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n                                            \n1. VMware Access is a registered trademark of VMware  \n2. VMware Identity Manager  is a registered trademark of VMware  \n3 SolarWinds Orion  is a registered trademark of SolarWinds Worldwide LCC.  \n4 Azure  is a registered trademark of Microsoft Corporation . \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "authentication_mechanisms_csa_exec_u_oo_198854_20",
  "source": "nsa",
  "id": "3e2e88a9eafec840940f8b5dbf360bd6ac3352e3b3d6d60f6f9cfbeb8c528e3b"
}