{
  "markdown": " \n \n U/OO/205603 -18          PP-18-0695          18 September 2018  BEST PRACTICES FOR K EEPING YOUR HOME \nNETWORK SECURE1 \n  \nDon't be a victim; cyber criminals may leverage your home network to gain access to personal, \nprivate, and confidential information. Help protect yourself and your family by observing some \nbasic guidelines and implementing t he following mitigations on your home network.  \nCOMPUTING AND ENTERT AINMENT DEVICE RECOM MENDATIONS  \nElectronic computing devices including computers, laptops, printers, mobile phones, tablets, security cameras, home \nappliances, cars and other Internet of Th ings devices must all be secured in order to prevent attack. Most home \nentertainmen t and utility devices, such as h ome monitoring systems, baby monitors, Internet of Th ings (IoT), Smart \nDevices, Blu -ray2 players, streaming video players, and video game c onsoles are capable of accessing the Internet, \nrecording audio, and/or capturing video. Implemented security measures can ensure these devices dont become the \nweak link in your home protection.  \n1. Upgrade to a Modern Operating System and Keep it Up -To-Date \nThe most recent version of any operating system (OS) inevitably contains security features not found in previous versions. \nMany of these security features are enabled by default and help prevent common attack vectors. Increase the difficulty for \nan adver sary to gain privileged access by utilizing the latest available and supported OS for desktops, laptops, and other \ndevices. Enable automatic update functionality inside the OS. If automatic updates are not possible, download and install \npatches and updates  from a trusted vendor minimally on a monthly basis.  \n2. Exercise Secure User Habits  \nTo minimize ransomware threat, backup data on external drives and portable media. Disconnect external storage when \nnot in use. Disable or disconnect printer and fax wireles s and phone lines when not in use. Power down access points \novernight or when not in use. Minimize charging mobile with desktop; use the power adapter instead. Turn off desktop, \ninstead of leaving in sleep mode. Disconnect a desktops internet connect when  not in use.  \n3. Leverage Security Software  \nLeverage security software that provides layered defense via anti -virus, anti -phishing, anti -malware, safe browsing, and \nfirewall capabilities. The security suite may be built into the operating system or availabl e as a separate product. Modern \nendpoint detection and response software uses cloud -based reputation service for detecting and preventing execution of \nmalware. To prevent data disclosure in the event that a laptop is lost or stolen, implement full disk enc ryption.  \n4. Safeguard against Eavesd ropping  \nDisconnect digital assistants when not in use. Limit conversation near baby monitors, audio recordable toys, and digital \nassistants. For toys, laptops, and monitoring devices, cover cameras unless in direct use.  Disable wireless for \nentertainment devices unless in use. Disconnect internet access if a device is not commonly used.  \n                                                \n1 The information contained in this document was developed in the course of NSAs cybersecurity mission including its responsib ilities to identify and disseminate information on threats to \nnational security systems and Department of Defense information tech nologies, develop and issue security implementation specifications for cybersecurity -enabled products, and to \nassist Executive departments and agencies with operational security programs.  The information may be shared broadly to reach  all appropriate stak eholders.  \n2 Blu-ray is a trademark of Blu -ray Disc Association  \n\n \n \n \n2 U/OO/205603 -18          PP-18-0695          18 September 2018  \n 5. Protect Passwords  \nEnsure that passwords and challenge responses are properly protected since they provide access to personal \ninformat ion. Passwords should be strong, unique for each account, and difficult to guess. Passwords and answers to \nchallenge questions should not be stored in plain text form on the system or anywhere an adversary might have access. \nUse passphrases and multi -facto r authentication if available. Phrases should include multiple words and be unique per \naccount.  \n6. Limit Use of the Administrator Account  \nThe highly -privileged administrator account has the ability to access and potentially overwrite all files and configurations \non your system. Malware can more effectively compromise your system if executed while you are logged on as an \nadministrator, since it can access more files. Create a non -privileged user account for normal, everyday activities such \nas web b rowsing, email access, and file creation/editing. Only use the privileged account for maintenance, installations, \nand update. Your Internet Service Provider (ISP) may provide a modem/router as part of your service contract. To \nmaximize administrative contr ol over the routing and wireless features of your home network, use a personally -owned \nrouting device that connects to the ISP -provided modem/router. Utilize modern router features to create a separate \nwireless network for guest, employing and promoting ne twork separation.  \n7. Employ Firewall Capabilities  \nEnsure that your personally -owned routing device supports basic firewall capabilities. Verify that it includes Network \nAddress Translation (NAT) to prevent internal systems from being scan ned at the network  boundary. Wireless access \npoint s (WAP) generally do not provide these capabilities so it may be necessary to purchase a router. If your ISP supports \nIPv6, ensure your router supports IPv6 firewall capabilities.  \n8. Implement WPA2 on the Wireless Network  \nTo keep your wireless communication confidential, ensure your personal or ISP -provided WAP is using Wi -Fi Protected \nAccess 2 (WPA2). When configuring WPA2, use a strong passphrase of 20 characters or more. Most computers and \nmobile devices should now support  WPA2. When identifying a suitable replacement, ensure the device is WPA2 -Personal \ncertified. Change the default SSID to something unique. Do not hide the SSID as this adds no additional security to the \nwireless network and may cause compatibility issues.  \n9. Limit Administration to the Internal Network  \nDisable the ability to perform remote administration on the routing device. Only make network configuration changes from \nwithin your internal network. Disable Universal Plug -n-Play (UPnP). These measures help  close holes that may enable an \nattacker to compromise your network.  \nONLINE BEHAVIOR RECO MMENDATIONS  \nSpear Phishing, malicious ads, email attachments, and untrusted applications can present concern for home internet \nusers. In order to avoid revealing sensi tive information, abide by the following guidelines while accessing the Internet.  \n1. Follow Email Best Practices  \nEmail is a potential attack vector for hackers. The following recommendations help reduce exposure to threats:  \n Avoid opening attachments or l inks from unsolicited emails. Exercise cyber hygiene; do not open unknown emails and \ndont click on their attachments or web links. Check the identity of the sender via secondary methods (phone call, in -\nperson) and delete the email if verification fails. F or those emails with embedded links, open a browser and navigate to \nthe web site directly by its well -known web address or search for the site using an Internet search engine.  \n\n \n \n \n3 U/OO/205603 -18          PP-18-0695          18 September 2018  \n  To prevent reuse of any compromised passwords, use a different password for ea ch account. Periodically change your \npassword.  \n Avoid using the out -of-office message feature unless absolutely necessary. Make it harder for unknown parties to learn \nabout your activities or status.  \n Always use secure email protocols, particularly if us ing a wireless network. Configure your email client to use the TLS \noption (Secure IMAP or Secure POP3).  \n Never open emails that make outlandish claims or offers too good to be true.  \n2. Take Precautions on Social Networking Sites  \nSocial networking sites are a convenient means for sharing personal information with family and friends. However, this \nconvenience also brings a level of risk. To protect yourself, do the following:  \n Avoid posting information such as address, phone number, place of employment, a nd other personal information that \ncan be used to target or harass you. Some scam artist make use of this information, along with pets name, first car, \nstreets you lived on, to figure out answers to account security questions.  \n Limit access of your infor mation to friends only and verify any new friend requests outside of social networking.  \n Review the security policies and settings available from your social network provider quarterly or when the sites Terms \nof Use/policy changes, as the defaults can change. Opt -out of exposing personal information to search engines.  \n Refer to email best practices about precautions concerning unsolicited requests and links.  \n3. Authentication Safeguards  \nEnable strong authentication on the router. Protect your login pas swords and take steps to minimize misuse of password \nrecovery options.  \nDisable the feature that allows web sites or programs to remember passwords.  \nMany online sites make use of password recovery or challenge questions. To prevent an attacker from leverag ing \npersonal information to answer challenge questions, consider providing a false answer to a fact -based question, assuming \nthe response is unique and memorable.  \nUse multi -factor authentication whenever possible. Examples of multi -factor authentication in clude secondary confirmation \nphone/email, security questions, and trusted device identification.  \n4. Exercise Caution when Accessing Public Hotspots  \nMany establishments such as coffee shops, hotels, and airports offer wireless hotspots or kiosks for customers to access \nthe Internet. Because the underlying infrastructure of these is unknown and security is often weak, these hotspots are \nsusceptible to a dversarial activity. If you have a need to access the Internet while away from home, avoid direct use of \npublic access. Avoid logging into any personal accounts.  \nIf possible, use the cellular network (that is, mobile Wi -Fi, 3G or 4G services) to connect t o the Internet instead of public \nhotspots. This option generally requires a service plan with a cellular provider.  \n\n \n \n \n4 U/OO/205603 -18          PP-18-0695          18 September 2018  \n If public Wi -Fi must be used, make use of a trusted virtual private network (VPN). This option can protect your connection \nfrom malicious act ivities and monitoring.  \nExercise physical security in the public place. Dont leave devices unattended.  \n5. Do Not Exchange Home and Work Content  \nThe exchange of information between home systems and work systems via email or removable media may put work \nsystems at an increased risk of compromise. Ideally, use organization provided equipment and accounts to conduct work \nwhile away from the office. If using a personal device, such as through a Bring Your Own Device ( BYOD ) program, use \ncorporate mandated securi ty products and guidance for accessing corporate resources and networks. Its preferable to \nattach to a remote desktop or terminal server inside the corporate network rather than make copies of files and transport \nthem between devices. Avoid using personal  accounts and resources for business interactions. Always use a VPN to \nconnect to corporate networks to ensure your data is secured through encryption.  \n6. Use Separate Devices for Different Activities  \nEstablish a level of trust based on a devices securit y features and its usage. Consider segregating tasks by dividing them \nbetween devices dedicated to different purposes. For example, one  device may be for financial/personally identifiable \ninformation (PII)  use and another for games or entertainment for chi ldren.  \n7. Upgrade to a Modern Browser and Keep it Up to Date  \nModern browsers are much better at prompting users when security features are not enabled or used. Modern browsers \nhelp protect the confidentiality of sensitive information in transit over the In ternet. The browser should be kept up to date. \nWhen conducting activities such as account logins and financial transactions, the browsers URL tab will show indication \nthat transit security is in place.  \nADDITIONAL GUIDANCE  \n Cyber Security  \nhttps://www.nsa.go v \n General topics  \nhttps://www.niap -ccevs.org/pp  \n NIST  \nhttp://csrc.nist.gov/publications/PubsSPs.html#800 -124 \nhttps://www.nist.gov/blogs/taking -measure/easy -ways -build -better -p5w0rd  \nCONTACT INFORMATION  \nClient Requirements and Inquiries or General Cybersecurit y Inquiries  \nCYBERSECURITY REQUIREMENTS CENTER (CRC)  \n410-854-4200  \nCybersecurity_Requests@nsa.gov  \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided as is and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not necessarily constitute or imply its endorsement, recommendation, or favoring by the United States \nGovernment. The views  and opinions of authors expressed herein do not necessarily state or reflect those of the United \nStates Government, and shall not be used for advertising or product endorsement purposes.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "best practices for securing your home network - copy",
  "source": "nsa",
  "id": "434fbef7735c3120d9489d87aeb553cec27165a0ab55bde504378b894398f5dd"
}