{
  "markdown": "  \nU/OO/134598 -20 | PP 20 -0713  | November  2020  Ver 1.7 \nNational Security Agency | Cybersecurity Information  \nSelecting and Safely Using Collaboration Services  for Telework  - UPDATE  \nSummary  \nDuring a global pandemic or other crisis contingency scenarios, many United States Government (USG) personnel must \noperate from home while continuing to perform critical national functions and support continuity of government services. \nWith limited access to government furnished equipment (GFE) such as laptops and secure smartphones, the use of (not \ntypically approved) commercial collaboration services on personal devices for limited government official use becomes \nnecessary and unavoidable.  \nWe define collaboration services as those capabilities that allow the workforce to communicate via internet -enabled  text, \nvoice, and video, and can include the sharing of files and other mission content . Collaboration can occur between two \npeople or widened to include a large group to support mission needs.  \nThis document provides a snapshot of best practices and criter ia based on capabilities available at the time  of publication \nand was coordinated with the Department of Homeland Security ( DHS ), which has released  similar guidance : \nCybersecurity Recommendations for Federal Agencies Using Video Confere ncing  [1] and Gu idance for Securing Video \nConferencing [2] . This NSA publication  is designed to provide simple  and actionable considerations for individual \ngovernment users. The intent of this document is not meant to be exhaustive or based on formal testing, but rather be \nresponsive to a growing demand amongst the federal government to allow its workforce to operate remotely using  \npersonal devices when deemed to be in the best interests of the health and welfare of its workforce and the nation.  \nRecommendations in this document are likely to change as collaboration services evolve and also address known \nvulnerabilities and threats.  Users should be aware that even the most secure collaboration service  cannot defend against \na compromised user device . \nScope  \nThis document pr ovides security assessment guidance about commercially available collaboration services. It does not \ncover USG  services designed specifically for secure communications, such as Defense C ollaboration Services , Intelink \nServices, and othe rs. NSA strongly rec ommends us e of these dedicated government services, when po ssible, before  any \nof the commercial services  detailed below . \nAssessment of individual services for this document focused on those that support multiple operating systems and \nplatforms (e.g. both m obile and desktop).  \nAudience  \nThe primary audience for this guidance is U.S. Government employees and military s ervice members engaging in \ntelework, especially telework employing personally owned devices such as sm artphones and home computers . \nTeleworkers m ay not be able to access collaboration services on their respective government enterprise networks, and \ntherefore turn to commercial services for collab oration on vital mission work. These services vary widely in the \ncybersecurity functionality and assuran ce that they offer. By using the objective criteria detailed below, government \nemployees and organizations can make more informed decisions about which collaboration services meet their particular \nneeds. By following the practical guidelines, users can dra w down their risk exposure and become harder targets for  \nmalicious threat actors . \nNote that individual departments and agencies may provide specific services or issue specific direction for their \nteleworkers. This document does not  override or supersede an y official guidance provided by your organization. Consult \nyour department or agency IT support or CIO organization for further guidance . \n \n\n \n \nU/OO/134598 -20 | PP 20 -0713  | November 2020  Ver. 1.7 2 \nNSA | Selecting and Safely Using Collaboration Services for Telework  - UPDATE  \nCriteria to Consider When Selecting a Collaboration Service  \nThe criteria below identif ies risks and features to consider when choosing collaboration services to support your mission. \nAll criteria should be strongly considered but may not be fully supported based on your own operating environment and \nconstraints.  The criteria is intended to  align with related USG guidance to include NIST SP 800 -171r2  Protecting \nControlled Unc lassified Information in Nonf ederal Systems and Organizations  (Feb 2020) [3] and NIST SP 800 -46r2 \nGuide to Enterprise Telework, Remote Access , and BYOD Security  (Apr 2016)  [4].  \n1. Does the service implement end -to-end encryption?  \nEnd-to-end encryption (E2EE) means that content (text, voice, video, data, etc.) is encrypted  all the way from sender to \nrecipient(s) without being intelligible  to servers or other services along the way. Some apps further support encryption \nwhile data is at rest, both on endpoints (e.g. your mobile device or workstation) and while residing on remote storage (e.g. \nservers, cloud storage). Only the originator of t he message and the intended recipients should be able to see the \nunencrypted content. Strong end -to-end encryption is dependent on keys being distributed carefully. Some use cases \nmay not be able to use end-to-end encryption due to performance reasons , cap ability limitations , or compliance \nrequirements.  \n2. Are strong, well -known, testable encryption standards used?  \nEven in the absence of end -to-end encryption, NSA recommends the use of strong encryption standards, preferably \nNIST -approved algorithms and current IETF secure protocol  standards . Many collaboration services protect data -in-transit \nbetween client s and server s via the  Transport Layer Security (TLS) version 1.2  (or later ) secure protocol , which is \ncommonly used for sensitive but unclassified inf ormation . Use of published protocol standards, such as TLS and DTLS -\nSRTP, is preferred . If the product vendor has created its own encryption scheme or protocol, it should undergo an \nindependent evaluation by an accredited lab. This include s not just crypto graphic protocols, but also key generation.  \n3. Is multi -factor authentication (MFA) used to validate users identities?  \nWithout MFA, weak or stolen passwords can be used to access legitimate users accounts and possibly impersonate them \nduring use of the c ollaboration service . Multi -factor authentication requires that a second form of identification (code, \ntoken, out -of-band challenge, etc .) be provided to allow access to an existing account.  \n4. Can users see and control who con nects to collaboration sessio ns? \nThe collaboration  service should allow organizers  to limit access to collaborat ion sessions to only those who are invited.  \nThis can be implemented through such features as session login passwords or waiting rooms, but preferably would \nsupport reasonably strong authentication . Users should also be able to see when participants join through \nunencrypted/unauthenticated  means such as telephone calls.  \n5. Does the service privacy policy allow the vendor to share data with third parties or \naffiliates?  \nWhile collaboration services must often collect certain basic information needed to operate, they should protect sensitive \ndata such as  contact details and content . Collaboration information  and conversations should not be shared with third \nparties. This could include metadata associated with user identities, device information, collaboration session history, or \nvarious other information that may put your organization at risk. Information sharing should be spelled out clearly in the \nprivacy policy.  \n6. Do u sers have the ability to securely delete data from the service and its repositories as \nneeded?  \nWhile no services are likely to support full secure overwrite/deletion capabilities, users should be given the opportunity to  \ndelete content (e.g. shared files, chat sessions, saved video sessions) and permanently remove a ccounts that are no \nlonger used . \n\n \n \nU/OO/134598 -20 | PP 20 -0713  | November 2020  Ver. 1.7 3 \nNSA | Selecting and Safely Using Collaboration Services for Telework  - UPDATE  \n7. Has the collaboration services source code been shared publicly ( e.g. open source)?  \nOpen source development can provide accountability that code is written to  secure programming best practices and is  \nunlikely to introduce vulnerabilities or weaknesses that could put users and data at risk . \n8. Has the service and/or app been reviewed or certified for use by a security -focused \nnationally recognized or government body?  \nNSA recommends that cloud services (which collaboration apps rely on) be evaluated under  the Office of Management \nand Budget  (OMB ) FEDRAMP program. NSA also recommends that collaboration apps be evaluated by independent \ntesting labs under the Nationa l Information Assurance Partnership (NIAP) against the Application  Software  Protection \nProfile (PP) [5]. NSA has worked with the DHS S&T Mobile Security R&D Program to develop semi -automatable test ing \ncriteria for app vetting based on the application PP.  These criteria include tests of how apps interact with platform \nresources, how they defend themselves from exploitation, the crypto libraries they use, what permissions they request, \nand many others.  \n9. Is the service developed and/or hosted under the juris diction of a government wit h laws that \ncould jeopardize US G official use ? \nSince it is well documented that some countries require that communications be provided to law enforcement and \nintelligence services , it may not be wise for certain USG missions to b e performed on services hosted or developed under \ncertain foreign legal jurisdictions.  Users should be aware that the country of origin where products were developed is not \nalways public knowledge. This criteri on was not assessed in the table on page 5 .  \n \nUsing Collaboration Services Securely  \nIf possible, use government furnished e quipment (GFE) that is managed and intended for \ngovernment use only  and secure services designed for government use . \nNo collaboration service can defend against a compromised devi ce. Personal devices are often exposed to considerable \nrisk of compromise due to failure to ap ply patches in a timely fashion  and the installation of applications that users fail to \nrecognize as being malicious (spyware). Resulting malware infections can a ccess files, keystrokes, contacts, call \nhistories, GPS locations, room audio or camera video (even when not on a call), and most any other information the \ndevice observes. Even the most secure collaboration service provides no protection against a compromi sed device .  \nCarefully  managed GFE devices are often more secure than personal devices unless configuration control policies delay \nthe deployment of critical patches. If GFE is a vailable, it should be used. If GFE cannot be used, NSA recommends using \na tem porary secure operating system such as  the Air Forces Trusted End Node Security (TENS) solution to create a \nvirtual GFE . If neither is practical, users should ensure all user accounts do not have administrator rights (which are only \nfor managing the sys tem), and if possible c reate a separate user account with low privileges for only work use . Consider \nusing NSA's Best Practices for Keeping Your Home Network Secure\" guide to protect your personal devices  [6]. \nIf you download a collaboration  service  app, be sure you know where it came from . \nBeware of potentially unwanted programs posing as legitimate collaboration apps. Many  collaboration services require \nusers to install specialized client software on their systems. If possible, install the correct client directly using the official \napp store. This helps ensure it is signed and legitimate. If you must download a client from a website, ensure it is from the  \nproperly signed secure (e.g. HTTPS)  official  website. Do not run or install clients from unexpe cted downloads, especially \nfrom links in email or other messaging that may have come from malicious senders.  Some services allow users to avoid \ninstalling custom apps by using a web interface.   \nEnsure that encryption is enabled when initiating a collaborat ion session.  \nMost collaboration apps do not have specific settings to enable or disable encryption, but where they do, NSA \n\n \n \nU/OO/134598 -20 | PP 20 -0713  | November 2020  Ver. 1.7 4 \nNSA | Selecting and Safely Using Collaboration Services for Telework  - UPDATE  \nrecommends enabling  encryption . When using b rowser -based services, users should validate that HTTPS is enabled and \ncheck the website certificate to ensure it was issued b y a trusted certificate authority.  \nUse the most secure means possible for meeting invitations . \nSend meeting invites through other encrypted and authenticated collaboration services if possible. Do not post meeting \ninvites in publ icly accessible forums or sites . If invitations must be sent in the clear, organizers should send passwords or \nPINs by a separate method (e.g. email and SMS or email and phone call).   \nVerify  that only intended invitees are participating before be ginning , and throughout,  each \nsession.  \nEnsure that someone is in charge of verifying participants and c heck ing if unknown participants have entered. If \nparticipants are not authenticated by the service, at least ensure that their vo ice or appearance is rec ognized.  Use \nmeeting waiting rooms if possible to allow access to be controlled.   \nEnsure that any information  shared is appropriate for the participants.  \nPlan beforehand the topics to be covered and consider the implications if the conversation or material s are compromised \nso that you understand the risks.  Be aware of screen -sharing features so that you  only share your screen to display \ncontent salient to the collaboration session . If content is sensitive, ensure that it is appropriate to share with all \nparticipants.  Be mindful of the affiliations of those with whom you connect.  \nEnsure that your physical environment does not provide unintentional access to voice, video, \nor data during collaboration sessions.  \nBe aware of y our surroundings including any oth er communications going on (e.g. family members on phone calls or \nvideo chats, location hints if working from a sensitive location) . Disable unnecessary app permissions (e.g. location \nservices). Ensure there is no other software on your device that is acti vely sharing microphone data back to a remote \nserver.  Note that less-trusted devices , to include Internet of Things (IoT),  often hav e microphones or cameras , so it may \nbe wise to leave personal cell phones or computers in a different room if they are not b eing used for work.     \n  \n\n \n \nU/OO/134598 -20 | PP 20 -0713  | November 2020  Ver. 1.7 5 \nNSA | Selecting and Safely Using Collaboration Services for Telework  - UPDATE  \nTable of Assessments against Criteria  \nService  1  End-to-End Encryption5 \n2  Testable \nEncryption  \n3  MFA  \n4  Invitation \nControls  \n5  Minimal 3rd \nParty Sharing  \n6  Secure Deletion  \n7  Public Source \nCode Shared  \n8  Certified \nService (FedRAMP \n/ NIAP)  Text Chat  \nVoice  \nCalls  \nVideo  \nCalls  \nFile \nSharing  \nScreen  \nSharing  \nAdobe \nConnect i N N N N N Y Y Y Y Client  Y \nServer  Y N FedRAMP  \nAmazon \nChime ii N N N N N Y Y Y N Client  Y \nServer  Y N FedRAMP  \nCisco Webexiii Y1 Y1 Y1 Y1 Y1 Y Y1, 2 Y1 Y Client  Y \nServer  N3 N FedRAMP  \nDust Y N/A N/A N/A N/A N3 N Y N Client  Y \nServer  Y N None  \nGoogle  \nWorkspace iv N N N N N Y Y1 Y1, 4 Y Client  Y \nServer  Y2 N FedRAMP  \nGoToMeetingv Y1 Y1 Y1 N/A N/A Y N Y1 Y Client  Y \nServer  N3 N None  \nJitsi Meetvi Y1 Y1 Y1 Y1 Y1 Y N Y N Client   N3 \nServer   N3 Y None  \nMattermost vii N N N N/A N Y Y2 Y4 N Client  Y \nServer  N Y None  \nMicrosoft \nTeamsviii N N N N N Y Y Y Y Client  Y1 \nServer  Y1 N FedRAMP  \nSignalix Y Y N/A Y N/A Y Y Y Y Client  Y \nServer  Y Y None  \nSkype for \nBusiness x N N N N N Y Y Y Y Client  Y1 \nServer  Y1 N FedRAMP  \nSlackxi N N N N N Y Y Y Y1 Client  Y1 \nServer  Y1 N FedRAMP  \nSMS Text  N N/A N/A N N/A N N N N Client  Y \nServer  N N None  \nWhatsAppxii Y N/A Y Y N/A Y Y Y Y Client  Y \nServer  Y N None  \nWickrxiii Y Y Y Y Y Y Y Y Y Client  Y \nServer  Y Y None  \nWire Y Y Y Y Y Y Y Y Y Client  Y \nServer  Y Y None  \nZoomxiv Y1 N N Y1 N Y Y1 Y Y Client  Y \nServer  N3 N FedRAMP  \n                                            \nLegend: Y = Yes, N = No; N/A = Not Applicable  \n1 Configurable  \n2 Free Version - N \n3 No Published Details  \n4 Partial  \n5 End-to-end Encryption (E2EE ) may be limited by app, browser, number of participants , or capabilities of other clients. Even without E2EE, all services (other than SMS) utilize link \nencryption between clients and servers whenever possible.  \n\n \n \nU/OO/134598 -20 | PP 20 -0713  | November 2020  Ver. 1.7 6 \nNSA | Selecting and Safely Using Collaboration Services for Telework  - UPDATE  \nAssessment of Common Collaboration Services Against the Criteria  \nThe above table presents an initial assessment of how available commercial collaboration services satisfy our security \ncriteria. The selection of services for this initial assessment was driven by inquiries and usage from across NSA's national \nsecurity cus tomer base; this is not a comprehensive list of services or possible criteria.  \nNSA analysts gathered factual material from published company literature and product specifications, supplemented by \nother openly published analyses and basic hands -on technica l observation. No formal testing was performed on products \nor services for this analysis. These assessment findings are meant to serve as an input for government employees and \norganizations. Users of these services must exercise judgment when choosing a se rvice for their particular mission \ntelework needs.  \nWorks Cited  \n[1]  CISA (2020), Cybersecurity Recommendations for Federal Agencies Using Video Conferencing . [Online] Available at: \nhttps://www.cisa.gov/publication/cybersecurity -recommendations -federal -agencies -using -video -conferencing  [Accessed May 18, 2020]  \n[2]  CISA (20 20), Guidance for Securing Video Conferencing . [Online] Available at: https://www.cisa.gov/publication/guidance -securing -video -\nconferencing  [Accessed May 18, 2020]  \n[3]  NIST ( 2020), SP 800 -171r2 Protecting Controlled Unclassified Information in Nonfederal Systems and Organizations . [Online] Available at: \nhttps://csrc.nist.gov/publications/detail/sp /800-171/rev -2/final  [Accessed May 18, 2020]  \n[4]  NIST (2016), SP 800 -46r2 Guide to Enterprise Telework, Remote Access, and Bring Your Own Device (BYOD) Security . [Online] Available at: \nhttps://csrc.nist.gov/publications/detail/sp/800 -46/rev -2/final  [Accessed May 18, 2020]  \n[5]  NIAP (2019) U.S. Government Approved Protection Profile - Protection Profile for Application Software . [Online] Available at: https://www.niap -\nccevs.org/Profile/Info.cfm?PPID=429&id=429   [Accessed Apr. 20,2020]  \n[6]  NSA (2018) Best Practices for keeping Your Home Network Secure . [Online] Available at: https://www.nsa.gov/Portals/70/documents/what -\nwe-do/cybersecurity/professional -resources/csi -best-practices -for-keeping -home -network -secure.pdf  [Accessed Apr. 20, 2020]  \nDisclaimers  \nNote that this does not constitute a Qualified Products List, within the meaning of the definition of Federal Acquisition Reg ulation (FAR) 2.101 or a \nQualified Manufacturers  List under FAR subpart 9.2 Qualification Requirements . The government has not undertaken any testing or evaluation of the \nproducts listed under this analysis , but has only reviewed the published attributes of the products . The list is not all -inclusive . This list may be amended \nand supplemented from time to time as market research discloses other items or new products become available . The descriptions and procedures \nexplained in this document do not constitute or imply an endorsement by NSA/CSS , DoD, or USG  of the products in question . It is intended solely for the \nnon-commercial use of USG personnel for purpose of explaining and giving operating instructions for the use of the particular product in question . Any \nfurther use for other purposes is prohibit ed. \n \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does  not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa. gov  \n \ni Adobe Connect is a trademark of Adobe Systems, Inc.  \nii Amazon Chime is a trademark of amazon.com, Inc.  \niii Cisco Webex is a registered trademark of Cisco Systems, Inc.  \niv Google Workspace  is a trademark of Google, LLC  \nv GoToMeeting is a registered trademark of LogMein, Inc.  \nvi Jitsi Meet is a  registered trademark of BlueJimp, SARL  \nvii Mattermost is a trademark of Mattermost, Inc.  \nviii Microsoft Teams is a registered trademark of Microsoft Corporation  \nix Signal is a registered trademark of Signal Technology Foundation  \nx Skype for Business is a tradem ark of Microsoft Corporation  \nxi Slack is a registered trademark of Slack Technologies, Inc.  \nxii WhatsApp is a registered trademark of WhatsApp, Inc.  \nxiii Wickr is a registered trademark of Wickr, Inc.  \nxiv Zoom is a registered trademark of Zoom Video Communications , Inc.                                             \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "collaboration_services_uoo13459820_full",
  "source": "nsa",
  "id": "f7022cebb4090904ea5d8d83dab5f69237e47a903caadad680f2177b624609a1"
}