{
  "markdown": "  \nU/OO/169571 -20 | PP-20-0849  | Sept 2020 ver.  1.0 \nNational Security Agency | Cybersecurity Information  \nCompromised Personal Network Indicators and Mitigations  \nMore and more government workers are  teleworking,  using Government Furnished Equipment (GFE) for official work and \nconnecting them through personal network s. Cybersecurity is a crucial priority for these users to ensure their data and \nnetworks remain secure and uncompromised. This includes being able to identify indicators of a network compromise and \npursue potential mitigations.  This knowledge aids users in safeguarding their personal networks and data.   \nPersonal networks are those used in homes for personal use or telework, such as a home network provided by a  \nresidential  Internet Service Provider  (ISP) . These networks usually c onsist of a router or wireless access points \nconnecting devices to the Internet. They may have computers, mobile devices, gaming systems, or a variety of Internet of \nThings (IoT) devices connected to them.  When setting up these personal networks, implement ing proper security from the \nbeginning is crucial.1 While there  is no way to ensure that personal  networks  will be completely secured from attack s\nattackers are persistent and continue to find ways to circumvent security controls users can still take steps  to help \nprevent future attacks  [1].  \nThis document  provide s guidance to users  who have received authorization to connect GFE to personal networks.  It \ndescribes potential indicators of compromise and mitigation practices that can be used to minimize damage  if the network \nis believed to be compromised. If indicators of compromise, as outlined in this document, are observed, then follow the \nguidance to mitigate  the compromise . Users can apply this guidance to any computers, mobile devices, or IoT devices \nthat they connect to personal network s. The best practices included here are not meant to fully mitigate a compromised \nnetwork on a large business or corporate scale . \nIn the event of a suspected compromise, some  users of personal  networks  may prefer to seek ex pert support  in lieu of \nattempting to mitigate the issue themselves . Forensic expert support typically involves analyzing volatile data in \ncompromised devices. The guidance here includes steps that involve rebooting devices, as well as other steps that cou ld \ncorrupt or destroy volatile data  that is crucial to a forensic investigation . Users who seek expert support should \ndisregard the remainder of this paper and take guidance from the expert.  \nIndicators of a personal network c ompromise  \nDue to the increasing  amount of devices connected to personal networks, indicators of compromise may come in a variety \nof forms. While recommendations may change as technology evolves, and vulnerabilities and threats continue to develop, \nusers should always be aware of the bas ic indicators of a compromised network so proper steps can be taken to mitigate \nor eliminate the threat. The following table lists common indicators that a network may be compromised. The table is not \ncomprehensive, and only lists some of the most obvious signs of compromise. It should also be noted that many of these \nindicators can also be caused by non -malicious issues.  \nTable I: Indicators That Personal Networks Could be Compromised  \nType of \nCompromis e Indicators of \nCompromise  Description of Suspicious Activity  \nCompromised \nRouter  Router  Password \nChanges  Existing r outer login credentials that were not changed by the user become ineffective \nand/or foreign  devices are  found on the personal network.  \nModified Connectivity  Router/wireless status shows a different router/SSID connected.  \nCompromised \nRouter or \nMalware  Browser Redirects  User intends to access a certain site an d has been redirected to a different,  \nunintended site.  Redirection of banking sites in particular can lead to massive financial \ntheft.  This can be done by malware on the device or on the network . \n                                            \n1 Please refer to Best Practices for Keeping Your Home Network Secure  for prevent ative measures that can help all users improve the  chances of avoiding network or device \ncompromise.  \n\n \n \nU/OO/169571 -20 | PP-20-0849  | Sept 2020 ver.  1.0 2 \nNSA | Compromised Personal Network Indicators and Mitigations  \nType of \nCompromis e Indicators of \nCompromise  Description of Suspicious Activity  \nMalware (e.g. \nSpyware, \nAdware, \nRootkits)  Devices Functioning \nWithout User Input  Computer cursors begin to move on their own, web cameras and microphones \nactivate without being enabled by the user, or a device turns on by itself.  \nFalse Anti -Virus / Anti -\nMalware Alerts  Misleading notifications resembling reputable security programs appear on device \nscreens.  These often look different from the usual alerts and may appear within web \npages ( in places where it seems like they do not  belong).  \nUnexpected Hardware \nDisplays  Camera light/LED is on  unexpectedly . \nInactivity Faults  Off computer is hot/warm after extended periods of time being turned off . Mobile \ndevices in particular should not normally run hot when not in use.  \nTampered  Logs  The website history and/or cache is reset (unrelated to users manual reset or \nscheduled r eset).  \nMalfunctioning Anti -virus \nor Anti -malware  Anti-virus/a nti-malware task manager or registry will not start up, is put in a reduced \nstate, or completely disabled , but not by the user.  \nTaxed Memory  The Task Manager shows applications or services with uncharacteristic heavy memory \nusage.  \nModified Parameters  The clock time is reset or appears different from the current time.  \nOperation Instability  Periodic device crashes. Devices reboot on their own or during times disassociated \nfrom updates.  \nUsage Strain  Portable network devices (e.g ., laptop , mobile device ) hold power for drastically \nshorter periods of time.  This can also be caused by normal battery wear and poor \ncharging practices.  \nPhishing Emails2 Emails or messages sent to the user claiming to have the persons  username, \npassword, or have installed a rootkit or key logger on the device.  This can also be an \nattempt to compromise the user.  \nChanged Software \nDisplays  New or different application icons on the screen.  This can also be caused by legitimate \nsoftware updates.  \nUnexpected \nAdvertisements  Advertisements appear  randomly on device screens without a browser being opened.  \nRansomware  Ransomware Messages  Messages appear or completely lock the  device and may restrict access to content \nuntil the victim pays a specified fee.  \nUnexpected File \nEncryption  Files or folders randomly become encrypted and the user is unable to open  them . \nCompromised \nAccount  Sharing Exposure  Collaborative or teleconference applications show previous connections different from \nthose initiated by the user.  \n                                            \n2 Phishing emails could also be social engineering attempts to gain access to a device or network.  \n\n \n \nU/OO/169571 -20 | PP-20-0849  | Sept 2020 ver.  1.0 3 \nNSA | Compromised Personal Network Indicators and Mitigations  \nType of \nCompromis e Indicators of \nCompromise  Description of Suspicious Activity  \nUnexpected Login \nNotifications  Many services provide notifications (e.g. by email or text) when new devices connect \nto an account on the service. Sometimes they will give the option to block the new \ndevice. Pay attention to these notifications and act on them.  \nUnintentional Sent \nMessages3 Family, friends, or co -workers receive messages or invitations supposedly from the \nuser but not sent by the user.  \nUnusual Displays  Please update or change password prompts appear (which may look different from \nnormal prompt).  \nWhat  to do if you suspect a personal network is c ompromised  \nIf these indicators lead a user to suspect their personal network is compromised , steps can be taken to mitigate  the \ndamage or eliminate  the network threat altogether . This section recommends general steps  for responding to suspicious \nactivity  as well as more aggressive actions that can be taken depending on the severity  of the compromise.  \nResponding to generally suspicious activity  \nThe following are recommended actions in no particular order for users to take in response to some common \nindicators. It is advised that users should seek expert support  if they do not have th e required skillset  to perform the \nactions . \nCompromised Router  \n Reboot the d evice.  \n Disable local/remote administration.  \n Reset the device to factory settings.  \n Update the software/f irmware.  \n Change passwords on all accounts.  \n Enable multi -factor a uthentication if applicable.  \nMalware (e.g. Spyware, Adware, Rootkits)  \n Disconnect suspected compromised devices fr om the network.  \n Sign into accounts on a separate, trusted device an d change all passwords that were used on the compromised \ndevice . \n Sign into accounts on a separate, trusted device and s ign all unknown or untrusted devices out of online services.  \n Run an anti -virus/redirection scan on the device.  \n Remove the malware.  \n Restore the device to a previously backed up good state.  \n Run automatic updates for the operating system and software.  \nRansomware  \n Do NOT  pay the ransom.  \n Disconnect suspected compromised devices from the network.  \n Run an anti -virus/redirection scan on the device.  \n Remove the malware  if possible . \n Certain ransomware variants have recovery programs  or keys available (only use from reputable sources).  \n Reset the device to factory settings.  \n Restore the device to a previously backed up good state.  \n Run automatic updates for the operating system and software . \n Using the services online portal, s ign all un trusted devices out of services such as  social media accounts.  \n                                            \n3 In the case of unintentional sent messages, users should check to see if the message ca me from their actual account or if a duplicate account was created.  \n\n \n \nU/OO/169571 -20 | PP-20-0849  | Sept 2020 ver.  1.0 4 \nNSA | Compromised Personal Network Indicators and Mitigations  \n Change all passwords that were used on the compromised device.  \nCompromised Account  \n Change passwords on all accounts.  \n Enable multi -factor a uthentication if applicable.  \n Remove social media accoun ts and applications.  \n Reset the device to factory settings.  \n If contact list may have been stolen, warn contacts to avoid clicking links that appear to come from the \ncompromised account.  \nAggressive eradication of threats on a compromised personal network  \nThe actions recommended in this sect ion are more aggressive: they attempt to eliminate the threat on a device or \npersonal network. If necessary, these steps may  be taken if a user has the required knowledge/skillset, as some actions \nmay result in the loss of data or connectivity. I t is advised that  users should seek expert support  if desired . \nDisconnect all devices  from the network  and reset network devices  \nThis should include all computers, mobile devices, routers, access points, and IoT devices  connected to the network . \nOnce disconnected, perform a factory reset on all of the  network devices to include ISP -supplied devices. If desired, users \ncan acquire personal routers or access points that can be connected to the ISP equipment, as ISP provided  equipment \nmay have potentially compromised administrative credentials.  By using personal routers or access points, users can add \nan additional layer of security to the personal network.   \nPerform a factory r eset on previously connected devices  \nFactory rese t all mobile devices, desktops, and laptops. When restoring the devices, only use the original operating \nsystem media for desktops and laptops  and update them as soon as possible . For mobile devices, perform a full reset to \ninclude backup/restore of data.  \nImmediately change passwords  and require a new sign in from all linked devices  \nThis should  include all bank, email, social media, wireless access, and administrator router console passwords.  This \nmitigation is crucial as attackers may have acquired user cr edentials  during the compromise. If this  is the case, the \nattackers will  still have access to the accounts unless the credentials are changed.  \nSafeguard personal networks and data  \nBy following the mitigations outlined within this document, users should be able to eradicate and/or minimize the damage \ncaused by a compromised personal network. If suspicious activity continues after performing mitigation steps, users \nshould seek expert advice to a ssist in further resolving the compromise or other issue . \nWorks C ited \n[1] Best Practices for Keeping Your Home Network Secure . NSA, 2018.  [Online] Available at: https://media.defense.gov/2019/Jul/16/2002158056/ -1/-1/0/CSI -BEST -\nPRACTICES -FOR -KEEPING -HOME -NETWORK -SECURE.PDF  \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  Reference herein to any specific commercial \nproducts, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsem ent, recommendation, or favoring by the United \nStates Government, and this guidance sh all not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify and di sseminate threats to National Security Systems, \nDepartment  of Defense, and Defense Industrial Base information systems and to develop and issue cybersecurity specifications and mitigat ions.  This information may be \nshared broadly to reach all appropriate stakeholders.   \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "compromised_personal_network_indicators_and_mitigations_20200914_final",
  "source": "nsa",
  "id": "bcb0ddaf075b3d47e8d07ec16ddf501505df7c414f8a0658a6189dc6544fea56"
}