{
  "markdown": " \n \n   U/OO/205255 -19                       PP-19-1429          28 October 2019  1 PATCH CRITICAL VULNE RABILITY IN ATLASSIA N \nCONFLUENCE  \nDISCUSSION  \nOn March 20, 2019, Atlassian published an advisory about a critical vulnerability (CVE -2019 -3396) in its Confluence1  \nServer or Confluence Data Center software that could allow adversaries to execute code remotely on systems running the \nvulnerable application. Along with the advisory, Atlassian released a software patch to fix the vulnerability2. \nSpecifically, there is a  server -side template injection vulnerability in the Widget Connector, a macro used by Confluence. \nAdversaries can exploit this vulnerability in the affected application , without credentials,  to gain remote code execution on \nthe system running Confluence.  \nBoth Nation State Advanced Persistent Threat (APT)3 and criminal actors have exploited this vulnerability with goals \nranging from delivering ransomware4 to gaini ng control of exploited systems5. Any unpatched servers operate at \nsignificant risk and it is strongly recommended that they be patched promptly.  \nMITIGATION ACTIONS  \nUpdate Confluence immediately by installing the patch for CVE -2019 -3396. Using an older or unpatched version of \nConfluence makes your system vulnerable to exploitation. Confluence Serve r and Confluence Data Center versions \n6.15.1, 6.14.2, 6.13.3, 6.12.3, and 6.6.12 (and any newer versions) are patched and not vulnerable. You can download \nthe newest versions here:  \n https://www.atlassian.com/software/confluence/download  (latest build)  \n https://www.atlassian.com/software/confluence/download -archives  (patches for older builds)  \n https://confluence.atlassian.com/doc/upgrading -confluence -4578.html  (guidance on upgrading)  \nFor a temporary mitigation of this vulnerability, administrators can disable the Widg et Connector and WebDav plugin2. \nAlthough this can temporarily reduce functionality, this mitigation will prevent exploitati on while updates are prepared. In \ngeneral, procedures should be in place to patch and update systems and software in a timely manner  when vulnerabilities \nsuch as this one are announced.  \n  \n                                                \n1 Confluence is a registered trademark of Atlassian  \n2 https://confluence.atlassian.com/doc/confluence -security -advisory -2019 -03-20-966660264.html  \n3 https://fireeye.com/blog/threat -research/2019/08/game -over-detecting -and-stopping -an-apt41 -operation.html  \n4 https://blog.alertlogic.com/active -exploitation -of-confluence -vulnerability -cve-2019 -3396 -dropping -gandcrab -ransomware/  \n5 https://www.tenable.com/blog/cve -2019 -3396 -vulnerability -in-atlassian -confluence -widget -connector -exploited -in-the-wild \n\n \n U/OO/205255 -19 PP-19-1429          28 October 2019  \n2 DISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial product, process, or service by trade name, trademar k, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or endorsement purposes.  \nNOTICE  \nThe information contained in this document was developed in the course of NSAs cybersecurity missions including its \nresponsibilities to identify and disseminate threats to national security systems and Department of Defense information \ntechnologies, develop and issue security implementati on specifications for cybersecurity -enabled products, and to assist \nExecutive departments and agencies with operational security programs. The information may be shared broadly to reach \nall appropriate stakeholders.  \nCONTACT  \nFor general cybersecurity inquir ies and reporting, contact the NSA Cybersecurity Requirements Center ,  \n410-854-4200, Cybersecurity_Requests@nsa.gov  . \nFor media inquiries, contact Press Desk: 443 -634-0721   Email: MediaRelations@nsa.gov  \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "confluence advisory-oct25.final_20191028 - nsagov",
  "source": "nsa",
  "id": "7bdf10718dab345f43d9cb7f85bcd52946b8e29afd178626242590af37b8fa2b"
}