{
  "markdown": "  \nU/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2 \nNational Security Agency | Cybersecurity Information  \nConfiguring  IPsec Virtual Private Networks  \nThe recent NSA publication Securing IPsec Virtual Private Networks  [1] lays out the importance of IP Security (IPsec) \nVirtual Private  Networks (VPNs) and outlines specific recommendations for securing those connections. I t is critical that \nVPNs use strong cryptography. This guidance goes deeper, providing  device administrator s with specific instructions.1  \nMaintaining a secure VPN tunne l can be complex and requires regular maintenance. To maintain a secure VPN, network \nadministrators should perform the following tasks on a regular basis:  \n Reduce the VPN gateway attack surface  \n Verify that cryptographic  algorithms are  Committee on National Security Systems Policy (CNSSP) 15 -compliant  \n Avoid using  default VPN settings  \n Remove unused or non -compliant cryptography  suites  \n Apply vendor -provided updates (i.e. patches) for VPN gateways and clients  \nReduce the VPN gateway attack su rface  \nVPN gateways t end to be directly accessible from the Internet and are prone to network scanning, brute force attacks, and \nzero day vulnerabilities. To mitigate many of these vulnerabilities, network administrators should implement strict traffic \nfiltering rules : \n Limitin g access to UDP port 500, UDP port 4500, and ESP.  \n When possible, limit accepted traffic to known VPN peer IP addresses. Remote access VPNs present the issue of \nthe remote peer IP address being unknown and therefore it cannot be added to a static filtering rule.  \n If traffic cannot be filtered to a specific IP address, NSA recommends  an Intrusion Prevent System (IPS) in front of \nthe VPN gateway to monitor for malformed IPsec traffic and inspect IPsec session negotiations. Examples of \nrecommended ACLs and IPS signatures for anomalous ISAKMP/IKE traffic can be found in Appendi ces A and D.  \nVerify only CNSSP 15 -compliant algorithms  are in use \nAll IPsec VPN configurations require at least two items: (1) the Internet Security Association and Key Management \nProtocol ( ISAKMP ) or Internet Key Exchange ( IKE) policy ; and (2) the IPsec p olicy. These policies determine  how an \nIPsec tunnel will negotiate phase 1 and phase 2 respectively when establishing the tunnel. If the cryptography on either of \nthese phases is configured to allow weak cryptography , the entire VPN may be at risk , and dat a confidentiality will be lost.  \nWhen configuring ISAKMP/IKE, many vendors support having sever al possible ISAKMP/IKE policies. The device is then \ntrusted to choose the strongest matching policy between the remote and local ends of the VPN. Some vendors do this \nthrough priority numbers and other s through explicit selection. NSA recommends only configuring policies that strictly use  \nCNSSP 15 -compliant  algorithms, and removing all others . Also, if priority numbers are used, the strongest ISAKMP/IKE \npolicy sho uld be  the highest priority (for many  vendors a priority of  1 is the highest priority). Each ISAKMP/IKE policy \ninclude s at least three key components. These components are the Diffie -Hellman algorithm/group, encryption algorithm, \nand hashing algorithm.  \nThe following i s an example of a recommended ISAKMP/IKE setting  per CNSSP 15 as of June 2020[2]:  \n Diffie -Hellman Group: 16  \n Encryption: AES -256  \n Hash: SHA -384  \n                                            \n1 For proprietary application layer VPN best practices, refer to NSAs Cybersecurity Advisory Mitigating Recent VPN Vulnerabil ities. \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  2 \nNSA | Configuring IPsec Virtual Private Networks  \nMany vendors also support configuring multiple IPsec policies; however, these policies are norma lly explicitly configured \nfor a specific VPN. NSA recommends utilizing the strongest FIPS -validated cryptography  suites supported by the device. \nSimilar to ISAKMP/IKE, the IPsec policy contains three key components : (1) the encryption algorithm ; (2) hashing \nalgorithm ; and (3)  the block cipher mode. The following  is an example of a recommended IPsec setting  per CNSSP 15 as \nof June 2020[2]:  \n Encryption: AES -256  \n Hash: SHA -384  \n Block Cipher Mode: CBC  \nThe best way to verify that existing VPN configuration s are utilizing approved cryptographic  algorithms  is to review the \ncurrent ISAKMP/IKE and IPsec security associations (SAs). Appendix B provides a set of common vendor commands to \nshow the current SAs and what cryptographic  algorithms were negotiated.  \nNSA recommends using this approach when reviewing ISAKMP/IKE and IPsec configurations because it will display the \nexact cryptography  settings that were negotiated . On the other hand, if this approach is not followed, reviewing a devices \nconfiguration file  may miss where a device is selecting a non -compliant algorithm that was a device default or left over \nfrom a previous VPN configuration.  \nIf SAs are identified with non -compliant algorithms, administrators should  immediately investigate as to why the VPN \nnegot iated a lower cryptography  standard and make appropriate configuration changes. Also, if utilizing pre -shared keys \nfor VPN authentication , NSA recommends that all keys be replaced as they may have been compromised due to weak \ncryptography  standards.  \nMany o rganizations can detect or even block the use of certain common outdated cryptographic algorithms in IP sec within \ntheir networks, such as the Data Encryption Standard (DES), Triple DES (3DES) and Diffie -Hellman groups 1, 2, and 5. \nFor examples on configuri ng the ISAKMP/IKE and IPsec policies on multiple common vendors, see Appendix C.  \nCryptography  standards continue to change over time as the computing environment evolves and new weaknesses in \nalgorithms are identified. Administrators should prepare for cry ptographic agility and periodically check CNSSP and \nNational Institute of Standards and Technology ( NIST ) guidance for the latest cryptography  requirements, standards, and \nrecommendations.  \nNSA has observed scanning activity that includes anomalous malforme d ISAKMP packets, which most customers should \nbe able to block. The signature for these packets is in Appendix C.  \nAvoid using default s ettings  \nDue to the complexity of establishing a VPN, many vendors provide default configurations, automated configuration  \nscripts, or graphical user interface wizards to aid in the deployment of VPNs. These tools take care of setting up the \nvarious aspects of a VPN to include ISAKMP/IKE and IPsec policies. However, many will configure a wide range of \ncryptography  suites to e nsure compatibility with the remote side of a VPN.  \nNSA recommends that administrators try avoiding these tools as they may allow more than the desired cryptography  \nsuites. If these tools are used, then evaluate all configuration settings that the tool depl oyed. Administrators should then \nremove any non -compliant ISAKMP/IKE and IPsec policies. As a best practice, administrators should not utilize any \ndefault settings and ensure that all ISAKMP/IKE and IPsec policies are explicitly configured for the CNSSP 15  compliant \nalgorithms.  \nRemove unused or non -compliant cryptography  suites  \nAs previously described, many vendors support having several ISAKMP/IKE and IPsec policies configured on a single \ndevice. It is also very common for vendors to include extra ISAKMP/IKE and IPsec policies for compatibility by default or \nwhen using automatic  configuration tools; however, these extra policies may include non -compliant cryptographic  \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  3 \nNSA | Configuring IPsec Virtual Private Networks  \nalgorithms. Leaving extra ISAKMP/IKE and IPsec policies as acceptable ISAKMP/IKE and IPsec policies creates a \nvulnerability  known as a downgrade attack. This type o f attack is where a malicious user or Man -in-the-Middle only offers \nweak cryptography  suites and forces the VPN endpoints to negotiate non -compliant cryptography  suites.  \nIn doing so, it leaves the encrypted VPN vulnerable to exploitation, including potenti al decryption, data modification, and \nadversarial system access . To mitigate against this vulnerability, administrators should validate that only compliant \nISAKMP/IKE and IPsec policies are configured and all unused or non -compliant policies are explicitly  removed from the \nconfiguration. NSA also recommends periodically validating that only compliant policies are configured as the use of \nautomated tools, graphical interfaces, or user error could reintroduce these non -compliant policies.  \nApply v endor -provide d updates  \nAfter ensuring that all configuration settings are utilizing compliant cryptography  suites and all non -compliant suites are \nremoved, a robust patch management procedure must be implemented. Over the past several years, multiple \nvulnerabilities ha ve been released related to IPsec VPNs. Many of these vulnerabilities are only mitigated by applying \nvendor -provided patches. Applying patches to VPN gateways and clients need to be a part of a regular routine. Many \nnetwork equipment vendors allow customer s to sign up for notification emails for new security alerts. These notifications \nare an excellent way to stay up -to-date on relevant out -of-cycle patches.  \nProtect the Essential  \nVPNs are essential for enabling remote access and connecting remote sites secu rely. However, without the proper \nconfiguration, patch management, and hardening, VPNs are vulnerable to many different types of attacks. To ensure that \nthe confidentiality and integrity of a VPN is protected, always use CNSSP 15 -compliant and FIPS validat ed cryptography  \nsuites, disable all other cryptography  suites, and avoid using vendor defaults. Following the steps identified in this paper \nwill ensure the most secure VPN configurations.   \nPublication Information  \nWorks Cited  \n[1] Securing IPsec Virtual Privat e Networks. National Security Agency, June 2020. [Online] Available  at: https://www.nsa.gov/cybersecurity -\nguidance   \n[2] CNSSP 15 - Use of Public Standards for Secure Information Sharing . [Online] Av ailable at: \nhttps://www.cnss.gov/CNSS/issuances/Policies.cfm  \nRelated Guidance  \n[1] NSA (2019). Mitigating Recent VPN Vulnerabilities . [Online] Available at: https://media.defense.gov/2019/Oct/07/2002191601/ -1/-1/0/CSA -\nMITIGATING -RECENT -VPN-VULNERABILITIES.PDF   \nDisclaimer of Endorsement  \nThe infor mation and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference herei n to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitut e or imply its endorsement, \nrecommendation, or favoring by t he United States Government.  This guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, in cluding its responsibilities to identify and disseminate threats to \nNational Security Systems, Department of Defense, and Defense Industrial Base information systems, and to develop and issue c ybersecurity \nspecifications and mitigations. This information m ay be shared broadly to reach all appropriate stakeholders.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n  \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  4 \nNSA | Configuring IPsec Virtual Private Networks  \nAppendix A: Reducing VPN Gateway Attack Surface Examples  \nACL example to limiting ISAKMP traffic to only known peers  \nCisco  ASA:  \nAccess-list deny -ike extended permit udp <source_peer_ip> <destination_peer_ip> eq isakmp  \nAccess-list deny -ike extended permit udp <source_peer_ip> <destination_peer_ip> eq 4500  \nAccess-list deny -ike extended permit esp <source_peer_ip> <destination_p eer_ip> \nAccess-list deny -ike extended deny udp any <destination_peer_ip> eq isakmp  \nAccess-list deny -ike extended deny udp any <destination_peer_ip> eq 4500  \nAccess-list deny -ike extended deny esp any <destination_peer_ip>  \n \nJuniper SRX:  \n[edit security polici es from-zone untrust to -zone trust]  \nPolicy <permit -policy-name> { \n Match { \nsource-address <source -peer-ip>; \n  destination -address <destination -peer-ip>; \n  Application [junos -ike junos -ike-nat]; \n } \n Then { \n  Permit; \n } \n} \nPolicy <deny -policy-name> { \n Match { \nsource-address any  \n  destination -address <destination -peer-ip>; \n  Application [junos -ike junos -ike-nat]; \n } \n Then { \n  deny; \n } \n} \n \nPalo Alto Firewalls:  \n[edit rulebase security]  \nSecurity {  \n Rules \n  <permit-rule-name> { \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  5 \nNSA | Configuring IPsec Virtual Private Networks  \n   From untrust;  \n   To trust;  \n   Source <source -peer-ip>; \n   Destination <destination -peer-ip>; \n   Service application -default;  \n   Application [ike ipsec -esp-udp] \n   Action allow;  \n  } \n  <deny-rule-name> { \n   From untrust;  \n   To trust;  \n   Source any;  \n   Destination <destination -peer-ip>; \n   Service application -default;  \n   Application [ike ipsec -esp-udp] \n   Action deny;  \n  } \n } \n} \n \n \nIPS Signature to b lock all IKEv2 traffic  to devices that do not use IKEv2  \nalert udp any any -> any [500,4500] ( msg:\"All IKEv2\";  content:\"|00 00 00 00 00 00 00 00  21 20 22 \n08 00 00 00 00 |\"; offset: 8; sid:9800028;   rev:1;)  \n  \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  6 \nNSA | Configuring IPsec Virtual Private Networks  \nAppendix B: Security Association \"show\" Commands Examples  \nThis appendix lists several common vendors and the available commands to show ISAKMP/IKE and IPsec connection \ndetails. For the purpos e of this appendix, only common vendors that provide the cryptographic  algorithms negotiated are \nlisted.  \nCisco IOS Routers and ASAs:  \nISAKMP/IKE:  \nshow crypto isakmp sa detail  \nIPSEC:  \nshow crypto ipsec sa  \n \nJuniper SRX:  \nISAKMP/IKE:  \nshow ike  security -associations details  \nIPSEC:  \nshow security ipsec security -associations detail  \n \nPalo Alto Firewalls:  \nISAKMP/IKE:  \nshow vpn ike -sa \nIPSEC:  \nshow vpn ipsec -sa \n \nAruba:  \nISAKMP/IKE:  \nAruba provides the following command to show isakmp SAs however it does no t provide cryptography  details  \nshow crypto isakmp sa  \nIPSEC:  \nshow crypto ipsec sa  \n  \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  7 \nNSA | Configuring IPsec Virtual Private Networks  \nAppendix C: ISAKMP/IKE and IPsec Configuration Examples  \nIn an effort to provide clear guidance on implementing strong IPsec VPNs, this document includes  examples of the \nISAKMP/IKE and IPsec, also known as phase 1 and 2, configurations for multiple vendors and devices. When deploying a \nremote access IPsec VPN, administrators must also ensure that all VPN clients are also configured properly. For further \nguidance on deploying VPNs on specific devices or VPN clients, appropriate  vender documentation should be followed .  \nCISCO IOS ROUTERS  \nISAKMP:  \nIKEv1:  \nno crypto isakmp default policy  \ncrypto isakmp policy 1  \nencryption aes 256  \ngroup [16|20]  \nhash [sha384|sha512]  \nIKEv2:  \ncrypto ikev2 proposal <proposal name>  \nencryption aes -cbc-256  \nintegrity [sha384|sha512]  \ngroup [16|20]  \nIPsec:  \ncrypto ipsec transform -set <transform name> esp-256-aes [esp -sha-hmac|esp -sha384-hmac|esp -sha512-\nhmac]  \n \nCISCO ASA  \nISAKMP:  \nFor Cisco ASA devices, NSA recommends IKEv2, since the IKEv1 implementation only supports SHA1.  \nIKEv2:  \ncrypto ikev2 policy 1  \nencryption [aes -256|aes-gcm-256]  \nintegrity [sha384|sha512]  \ngroup [16|20]  \nIPsec: crypto ipsec ikev2 ipsec -proposal <pr oposal name>  \nprotocol esp encryption [aes -256|aes-gcm-256] \nprotocol esp integrity [sha -384|sha512]  \n \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  8 \nNSA | Configuring IPsec Virtual Private Networks  \nJuniper SRX  \nISAKMP/IKEv1 and IKEv2:  \n[edit security ike]  \nproposal ike-proposal  { \n dh-group [group16|group20];  \n authentication -algorithm [sha -384|sha512]  \n encryption -algorithm [aes -256-cbc|aes-256-gcm] \n} \npolicy ike-policy { \n mode main;  \n proposals ike-proposal ; \n} \ngateway <gw name>  { \n ike-policy ike-policy; \n version v2 -only; #For IKEv2 otherwise SRX defaults to IKEv1  \n} \nIPsec:  \n[edit security ipsec]  \nproposal <proposal name>  { \n protocol esp;  \n authentication -algorithm [hmac -sha-384|hmac -sha-512] \n encryption -algorithm [aes256 -cbc|aes256 -gcm] \n} \nPalo Alto Firewalls  \nISAKMP/IKEv1 and IKEv2:  \n[edit network ike crypto -profiles]  \nike-crypto-profiles <profile name> { \ndh-group group20;  \nencryption aes -256-cbc; \nhash [sha384|sha512];  \n} \n[edit network ike]  \ngateway <gw name> { \nprotocol version [ikev1|ikev2|ikev2 -prefered];  \n} \nIPsec:  \n[edit network ike crypto -profiles]  \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  9 \nNSA | Configuring IPsec Virtual Private Networks  \nipsec-crypto-proiles <profile name> { \ndh-group group 20;  \nesp; \nauthentication [sha384|sha512];  \nencryption [aes -256-cbc|aes-256-gcm]; \n} \n \nAruba  \nISAKMP/IKEv1 and IKEv2:  \ncrypto isakmp policy 1  \nencryption aes256  \ngroup 20  \nversion [v1|v2]  \nhash sha2 -384-192 \nIPsec:  \ncrypto ipsec mtu <max-mtu> transform -set <transform -set-name> [esp-aes256|esp -aes256-gcm] \n \nApriva  \nApriva does not provide extensive documentation for configuring their devices online. The following snippet was created \nusing NIAP configuration guidance. Based on documentation provided, the ISAKMP/IKE and IP sec configuration is co -\nlocated.  \nvpn-suite <suite name>  copy suiteb -rsa{ \n algorithm [AES -256|AES-GCM-256] \n algorithm ike sha2 [SHA -384|SHA-512] \n algorithm ipsec sha2 [SHA -384|SHA-512] \n group ike [16|20]  \n  \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  10 \nNSA | Configuring IPsec Virtual Private Networks  \nAppendix D: Examples of ISAKMP/IKE Traffic Signatures  \nIPS Signatures for Weak Diffie -Hellman Groups (1, 2, or 5)  \nThese signatures can be used to detect weak IKE v1 connections. From a defensive perspective, this can be used to \nidentify VPN endpoints using weak Diffie -Hellman groups or to outright block these co nnections thereby ensuring policy \ncompliance.  \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"Weak IKE group detected\"; content:!\"|00 00 00 00 \n00 00 00 00|\"; offset: 36; depth: 8; content:\"|80 02 00 01 80 04 00 01|\"; within: 80; sid: 1; rev: \n1;) \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"Weak IKE group detected\"; content:!\"|00 00 00 00 \n00 00 00 00|\"; offset: 36; depth: 8; content:\"|80 02 00 01 80 04 00 02|\"; within: 80; sid: 2; rev: \n1;) \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"Weak IKE group detected\"; content:!\"|00 00 00 00 \n00 00 00 00|\"; offset: 36; depth: 8; content:\"|80 02 00 01 80 04 00 05|\"; within: 80; sid: 3; rev: \n1;) \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"Weak IKE group detected\"; content:!\"|00 00 00 00 \n00 00 00 00|\" ; offset: 36; depth: 8; content:\"|80 02 00 02 80 04 00 01|\"; within: 80; sid: 4; rev: \n1;) \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"Weak IKE group detected\"; content:!\"|00 00 00 00 \n00 00 00 00|\"; offset: 36; depth: 8; content:\"|80 02 00 02 80 04 0 0 02|\"; within: 80; sid: 5; rev: \n1;) \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"Weak IKE group detected\"; content:!\"|00 00 00 00 \n00 00 00 00|\"; offset: 36; depth: 8; content:\"|80 02 00 02 80 04 00 05|\"; within: 80; sid: 6; rev: \n1;) \nIPS Signatures f or DES/3DES  \nThese signatures can be used to detect devices attempting to use weak encryption.  \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"IKE DES Encryption Used\";content:\"|00 00 08 01 \n00 00 02|\";offset:41; depth: 7; sid: 7; rev: 1;)  \n \nalert udp  $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"IKE DES Encryption Used\";content:\"|00 00 08 01 \n00 00 03|\";offset:41; depth: 7; sid: 8; rev: 1;)  \n \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"IKE DES Encryption Used\";content:\"|00 00 08 01 \n00 00 09|\";offset:4 1; depth: 7; sid: 9; rev: 1;)  \n \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"IKE DES Encryption Used\";content:\"|00 00 08 01 \n00 00 11|\";offset:41; depth: 7; sid: 10; rev: 1;)  \n \nalert udp $HOME_NET 500 -> $EXTERNAL_NET any (msg:\"IKE DES Encryption Used\"; content:\"|00 00 08 01 \n00 00 21|\";offset:41; depth: 7; sid: 11; rev: 1;)  \nIPS Signatures of Anomalous ISAKMP/IKE Traffic  \nNSA has identified scanning activity that generates  malformed ISAKMP traffic. The following rule is designed to block that \nmalformed traf fic. \nalert udp any any -> any 500 ( msg:\"Anomalous Malformed ISAKMP\";  content:\"|00 00 00 00 00 00 00 00 \n21 20 22 08 00 00 00 00 |\"; offset: 8; content:\"|03 00 00 0e 01 00 00 00 00 00|\"; distance:16;  \nsid: 12;   rev:1;)  \n  \n\n \n \n U/OO/148260 -20 | PP-20-0712  | October 2020 ver. 1.2  11 \nNSA | Configuring IPsec Virtual Private Networks  \nAppendix E: Frequently Asked Quest ions \n \nQ1: How does NSA define obsolete cryptography?  \nA1: NSA  defines obsolete cryptography as those algorithms that do not meet  NIST recommendations for protecting \nsensitive -but-unclassified federal systems. (See NIST SP 800 -131A rev2 and SP 800 -56A re v3 for further details on \nNISTs recommendations) . \n \nQ2: Can the WireGuard protocol be configured to use CNSSP  15 or NIST approved cryptography?  \nA2: WireGuard is not an implementation of IKE/IPsec and supports neither CNSSP  15 nor NIST approved cryptography.  \n \nQ3: Is AES -128 approved for use on National Security Systems (NSS)?  \nA3: CNSSP  15 specifies AES -256 for use on NSS. Although AES -128 is not approved for use on NSS, AES -128 does \nachieve a security strength consistent with NIST recommendations  for protecting sensitive -but-unclassified federal \nsystems.  \n \nQ4: Does the cryptographic strength of Diffie -Hellman groups increase as the group number increases?  \nA4: Not always. There are cases where Diffie -Hellman groups with lower group numbers (e.g. , Groups 15 and 16) will \npossess greater cryptographic strength than a Diffie -Hellman group wi th a higher group number (e.g.,  Group 24).  \n \nQ5: Which  Diffie -Hellman groups comply with CNSSP 15 guidance and are commonly available in commercial products ? \nA5: Diffie -Hellman groups 20, 16, and 15 are CNSSP 15 -compliant and are currently available in many products.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "configuring_ipsec_vpn_uoo148260_20_v1_2",
  "source": "nsa",
  "id": "5dc7cdcadfee3c8576879b195d099cd7b53cde2d3635f8347d439710fb5c6b13"
}