{
  "markdown": " \n   \n \nU/OO/103100 -20                       PP-20-0026          10  January 2020  \n \n  \nMITIGATE CVE-2019 -19781 : \nCRITICAL VULNERABILI TY IN CITRIX APPLICA TION \nDELIVERY CONTROLLER (ADC) AND CITRIX GAT EWAY  \nDISCUSSION  \nOn December 17, 2019, Citrix1 published an advisory for a critical vulnerability (CVE -2019 -19781) in Citrix Application \nDelivery Controller (Citrix ADC1/NetScaler ADC1) and Citrix Gateway1 (NetScaler  Gateway1).2 3 If unmitigated, \nadversaries could exploit this vulnerability to gain remote code execution on affected a ppliances without credent ials, \npotentially enabling access to other internal resources and sensitive data .2 Citrix also released an interim mit igation for the \nvulnerabili ty.4 Citrix Virtual Apps and Desktops1 users typically access their applications and  desktops through Citrix \nADC or  Citrix Gateway appliances that are frequently deployed in front of Citrix Virtual Desktop Infrastructure (VDI) \nproducts and web applications. The appliances are often accessible from the Internet to allow remote connections, \nincreasing their risk of explo itation.  \nSecurity researchers have reproduce d an exploit for this vulnerability and have detected scanning for vulnerable \nappliances and exploitation attempts in the wild.5 6 7 \nMITIGATION ACTIONS  \nApply the Citrix published interim mitigation for CVE -2019 -19781 immediately.  \nThe Citrix mitigation can be found at https://support.citrix.com/article/CTX267679 .4 All supported builds of Citrix ADC  \n(NetScaler ADC ) and Cit rix Gateway (NetScaler Gateway ) version 13.0, 12.1, 12.0, 11.1, and 10.5 are vulnerable.2 \nAlthough a patched firmware update is not available, the Citrix mitigation will help prevent exploitation while patches are \ndeveloped. Procedures should  be in place to apply mitigations, patch es, and updates in a timely manner.  \nUpdate Citrix ADC and Citrix Gateway to patched firmware once Citrix releases a patch.2 \nRunning the most up -to-date patched version reduces risk of successful exploitation.  \nApply defense -in-depth security strategy.  \nConsider deploying a VPN capability using standardized protocols, preferably ones listed on the National Information \nAssurance Partnership (NIAP) Produ ct Compliant List (PCL), in front of publicly accessible Citrix ADC and Citrix Gateway \nappliances to require user authentication for the VPN before being able to reach these appliances. Use of a proprietary \nSSLVPN/TLSVPN is disco uraged . \n                                                \n1 Citrix, Citrix ADC, NetScaler ADC, Citrix Gateway, NetScaler  Gateway, Citrix Virtual Apps and Desktops are registered trademarks of Citrix System, Inc.  \n2 https://support.citrix.com/article/CTX267027  \n3 https://nvd.nist.gov/vuln/detail/CVE -2019 -19781  \n4 https://support.citrix.com/article/CTX267679  \n5 https://tripwire.c om/state -of-security/vert/citrix -netscaler -cve-2019 -19781 -what -you-need -to-know/  \n6 https://isc.sans.edu/forums/diary/Some+Thoughts+About+the+Critical+Citrix+ADCGateway+Vulnerability+CVE201919781/25660/  \n7 https://isc.sans.edu/forums/diary/A+Quick+Update+on+Scanning+for+CVE201919781+Citrix+ADC+Gateway+Vulnerability/25686 / \n\n \n \n 2 U/OO/103100 -20          PP-20-0026          10  January 2020  \n \n  \n \nIf a web application firewall (WAF) or an intrusion detection system (IDS) with TLS Inspection (break and inspect) is \ndeployed to protect these applianc es, apply the following rules:  \n For non -SSL VPN configurations, send a HTTP 403 response for requests containing /vpns/6 \n For SSL VPN enabled configurations, send  a HTTP 403 response for:  \no requests containing both /vpns/ with /../6 \no requests containing /vpns/cfg/smb.conf 7  \nDetecting potential exploitation attempts . \n For non -SSL VPN configurations, review the web request logs for requests  containing /vpns/6 \n For SSL VPN enabled configurations, review the web request logs . There will be legitimate requests containing \n/vpns/, but potentially malicious web requests includ e at least : \no requests containing both /vpns/ and /../6 \no requests containing /vpns/cfg/smb.conf 7 \nRespond ing to potential exploitation attempts . \n If the detection rules described above trigger an alert, review the web request logs for unusual requests (see above).  \n If warranted , perform a forensic triage of the appliance for potential sign s of compromise (e.g. , unusual addition al files \nor file modification s, unusual processes, additional accounts , or account modifications).  \n If there are signs of appliance compromise, perform incident response assuming lateral movement  has occurred . \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial  product, process, or service by trade name, trademark, manufacturer, or \notherwise, does not c onstitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or endorsement purposes.  \nNOTICE  \nThe information contained in this document was developed in the course of N SAs cybersecurity missions including its \nresponsibilities to identify and disseminate threats to national security systems and Department of Defense information \ntechnologies, develop and issue security implementation specifications for cybersecurity -enabl ed products, and to assist \nExecutive departments and agencies with operational security programs. The information may be shared broadly to reach \nall appropriate stakeholders.  \nCONTACT  \nFor general cybersecurity inqui ries and reporting, contact the  \nNSA Cybers ecurity Requirements Center, 410 -854-4200,  Cybersecurity_Requests@nsa.gov . \nFor media inquiries, contact the \nNSA Press  Desk, 443 -634-0721, MediaRelations@nsa .gov. \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa for citrixadcandcitrixgateway_20200109",
  "source": "nsa",
  "id": "5433cd2031b4d0495f5675df8f6246e5f62219ebfa9cdb994946030bd4e057ee"
}