{
  "markdown": " \n \nU/OO/191712 -19           PP-19-1187          SEPTEMBER 2019  CONTINUED USE OF A DOBE FLASH  INVITES COMPROMISE  \nDISCUSSION  \nOn July 25 , 2017 , Adobe Inc. announced they will stop updating and distributing  Flash1 by the end of 2020 .2 Adobe is \nencouraging content creators to migrate Flash content to open -source, standards -based technologies, such as HTML5, \nWebGL and WebAssembly.2  \nSince the release of Flash, Adobe has patched over 840 code -execution vulnerabilities in it.3 When Adobe end s support \nin 2020, no new patches should be expected for n ewly reported vulnerabil ities. Systems that continue to use Flash are at \nan increased risk of compromise . Flash vulnerabilities discovered after 2020  will become permanent attack vectors into \nsystems running the software. Adversaries  can easily exploit outdated software, often using nothing  more than public \ninformation. Any publicly unknown Flash vulnerabilities prior to 2020 will also continue to be successfully leveraged by \nattackers.  With 2020 fast approaching, failing to remove Flash places  systems  at increased  risk of compromise.  \nIndustry has widely agree d with Adobes decision to end support of Flash with Mozilla  Firefox4, Google Chrome 5, \nApple Safari6, and Microsoft Edge7 removing  Flash support by the end of 2020.  Updating browsers as soon as updates \nare available , and removing end -of-life software before  the end -of-life deadline,  are both  vital to protect ing systems . \nMITIGATION  ACTIONS  \nOn web server s, system administrators should stop hosting Flash applications. Continuing to host Flash applications will \nforce the use of old, unpatched browsers that are vulnerable to exploitation. Web d evelopers should convert Flash \napplications to a newer, more secure technology.  Replacing  Flash with standards -based technologies , such as HTML5 , \nWebGL, and WebAssembly, is critical to lowering risk of exploitation . \nOn end-user systems, administrators or  users should remove Flash from browsers.  Use a fully automated process for \nupdating browsers and always update browsers to the latest version.  Enabling the automatic update feature in modern \nbrowsers is the only reliable way for internet -connected systems to keep the browser updated.   \nFor additional information  on brows er security, see Steps to Secure Web Browsing which can be found at:  \nhttps://nsa.gov/what -we-do/cybersecurity/advisories -technical -guidance   \n \nAdobe guidance  for converting Flash to HTML5 can be found at: \nhttps://helpx.adobe.com/animate/how -to/convert -flash -ads-to-html5.html  \nhttps://helpx.adobe.com/animate/how -to/convert -flash -to-html5.html  \n                                                \n1 Adobe and Flash are either registered trademark s or trademarks  of Adobe Inc.  in the United States and/or other countries . Mozilla and  Firefox are trademark s of the Mozilla Foundation \nin the U.S. and other countries. Google Chrome is a trademark of Google, LLC.  Apple and Safari are trademarks of Apple Inc., registered in the U.S. and other countries.  Microsoft Edge \nis a registered tradem ark of Microsoft Corporation in the United States and other countries.  \n2 Flash and the Future of Interactive Content. https://theblog.adobe.com/adobe -flash-update  \n3 Adobe Flash Player Vulnerability Statistics. https://www.cvedetails.com/product/6761/Adobe -Flash -Player.html?vendor_id=53  \n4 Firefox Roadmap for Flash End -of-Life. https://blog.mozilla.org/futurereleases/2017/07/25/firefox -roadmap -flash -end-life  \n5 Saying Goodbye to Flash in Chrome. https://www.blog.google/products/chrome/saying -goodbye -flash -chrome   \n6 Adobe Announces Flash Distribution and Updates to End. https://webkit.org/blog/7839/adobe -announces -flash -distribution -and-updates -to-end  \n7 The End of an Era  Next Steps for Adobe Flash. https://blogs.win dows.com/msedgedev/2017/07/25/flash -on-windows -timeline   \n\n \n \nU/OO/191712 -19           PP-19-1187          SEPTEMBER 2019  2 DISCLAIMER OF WARRAN TIES AND ENDO RSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial product, process, or service by trade name, trademark, manufacturer, or \notherwise, do es not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or endorsement purposes.  \nNOTICE  \nThe information contained in this document was developed in the course of NSAs cybersecurity missions including its \nresponsibilities to identify and disseminate threats to national security systems and Department of Defense information \ntechnologies, develop and issue security implementation specifications for cybersec urity-enabled products, and to assist \nExecutive departments and agencies with operational security programs. The information may be shared broadly to reach \nall appropriate stakeholders.  \nCONTACT  \nCybersecurity Requirements Center  \n410-854-4200  \nCybersecurity _Requests@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa - continued use of adobe flash invites compromise",
  "source": "nsa",
  "id": "0c0c31a2d4e24c3582f2cd7212c18add0a40b1e08d8f8b7323be348cc991bfe1"
}