{
  "markdown": " \n   \nU/OO/151 937-19              PP-19-0572          MAY  2019  \n GUIDANCE FOR VULNERA BILITIES AFFECTING \nMODERN PROCESSORS  (UPDATE 2)   \nDISCUSSION  \nA new  set of side -channel vulnerabilities focusing on Intel processors[1] has been disclosed to the public. These \nvulnerabilities exploit weaknesses in processor buffers to leak unauthorized information. Vulnerable buffers move data to \nand from caches affected by previous side -channel vulnerabilities. Account permissions, virtu alization boundaries, and \nprotected memory regions may be bypassed via exploitation. The new vulnerabilities are identified as:  \n Microarchitectural Data Sampling (MDS)[1]  a generic term encompassing multiple vulnerabilities  \n Fallout[2] \n Rogue In -Flight Data  Load (RIDL)[2] \n ZombieLoad[3] \nVulnerable processors are present in several  generations of systems widely deployed within National Security Systems \nincluding DoD networks. Desktops, servers, notebooks, tablets, thin clients, and other computing products are  affected. \nAssume ALL[4] Intel x86 architecture processors are affected  including products with hardware in -silicon Spectre and \nMeltdown mitigations. Spectre and Meltdown patches are not sufficient to address MDS vulnerabilities.  \nMITIGATION ACTIONS  \n1) Apply system UEFI/BIOS firmware updates provided by system vendors.  Firmware updates may include a processor \nmicrocode update element. Ensure that the entire firmware update process runs uninterrupted  some implementations \nhave multiple phases. Some firm ware updates may not be delivered through widely used patching services. Always check \nwith system vendors, such as Dell [5] and HP [6] and similar, for each specific make and model of system. Patch delivery \nmechanisms may not be consistent across product  lines and form factors.  \n \n2) Apply all operating system, driver, application, and development library patches. Perform configuration changes \nas indicated.  Xen Project [7], VMware [8], Microsoft [9], Red Hat [10], Google [11], Citrix [12], Apple [13], and others have \nreleased information and updates for their respective products. Additional applications, such as web browsers and document \nreaders, may also require patching. Software development tool updates may contain new instructions and subroutines to \nmitigate MDS.\n                                                \n1 Deep Dive: Intel Analysis of Microarchitectural Data Sampling https://software.intel.com/security -software -guidance/insights/deep -dive/intel -analysis -microarchitectural -data-sampling  \n2 RIDL and Fallout: MDS attacks https://mdsattacks.com  \n3 ZombieLoad Attack https://zombieloadattack.com  \n4 Deep Dive: CPUID Enumeration and Architectural MSRs https://software.intel.com/security -software -guidance/insights/deep -dive-cpuid -enumeration -and-architectural -msrs  \n5 Dell EMC Server Security  Notice https://www.dell.com/support/article/us/en/04/sln317156/dell -emc-server -security -notice -for-intel-sa-00233   \n6 HPE Products Us ing Certain Intel Processors, MDS https://support.hpe.com/hpsc/doc/public/display?docLocale=en -US&docid=emr_na -hpesbhf03933en_us   \n7 Xen Security Advisory XSA -297 https://xenbits.xen.org/xsa/advisory -297.html  \n8 Implementing Hypervisor -Specific Mitigations for MDS Vulnerabilities https://kb.vmware.com/s/article/67577  \n9 Microsoft Guidance to Mitigate MDS Vulnerabilities https://portal.msrc.microsoft.com/en -us/security -guidance/adviso ry/ADV190013  \n10 MDS Advisory https://access.redhat.com/security/vulnerabilities/mds  \n11 Product Status: MDS https://support.g oogle.com/faqs/answer/9330250  \n12 MDS Security Issues and Mitigations https://www.citrix.com/blogs/2019/05/14/microarchitectural -data-sampling -security -issues -and-mitigations  \n13 Additional Mitigations for Speculative Execution Vulnerabilities https://support.apple.com/en -us/HT210107  \n\n  \n \n 2        U/OO/151 937-19              PP-19-0572          MAY 2019  \n                                   \n \n \n3)Temporarily disable Intel Hyper -Threading Technology (HT Technology) on systems handling sensitive data.  \nDisable HT until MDS mitigation patches are widely deployed. Lag time between disclosure and the deployment of \npatches  is expected. Initial patches may also miss some edge case s. Wait for the full effectiveness of patches to be \nunderstood before restoring HT. Some use cases may see significant performance impacts.  \nRESOURCES  \nThe following websites are updated as new vulnerabilities are discovered and link to extensive vendor reso urces:  \n https://github.com/nsacyber/Hardware -and-Firmware -Security -Guidance  \n https://portal.msrc.microsoft.com/en -us-security -guidance/advisory/ADV190013  \n https://www.intel.com/content/www/us/en/architecture -and-technology/mds.html  \nVulnerabiliti es covered in this advisory utilize the following identifiers:  \n CVE-2019 -11091  \n CVE-2018 -12127  \n CVE-2018 -12130  \n CVE-2018 -12126  \nDISCLAIMER OF ENDORS EMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement purposes.  \nCONTACT  \nCybersecurity Requirements Center  \n410-854-4200  \nCybersecurity_Requests@nsa.gov  \nTRADEMARK INFORMATIO N \n Apple and MacOS are registered trademarks of Apple, Inc.  \n Citrix is a reg istered trademark of Citrix.  \n CVE is a registered trademark of The MITRE Corporation.  \n Dell, EMC, and Dell EMC are registered trademarks of Dell, Inc.  \n Google, Chrome OS, and Chrome are registered trademarks of Google, Inc.  \n HP, HPE, and HP Enterprise are registered trademarks of Hewlett -Packard Company.  \n Intel, Core, Xeon, and vPro are registered trademarks of Intel Corporation.  \n Linux is a registered trademark of Linus Torvalds.  \n Microsoft, Windows, Edge, and Internet Explorer are registered trademarks of Mi crosoft Corporation.  \n Red Hat is a registered trademark of Red Hat, Inc.  \n Vmware, vSphere, and ESXi are registered trademarks of VMware, Inc.  \n Xen Project is a registered trademark of The Linux Foundation.  \n\n",
  "cves": [],
  "techniques": [
    "T2101"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa-guidance_for_vulnerabilities_affecting_modern_processors_update2",
  "source": "nsa",
  "id": "b46b75ac8fc406e13dc1c56234236cd964e50407edf4191e94bc7cb2267cd35d"
}