{
  "markdown": "February 2024 \n Crown Copyright 2024  Advisory  \nSVR cyber actors adapt  \ntactics for initial cloud \naccess  \n\n\nSVR cyber actors adapt tactics for  \ninitial cloud access  \nHow SVR -attributed actors are adapting to the move of \ngovernment and corporations  to cloud infrastructure\nOverview \nThis advisory details r ecent tactics , techniques an d procedures (TTPs) of t he \ngroup commo nly known as A PT29, a lso known as M idnight Blizzard, the  Dukes or \nCozy Bear.   \nThe U K National C yber Security C entr e (NCSC) an d international partners as sess \nthat A PT29 i s a cyber espionage gr oup, al most  certainly par t of the SVR, an \nelement o f the Russian i ntelligence services . The US National S ecurity A gency  \n(NSA), the U S Cybersecurity an d Infrastructure Security Agency (CI SA), the US \nCyber National M ission Force ( CNMF) , the Fed eral Bureau of I nvestigation ( FBI), \nAustralian Signals Directorates Austra lian Cyber Security Centre (ASDs ACSC), \nthe Canadian Centre for  Cyber Security (CCCS)  and  the New Zealand Nationa l \nCyber Security Centre  (NCSC) agree with this attr ibution and the details \nprovided in this a dvisory. \nThis advisory provide s an overview of TTPs  deployed by the actor to g ain initial \naccess into the cloud  environment and includes advice t o detect and mitigat e \nthis activity.  \nPrevious actor activ ity \nT\nhe NCSC has previously detailed how Russian Foreign Intelligence Service (SVR) \ncyber actors have targeted governmental, think tank, healthcare and energy \ntargets for intelligence gain . It has now observed SVR actors expanding their \ntargeting to include aviation, education, law  enforcement, local and state \ncouncils, government financial departments and military organisations.  \nS\nVR actors are also known for : \nthe supply c hain compromise of SolarWinds software\n\n  activity that targeted organisations developing the COVID -19 vaccine  \n \n  \nEvolving TTPs  \nAs organisations continue to modernise their systems and move to cloud -based \ninfrastructure, the SVR has adapted to these changes in the operating environment.  \nThey  have to move beyond their t raditional means of initial access, such as \nexploiting software vulnerabiliti es in an on- premise network , and instead target \nthe cloud services themselves.  \nTo access the majority of the victims cloud hosted network, actors must first \nsuccessfully authenticate to the cloud provider. Denying initial access to the cloud environment can prohibit SVR from successfully compromising their target. In contrast, in an on- premise system, more of the network is typically exposed to \nthreat actors.   \nBelow  describes in more detail  how  SVR actors are adapting to continue their \ncyber operations for intelligence gai n. These TTPs have been observed in the last \n12 months . \n Access via service  and dormant  account s  \n Previous SVR campaigns reveal the actors have successfully used brute forcing \n(T1110 ) and password spraying to access service accounts. This type of account is \ntypically used to run and manage applications and services. There is no  human \nuser behind them so they cannot be easily protected with multi -factor \nauthentication (MFA ), making these accounts more susceptible to a successful \ncompromise. Service accounts are often also highly privileged depending on \nwhich applications and services theyre responsibl e for managing. Gaining \naccess to these accounts provides threat actors with privileged initial access to a network, to launch further operations.  \n \n\nSVR campaigns have also targeted dormant accounts belonging to  users who no \nlonger work at a victim  organisation but whose accounts remain on  the system. \n(T1078.004 ).  \n \nFollowing an e nforced password reset for all users during an incident, SVR actors \nhave also been observed logging into inactive a ccounts and following \ninstructions to reset the password. This has allowed the actor to regain access \nfollowing incident response eviction activiti es. \nCloud -based token authentication  \nAccount access is typically  authenticated by either username and password \ncredentials or system -issued access tokens. The NCSC and partners have \nobserved SVR actors  using tokens to access their victims accounts , without \nneeding  a password  (T1528 ). \nThe default validity time of system -issued tokens varies dependant on  the \nsystem , however cloud platforms  should allow administrators to  adjust the \nvalidity time as appropriate for their users.  More information can be found on this \nin the mitigations section of this advisory . \nEnrolling new devices to the  cloud  \nOn multiple occasions, the  SVR has successfully bypassed password \nauthentication on personal accounts  using password spraying and credential \nreuse. SVR a ctors  have also then bypassed MFA through a techni que known as  \nMFA bombing or MFA fatigue , in which the actors  repeatedly  push  MFA requests \nto a victim s device until the victim accepts the notification ( T1621 ).  \nOnce an actor has bypassed these systems  to gain access to the cloud \nenvironment, SVR actors have bee n ob served registering  their own device as a \nnew device on the cloud tenant  (T1098.005 ). If device validation rules are not set \nup, SVR actors  can  successfully register their own device a nd gain access to the \nnetwork .  \nBy configuring the network with device enrolment policies , there have been \ninstances where these measures have defended agai nst SVR actors and denied \nthem access to the cloud tenant.  \n\n \nResidential proxies \nAs network -level defences improve detection of suspicious activity, SVR actors \nhave looked at other ways to stay covert on the internet. A TTP associated with \nthis actor is the use of residential proxies ( T1090.002 ). Residential proxies typically \nmake traffic appear to originate from IP addresses within internet service provider ( ISP) ranges used for residential broadband customers  and hide the true \nsource. This can make it harder to distinguish malicious connections from typical users.   This reduces the effectiveness of network defences that use IP addresses \nas indicators of compromise, and so it is important to consider a variety of information sources such as application and host -based logging for detecting \nsuspicious activity.  \n \nConclusion  \nThe SVR is a sophisticated actor capable of  carrying out  a global  supply chain \ncompromise such as the 2020 SolarWinds, however the guidance in this advisory \nshows that a strong baseline of cyber security fundamentals can help defend \nfrom such actors.   \nFor organisations that have moved to cloud infrastructure, a first line of defence \nagainst an actor such as SVR should be to protect against SVRs TTPs for  initial \naccess. By  following the mitigations outlined in this advisory , organisations will be \nin a stronger position to defend against this threat.  \nOnce  the SVR gain  initial access, the actor is capable of deploying highly \nsophisticated post compromise capabilities such  as MagicWeb , as reported in \n2022.  Therefore, mitigating against the SVRs initial access vectors is particularly \nimportant for network defenders.   \nCISA have also produced guidance through their Secure Cloud Business \nApplications (SCuBA) Project  whi ch is designed to protect assets stored in cloud \nenvironments.   \n\nSome of the TTPs listed in this report, such as residential proxies and exploitation \nof system accounts, are similar to thos e reported as recently as January 2024 by \nMicrosoft . \n \nMITRE ATT&CK \nThis report has been compiled with respect to the MITRE ATT&CK framework, a \nglobally accessib le knowledge base of adversary tactics and techniques based \non real -world observations.  \nTactic  ID Technique  Procedure  \nCredential \nAccess  T1110  Brute forcing  The SVR use password \nspraying and brute forcing as \nan initial infection vector . \nInitial Access  T1078.0\n04 Valid Accounts: Cloud \nAccounts  The SVR use compromised \ncredentials to gain access to accounts for cloud services, including system and \ndormant accounts.  \nCredential \nAccess  T1528  Steal Application Access Token  The SVR use stolen access \ntokens to login to accounts \nwithout the need for \npasswords.  \nCredential \nAccess  T1621  Multi -Factor \nAuthentication Request \nGeneration  The SVR  repeatedly push MFA \nrequests to a victim s device \nuntil the victim accepts the \nnotification, providing SVR access to the account.  \nCommand and \nControl T1090.0\n02 Proxy: External Proxy  The SVR use open proxies in \nresidential IP ranges to blend \nin with expected IP address \npools in access logs . \nPersistence  T1098.0\n05 Account Manipulation: \nDevice Registration  The SVR  attempt to register \ntheir own device on the cloud tenant after acquiring access to accounts.  \n \n \n\nMitigation and Detection  \nA number of mitigations will be useful in defending against the activity \ndescribed in this advisory :  \n> Use multi- factor authentication  (/2-factor authentication/two- step \nverification ) to reduce the impact of password compromises. See NCSC \nguidance: https://www.ncsc.gov.uk/guidance/multi -f actor -\nauthentication- online -services   an d \nhttps://www.ncsc.gov.uk/guidance/setting -two- factor- authentication -2fa \n> Accounts that cannot use 2SV should have strong, unique passwords. \nUser and system accounts should be disabled when no longer required \nwith a joiners, movers and leavers process in place and regular reviews \nto identify and disable inactive/dormant accounts .  See NCSC guidance:  \nhttps://www.ncsc.gov.uk/collection/10 -steps/identity -and- access -\nmanagement  \n \n> System and service accounts should implement  the principle of least \nprivilege, providing a tightly scoped access to resources required for the \nservice to function.  \n \n> Canary service accounts should be created which appear to be valid \nservice accounts but are never used by legitimate services. Monitoring \nand alerting on the use of these account  provides a high confidence \nsignal that they are being used illegitimately and should be i nvestigated \nurgently.  \n> Session lifetimes should be kept as short as practical to reduce the \nwindow of opportunity for an adversary  to use stolen session tokens. This \nshould be paired with a suitable authentication method that strikes a \nbalance between regular user authentication and user experience.   \n> Ensure device enrolment policies are configured to only permit authorised \ndevices to enrol. Use zero -touch enrolment wher e possible, or if self -\n\n \nDisclaimer  \nThis report draws on information derived from NCSC and industry sources. Any \nNCSC findings and recommendations made have not been provided with the intention of avoiding all risks and following the recommendations will not remove all such risk. Ownership of information risks remains with the relevant system owner at all ti mes.  \nThis information is exempt under the Freedom of Information Act 2000 (FOIA) a nd \nmay be exempt under other UK information legislation.  \nRefer any FOIA queries to ncscinfoleg@ncsc.gov.uk\n.  \nAll material is U K Crown Copyright   enrolment is required then use a strong form of 2SV that is resistant to \nphishing and prompt bombing. Old devices should be prevented from \n(re- )enrolling when no longer required. See NCSC guidance:  \nhttps://www.ncsc.gov.uk/collection/device -security -guidance/getting-\nready/provisioning -and- distributing -devices  \n \n> Consider a variety of information sources such as application events and \nhost- based logs to help prevent, detect and investigate potential \nmalicious behaviour. Focus on the information sources and indicators of \ncompromise that have a better rate of false positives. For ex ample, \nlooking for changes to user agent strings that could indicate session \nhijacking may be more effective than trying to identify connections from \nsuspicious IP addresses.  See NCSC guidance:   \nhttps://www.ncsc.gov.uk/guidance/introduction- logging- security -\npurposes  \n \n \n\n",
  "cves": [],
  "techniques": [
    "T1078.004",
    "T1090.002",
    "T1098.005"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa-svr-adapt-tactics-for-initial-cloud-access",
  "source": "nsa",
  "id": "612fb70f973bd6dab015aa4685a781f1e75043fd00958c06298906661765df1b"
}