{
  "markdown": "Co-Authored by:  \n \nTo report suspicious or criminal activity related to information found in this joint Cybersecurity Advisory, contact \nyour local FBI field office . When available, please include the following information regarding the incident: date, \ntime, and location of the incident; type of activity; number of people affected; type of equipment used for the \nactivity; the name of the submitting compan y or organization; and a designated point of contact.   \nThis document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information \ncarries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public \nrelease. Subject to standard copyright rules, TLP:CLEAR information may be distributed without restriction. For \nmore information on the Traffic Light Protocol, see cisa.gov/tlp .  Product ID: JCSA -20240918 -001 \n \n \n September 18, 2024  \n  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n \n \n \nPeoples Republic of China -Linked  Actors \nCompromise Routers and IoT Devices for \nBotnet Operations  \nSummary  \nThe Federal Bureau of Investigation (FBI), Cyber National Mission Force (CNMF), and National Security \nAgency (NSA) assess that Peoples Republic of China (PRC) -linked cyber actors have compromised \nthousands of Internet -connected devices , including small office/home office (SOHO) routers, firewalls, \nnetwork -attached storage (NA S) and Internet of Things (IoT) devices with the goal of creating a network of \ncompromised nodes (a botnet) positioned for malicious activity. The actors may then use the botnet as a \nproxy to conceal their identities while deploying distributed denial of  service (DDoS) attacks or \ncompromising targeted U.S. networks.  \nIntegrity Technology Group, a PRC -based company, has controlled and managed a botnet active since mid -\n2021. The botnet has regularly maintained between tens to hundreds of thousands of comprom ised \ndevices. As of June 2024, the botnet consisted of over 260,000 devices. Victim devices part of the botnet \nhave been observed in North America, South America, Europe, Africa, Southeast Asia  and Australia . \nWhile devices aged beyond their end -of-life dat es are known to be more vulnerable to intrusion, many of the \ncompromised devices in the Integrity Tech controlled botnet are likely still supported by their respective vendors.  \nFBI, CNMF, NSA, and allied partners are releasing this Joint Cyber Security Ad visory to highlight the threat \nposed by these actors and their botnet activity and to encourage exposed device vendors, owners, and \noperators to update and secure their devices from being compromised and joining the botnet. Network \ndefenders  are advised to  follow the guidance in the mitigations section to protect against the PRC -linked \ncyber actors botnet activity. Cyber security companies can also leverage the information in this advisory to \nassist with identifying malicious activity and reduc ing the numb er of devices present in botnets worldwide.  \nFor additional information, see U.S. Department of Justice (DOJ) press release.   \n\n \n  Page 2 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n Technical Details  \nAttribution  \nIntegrity Technology Group (Integrity Tech) is a company based in the PRC with links to the PRC \ngovernment. Integrity Tech has used China Unicom Beijing Province Network IP addresses to control and \nmanage the botnet described in this  advisory.  \nIn addition to managing the botnet, these same China Unicom Beijing Province Network IP addresses were \nused to access other operational infrastructure employed in computer intrusion activities against U.S. \nvictims. FBI has engaged with multiple U.S. victims of these c omputer intrusions and found activity \nconsistent with the tactics, techniques, and infrastructure associated with the cyber threat group known \npublicly as Flax Typhoon, Red Juliett , and Ethereal Panda.  \nNote:  Cybersecurity companies have different methods of  tracking and attributing cyber actors, and th ese \nmay not be a 1:1 correlation to the U.S. Governments methodology and understanding for all activity \nrelated to these groupings.  \nBotnet Command  and Control  \nAs with similar botnets, th is botnet infrastructure is comprised of a network of devices, known as bots, \nwhich are infected with a type of malware that provides threat actors with unauthorized remote access. A \nfunctioning botnet can be used for a variety of purposes, including malwa re delivery, distributed denial of \nservice (DDoS) attacks, or routing nefarious Internet traffic.  \nThe botnet uses the Mira i family of malware, designed to hijack IoT devices such as webcams, DVRs, IP \ncameras, and routers running Linux -based operating syste ms. The Mirai source code was posted publicly \non the Internet in 2016 , resulting in other hackers creating their own botnets based on the malware. Since \nthat time, various Mirai botnets have been used to conduct DDoS and other  malicious  activities against \nvictim entities within the United States.  \nThe investigated botnet s customized Mirai malware is a component of a system that automates the \ncompromise of a variety of devices. To recruit a new bot, the botnet system first compromises an \nInternet -connected device using one of a variety of known vulnerability exploits (see Appendix  B: Observed \nCVEs ). Post -compromise, the victim device executes a Mirai -based malware payload from a remote server. \nOnce executed,  the payload starts processes on the device to establish  a connection with a command -and- \ncontrol (C2) server using Transport Layer Security (TLS) on port 443. The processes gather system \ninformation from the infected device, including but not limited to t he operating system version  and \nprocessor, memory and bandwidth details to send to the C2 serve r for enumeration purposes.  The malware \nalso makes requests to c.speedtest.net , likely to gathe r additional Internet connection details . Some \nmalware payloads were self-deletin g to evade detection.  \nA variety of subdomains of w8510.com were linked to the botnets C2 servers. As of September 2024, \ninvestigators identified over 80 subdomains associated with w8510.com (see Appendix  A: Indicators of \nCompromise ). \n\n \n  Page 3 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n Botnet Management  \nA tier of upstream management servers using TCP port 34125 manage the botnets C2 servers.  These \nmanagement servers host a MySQL database which stored information used for the control of the botnet. \nAs of June 2024, this database contained over 1.2 million records of compromised devices, including over \n385,000 unique U.S. victim devices , both previously and actively exploited . \nThe management servers hosted an application known a s Sparrow which allow s users to interact with \nthe botnet. The a ctors used specific IP addresses registered to China Unicom Beijing Province Network to \naccess th is application, including the same IP address es previously used by Flax Typhoon to access the \nsystems used in computer intrusion activities against U .S.-based victims.  \nThe code for the Sparrow application, stored within a Git repository, define s functions that allow registered \nusers to manage and control the botnet and C2 servers, sending tasks to victim devices including DDoS \nand exploitation command s to grow the botnet. Sparrow also contain s functionality providing device \nvulnerability information to users. A subcomponent called vuln erability  arsenal  also allow s users to \nexploit traditional comp uter networks through the victim devices in the botnet.  \nCompromised Device Distribution  \nThe following tables approximate the count of devices compromised by the botnet system as of June 2024, \nby location and by processor architecture.  There were at least 5 0 different Linux operating system versions \nfound among botnet nodes. Based on the operating system versions of the nodes, infected systems \ninclude devices that ceased receiving support as early as  2016 to devices that are currently supported. \nAffected  devices were running Linux kernel versions 2.6 through 5.4.   \n\n \n  Page 4 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n Table 1: Botnet devices per country  \nCountry  Node Count  Percent age \nUnited States  126,000  47.9% \nVietnam  21,100 8.0%  \nGermany  18,900  7.2% \nRomania  9,600  3.7% \nHong Kong  9,400  3.6%  \nCanada  9,200  3.5%  \nSouth Africa  9,000  3.4%  \nUnited Kingdom  8,500  3.2%  \nIndia  5,800  2.2%  \nFrance  5,600  2.1%  \nBangladesh  4,100  1.6%  \nItaly 4,000  1.5%  \nLithuania  3,300  1.3% \nAlbania  2,800  1.1%  \nNetherlands  2,700  1.0%  \nChina  2,600  1.0%  \nAustralia  2,400  0.9%  \nPoland  2,100  0.8%  \nSpain  2,000  0.8%  \nTable 2: Botnet devices per continent  \nContinent  Node Count  Percent age \nNorth America  135,300  51.3% \nEurope  65,600 24.9% \nAsia 50,400 19.1%  \nAfrica  9,200  3.5%  \nOceania  2,400  0.9% \nSouth America  800 0.3%  \nTable 3: Botnet devices by processor architecture  \nProcessor Architecture  Node Count  Percent age \nx86 236,000  89.2%  \nMIPS  21,400  8.1%  \nARM  3,900  1.5%  \nx86_64  1,900  0.7%  \nMIPSEL  1,400  0.5%  \n \n\n \n  Page 5 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n  \nFigure 1: Exploited processor architectures chart  \nRecommended Mitigations  \nThe FBI recommends network defenders take the following actions to mitigate threats  posed by \nadversaries attempting to use botnets for malicious cyber activity. The following guidance applies both to \npreventing IoT devices from becoming part of a botnet, as well as to defending networks from botnets \nalready in operation.  \n Disable unused services and ports  such as automatic configuration, remote access or file sharing  \nprotocols. Routers and IoT devices may provide features such as Universal Plug and Play (UPnP), \nremote management options and file sharing services, which threat actors may abuse to gain initial \naccess or to spread malware to other networked devices. Disa ble these features if not needed.  \n Implement network segmentation  to ensure IoT devices within a larger network pose known, \nlimited, and tolerable risks. Use the principle of least privilege to provide devices with just enough \nconnectivity needed to perform  their intended function.  \n Monitor for high network traffic volume . Since DDoS attacks originating from botnets may at first \nappear similar to normal traffic, it is critical for organizations to define, monitor and prepare for \nabnormal traffic volumes.  Moni toring is possible via firewalls or intrusion detection systems. Some \nnetwork solutions such as proxies may mitigate DDoS incidents.  \n Apply patches and updates , including software and firmware updates. Regular patching mitigates \nmany high -risk security vuln erabilities. If available, take advantage of automatic update channels \nfrom trusted network locations. Do not trust email messages claiming to provide software updates \nas attachments or via links to untrusted websites.  \n Replace default passwords with strong  passwords . Many IoT products implement a device \nadministration password in addition to other account passwords. Ensure all passwords are \nchanged from their defaults, using a strong password policy. If possible, disable password hints.  \n Plan for device rebo ots. Rebooting a device terminates all running processes, which may remove \nspecific types of malware, such as fileless malware that runs in the hosts memory. As a reboot Exploited Processor Architectures\nx86 mips arm x86_64 mipsel\n\n \n  Page 6 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n may disrupt legitimate activity, users may need to prepare for service interruption s. Some devices \nprovide scheduled reboot features, enabling reboots to occur at preferred times. If a compromised \ndevice fails to respond to reboot commands issued remotely, reboot physically.  \n Replace end -of-life equipment with devices that remain in respe ctive vendor support plans.  \nDisclaimer  \nThe information in this report is being provided as is for informational purposes only. The authoring \norganizations  do not endorse any commercial entity, product, company, or service, including any entities, \nproducts, or services linked within this document. Any reference to specific commercial entities, products, \nprocesses, or services by service mark, trademark, manu facturer, or otherwise, does not constitute or \nimply endorsement, recommendation, or favoring by the authoring organizations . \nVersion History  \nSeptember 18, 2024 : Initial  version.  \n  \n\n \n  Page 7 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n Appendix A: Indicators of Compromise  \nThe following listed domain names were  observed subdomains of w 8510.com, the observed \ncommand and control system domain.  \nTable 4: List of w8510.com subdomains  \nDomain  IP Address  Last Seen  \nacqv.w8510.com  208.85.16.100  8/29/2024  \naewreiuicajo.w8510.com  45.77.231.209  9/1/2024  \napdfhhjcxcb.w8510.com  139.180.137.219  8/31/2024  \nasdvxzzxvza.w8510.com  45.135.117.131  9/3/2024  \nawbpxtpi.w8510.com  155.138.151.225  9/3/2024  \nbzbatflwb.w8510.com  45.77.231.209  9/3/2024  \ncansqra.w8510.com  222.186.48.201  8/22/2023  \ncanwtrow.w8510.com  222.186.48.204  10/7/2023  \ncccasdqawer.w8510.com  92.38.185.45  9/3/2024  \nccccasdasdq.w8510.com  85.90.216.115  9/3/2024  \ncccvbsdfsdf.w8510.com  195.234.62.197  9/3/2024  \nccmmkmnkna.w8510.com  85.90.216.69  9/3/2024  \ncpooooim.w8510.com  85.90.216.110  9/3/2024  \ndftiscasdwe.w8510.com  207.148.122.69  9/2/2024  \ndvasrdftqgqg.w8510.com  45.10.58.129  9/3/2024  \niiiiopasdfcasd.w8510.com  92.38.185.46  9/3/2024  \niikljhg.w8510.com  85.90.216.116  9/3/2024  \niuyrdfvv.w8510.com  45.10.58.133  9/3/2024  \niyasdasfda.w8510.com  195.234.62.184  9/1/2024  \n\n \n  Page 8 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n kliscjaisdjhi.w8510.com  149.248.51.22  9/4/2024  \nlkljjhidjaiwd.w8510.com  37.61.229.15  9/3/2024  \nlkopiyut.w8510.com  5.181.27.219  9/3/2024  \nlyblqwesfawe.w8510.com  78.141.238.97  8/28/2024  \nmjiudwajhkf.w8510.com  45.77.231.209  9/3/2024  \nmmjkjiu.w8510.com  92.38.185.43  9/3/2024  \nmmnajsdh.w8510.com  37.9.35.91  9/1/2024  \nmnbghjj.w8510.com  45.92.70.71  9/2/2024  \nocmnusdjdik.w8510.com  139.180.137.219  9/2/2024  \noiuiasdads.w8510.com  195.234.62.188  9/3/2024  \nplllkkoasdko.w8510.com  195.234.62.198  9/3/2024  \npoiaqqrjk.w8510.com  195.234.62.192  9/3/2024  \npojkkaka.w8510.com  45.10.58.130  9/3/2024  \npoooooiioasd.w8510.com  37.61.229.17  9/3/2024  \nppppoiiua.w8510.com  92.38.185.44  9/3/2024  \nqacassdfawemp.w8510.com  155.138.133.56  9/4/2024  \nqmmklou.w8510.com  45.92.70.68  9/3/2024  \nqwertdvvaaz.w8510.com  45.135.117.136  9/3/2024  \nssacawfafwa.w8510.com  45.10.58.132  9/3/2024  \ntestate.w8510.com  207.148.68.131  8/30/2024  \ntestateone.w8510.com  108.61.177.81  9/3/2024  \ntuisasdcxzd.w8510.com  78.141.238.97  8/29/2024  \nuqooapp.w8510.com  85.90.216.112  9/3/2024  \n\n \n  Page 9 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n uuiyiyasd.w8510.com  92.38.185.47  9/3/2024  \nwmllxwkg.w8510.com  45.77.231.209  9/3/2024  \nzasdfgasd.w8510.com  65.20.97.251  9/3/2024  \nzda4g4.w8510.com  91.216.190.154  9/3/2024  \nzda896.w8510.com  45.13.199.152  9/3/2024  \nzda9ol.w8510.com  91.216.190.247  9/3/2024  \nzdaaac.w8510.com  5.181.27.6  9/1/2024  \nzdaasdafq.w8510.com  45.80.215.156  9/3/2024  \nzdabnv.w8510.com  23.236.68.161  9/3/2024  \nzdacasc.w8510.com  45.80.215.150  9/2/2024  \nzdacasdc.w8510.com  195.234.62.19  9/3/2024  \nzdacawca.w8510.com  45.13.199.84  8/28/2024  \nzdacccz.w8510.com  5.181.27.21  8/23/2024  \nzdacppao.w8510.com  45.13.199.140  9/2/2024  \nzdacscswc.w8510.com  89.44.198.195  8/30/2024  \nzdacvb.w8510.com  23.236.69.110  9/3/2024  \nzdacvbzzs.w8510.com  45.13.199.104  9/3/2024  \nzdacwaca.w8510.com  45.80.215.153  9/2/2024  \nzdacwrf.w8510.com  45.92.70.111  9/1/2024  \nzdacx46.w8510.com  23.236.68.213  8/24/2024  \nzdacxdawdas.w8510.com  45.13.199.45  8/28/2024  \nzdacxzd.w8510.com  89.44.198.200  9/2/2024  \nzdaczcaaw.w8510.com  45.80.215.151  8/30/2024  \n\n \n  Page 10 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n zdaczcvs1.w8510.com  92.38.176.156  7/22/2024  \nzdaczsc.w8510.com  45.92.70.113  8/13/2024  \nzdaczvs.w8510.com  45.80.215.149  9/2/2024  \nzdaczxc1.w8510.com  23.236.68.193  9/4/2024  \nzdafaa.w8510.com  91.216.190.74  9/3/2024  \nzdamkl.w8510.com  5.181.27.19  9/2/2024  \nzdaplm.w8510.com  45.92.70.115  8/28/2024  \nzdapoi.w8510.com  45.80.215.152  9/2/2024  \nzdapoq.w8510.com  45.13.199.96  9/2/2024  \nzdaqggh.w8510.com  23.236.69.82  9/1/2024  \nzdaqwfasf.w8510.com  45.92.70.112  8/31/2024  \nzdavva.w8510.com  195.234.62.18  8/27/2024  \nzdaxcxzc.w8510.com  91.216.190.80  9/2/2024  \nzdazzz.w8510.com  45.13.199.207  8/29/2024  \nzdcacaw.w8510.com  45.80.215.155  8/31/2024  \nzdcawca.w8510.com  45.80.215.154  8/25/2024  \nzdpoa.w8510.com  89.44.198.254  9/3/2024  \nzdpog.w8510.com  45.80.215.47  9/3/2024  \nzdqqqqwe.w8510.com  91.216.190.2  9/2/2024  \nzdzvbs.w8510.com  23.236.68.229  9/3/2024  \nzzxnjiq.w8510.com  85.90.216.111  9/3/2024  \nzzzcmsq.w8510.com  5.45.184.68  9/2/2024  \n\n \n  Page 11 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n Appendix  B: Observed CVEs  \nIntegrity Tech relied on the following vulnerabilities to acquire new botnet victims and allow botnet users to \nexploit further victims through the compromised botnet de vices.   \nTable 5: CVEs exploited to add devices to botnet  and exploit further victims  \nCVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2024 -\n5217  ServiceNow  Now Platform  Washington DC, Vancouver, \nand earlier Now Platform \nreleases  RCE \nCVE-2024 -\n4577  PHP Group  PHP PHP versions 8.1.* before \n8.1.29, 8.2.*  before 8.2.20, \n8.3.* before 8.3.8, when \nusing Apache and PHP -CGI on \nWindows  OS command \ninjection  \nCVE-2024 -\n29973  Zyxel  NAS326  \nNAS542  NAS326 firmware versions \nbefore V5.21(AAZF.17)C0 and \nNAS542 firmware versions \nbefore V5.21(ABAG.14)C0  OS command \ninjection  \nCVE-2024 -\n29269  Telesquare  TLR-2005Ksh  1.0.0 and 1.1.4  Arbitrary system \ncommands  \nCVE-2024 -\n21762  Fortinet  FortiOS  FortiOS 7.4.0 through 7.4.2, \n7.2.0 through 7.2.6, 7.0.0 \nthrough 7.0.13, 6.4.0 through \n6.4.14, 6.2.0 through 6.2.15, \n6.0.0 through 6.0.17,  RCE \nFortiProxy  FortiProxy versions 7.4.0 \nthrough 7.4.2, 7.2.0 through \n7.2.8, 7.0.0 through 7.0.14, \n2.0.0 through 2.0.13, 1.2.0 \nthrough 1.2.13, 1.1.0 through \n1.1.6, 1.0.0 through 1.0.7  \nCVE-2023 -\n50386  Apache  Solr 6.0.0 through 8.11.2, 9.0.0 \nbefore 9.4.1  Unrestricted file \nupload  \nCVE-2023 -\n47218  QNAP  QTS \nQuTS hero  \nQuTScloud  QTS 5.1.x before 5.1.5.2645 \nbuild 20240116,  \nQuTS hero h5.1.x before \nh5.1.5.2647 build \n20240118,  \nQuTScloud c5.x before \nc5.1.5.2651  OS c ommand \ninjection  \n\n \n  Page 12 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n CVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2023 -\n46747  F5 F5 Big -IP Big-IP (all modules) 17.1.0 -\n17.1., 16.1.0 -16.1.4, 15.1.0 -\n15.1.10, 14.1.0 -\n14.1.5,13.1.0 -13.1.5  Authentication bypass  \nCVE-2023 -\n46604  Apache  Apache ActiveMQ  before 5.15.16, 5.16.7, \n5.17.6, or 5.18.3  RCE \nCVE-2023 -\n43478  Telstra  Smart Modem \nGen 2  Firmware versions  before \n0.18.15r  Code execution as \nroot \nCVE-2023 -\n4166  Tongda OA  Tongda2000  11.10  SQL injection  \nCVE-2023 -\n38646  Metabase  Metabase and \nMetabase  \nEnterprise  Metabase before 0.46.6.1, \nMetabase Enterprise before \n1.46.6.1  Arbitrary command \nexecution    \nCVE-2023 -\n3852  OpenRapid  Yuque Rapid CMS  Up to version 1.3.1  Arbitrary file upload  \nCVE-2023 -\n38035  Ivanti  MobileIron Sentry \n(MICS Admin \nPortal)  9.18.0 and below  Authentication bypass  \nCVE-2023 -\n37582  Apache  Rocket MQ 5.1.1  Remote command \nexecution  \nCVE-2023 -\n36844  Juniper  Juniper Junos  20.4, 21.1, 21.2, 21.3, 21.4, \n22.1, 22.2 , 22.3,  22.4  PHP external v ariable \nmodification  \nCVE-2023 -\n36542  Apache  Apache NiFi  0.0.2 through 1.22.0  Code injection  \nCVE-2023 -\n35885  CloudPanel  CloudPanel 2  before 2.3.1  Insecure file -manager \ncookie authentication  \nCVE-2023 -\n35843  NocoDB  NocoDB  Through 0.106.0 (or 0.109.1)  Path traversal  \nCVE-2023 -\n3519  Citrix  Netscaler \nGateway, \nApplication \nDelivery \nController (ADC)  12.1 -NDcPP before 55.297, \n12.1 -FIPS before 55.297, \n13.1 -FIPS before 37.159, \n13.0 before 91.13, 13.1 \nbefore 49.13  Unauthenticated \nremote code \nexecution  \nCVE-2023 -\n35081  Ivanti  Endpoint \nManager Mobile \n(EPMM)  11.10x<11.10.0.3 , \n11.9x<11.91.2, and \n11.8<11.8.12  Path traversal  \nCVE-2023 -\n34960  Chamilo  Chamilo  v1.11.* up to v1.11.18  Command injection  \nCVE-2023 -\n34598  Gibbonedu  Gibbon  25.0.00  Local File Inclusion \n(LFI) vulnerability  \n\n \n  Page 13 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n CVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2023 -\n3368  Chamilo  Chamilo LMS  <= v1.11.20  Command injection \nleading to remote \ncode execution (RCE)  \nBypass of CVE -2023 -\n34960  \nCVE-2023 -\n33510  WordPress  Jeecg P3 Bix Chat  Jeecg P3 Biz Chat Project \nJeecg P3 Biz Chat 1.0.5  Allows remote \nattackers to read \narbitrary files  \nCVE-2023 -\n30799  MikroTik  MikroTik \nRouterOS  Stable before 6.49 .7 and \nlong-term through 6.48.6  Privilege escalation  \nCVE-2023 -\n28771  Zyxel  ZyWALL/USG \nseries  ZyWALL/USG  ZLD 4.60 t o \n4.73, VPN ZLD 4.60 to 5.35, \nUSG FLEX ZLD 4.60 t o 5.35,  \nATP ZLD 4.60 t o 5.35  OS command \ninjection  \nCVE-2023 -\n28365  Ubiquiti  UI UniF i 7.3.83 and earlier  Back up file  \nvulnerability  \nCVE-2023 -\n27997  Fortinet  FortiOS  FortiOS version 7.2.4 and \nbelow, version 7.0.11 and \nbelow, version 6.4.12 and \nbelow, version 6.0.16 and \nbelow  Buffer overflow   \nFortiProxy  FortiProxy 7.2.3 and below, \n7.0.9 and below, 2.0.12 and \nbelow, 1.2 all versions, 1.1 all \nversions  \nCVE-2023 -\n27524  Apache  Apache Superset  Versions up to and including \n2.0.1.  Authenticate and \naccess unauthorized \nresources  \nCVE-2023 -\n26469  Jorani  Jorani  1.0.0  Path traversal to RCE  \nCVE-2023 -\n25690  Apache  Apache HTTP \nServer  2.4.0 through 2.4.55  HTTP r equest \nsmuggling  \nCVE-2023 -\n24229  DrayTek  Vigor2960  Firmware v1.5.1.4  \nNo longer supported by \nmaintainer  Command injection  \nCVE-2023 -\n23333  Contec  SolarView \nCompact  Firmware through 6.00  Command injection  \nCVE-2023 -\n22527  Confluence  Data Center and \nServer  < 8.5.5 (LTS)  \n< 8.7.2 (Data Center Only)  Template injection \nleading to RCE  \n\n \n  Page 14 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n CVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2023 -\n22515  Confluence  Data Center and \nServer  >=8.0.0, >= 8.1.0, >=8.2.0, \n>=8.30 to <8.3.3, >=8.4.0 to \n<8.4.3, >=8.5.0 to <8.5.2  Privilege escalation  \nCVE-2022 -\n42475  Fortinet  FortiOS  FortiOS SSL -VPN 7.2.0 \nthrough 7.22, 7.00 through \n7.0.8, 6.4.0 through 6.4.10, \n6.2.0 through 6.211, 6.0.15 \nand earlier  Buffer overflow   \nFortiProxy  FortiProxy SSL VPN 7.2.0 \nthrough 7.2.1, 7.0.7 and \nearlier.  \nCVE-2022 -\n40881  Contec  SolarView  \nCompact  Firmware 6.00  Command injection  \nCVE-2022 -\n3590  WordPress    WordPress  WordPress 4.1  Unauthenticated blind \nSSRF in the pingback \nfeature  \nCVE-2022 -\n31814  Netgate  pfSense \npfBlockerNG  Through 2.1.4_26  OS command \ninjection  \nCVE-2022 -\n30525  Zyxel  USG FLEX,  ATP, \nand VPN series \nfirmware  USG FLEX \n100(W) /200/500/700 ZLD  \n5.00 through 5.21 Patch 1, \nUSG FLEX 50(W) /USG20(W) -\nVPN ZLD  5.10 through 5.21 \nPatch 1, ATP series ZLD 5.10 \nthrough 5.21 Patch 1,  \nVPN series ZLD 4.60 through \n5.21 Patch 1  OS command \ninjection  \nCVE-2022 -\n26134  Atlassian  Confluence Data \nCenter  7.18.0  OGNL Injection  \nConfluence \nserver  \nCVE-2022 -\n20707  Cisco  Small Business \nSeries Routers  RV160, RV260, RV340, and \nRV345  RCE \n\n \n  Page 15 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n CVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2022 -\n1388  F5 BIG-IP 16.1.x versions prior to \n16.1.2.2,  \n15.1.x versions prior to \n15.1.5.1,  \n14.1.x versions prior to \n14.1.4.6,  \n13.1.x versions prior to \n13.1.5,  \nall 12.1.x and 11.6.x versions  Authentication bypass  \nCVE-2021 -\n46422  Telesquare  SDT-CW3B1  1.1.0  OS command \ninjection  \nCVE-2021 -\n45511  NETGEAR  NETGEAR  AC2100 before 2021 -08-27, \nAC2400 before 2021 -08-27, \nAC2600 before 2021 -08-27, \nD7000 before 2021 -08-27, \nR6220 before 2021 -08-27, \nR6230 before 2021 -08-27, \nR6260 before 2021 -08-27, \nR6330 before 2021 -08-27, \nR6350 before 2021 -08-27, \nR6700v2 before 2021 -08-27, \nR6800 before 2021 -08-27, \nR6850 before 2021 -08-27, \nR6900v2 before 2021 -08-27, \nR7200 before 2021 -08-27, \nR7350 before 2021 -08-27, \nR7400 before 2021 -08-27, \nR7450 before 2021 -08-27 Authentication bypass   \nCVE-2021 -\n44228  Apache  Log4j2  2.0-beta9 through 2.15.0 \n(excluding security releases \n2.12.2, 2.12.3, and 2.3.1)  Input validation code \nexecution  \nCVE-2021 -\n36260  Hikvision   Web servers \nfirmware  Various DS-2CD, DS-2X, D S-\n2DY, PTZ -N, DS-2DF, DS-2TD, \nIDS, DS-76, D S-71  Command injection  \n\n \n  Page 16 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n CVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2021 -\n28799  QNAP Systems \nInc. Hybrid Backup \nSync (HBS) 3  versions prior to v16.0.0415 \non QTS 4.5.2;  \nversions prior to v3.0.210412 \non QTS 4.3.6;  \nversions prior to v3.0.210411 \non QTS 4.3.4;  \nversions prior to v3.0.210411 \non QTS 4.3.3;  \nversions prior to v16.0.0419 \non QuTS hero h4. 5.1;  \nversions prior to v16.0.0419 \non QuTScloud c4.5.1~c4.5.4  Improper \nauthorization  \nCVE-2021 -\n20090  Buffalo   \nArcadyan  Buffalo  WSR  \nArcadyan \nfirmware  WSR -2533DHPL2 firmware \nversion <= 1.02,  \nWSR -2533DHP3 firmware \nversion <= 1.24  Path traversal  \nCVE-2021 -\n1473  Cisco  Small Business \nRV Series \nRouters  RV340/RV340W, \nRV345/RV345P before \n1.0.03.21  OS command \ninjection  \nCVE-2021 -\n1472  Cisco  Small Business \nSeries Routers \nfirmware  RV160 , RV160W , RV260 , \nRV260P , RV260W , RV340 , \nRV340W , RV345 , RV345P  Arbitrary code \nexecution  \nCVE-2020 -\n8515  DrayTek  Vigor  Vigor2960 1.3.1_Beta, \nVigor3900 1.4.4_Beta, \nVigor300B 1.3.3_Beta, \n1.4.2.1_Beta, 1.4.4_Beta  RCE \nCVE-2020 -\n4450  IBM WebSphere \nApplication \nServer  8.5 and 9.0 traditional  Arbitrary code \nexecution  \nCVE-2020 -\n35391  Tenda  Tenda F3 \nFirmware  Tenda F3 Firmware \n12.01.01.48  Forced browsing  \n\n \n  Page 17 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n CVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2020 -\n3452  Cisco   Adaptive Security \nAppliance \n(ASA)  and \nFirepower Threat \nDefense (FTD) \nSoftware  ASA <9.6.4.42, <9.8.4.20, \n<9.9.2.74, <9.10.1.42, \n<9.12.3.12, <9.13.1.10, \n<9.14.1.10  \nFTD <6.2.3.16, <6.3.0.6, \n<6.4.0.10, <6.5.05, <6.6.0.1  Path traversal  \nCVE-2020 -\n3451  Cisco  Small Business \nSeries Routers \nFirmware  RV340W,  \nRV340,  \nRV345,  \nRV345P  \n  Multiple Security \nVulnerabilities  like \nBuffer overflow via \nenvironment \nvariables, server side \ninclude (SSI) injection  \nCVE-2020 -\n15415  DrayTek  Vigor Firmware  3900, 2960, and 300b  Command injection  \nCVE-2019 -\n7256  Linear eMerge  E3-Series  Nortekcontrol Lin ear Emerge \nEssential Firmware  \nNortekcontrol Linear Emerge \nElite Firmware  \n Command injection  \nCVE-2019 -\n19824  TOTOLINK \nRealtek  SDK based \nrouters  A3002Ru through 2.0.0, \nA702R through 2.1.3, \nN301Rt through 2.16, N302R \nthrough 3.4.0, N300Rt \nthrough 3.4.0, N200Re \nthrough 4.0.0, N150Rt \nthrough 3.4.0, N100Re \nthrough 3.4.0, N302RE \nthrough 2.0.2  OS command \ninjection  \n\n \n  Page 18 of 18  |  Product ID : JCSA -20240918 -001  \nTLP:CLEAR  \n \n \nTLP:CLEAR  \n CVE Vendor  Product  Versions affected  Vulnerability type  \nCVE-2019 -\n17621  D-Link  DIR-859 Wi -Fi \nrouter 1.05 and \n1.06B01 Beta01  DIR-818Lx Bx \n<=v2.05b03_Beta08, DIR-\n822 Bx <=v2.03b01, DIR -822 \nCx <=v3.12b04, DIR -823 Ax \n<=v1.00b06_Beta, DIR -859 \nAx <=v1.06b01Beta01, DIR -\n868L Ax <=v1.12b04, DIR -\n868L Bx <=v2.05b02, DIR -\n869 Ax <=v1.03b02Beta02, \nDIR-880L Ax <=v1.08b04, \nDIR-890L/R Ax \n<=v1.11b01_Beta01, DIR -\n885L/R Ax <=v1.12b05, DIR -\n895L/R Ax <=v1.12b10   OS command \ninjection related to \nUPnP service  \nCVE-2019 -\n12168  Four -Faith  Four -Faith \nWireless Mobile \nRouter F3x24  Firmware 1.0  \n RCE via command \nshell  \nCVE-2019 -\n11829  Microsoft   Windows 10   \nServer 2016  Server 2016  \n1607  \n1703  OS command \ninjection  \nCVE-2018 -\n18852  Cerio   \n Cerio Dt -300N \nFirmware  \nCerio Dt -300n  DT-300N 1.1.6 through \n1.1.12 devices  OS command \ninjection  \nCVE-2017 -\n7876  QNAP  \n QTS   QTS 4.2.6 before build \n20170517, QTS 4.3.3.0174 \nbefore build 20170503  Command injection  \nCVE-2015 -\n7450  IBM Tivoli Common \nReporting  3.1.0.2 , 3.1, 3.1.2 , 3.1.2.1 , \n2.1, 2.1.1.2 , 3.1.0.1 , 2.1.1 ,  Code injection  \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-prc-linked-actors-botnet",
  "source": "nsa",
  "id": "9ef08bcc9f4897eb440802cca11e16213a0ed6cc8ba08d52f7a7a136c2329d98"
}