{
  "markdown": " \n \nU/OO/152674 -19          PP-19-0605           JUNE  2019  PATCH REMOTE DESKTOP SERVI CES ON LEGACY \nVERSIONS OF WINDOWS   \nDISCUSSION  \nThe National Security Agency is urging Microsoft Windows administrators and users to ensure they are using a patched \nand updated system in the face of growing threats.  Recent warnings by Microsoft1 stressed the importance of installing \npatches to address a vulnerability in older versions of Windows.  Microsoft has warned that this flaw is potentially \nwormable,  meaning it could spread without user interaction across the internet.  We have seen devastating computer \nworms inflict damage on unpatched systems with wide -ranging impact, and are seeking to motivate increased protections \nagainst this flaw.  \nCVE-2019 -0708, dubbed BlueKeep, is a vulnerability in Remote Desktop Services (RDS) on legacy versions of the \nWindows2 operating system.  T he following versions of Windows  are affected:  \n Windows  XP \n Windows Server 2003  \n Windows Vista  \n Windows Server 2008  \n Windo ws 7  \n Windows Server 2008 R2  \n \nAlthough Microsoft has issued a patch, potentially millions of machines are still vulnerable.   This is the type of vulnerability \nthat malicious cyber actors frequently exploit through the use of software code that specificall y targets the vulnerability.  \nFor example, the vulnerability could be exploited to conduct denial of service attacks.  It is likely only a matter of time \nbefore remote exploitation  tools  are widely available for this vulnerability.  NSA is concerned that m alicious cyber actors \nwill use the vulnerability in ransomware and exploit kits containing other known exploits, increasing capabilities against \nother unpatched systems.  \nMITIGATION ACTIONS  \nNSA urges everyone to invest the time and resources to know your ne twork and run supported operating systems with the \nlatest patches.  This is critical not just for NSAs protection of National Security Systems but for all networks.  \nTo address CVE-2019 -0708  immediately a pply the following patches for each respective affe cted version of the \nWindows operating system:   \n Windows XP / Windows  Server  2003  Security Patch KB4500331  \n Windows Vista / Windows  Server  2008  Security Patch KB4499180 OR Monthly Rollup KB4499149  \n Windows 7 / Windows  Server  2008 R2  Security Patch  KB4499175 OR Monthly Rollup KB4499164  \n                                                \n1 https://blogs.technet.microsoft.com/msrc/2019/05/30/a -reminder -to-update -your-systems -to-prevent -a-worm/   \n2 Windows and Windows Server ar e registered trademarks of the Microsoft Corporation  \n\n \n \n 2 U/OO/152674 -19          PP-19-0605           JUNE 2019  \n  \n \nIn order to increase resilience against this threat while large networks patch and upgrade, there are additional measures \nthat can be taken  as described in  the Microsoft CVE -2019 -0708 security advisory3: \n Block TCP Port 3389 at your firewalls, especially any perimeter firewalls exposed to the internet.  This port is \nused by the Remote Desktop Protocol ( RDP ) and will block attempts to establish a connection.  \n Enable Network Level Authentication.  With NLA enabled, atta ckers would first have to authenticate to RDS in \norder to successfully exploit the vulnerability. NLA is available on the Windows 7, Windows Server 2008 and \nWindows Server 2008 R2 operating systems.  \n Disable remote Desktop Services if they are not requir ed.  Disabling unused and unneeded services helps reduce \nexposure to security vulnerabilities overall and is a best practice even without the BlueKeep threat.   \n \nNote that Windows 10  systems  are already protected from this vulnerability,  as it only affect s the older  versions of \nWindows listed above.  \nDISCLAIMER OF ENDORSEM ENT \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or  \nOtherwise,  does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement purposes . \nCONTACT  \nCybersecurity Requirements Center  \n410-854-4200  \nCybersec urity_Requests@nsa.gov  \n                                                \n3 https://portal.msrc.microsoft.com/en -US/security -guidance/advisory/CVE -2019 -0708   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-bluekeep_20190604",
  "source": "nsa",
  "id": "3100c8e609760860e086b02fd8dbc70c27d7196affe0de0cdd1c0c6f784467bf"
}