{
  "markdown": " \n \n     \n VULNERABILITIES  AFFECTING  MODERN  \nPROCESSORS  \nDISCUSSION  \nThree vulnerabilities affecting modern Intela [1], AMDb [2], and ARMc processors have been disclosed. CVE3-2017 -5753 \n(bounds check bypass) and CVE -2017 -5715 (branch target injection), also known as Spectre[4], have been confirmed to \naffect Intel, AMD, and ARM processors. CVE -2017 -5754 (rogue data cache load), also known as Meltdown[4], has been \nconfirmed to affect Intel processors. The vulnerabilities could be leveraged to read privileged system memory from an \nunprivileged context. The vulnerable process ors are present in systems widely used across the Department of Defense \n(DoD). Software patches have been released by vendors to mitigate the hardware vulnerabilities . \nMITIGATION  ACTIONS  \nThere are no fundamental hardware mitigations available to fix the associated architectural vulnerabilities, so software \npatches must be applied. Install patches and upgrade to new software versions that mitigate the vulnerabilities as those \npatches and software become available. Firmware patches are pending release from Original Equipment Manufacturers \n(OEMs).  \nOPERATING SYSTEMS  \nWindows  \nMicrosoftd released an advisory[5] and guidance[6] for Spectre and Meltdown. Install patches for Windows 10 and \nWindows Server 2016 released on January 3, 2018. Install patch 4056892[7] for Windows 10 1709. Install patch 4056891[8] \nfor Windows 10 1703. Install patch 4056890[9] for Windows 10 1607 and Windows Server 2016. Install patch 4056888[10] \nfor Windows 10 1511. Install patch 4056893[11] for Windows 10 1507. Install all patches released  during the January 2018 \nPatch Tuesday, when made available on or around January 9, to mitigate other Windows operating systems.  \n \n                                                \n1 Intel Responds to Security Research Findings. https://newsroom.intel.com/news/intel -responds -to-security -research -findings/  \n2 An Update on AMD Processor Security. https://www.amd.com/en/corporate/specu lative -execution  \n3 CVE is a registered trademark of The MITRE Corporation  \n4 Spectre and Meltdown Attacks. https://spectreattack.com/ and https://meltdownattack.com/  \n5 ADV180002 | Guidance to mitigate speculative execution side -channel vulnerabilities. https://portal.msrc.microsoft.com/en -us/security -guidance/advisory/ADV180002  \n6 Windows Client Guidance for IT Pros to protect against speculative execution side -channel vulnerabilities. https://support.microsoft.com/en -us/help/4073119/windows -client -guidan ce-\nfor-it-pros-to-protect -against -speculative -exe \n7 https://support.microsoft.com/en -us/help/4056892  \n8 https://support.microsoft.com/en -us/help/4056891  \n9 https://support.microsoft.com/en -us/help/4056890  \n10 https://support.microsoft.com/en -us/help/4056888  \n11 https://support.microsoft.com/en -us/help/4056893  \n\n \n \n          \n U/OO/101375 -18         PP-18-0006           4 JANUARY  2018  \n  \n \nInstallation of the applicable patch may result in operating system stability issues due to antivirus applications that make \nunsupported calls into kernel memory. Due to the stability issue, the patch will not install until a specific registry value \nexists  on a system[12]: \nKey: HKLM \\SOFTWARE \\Microsoft \\Windows \\CurrentVersion \\QualityCompat  \nValue Name: cadca5fe -87d3 -4b96 -b7fb-a231484277cc  \nValue Type: REG_DWORD  \nValue Data: 0  \n \nContact antivirus vendors to confirm whether a specific antivirus product is compatible  with the patch. The registry value \nmay be created by installation of an antivirus product update. The registry value can also be deployed enterprise wide \nusing Group Policy Registry Preferences if the antivirus product in use is known to be  compatible wit h the patch.  \nSee McAfee KB90167[13] for more information about McAfee product minimum version requirements affecting Host Based \nSecurity System (HBSS) deployments in DoD. See Symantec TechNote TECH248545[14] for more information about \nSymantec Endpoint Protection product minimum version requirements.  \nLinux e \nUpgrade to Linux kernel 4.14.11 released on January 3, 2018 which has Kernel Page -Table Isolation (KPTI), previously \nknown as KAISER, patches incorporat ed. Linux kernel version 4.15 released on or around January 21 , 2018  also \nincorporates the KPTI patches.  \nmacOS f \nUpgrade to macOS 10.13.2 High Sierra released on December 6, 2017[15]. Upgrade to 10.13.3, when made avail able, for \na complete mitigation . \nAndr oid g \nInstall patch 2018 -01-05 on Android -based devices[16]. \nChrome OS h \nUpgrade to Chrome OS 63 and above released on December 15, 2017[17]. \nBROWSERS  \nEdge i and Internet Explorer  j \nInstall previously mentioned patches for Windows 10 and Windows Server 2016 as well as all patches released for the \nJanuary 2018 Patch Tuesday[18]. \n                                                \n12 Important information regarding the Windows security updates released on January 3, 2018 and anti -virus software. https://support.microsoft.com/en -us/help/4072699  \n13 Meltdown and Spectre  Microsoft update (January 3, 2018) compatibility issue with anti -virus products. https://kc.mcafee.com/corporate/index?page=content&id=KB90167  \n14 Blue Screen of Death with Stop Code: MEMORY_MANAGEMENT (0x1a) After Applying Windows Security Updates from 01/03/2018. \nhttps://support.symantec.com/en_US/article.TECH258545.html  \n15 About the security content of macOS High Sierra 10.13.2, Security Update 2017 -002 Sierra, and Security Update 2017 -005 El Capitan. https://support.apple.com/en -us/HT208331  \n16 Android Security Bull etin - January 2018. https://source.android.com/security/bulletin/2018 -01-01 \n17 Googles Mitigation Against CPU Speculative Execution Attack Methods. https://support.google.com/faqs/answer/7622138  \n18 Mitigating speculative execution side -channel attacks in M icrosoft Edge and Internet Explorer. https://blogs.windows.com/msedgedev/2018/01/03/speculative -execution -mitigations -\nmicrosoft -edge -internet -explorer/  \n\n \n \n          \n U/OO/101375 -18         PP-18-0006           4 JANUARY  2018  \n  \n \nChrome k \nUpgrade to Chrome 64 when released on or around January 23, 2018. The Site Isolation[19] feature, introduced in Chrome \n63, can also be used as a mitigation but may cause 10 -20% more memory usage and some sites may not work correctly. \nVisit chrome://flags#enable -site-per-process in the browser, click Enable next to Strict site isolation, and r estart the \nbrowser[20]. Site Isolation can also be configured via enterprise policy[21] using the latest policy templates[22]. \nFirefox l \nUpgrade to at least Firefox 57 released on November 14, 2017[23]. \nVIRTUALIZATION   \nVMware m \nUpgrade ESXi 6.5 to patch ESXi 650-201712101 -SG, Upgrade ESXi 6.0 to patch ESXi600 -201711101 -SG. Upgrade ESXi \n5.5 to ESXi550 -201709101 -SG. Note that ESXi 5.5 will remain vulnerable CVE -2017 -5753. Customers running ESXi 5.5 \nshould consider upgrade 6.0 or 6.5 with the patches applied for a complete mitigation. VMware Workstation 14 is not \naffected. Upgrade to VMware  Workstation 12 to 12.5.8 on all operating systems. VMware Fusion 10 is not affected. \nUpgrade VMware Fusion 8 to 8.5.9 on macOS[24]. \nXen n \nMitigations for Xen are in development [25]. No mitigation is currently available for CVE -2017 -5753 (bounds check bypass). \nNo mitigation is currently available for CVE -2017 -5715 (branch target injection), but a patch is being developed. Run \nguests in HVM or PVH mode to mitigate CVE -2017 -5754 (rogue data cache load).  \nAPPLICABILITY  \nThis Advisory is issued under the authority defined in National Security Directive 42[26] and applies to all Executive \nDepartments and Agencies, and to all U.S. Government contractors and agents who operate or use Nati onal Security \nSystems (NSS) as defined in CNSS 4009[27]. \nDISCLAIMER OF ENDORS EMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial products, p rocess, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement p urposes.  \n                                                \n19 Site Isolation. http://www.chromium.org/Home/chromium -security/site -isolation  \n20 Increase security with  site isolation. https://support.google.com/chrome/answer/7623121  \n21 Chrome Policies. https://www.chromium.org/administrators/policy -list-3#SitePerProcess  \n22 Chrome Policy Templates. https://dl.google.com/dl/edgedl/chrome/policy/policy_templates.zip  \n23 Mitiga tions landing for new class of timing attack. https://blog.mozilla.org/security/2018/01/03/mitigations -landing -new-class -timing -attack/  \n24 VMSA -2018 -0002 VMware ESXi, Workstation and Fusion updates address side -channel analysi s due to speculative execution.  https://www.vmware.com/us/security/advisories/VMSA -\n2018 -0002.html  \n25 Xen XSA -254. https://xenbits.xen.org/xsa/advisory -254.html  \n26 National Security Directive 42, National Policy for the Security of National Security Telecommunications and Information Sys tems, dated July 5, 1990.  \n27 CNSS Instruction No. 4009, National Information Assurance Glossary, dated April 6, 2015.  \n\n \n \n          \n U/OO/101375 -18         PP-18-0006           4 JANUARY  2018  \n  \nCONTACT  INFORMATION  \nFor further information about this product, please contact:  \nClient Requirements or General  Cybersecurity  Inquiries  \nCybersecurity Requirements Center  \n410-854-4200  \nEmail: Cybersecurity_Requests@nsa.gov  \nTRADEMARK INFORMATIO N \na. Intel is a registered trademark of Intel Corporation  \nb. AMD is a registered trademark of Advanced Micro Devices, Inc.  \nc. ARM is a registered trademark of Arm  Limited Soft Bank Group  \nd. Microsoft is a registered trademark of Microsoft Corp.  \ne. Linux is a registered trademark of Linux Torvolds  \nf. macOS is a trademark of Apple, Inc.  \ng. Android is a trademark of Google, Inc.  \nh. Chrome OS is a trademark of Google, Inc.  \ni. Microsoft Edge is a trademark of Microsoft Corp.  \nj. Internet Explorer is a trademark of M icrosoft Corp.  \nk. Chrome is a trademark of Google, Inc.  \nl. Firefox is a registered trademark of the Mozilla Foundation  \nm. VMware is a registered trademark of VMware, Inc.  \nn. Xen is a registered trademark of Citrix  \n \n\n",
  "cves": [],
  "techniques": [
    "T2083"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa-vulnerabilities-affecting-modern-processors",
  "source": "nsa",
  "id": "ba8e32f89e18eb1325ca38fb572d9ff5158f78c95d75093a6fe4e2161ee40267"
}