{
  "markdown": " \n \n1  MITIGATIONS FOR KEY REINSTALLATION ATTAC KS \nAGAINST WI -FI PROTECTED ACCESS II (WPA2)   \nDISCUSSION  \nOn October 16, 2017, a vulnerability in the Wi -Fi Protected Access II (WPA2) mechanism used for authentication and \nsession key agreement was released. [1,2]  The vulnerability affects the following WPA2 handshakes: the Four -way, Group \nKey, Fast BSS Transitio n (FT), Peerkey, Tunneled Direct -Link Setup (TDLS), and Wireless Mesh Network (WMN) Sleep \nMode Response handshakes.  \nThe attacker must be within wireless communications range of the device being attacked in order to manipulate and \nreplay handshake messages  to force the attacked device to reinstall the previously installed key. The key reinstallation \nresets the nonce and replay counters, which violates an important security tenet of stream ciphers: a nonce must be a \nnon-repeating value. The key and nonce reu se does not result in recovery of the actual session key, but results in the \nreuse of the same derived keystream.  \nAll Wi -Fi capable devices are affected, however, the severity of the impact changes depending on the handshake type, \nconfidentiality protocol,  and the operating system. For example, for the Four -way or Fast BSS handshake using Advanced \nEncryption Standard  Counter Mode with Cipher Block Chaining Message Authentication Code Protocol (AES -CCMP), \nthe attacker would be able to replay and decrypt so me traffic.  For those same handshakes using TKIP or Advanced \nEncryption Standard  Galois/Counter Mode Protocol (AES -GCMP), the attacker would be able to replay, decrypt traffic, \nand inject arbitrary packets.  For wpa_supplicant versions 2.4, 2.5 and 2.6,  rather than reinstalling the previously installed \nkey, the attack sets the key to all zeros.  \nMITIGATION ACTIONS  \n Install patches to both the clients and Access Systems as soon as they are made available. [3,4,5 ] \nRelevant CVEs [2]: CVE -2017 -13077, CVE -2017 -13078, CVE -2017 -13079, CVE -2017 -13080, CVE -2017 -13081, CVE -\n2017 -13082, CVE -2017 -13084, CVE -2017 -13086, CVE -2017 -13087, and CVE -2017 -13088.  \n Disable Fast BSS Transition on Access Systems until patches are available to prevent the FT handshake attack.  \n Temporar ily use only AES-CCMP until patches are available.  \n Install an underlying virtual private network until patches are available.  \n Do not use modes requiring generation of a Peerkey.  \nREFERENCES  \n[1] Mathy Vanjoef and Frank Piessens. 2017. Key Reinstallation At tacks: Breaking WPA2 by forcing nonce reuse. \nwww.krackattacks.com . \n[2] CERT/CC. 20 17. Vulnerability Note VU#228519 :Wi-Fi Protec ted Access (WPA) Handshake Traffic Can Be \nManipulated to Induce Nonce and Session Key Reuse . www.kb.cert.org/vuls/id/228519 . \n[3] Aruba Networks1. 2017. Aruba Product Security Advisory. Advisory ID: Aruba -PSA-2017 -007. \nwww.arubanetworks.com/assetts/alert/aruba -psa-201-007.txt .  \n[4] Cisco2. 2017. Multiple Vulnerabilities in Wi -Fi Protected Access and Wi -Fi Protected Access II. \ntools.cisco.com/security/center/content/ciscosecurityadvisory/cisco -sa-20171016 -wpa \n                                                \n1 Aruba Networks  is a registered trademark of Hewlett Packard Enterprise Development LP  \n2 Cisco is a registered trademark of  Cisco  Systems, Inc.  \n\n \n \n2 U/OO/208765 -17          PP -17-0797          18 OCTOBER 2017   \n \n[5] Intel3. 2017. One or more Intel Products affected by the W -Fi Protected Access II (WPA2) protocol vulnerability.  \nsecurity -center.intel.com/advisory.aspx?intelid=intel -sa-00101&languageid=en -fr \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  \nReference herei n to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement purposes.   \nCONTACT INFORMATION  \nClient Requirements and General Cybersecurity Inquiries:  \n    Cybersecurity Requirements Center  \n    410-854-4200  \n    Email: Cybersecurity_Requests@nsa.gov  \n \n                                                \n3 Intel is a registered trademark of  Intel Corporation  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-mitigations-for-key-reinstallation-attacks-against-wifi-access-ii",
  "source": "nsa",
  "id": "800caee3644a9ea0cbe39cafc4417733f907b5515472a429bcdd8db4037aa17f"
}