{
  "markdown": " \n \n 1 CISCO1 SMART INSTALL PROTOC OL MISUSE  \nBLUF: Disable the Smart Install auto -loading feature on all network devices.  \nPURPOSE:   \nAdversaries are likely exfiltrating  copies of configuration files on internet accessible switches using the Cisco Smart Install \nfunctionality. This protocol exposes infrastructure devices to increased operational risk, which could compromise  device \nintegrity.  Malicious Smart Install  protoco l messages can allow an unauthenticated, remote attacker to change the startup -\nconfig file , force a reload of the device, load a new IOS image on the device, and execute high -privilege CLI commands \non switches running Cisco IOS and IOS XE Software . \nOPERAT IONAL SECURITY CONCE RN: \nThese configuration files allow an adversary to map and move laterally through the network.  An adversary can also \ndeploy modified IOS images and configuration changes to the switches.  A maliciously crafted IOS or altered configura tion \nfile will allow an adversary to further compromise the network. It is important to note that t his feature is enabled by default \non supported IOS images.  \nDETECTION:  \n Examine the output of  show vstack config | inc Role . The presence of Role: Client ( SmartInstall enabled) \nindicates that Smart Install is configured.  \n \n Examine the output of \" show tcp brief all \" and look for \"*: 4786 \". The Cisco Smart Install feature listens on \ntcp/4786.  \n \nNote: The commands above will indicate if the feature is enabled on the device and not that a device has been \ncompromised . \nMITIGATION ACTIONS:  \n Per DISA STIG rule: SV -3080r3_rule, configuration auto -loading feature must be disabled.  Therefore, Smart \nInstall must be disabled on all Cisco switches.  The command  no vstack  will disable the feature.  \n \n Review all Cisco switch configuration files for deviations from documented pre -existing configurations.  \n \n If a deny -by-default strategy is not already implemented at edge firewall devices, the layer -7 TFTP application, \nport udp/69,  and port tcp/4786 must  be denied.  \n \n  \n                                                \n1 Cisco and Cisco IOS are registered trademarks of Cisco Systems, Inc.  \n\n \n \n2 U/OO/801020 -17          PP -17-0595          7 AUGUST 2017  \n  \nREFERENCES:  \n     DISA STIG NET0760 SV -3080r3_rule: The Configuration auto -loading feature must be disabled  (28 April 2017)  \n     CISCO PISRT CISCO -sr-20170214 -smi: Cisco Smart Install Protocol Misuse (14 February 2017)  \nDISCLAIMER OF WARRANTIES AND ENDORSEMENT:  \nThe information and opinions contained in this document are provided \"as is\" and without any warrantie s or guarantees.  \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement purposes.  \nFOR FURTHER INFORMAT ION, PLEASE CONTACT:  \nClient Requirements or General Cybersecurity  Inquiries  \nCybersecurity Requirements Center   \n410-854-4200  \nemail: Cybersecurity_Requests @nsa.gov  \n \n \n\n",
  "cves": [],
  "techniques": [
    "T0760"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa-cisco-smart-install-protocol-misuse",
  "source": "nsa",
  "id": "4cc451b64196668f41d13ff2c75562d637f26a47d264ea6db2cbbe581f5db625"
}