{
  "markdown": " \n \n1  DOTNETNUKE REMOTE CO DE EXECUTION \nVULNERABILITY CVE1-2017 -9822   \nDISCUSSION  \nDotNetNuke2 (DNN), also known as DNN Evoq and DNN Evoq  Engage, is a web -based Content Management System \n(CMS) developed on the Microsoft3 .NET framework. DNN is a web application commonly deployed on local or cloud \nMicrosoft Internet Information Service (IIS) servers.  \nOn July 7, 2017, security researchers r evealed a vulnerability within DNN versions 5.2.0 through 9.1.0 that allows an \nattacker to forge valid DNN credentials and execute arbitrary commands on DNN web servers.  \nWeb-based applications, such as DNN, can be overlooked in routine patching since vulne rability scans may be unaware \nof their presence. Furthermore, administrators often postpone major version updates to web applications due to the \nfrequent user impact and incompatibility with customized features. Web applications are a frequent target for a ttackers \nand vulnerabilities can be exploited days or even hours after their release. For this reason, configuring web applications to  \nupdate automatically is imperative to secure web application servers.  \nThere are many web -based CMSs similar to DNN. Othe r common CMSs are WordPress4, Drupal5 and Joomla6. \nOrganizations should be aware of CMS instances within their purview (i.e., blog, wiki, etc.) and ensure adequate \nprocesses are in place for timely updates.   \nMITIGATION ACTIONS  \nThe most effective mitiga tion action is to update to the latest version of DNN, version 9.1.1, which is not vulnerable. A \nhotfix is available at dnnsoftware.com for older versions of DNN, but NSA recommends to only use the hotfix as a \ntemporary measure while migrating to the lates t version.  \nAdditionally, the DNN Corporation advocates the use of a scanning tool7 released by the DNN community that may help \nto identify sites that have been compromised by an attacker. While this tool may help to identify a compromised site, NSA \nalso r ecommends using other techniques such as comparing DNN instances against a known good baseline.  \nAPPLICABILITY  \nThis Advisory  is issued under the authority defined in National Security Directive 42 and applies to all Executive \nDepartments and Agencies, and to all U.S. Government contractors and agents who operate or use National Security \nSystems (NSS) as defined in CNSS 4009.  \n                                                \n1 CVE is a registered trademark of The MITRE Corporation  \n2 DotNetNuke is a registered trademark of the DNN Corporation  \n3 Microsoft is a registered trademark of the Microsoft Corporation  \n4 WordPress is a registered trademark of the WordPress Foundation  \n5 Drupal  is a registered trademark of Dries Buyteant  \n6 Jooml a is a registered trademark of the Open Source Matters, Inc.  \n7 https://github.com/DNNCommunity/SecurityAnalyzer/releases  \n\n \n \n2 U/OO/102315 -18          PP -18-0797          9 JANUARY 2018  \n DISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not  constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement purposes.   \nCONTACT INFORMATION  \nClient Requirements and General Cybersecurity Inqu iries:  \n    Cybersecurity Requirements Center  \n    410-854-4200  \n    Email: Cybersecurity_Requests@nsa.gov  \n \n  \n \n \n \n \n \n \n \n \n  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-dotnetnuke",
  "source": "nsa",
  "id": "000b0fecc3100eb9a926024cd27187c5934ef58ddce834aab2b1161459b9af49"
}