{
  "markdown": " \n   \n \nU/OO/124180 -19          PP -19-0284          MARCH 2019  \n 1 UPGRADE EARLIER VERS IONS OF SOLARIS TO 11.4  \nDISCUSSION  \nOperating systems and application software routinely receive security updates through new versions and intermediate \npatches. Applying these security updates in a timely manner reduces vulnerability exposure and maximizes software \nreliability and protections.  \nUpgrading Solaris1 to the latest version and applying the latest Support Repository Update (SRU) ensures these systems \nare running with the most up -to-date software that is currently available while providing access to new security and \ncompliance features. Solaris 11.4 was released on August 28, 2018 and the current SRU 6 was released on February \n19, 2019.  \nMITIGATION ACTION S \nUpgrade to Solaris 11.4 from earlier versions of Solaris and apply the latest Support Repository Update (SRU). Each \nSRU provides fixes and enhancements, and every third SRU contains critical fixes for multiple vulnerabilities, including \nthose documente d as Common Vulnerabilities and Exposure (CVE2) entries. More information on these critical patch \nupdates and the CVEs they address can be found at:  \nhttps://www.oracle. com/technetwork/topics/security/alerts -086861.html . \nFor guided instructions on upgrading from Solaris 11.3 to 11.4 see Oracles3 documentation at: \nhttps://docs.oracle.com/cd/E37838_01/pd f/E60977.pdf . \nFor guided instructions on how to apply Support Repository Updates see Oracles documentation at:  \nhttps://docs.oracle.com/cd/E53394_01/html/E54739/srus.html . \nMethods do not exist to upgrade earlier major versions of Solaris.  Instead, a  fresh installation of Solaris 11 must be \nperformed by using one of the installation options described at : \nhttps://docs.oracle.com/cd/E23824_01/html/E24456/gljhj.html  \nDISCLAIMER OF WAR RANTIES AND ENDORSEM ENT \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial product , process, or service by trade name, trademark, manufacturer, or  \notherwise,  does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be  used for advertising or  endorsement purpo ses. \n \n \n \n  \n                                                \n1 Solaris is a registered trademark of Oracle Corporation  \n2 CVE is a registered trademark of The MITRE Corporation  \n3 Oracle is a registered trademark of Oracle Corporation  \n\n \n \n 2 U/OO/124180 -19          PP -19-0284          MARCH 2019  \n NOTICE  \nThe information contained in this document was developed in the course of NSAs cybersecurity missions including its \nresponsibilities to identify and disseminate threats to national security systems and Department of Defense information \ntechnologies, develop and issue security implementation specifications for cybersecurity -enabled pr oducts, and to assist \nExecutive departments and agencies with operational security programs.   The information may be shared broadly to \nreach all appropriate stakeholders.  \nCONTACT  \nCybersecurity Requirements Center  \n410-854-4200  \nCybersecurity_Requests@nsa.go v \n \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-upgrade-solaris11-4",
  "source": "nsa",
  "id": "d3afee957b2fd0eaaec6e2db80223f1dbf00d8ca7587124ea7fb072565e5bcb4"
}