{
  "markdown": " \n \n 1 RSA SECURID TOKEN AU THENTICATION AGENT \nVULNERABILITIES   \nDISCUSSION  \nA recent error handling vulnerability has been discovered in two RSA1 (Rivest Shamir Adleman ) Authentication Agent \ntoolkits and in one Authentication Agent product. This vulnerability can result in authentication bypass and affects a limite d \nnumber of applications. These toolkits and product are used to deploy RSA SecurID Token Authentication to au thenticate \nusers to workstations, web servers, and network devices.  \nThe RSA Authentication Agent Software Development Kit (SDK) for C version 8.5 and RSA Authentication Agent API for \nC version 8.6 contain this vulnerability .2,3 Vulnerable implementations include custom deployments based on these \nSDK/API  versions  in Transmission Control Protocol  (TCP) asynchronous mode . The vulnerability was also found in  the \nRSA Authentication Agent for Web used in versions of the Apache Web Server4,5: Apache Web Server 8. 0 and Apache \nWeb Server version 8.0.1 prior to Build 618 .  \nThese products may  have been deployed in the last two years.  Systems utilizing either of the affected  products are \npotentially vulnerable and should be updat ed immediately.  \nMITIGATION ACTIONS  \nConti nued use of affected RSA Authentication Agent API and SDK implementations exposes systems to high risks of \nunauthorized access. Upgrade to the newest versions of RSA Authentication Agent API/SDK and implement according to \nRSA guidelines.6,7 If a system adm inistrator is unsure if their system is vulnerable or needs additional support, contact \nRSA representative or call the RSA Software Technical Support at 1 -800-995-5095.   \nFor systems operating susceptible RSA Authentication Agent for Web for Apache Web Ser ver products, upgrade to \nApache Web Server version 8.0.1 Build 618 or later versions.8  \nTECHNICAL ADDENDUM  \nTo determine if a system is vulnerable, locate the SecurID Agent A uthentication library file and determine the files version \nnumber. The version of the acecl nt.dll file is the same as the version of the SDK/API used in the system implementation. \nFor Windows machines, the library file is named aceclnt.dll, while on Unix machines, it is named libaceclnt.dll.  \n For Windows devices, the version number can be determined  by right clicking the file, selecting properties, and \nclicking the details tab.  If the file location is unknown, search acecl nt.dll in C: \\\\ in Windows File Explorer.  \n  \n                                                \n1 RSA is a registered trademark of RSA Security LLC  \n2 CVE-2017 -14378: https://nvd.nist.gov/vuln/detail/CVE -2017 -14378   \n3 ESA-2017 -146: seclists.org/fulldisclosure/2017/Nov/48  \n4 CVE-2017 -14377: https://nvd.nist.gov/vuln/detail/CVE -2017 -14377  \n5 ESA-2017 -145: seclists.org//fulldisclosure/2017/Nov/46  \n6 RSA Authentication Agent SDK for C version 8.6.1: https://community.rsa.com/docs/DOC -85036  \n7 RSA Authentication Agent API for C version 8.5.1: https://community.rsa.com/docs/DOC -85038  \n8 RSA Authenti cation Agent for Web: Apache Web Server version 8.0.1 Build 618: https://community.rsa.com/docs/DOC -85062  \n\n \n \n2 U/OO/228241 -17          PP-17-0954          11 DECEMBER 2017   For UNIX devices, the following string command can be executed.  \no $ strings <path to library> /libacecl nt.so | grep Agent Version  \no If the location of the file is unknown, execute the following find command in the root directory . \n $ find name acecl nt.dll    \n \nDISCLAIMER OF ENDORS EMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement purposes.  \nCONTACT INFOR MATION  \nFor further information about this product, please contact:  \nClient Requirements a nd General Cybersecurity  Inquiries  \nCybersecurity  Requirements  Center  \n410-854-4200  \nEmail: Cybersecurity_Requests @nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-rsa-securid",
  "source": "nsa",
  "id": "4c4f6a1d2a22a6a448041562b46563b4b574ce9baa8703d5624c1d15c4e862dc"
}