{
  "markdown": "  \n U/OO/ 104201 -20    PP-19-0031   01/14/2020  National Security Agency  | Cybersecurity Advisory  \n1 Patch Critical Cryptographic Vulnerability in Microsoft Windows \nClients and Servers  \n \nSummary  \nNSA has discovered a critical vulnerability (CVE -2020 -0601) affecting Microsoft Windows1 cryptographic functionality. \nThe certificate validation vulnerability allows an attacker to undermine how Windows verifies cryptographic trust and can \nenable remote code execution. The vulnerability affects Windows 10 and Windows Server 2016/2019 as well as \napplications that rely on Windows for trust functionality. Exploitation of the vulnerability allows attackers to defeat trust ed \nnetwork connections and deliver executable code while appearing as legitimately trusted entities. Examples where \nvalidation o f trust may be impacted include:  \no HTTPS connections  \no Signed files  and emails  \no Signed executable code launched as user -mode processes  \nThe vulnerabilit y place s Windows endpoints  at risk to a broad range of exploitation vectors. NSA assesses the \nvulnerability to  be severe and that sophisticated cyber actors will understand the underlying flaw very quickly  and, if \nexploited, would render the previously mentioned  platforms as fundamentally vulnerable .  The consequences o f not \npatching the vulnerability  are severe a nd widespread. Remote exploitation tools will likely be made quickly and widely \navailable.  Rapid adoption of the patch is the only known mitigation at this time and should be the primary focus for all \nnetwork owners.  \nMitigation Actions  \nNSA recommends  insta lling all January 2020 Patch Tuesday patches as soon as possi ble to effectively mitigate the \nvulnerability on all Windows 10 and Windows Server 2016/2019 systems. In the event that enterprise -wide, automated \npatching is not possible, NSA recommends system owners prioritize patching endpoints that provide essential or broadly \nreplied -upon services . Examples include : \no Windows -based web appliances, web servers, or proxies that perform TLS validation.  \no Endpoints that host critical infrastructure (e.g. domain controllers, DNS servers, update servers, VPN servers, \nIPSec negotiation).  \nPrioritization  should also be given to endpoints that have a high risk of exploitation. Examples include:  \no Endpoints directly  exposed to the internet.  \no Endpoints regularly used by privileged users.  \nAdministrators should be prepared to conduct remediation activities since unpatched endpoints may be compromised. \nApplying patches to all affected endpoints is recommended, when possib le, over prioritizing specific classes of endpoints.  \nOther actions can be taken to protect endpoints in addition to installing patches. Network devices and endpoint logging \nfeatures may prevent or detect some methods of exploitation, but installing all pat ches is the most effective mitigation . \nNetwork Prevention and Detection  \nSome enterprises route traffic through existing proxy devices that perform TLS inspection, but do not use Windows for \ncertificate validation. The devices can help isolate vulnerable endpoints behind the proxies while the endpoints are being \n                                            \n1 Microsoft Windows is a registered trademark of Microsoft Corporation.  \n\n \n \n  U/OO/ 104201 -20    PP -19-0031  01/14/2020  2 patched. Proper ly configured and managed TLS inspection proxies independently validate TLS certificates from external \nentities and will reject invalid or untrusted certificates, protecting endpoints from certificates that attempt to exploit th e \nvulnerabilities. Ensure th at certificate validation is enabled for TLS proxies to limit exposure to this class of vulnerabilities \nand review logs for signs of exploitation.  \nPacket capture analysis tools such as Wireshark can be used to parse and extract certificates from network pr otocol data \nfor additional analysis. Software utilities such as OpenSSL and Windows certutil can be used to perform in -depth analysis \nof certificates to check for malicious properties.  \nCertutil  can be used  to examine an X509 certificate  by running the foll owing command : \no certutil asn <certificate_filename>  \nOpenSSL can be used to examine an X509 certificate  by running the following command:  \no openssl asn1parse inform DER in <certificate_filename> i dump  \nor \no openssl x509 inform DER in <certificate_filename > text \nThe commands parse and display the ASN.1 objects within a specified DER encoded certificate file. Review the results for \nelliptic curve objects with suspicious properties. Certificates with named elliptic curves , manifested by explicit curve OID \nvalues, can be ruled benign. For example, the curve OID value for standard curve nistP384 is 1.3.132.0.34. Certificates \nwith explicitly -defined parameters (e.g., prime, a, b, base, order, and cofactor) which fully -match those of a standard curve \ncan similarl y be ruled benign . \nCertutil  can be used  to list registered  elliptic curves and view their parameters  by running the following commands:  \no certutil displayEccCurve  \no certutil displayEccCurve <curve_name>  \nOpenSSL can be used to view standard curves enabled/com piled into OpenSSL by running the following commands : \no openssl ecparam list_curves  \no openssl ecparam name <curve_name> param_enc explicit text \nCertificates containing explicitly -defined elliptic curve parameters which only partially match a standard curve  are \nsuspicious, especially if they  include the public key for a trusted certificate , and  may represent bona fide exploitation \nattempts . \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Governm ent, \nand this guidance shall not be used for advertising or product endorsement purposes . \nContact  \nCybersecurity Requirements Center : 410-854-4200 , Cybersecurity_Requests@nsa.gov   \nMedia inquiries: Press Desk, 443 -634-0721, MediaRelations@nsa.gov    \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-windows-10-crypt-lib-20190114",
  "source": "nsa",
  "id": "843a0ab3d225e8e9d217b344d579881faa121019decc05f2fbaf26a98a992652"
}