{
  "markdown": " \n \nU/OO/ 231762 -22 | PP-22-1969  | DEC  2022 Ver . 1.0 1 \nNSA | APT5: Citrix ADC Threat Hunting Guidance  \nAPT5: Citrix ADC Threat Hunting Guidance  \nExecutive s ummary  \nAPT5 has demonstrated capabilities against  Citrix Application Delivery Controller  \n(ADC ) deployments (Citrix ADCs). Targeting Citrix ADCs can facilitat e illegitimate \naccess to targeted organizations by bypassing normal authentication controls. As such, \nNSA, in collaboration with partners, has developed this threat hunting guidance to \nprovide steps organizations can take to look for possible artifacts of this type of activity. \nPlease note that this guidance does not represent all techniques, tactics, or procedures \n(TTPs) the actors may use when targeting these environments.  This activity has been \nattributed to APT5, also k nown as UNC2630 and MANGANESE.  \nIntroduction  \nNSA recommends organizations hosting Citrix ADC environments take the following \nsteps as part of their investigation. Treat t hese detection mechanisms as independent \nways of identifying potentially malicious acti vity on impacted systems . Artifacts may vary \nbased on the environment and the stage of that activity. As such, NSA recommend s \ninvestigating any positive result even if other detections return no findings .  \nFile Integrity  \nA malicious actor e nabling continued  access will likely require modification to legitimate \nbinaries. Therefore, NSA recommend s organizations regularly check key executables in \ntheir environments for any deviations from the known good copies associated with their \nrunning version. Key  executables are those binaries essential for proper execution of \nthe Citrix ADC appliance. These files include, but may not be limited to: nsppe, nsaaad, \nnsconf, nsreadfile, and nsconmsg. The following command can be executed from a \nshell to facilitate th is comparison:  \ncd /netscaler ; for i in nsppe nsaaad nsconf nsreadfile nsconmsg; do md5 \n${i} ; done  \nThe MD5 hashes should be compared to known good hashes from the vendor or hashes \nof the respective binaries from a known good copy downloaded from the ven dor. Any \ndeviation requires further investigation.  \n\n \n \nU/OO/ 231762 -22 | PP-22-1969  | DEC  2022 Ver . 1.0 2 \nNSA | APT5: Citrix ADC Threat Hunting Guidance  \nAdditionally, the following command can indicate tampering by one APT5 technique. This \nis indicated by one line of output, but no output otherwise:  \nprocstat v $(pgrep o i nsppe) | grep 0x10400000  | g rep rwx  \nNSA also recommend s that organizations take scheduled tech support bundles1 and/or \nsnapshots of their running environment and store them in an offline or otherwise \nimmutable location to create a forensic history of systems . These backups  can be u sed \nto compare running instances or to reconstruct events if suspicious activity is identified.  \nBehavioral Checks  \nIn addition to any alterations of legitimate binaries, some of APT5s activities may be \nvisible in various system logs. NSA recommend s that organizations leverage off -device  \nlogging mechanisms for all system logs, to include dmesg  and ns.log , and actively \nmonitor them for the following activity:  \n Instances of pb_policy appearing in logs without being linked to expected \nadministrator activ ity. \n The actors have been seen leveraging tools that run ' pb_policy ' twice. \nThis creates the following logs in ns.log :  \n<local0.info> [hostname] pb_policy: Changing pitboss policy from X to Y  \n<local0.info> [hostname] pb_policy: Changing pitboss policy from  Y to X \nWhere X and Y are constant values for your system.  \n Gaps in logs, or mismatches between logs on the device  and in your remote \nlogging solution . \n Legitimate user account activity without a corresponding record of a valid SAML \ntoken being issued by the  identity provider for the environment . \n Unauthorized modification of user permissions . \n Unauthorized modifications to the crontab file and/or existence of suspicious \nfile(s) in /var/cron/tabs/ and other locations . \n Files related to this activity have been di scovered in /tmp for some, but not \nall, impacted organizations.  \n The command below can assist in finding files that have been associated \nwith this activity. While these files have not been discovered in all \nenvironments, their presence may be indicative of actor activity if \ndiscovered.  \nfind / -type f -name res* | grep -E res($|\\.[a-z]{3})$ \n\n \n \nU/OO/ 231762 -22 | PP-22-1969  | DEC  2022 Ver . 1.0 3 \nNSA | APT5: Citrix ADC Threat Hunting Guidance  \nDetections  \nProvided below are YARA signatures that can be used to detect malware seen being \nused by the actors in this campaign:  \n \nrule tricklancer_a {  \n \n  strings:  \n    $str1 = \"//var//log//ns.log\" nocase ascii wide  \n    $str2 = \"//var//log//cron\" nocase ascii wide  \n    $str3 = \"//var//log//auth.log\" nocase ascii wide  \n    $str4 = \"//var//log//httpaccess -vpn.log\" nocase ascii wide  \n    $str5 = \"//var//log//nsvpn.log\" noca se ascii wide  \n    $str6 = \"TF:YYYYMMddhhmmss\" nocase ascii wide  \n    $str7 = \"//var//log/ /lastlog\" nocase ascii wide  \n    $str8 = \"clear_utmp\" nocase ascii wide  \n    $str9 = \"clear_text_http\" nocase ascii wide  \n  condition:  \n   7 of ($str*)  \n} \n \nrule tricklancer_ b { \n \n  strings:  \n    $str1 = \"nsppe\" nocase ascii wide  \n    $str2 = \"pb_policy -h nothing\" nocase ascii wide  \n    $str3 = \"pb_policy -d\" nocase ascii wide  \n    $str4 = \"findProcessListByName\" nocase ascii wide  \n    $str5 = \"restoreStateAndDetach\" nocase ascii  wide \n    $str6 = \"checktargetsig\" nocase ascii wide  \n    $str7 = \"DoInject\" nocase ascii wide  \n    $str8 = \"DoUnInject\" nocase ascii wide  \n  condition:  \n    7 of ($str*)  \n} \n \nrule tricklancer_c {  \n \n  strings:  \n    $str1 = \"is_path_traversal_or_vpns_attack_request \" nocase ascii wide  \n    $str2 = \"ns_vpn_process_unauthenticated_request\" nocase ascii wide  \n    $str3 = \"mmapshell\" nocase ascii wide  \n    $str4 = \"DoUnInject\" nocase ascii wide  \n    $str5 = \"CalcDistan se\" nocase ascii wide  \n    $str6 = \"checkMyData\" nocase as cii wide  \n    $str7 = \"vpn_location_url_len\" nocase ascii wide  \n  condition:  \n    5 of ($str*)  \n} \n  \n\n \n \nU/OO/ 231762 -22 | PP-22-1969  | DEC  2022 Ver . 1.0 4 \nNSA | APT5: Citrix ADC Threat Hunting Guidance  \nMitigations  \nIn the event that you have results from the above detection methodology, NSA \nrecommend s the following steps to mitigate the activity, to the extent applicable in your \nenvironment:  \n Move all Citrix ADC instances behind a VPN or other capability that requires valid \nuser authentication (ideally multi -factor) prior to being able to access the ADC . \n Isolate the Citrix ADC appliances from the environment to ensure any malicious \nactivity is contained.  \n Restore the Citrix ADC to a known good state.  \nEven if you do not have any indications of malicious activity, ensure that your Citrix ADC \nappliances are running a current version with the latest updates.  \nConclusion  \nThe indicators and context from this analysis can be used by organizations for \ndefensive purposes against this malicious activity . NSA requests  that any additional \ninsights and/or discoveries be  shared with the NSA Cybersecurity Collaboration Center \nin order to enhance understanding of this activity and so that it can be used to improve \nthe overall security posture of the Defense Industrial Base, D oD, and USG.  \nAcknowledgements  \nNSA would like to acknowledge Citrix and additional industry partners for their \ncontributions to this guide.  \nAdditional information  \n[1] https://support.citrix.com/article/CTX227560 /citrix -adc-logs-collection -guide    \n[2] https://www.citrix.com/blogs/2022/12/13/critical -security -update -now-availab le-\nfor-citrix-adc-citrix-gateway/    \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or \nguarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United \nStates Government, and this guidance shall not be used for advertising or product endorsement purposes.  \n\n \n \nU/OO/ 231762 -22 | PP-22-1969  | DEC  2022 Ver . 1.0 5 \nNSA | APT5: Citrix ADC Threat Hunting Guidance  \nTrademark recognition  \nCitrix is a registered trademark of Citrix Systems, Inc.  \nCitrix Application Delivery Controller and Citrix ADC are trademarks of Citrix Systems, Inc.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including  its responsibilities to identify \nand disseminate threats to National Security Systems, Department of Defense, and Defense Industrial Base \ninformation systems, and to develop and issue cybersecurity specifications and mitigations. This information may be \nshared broadly to reach all appropriate stakeholders.  \nContact  \nGeneral Cybersecurity Inquiries: CybersecurityReports@nsa.gov   \nDefense Industrial Base Inquiries and C ybersecurity Services: DIB_Defense@cyber.nsa.gov   \nMedia I nquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa-apt5-citrixadc-v1",
  "source": "nsa",
  "id": "ad0a02c4eb46054efd0c2ed37543b10be0a0d7e380921af9ca6b8169cc584fc1"
}