{
  "markdown": " \n \n \n \n \n \n \nAll organizations should report incidents and anomalous activity to CISAs 24/7 Operations Center at \nreport@cisa.gov  or (888) 282- 0870 and/or to FBI via your local FBI field office or FBIs 24/7 CyWatch at (855) \n292-3937 or CyWatch@fbi.gov . When available, please include the following information regarding the incident: \ndate, time, and location of the incident; type of activity; number of people affected; type of equipment used for the \nactivity; the name of the submitting company or organization; and a designated point of contact. For NSA client requirements or general cybersecurity inquiries, contact Cybersecurity_Requests@nsa.gov . \nThis document is marked TLP: WHITE. Disclosure is not limited. Sources may use TLP: WHITE  when information \ncarries minimal or no foreseeable risk of misuse, in accordance with applicable rules  and procedures for public \nrelease.  Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction. For \nmore information on the Traffic Light Protocol, see cisa.gov/tlp/ . \nTLP:WHI TE \n TLP:WHITE  \n Co-Authored by:  Product ID: AA22 -277A \nOctober 4,  2022  \nImpacket and Exfiltration Tool Used to Steal \nSensitive Information from Defense Industrial \nBase Organization  \nSUMMARY  \nFrom November 2021  through January 2022, the \nCybersecurity and Infrastructure Security Agency \n(CISA) responded to advanced persistent threat (APT) \nactivity on a Defense Industrial Base (DIB) Sector  \norganizations enterprise network. During incident response activities, CISA uncovered  that likely  multiple \nAPT groups compromised  the organizations network , \nand s ome APT actors had long- term access to the \nenvironment . APT actors used an open- source toolkit  \ncalled  Impacket to gain their foothold within the \nenvironment and further compromise the network , and \nalso used a custom data exfiltration tool , \nCovalentStealer,  to steal the victims sensitive data.  \nThis joint Cybersecurity Advisory (CSA) provides  APT actor s tactics, techniques, and procedures \n(TTPs ) and indicators of compromise (IOCs)  identified during the incident response activities by CISA \nand a third- party incident response organization.  The CSA includes  detection and mitigation actions \nto hel p organizations detect and prevent related APT activity.  CISA, the Federal Bureau of \nInvestigation ( FBI), and the National Security Agency ( NSA) recommend DIB sector and other critical \ninfrastructure organizations implement the mitigations in this CSA to ensure they are managing and \nreducing the impact of cyber threats to their networks.  Actions to Help Protect Against APT \nCyber Activity.  \n Enforce multifactor authentication \n(MFA ) on all user accounts.  \n Implement network segmentation \nto separate network segments \nbased on role and functionality.  \n Update software, including \noperating systems, applications, \nand firmware, on network assets.  \n Audit account usage.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 2 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n For a downloadable copy of IOCs, see the following files:  \n Malware Analysis Report ( MAR )-10365227 -1.stix , 966 kb  \n MAR -10365227- 2.stix , 249B  \n MAR -10365227- 3.stix , 3.2 MB \nTECHNICAL  DETAILS \nThreat Actor Activity  \nNote:  This advisory uses  the MITRE ATT&CK for Enterprise  framework, version 11. See the MITRE \nATT&CK Tactics and T echniques  section  for a table of the APT cyber  activity mapped to MITRE \nATT&CK for Enterprise framework . \nFrom November 2021 through January 2022, CISA conducted an incident response engagement  on \na DIB Sector  organizations enterprise network. The victim  organization also engaged a third- party \nincident response organization for assistance. During incident response activities, CISA a nd the  \ntrusted  third-party identified APT activity on the victims netwo rk. \nSome APT actors gained initial access to the organization s Microsoft Exchange Server as early as \nmid-January 2021.  The initial access vector is unknown. Based on log analysis,  the actors  gathered \ninformation about the exchange environment and performed mailbox searches  within a four -hour \nperiod after gaining access . In the same period, t hese actors used a compromised administrator  \naccount  (Admin  1) to access the EWS  Application Programming Interface ( API). In early February \n2021, the actors r eturned to the network and used Admin  1 to access EWS API again.  In both \ninstances, the actors used a virtual private network (VPN).  \nFour days later , the APT actors  used  Windows Command Shell over a three- day period to interact \nwith the victims network. The actors  used Command Shell to learn about the organizations \nenvironment and to collect sensitive data, including sensitive contract -related information from shared \ndrives, for eventual exfiltration. The actors manual ly collect ed files using the command -line tool, \nWinRAR. The se files were split into approximately 3MB chunks located on the Microsoft Exchange \nserver within the CU2 \\he\\debug  directory.  See Appendix: Windows Command Shell Activity  for \nadditional information, including specific commands used.  \nDuring the same period , APT  actors implanted Impacket , a Python toolkit for programmatically \nconstruc ting and manipulating network protocols, on another system. The actors used Impacket to \nattempt to move laterally to another system.  \nIn early March 2021, APT  actors exploited CVE-2021- 26855, CVE- 2021- 26857, CVE -2021 -26858, \nand CVE -2021- 27065 to install 17 China Chopper webshells on the Exchange Server . Later in March,  \nAPT actors installed HyperBro on the Exchange Server and two other systems.  For more information  \non the HyperBr o and webshell samples, see CISA MAR -10365227 -2 and -3. \nIn April 2021,  APT actors used Impacket  for network exploitation activities. See the Use of Impacket  \nsection for additional information.  From late July through m id-October  2021,  APT actors employed a \ncustom exfiltration tool , CovalentStealer , to exfiltrate the remaining sensitive files.  See the Use of \nCustom Exfiltration Tool: CovalentStealer  section for additional information. \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 3 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n APT actors maintained access  through mid-January 2022, l ikely by relying on legitimate credentials .  \nUse of Impacket  \nCISA discovered activity indicating the use of two Impacket tools: wmiexec.py  and smbexec.py . \nThese tools use Windows Management Instrumentation (WMI) and Server Message Block (SMB) \nprotocol, res pectively , for creating a semi -interactive shell with the target device. Through the \nCommand Shell, an Impacket user with credentials can run commands on the remote device using \nthe Windows management protocols required to support an enterprise network.  \nThe APT cyber actors used existing, compromised credentials with Impacket to access a higher \nprivileged service account used by the organization's multifunctional devices.  The threat actors first \nused the service account to remotely access the organizations Microsoft Exchange server via Outlook Web Access (OWA) from multiple external IP addresses ; shortly afterwards, the actors \nassigned the Application Impersonation role to the service account by running the following \nPowerShell command for managing Exchange : \npowershell add- pssnapin *exchange*;New -ManagementRoleAssignment - \nname:\"Journaling -Logs\" -Role:ApplicationImpersonation -User:<account> \nThis command gave the service account the ability to access other users mailboxes . \nThe APT cyber actors  used virtual private network (VPN) and virtual private server (VPS) providers , \nM247 and SurfShark , as part of their techniques to remotely access the Microsoft Exchange server. \nUse of these hosting providers , which serves to conceal  interaction with victim networks , are common \nfor these threat actors. According to CISAs analysis of the victims Microsoft Exchange server \nInternet Information Services (IIS) logs,  the actors used the account of a former employee to access \nthe EWS. EWS enables access to mailbox items such as email messages, meetings, and contacts. \nThe source IP address for these connections is mostly from the VPS hosting provider, M247 . \nUse of Custom Exfiltration Tool: CovalentStealer  \nThe threat actors employed a custom exfiltration tool, CovalentStealer , to exfiltrate sensitive files.  \nCovalentStealer  is designed to identify file shares on a system, categorize the files, and upload the \nfiles to a remote server. CovalentStealer includes two configurations that specifically target the \nvictim's documents using predetermined files paths and user credential s. CovalentStealer stores the \ncollected files on a Microsoft OneDrive cloud folder, includes a configuration file to specify the types of files to collect  at specified times  and uses a 256 -bit AES key for encryption. See  CISA \nMAR -\n10365227-1  f or additional technical details, including IOCs and detection signatures. \nMITRE ATT&CK Tactics and Techniques  \nMITRE ATT&CK is a globally accessible knowledge base of adversary tactics and techniques based on real -world observations. CISA uses the ATT&CK Framework as a foundation for the development \nof specific threat models and methodologies. Table 1 lists the ATT&CK techniques employed by the \nAPT actors . \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 4 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n Table 1: Identified APT Enterprise ATT&CK Tactics and Techniques  \nInitial Access  \nTechnique Title  ID Use \nValid Accounts  T1078  Actors obtained and abused credentials of existing \naccounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. In this case, they exploited an organizations multifunctional device domain account \nused to access the organizations Microsoft \nExchange server via OWA.  \nExecution  \nTechnique Title  ID Use \nWindows Management Instrumentation  T1047\n Actors used Impacket tools wmiexec.py  and \nsmbexec.py  to leverage Windows Management \nInstrumentation and execute malicious commands. \nCommand and Scripting Interpreter  T1059\n Actors abused command and script interpreters to execute commands.  \nCommand and Scripting Interpreter: PowerShell T1059.001\n Actors abused PowerShell commands and scripts to \nmap shared drives by specifying a path to one \nlocation and retrieving the items from another.  See \nAppendix: Windows Command Shell Activity  for \nadditional information.  \nCommand and Scripting Interpreter: Windows Command Shell  T1059.003\n Actors abused the Windows Command Shell to \nlearn about the organizations environment and to collect sensitive data. See \nAppendix: Windows \nCommand Shell Activity  f or additional information, \nincluding specific commands used. \nThe actors used Impacket  tools, which enable a user \nwith credentials to run commands on the remote \ndevice through the Command Shell.  \nCommand and Scripting \nInterpreter: Python  T1059.006  The actors used two Impacket tools: wmiexec.py  \nand smbexec.py . \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 5 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n Shared Modules  T1129  Actors executed malicious payloads via loading \nshared modules. The Windows module loader can be instructed to load DLLs from arbitrary local paths \nand arbitrary Universal Naming Convention (UNC) network paths.  \nSystem Services  T1569  Actors abused system services to execute commands or programs on the victims network.  \nPersistence  \nTechnique Title  ID Use \nValid Accounts  T1078  Actors obtained and abused credentials of existing accounts as a means of gaining Initial Access, \nPersistence, Privilege Escalation, or Defense \nEvasion.  \nCreate or Modify System Process  T1543\n Actors were observed creating or modifying system processes.  \nPrivilege Escalation  \nTechnique Title  ID Use \nValid Accounts  T1078  Actors obtained and abused credentials of existing accounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. In this case, they exploited an \norganizations multifunctional device domain account \nused to access the organizations Microsoft Exchange server via OWA.  \nDefense Evasion  \nTechnique Title  ID Use \nMasquerading : Match \nLegitimate Name or \nLocation T1036.005  Actors masqueraded the archive utility WinRAR.exe  \nby renaming it VMware.exe to evade defenses and \nobservation.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 6 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n Indicator Removal on Host  T1070  Actors deleted or modified artifacts generated on a \nhost system to remove evidence of their presence or hinder defenses.  \nIndicator Removal on Host: \nFile Deletion  T1070.004  Actors used the del.exe  command with the /f  \nparameter to force the deletion of read- only files with \nthe *.rar  and tempg*  wildcards.  \nValid Accounts  T1078  Actors obtained and abused credentials of existing \naccounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense \nEvasion. In this case, they exploited an \norganizations multifunctional device domain account used to access the organizations Microsoft Exchange server via OWA.  \nVirtualization/Sandbox Evasion: System Checks  T1497.001\n Actors used Windows command shell commands \nto detect and avoid virtualization and analysis environments.  See Appendix: Windows Command \nShell Activity  for additional information.  \nImpair Defenses: Disable or Modify Tools  T1562.001\n Actors used the taskkill  command to probably \ndisable security features. CISA was unable to determine which application was associated with the Process ID.  \nHijack Execution Flow  T1574  Actors were observed using hijack execution flow.  \nDiscovery  \nTechnique Title  ID Use \nSystem Network Configuration Discovery  T1016\n Actors used the systeminfo  command to look for \ndetails about the network configurations and settings and determine if the system was a VMware virtual machine.  \nThe threat actor used route print  to display the \nentries in the local IP routing table.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 7 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n System Network \nConfiguration Discovery: Internet Connection Discovery T1016.001\n Actors checked for i nternet connectivity on \ncompromised systems. This may be performed during automated discovery and can be accomplished in numerous ways.  \nSystem Owner/User Discovery T1033\n Actors attempted to identify the primary user, currently logged in user, set of users that commonly use a system, or whether a user is actively using the system.  \nSystem Network Connections Discovery  T1049\n Actors used the netstat  command to display TCP \nconnections, prevent hostname determination of foreign IP addresses, and specify the protocol for TCP.  \nProcess Discovery  T1057  Actors used the tasklist  command to get \ninformation about running processes on a system and determine if the system was a VMware virtual machine.  \nThe actors used tasklist.exe  and find.exe  to \ndisplay a list of applications and services with their \nPIDs for all tasks running on the computer matching \nthe string powers . \nSystem Information Discovery T1082\n Actors used the ipconfig  command to get detailed \ninformation about the operating system and \nhardware and determine if the system was a \nVMware virtual machine.  \nFile and Directory Discovery  T1083  Actors enumerated files and directories or may search in specific locations of a host or network \nshare for certain information within a file system.  \nVirtualization/Sandbox \nEvasion: System Checks  T1497.001  Actors used Windows command shell  commands to \ndetect and avoid virtualization and analysis environments.  \nLateral Movement  \nTechnique Title  ID Use \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 8 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n Remote Services: \nSMB/Windows Admin Shares  T1021.002\n Actors used Valid Accounts to interact with a remote network share using Server Message Block (SMB) and then perform actions as the logged -on user.  \nCollection  \nTechnique Title  ID Use \nArchive Collected Data: Archive via Utility  T1560.001\n Actor used PowerShell commands and WinRAR to compress and/or encrypt collected data prior to \nexfiltration. \nData from Network Shared Drive  T1039\n Actors likely used net share command to display \ninformation about shared resources on the local \ncomputer and decide which directories to exploit, the \npowershell dir command to map shared drives to \na specified path and retri eve items from another, and \nthe ntfsinfo  command to search network shares \non computers they have compromised to find files of \ninterest.  \nThe actors used dir.exe  to display a list of a \ndirectory's files and subdirectories matching a certain \ntext string.  \nData Staged: Remote Data \nStaging T1074.002  The actors split collected files into approximately  \n3 MB chunks located on the Exchange server within \nthe CU2\\he\\debug  directory . \nCommand and Control  \nTechnique Title  ID Use \nNon-Application Layer \nProtocol  T1095  Actors used a non -application layer protocol for \ncommunication between host and Command and \nControl (C2) server or among infected hosts within a network.  \nIngress Tool Transfer  T1105  Actors used the certutil  command with three \nswitches to test if they could download files from the internet.  \nThe actors employed CovalentStealer to exfiltrate the files.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 9 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n Proxy  T1090  Actors are known to use VPN and VPS providers, \nnamely M247 and SurfShark, as part of their techniques to access a network remotely.  \nExfiltration  \nTechnique Title  ID Use \nSchedule Transfer  T1029  Actors scheduled data exfiltration to be performed only at certain times of day or at certain intervals and \nblend traffic patterns with normal activity.  \nExfiltration Over Web \nService : Exfiltration to Cloud \nStorage  T1567.002  The actor's CovalentStealer tool stores collected files \non a Microsoft OneDrive cloud folder . \n \nDETECTION \nGiven the actors demonstrated capability to maintain persistent, long- term a ccess in compromised \nenterprise environments, CISA, FBI, and NSA encourage organizations to:  \n Monitor logs for connections from unusual VPS s and VPN s. Examine connection logs for \naccess from unexpected ranges, particularly from machines hosted by SurfShark and M247.  \n Monitor for suspicious account use  (e.g., inappropriate or unauthorized use of \nadministrator accounts, service accounts, or third- party accounts ). To detect use of \ncompromised credentials in combination with a VPS, follow the steps below:  \no Review logs for impossible logins,  such as logins with changing username, user \nagent strings, and IP address combinations or logins where IP addresses do not align \nto the expected users geographic location.  \no Search for impossible travel,  which occurs when a user logs in from multiple IP \naddresses that are a significant geographic distance apart (i.e., a person could not \nrealistically travel between the geographic locations of the two IP addresses in the time between logins).  Note:  This detection opportunity can result in false positives if \nlegitimate users apply VPN solutions before connecting to networks.  \no Search for one IP used across multiple accounts, ex cluding expected logins.  \n Take note of any M247 -associated IP addresses used along with VPN \nproviders (e.g., SurfShark). Look for successful remote logins (e.g., VPN, \nOWA) for IPs coming from M247- or using SurfShark -registered IP addresses.  \no Identify suspicious privileged account use after resetting passwords or applying \nuser account mitigations.  \no Search for unusual activity in typically dormant accounts.  \no Search for unusual user agent strings,  such as strings not typically associated with \nnormal user activity, which may indicate bot activity.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 10 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n  Review the YARA rules provided in MAR -10365227-1  to assist in determining whether \nmalicious activity has been observed.  \n Monitor for the installation of unauthorized software,  including Remote Server \nAdministration Tools ( e.g., psexec, RdClient, VNC, and ScreenConnect). \n Monitor for anomalous and known malicious command- line use . See Appendix: Windows \nCommand Shell Activity  for commands used by the actors to interact with the victims \nenvironment.  \n Monitor for unauthorized changes to user accounts (e.g., creation, permission changes, \nand enabling a previously disabled account ). \nCONTAINMENT AND REMEDIATION \nOrganizations affected by active or recently  active threat actors in their environment can take the \nfollowing initial steps to aid in eviction efforts and prevent re -entry:  \n Report the incident. Report the incident to U.S. Government authorities and follow your \norganizations incident response plan.   \no Report incidents to CISA via CISAs 24/7 Operations Center ( report@cisa.gov  or 888 -\n282-0870).  \no Report incidents to your local FBI field office at fbi.gov/contact -us/field -offices  or to \nFBIs 24/7 Cyber Watch (CyWatch) via (855) 292 -3937 or CyWatch@fbi.gov . \no For DIB incident reporting, contact the Defense Cyber Crime Center (DC3) via DIBNET \nat dibnet.dod.mil/portal/intranet  or (410) 981 0104.  \n Reset all login accounts. Reset all accounts used for authentication since it is possible that \nthe threat actors have additional stolen credentials. Password resets should also include \naccounts outside of Microsoft Active Directory, such as network infrastructure devices and \nother non- domain joined devices (e.g., IoT devices).  \n Monitor SIEM logs and build detections. Create signatures based  on the threat actor TTPs \nand use these signatures to monitor security logs for any signs of threat actor re -entry.  \n Enforce MFA on all user accounts.  Enforce phishing- resistant MFA on all accounts without \nexception to the greatest extent possible. \n Follow Microsofts security guidance for Active Directory Best Practices for Securing \nActive Directory . \n Audit accounts and permissions.  Audit all accounts to ensure all unused accounts are \ndisabled or removed and active accounts do not have excessive privileges. Monitor SIEM logs for any changes to accounts, such as permission changes or enabling a previously disabled account, as this might indicate a threat actor using these accounts.  \n Harden and monitor PowerShell by reviewing guidance in the joint Cybersecurity \nInformation Sheet Keeping PowerShell: Security Measures to Use and Embrace\n. \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 11 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n MITIGATIONS \nMitigation recommendations are usually longer -term efforts that take place  before a compromise as \npart of risk management efforts, or after the threat actor s have been evicted from the environment \nand the immediate response actions are complete. While some may be tailored to the TTPs used  by \nthe threat actor, recovery recommendations are largely general best practices and industry standards \naimed at bolstering overall cybersecurity posture.  \nSegment Networks Based on Function  \n Implement network segmentation to separate network segments based on role and \nfunctionality. Proper  netwo rk segmentation significantly reduces the ability for  ransomware \nand other  threat actor lateral movement by controlling traffic flows between and access to\nvarious subnetworks.  (See CISAs Infographic on Layering Network Security Through \nSegmentation and NSAs Segment Networks and Deploy Application- Aware Defenses .) \n Isolate similar systems and implement micro- segmentation with granular access and \npolicy restrictions  to moder nize cybersecurity and adopt Zero Trust (ZT) principles for both \nnetwork perimeter and internal devices. Logical and physical segmentation are critical to \nlimiting  and preventing lateral movement, privilege escalation, and exfiltration.  \nManage Vul nerabilit ies and Configurations  \n Update software, including operating systems, applications, and firmware, on network \nassets.  Prioritize patching  known exploited vulnerabilities  and critical and high vulnerabilities \nthat allow for remote code execution or denial -of-service on internet -facing equipment.  \n Implement a configuration change control process that securely creates device \nconfiguration backups to detect unauthorized modifications. When a configuration change is \nneeded, document the change,  and include the authorization, purpose, and mission \njustification. Periodically verify that modifications have not been applied by comparing current device configurations with the most recent backups. If suspicious changes are observed, \nverify the change was authorized.  \nSearch for Anomalous Behavior  \n Use cybersecurity visibility and analytics tools to improve detection of anomalous \nbehavior and enable dynamic changes to policy and other response actions. Visibility tools \ninclude network monitoring tools and host -based logs and monitoring tools, such as an \nendpoint detection and response (EDR) tool. EDR tools are particularly useful for detecting lateral connections as they have insight into common and uncommon network connections for each host.  \n Monitor the use of scripting languages  (e.g., Python, Powershell) by authorized and \nunauthor ized users. Anomalous use by either group may be indicative of malicious activity, \nintentional or otherwise.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 12 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n Restrict and Secure Use of Remote Admin Tools  \n Limit the number of remote access tools as well as who and what can be accessed \nusing them . Reducing the number of remote admin tools and their allowed access will \nincrease visibility of unauthorized use of these tools.  \n Use encrypted services to protect network communications and disable all clear text \nadministration services ( e.g., Telnet, HTTP, FTP, SNMP 1/2c ). This ensures that sensitive \ninformation cannot be easily obtained by a threat actor capturing network traffic.  \nImplement a Mandatory Access Control Model  \n Implement stringent access controls to sensitive data and resources.  Access should be \nrestricted to those users who require access and to the  minimal level of access needed.  \nAudit Account Usage  \n Monitor VPN logins to look for suspicious access (e.g., logins from unusual geo locations, \nremote logins from accounts not normally used for remote access, concurrent logins for the same account from different locations, unusual times of the day).  \n Closely monitor the use of  administrative accounts.  Admin accounts should be used \nsparingly and only when necessary, such as installing new software or patches. Any use of admin accounts should be reviewed to determine if the activity is legitimate.  \n Ensure standard user accounts do  not have elevated privileges . Any attempt to increase \npermissions on standard user accounts should be investigated as a potential compromise.  \nVALIDATE SECURITY CONTROLS  \nIn addition to  applying mitigations, CISA, FBI, and NSA recommend exercis ing, testing , and validat ing \nyour organization's  security program against threat behaviors mapped to the MITRE ATT&CK for \nEnterprise framework  in this advisory . CISA, FBI, and NSA  recommend testing  your existing security \ncontrols inventory to assess  how they perform against the ATT&CK techniques described in this \nadvisory .  \nTo get started : \n1. Select an ATT&CK technique described in this advisory (see Table 1 ). \n2. Align your security technologies against the technique.  \n3. Test your technologies against the technique. \n4. Analyze the performance of your  detection and prevention technologies. \n5. Repeat the process for all security technologies to obtain a set of comprehensive performance data.  \n6. Tune your security program, including people, processes, and technologies, based on the  \ndata generated by this process.  \nCISA, FBI,  and NSA recommend continually tes ting your security program, at scale, in a production \nenvironment to ensure optimal performance against the MITRE ATT&CK techniques identified in this advisory.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 13 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n RESOURCES  \nCISA off ers several no- cost scanning and testing services to help organizations reduce their exposure \nto threats by taking a proactive approach to mitigating attack vectors.  See cisa.gov/cyber -hygiene-\nservices. \nU.S. DIB sector  organizations may consider signing up for the NSA Cybersecurity Collaboration \nCenters DIB Cybersecurity Service Offerings, including Protective Domain Name System (PDNS) \nservices, vulnerability scanning, and threat intelligence collaboration for eligible organizations. For \nmore information on how to enroll in these services, email dib_defense@cyber.nsa.gov . \nACKNOWLEDGEMENTS \nCISA,  FBI, and NSA  acknowledge Mandiant  for its contributions to this CSA.  \nREFERENCES  \n[1] Microsoft Net Share  \n[2] Microsoft Get -ChildItem  \n[3] Microsoft systeminfo  \n[4] Microsoft tasklist  \n[5] Microsoft ipconfig  \n[6] Microsoft Route  \n[7] Microsoft netstat  \n[8] Microsoft certutil  \n[9] Microsoft ping  \n[10] Microsoft taskkill  \n[11] Microsoft Compress -Archive  \n[12] NTFSInfo v1.2  \n[13] rarlab  \n[14] Microsoft Import -Module  \n[15] Microsoft set (environment variable)  \n[16] Microsoft tasklist  \n[17] Mitre ATT&CK - Sofware: TaskList  \n[18] Microsoft find  \n[19] Microsoft ping  \n[20] Microsoft del  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 14 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n APPENDIX: WINDOWS COMMAND SHELL ACTIVITY  \nOver a three -day period in February 2021, APT cyber actors used Windows Command Shell to \ninteract with the victims environment. When interacting with the victims system and executing \ncommands, the threat actors used /q and /c parameters to turn the echo off, carry out the command \nspecified by a string, and stop its execution once completed. \nOn the firs t day, the threat actors consecutively executed many commands within the Windows \nCommand Shell to learn about the organizations environment and to collect sensitive data for \neventual exfiltration  (see Table 2). \nTable 2 : Windows Command Shell Activity (Day  1) \nCommand  Description / Use  \nnet share  Used to create, configure, and delete network shares from the command -line.[1\n] The threat actor likely used this command to \ndisplay information about shared resources on the local computer \nand decide which directories to exploit . \npowershell dir An alias (shorthand) for the PowerShell Get -ChildItem cmdlet. \nThis command maps shared drives by specifying a path to one \nlocation and retrieving the items from another .[2] The threat actor \nadded additional switches (aka options, parameters, or flags) to \nform a one liner, an expression to describe commonly used \ncommands used in exploitation: powershell dir -recurse -\npath e:\\<redacted>|select fullname,length|export -csv \nc:\\windows\\temp\\temp.txt . This particular command lists \nsubdirectories of the target environment when.  \nsysteminfo  Displays detailed configuration information [ 3], tasklist   lists \ncurrently running processes  [4], and ipconfig  displays all current \nTransmission Control Protocol (TCP)/IP network configuration \nvalues and refreshes Dynamic Host Configuration P rotocol (DHCP) \nand Domain Name System (DNS) settings, respectively [ 5]. The \nthreat actor used these commands with specific switches to determine if the system was a VMware virtual machine: \nsysteminfo > vmware & date /T , tasklist /v > vmware & \ndate /T , and ipconfig /all >> vmware & date /. \nroute print Used to display and modify the entries in the local IP routing table. \n[6] The threat actor used this command to display the entries in the \nlocal IP routing table.  \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 15 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n netstat Used to display active TCP connections, ports on which the \ncomputer is listening, Ethernet statistics, the IP routing table, IPv4 statistics, and IPv6 statistics .[7\n] The threat actor used this \ncommand with three switches to display TCP connections, prevent hostname determination of foreign IP addresses, and specify the \nprotocol for TCP: netstat -anp tcp . \ncertutil  Used to dump and display certification authority (CA) configuration information, configure Certificate Services, backup and restore CA components, and verify certificates, key pairs, and certificate \nchains .[8\n] The threat actor used this command with three switches \nto test if they could download files from the internet: certutil -\nurlcache -split -f https://microsoft.com temp.html . \nping Sends Internet Control Message Protocol (ICMP) echoes to verify \nconnectivity to another TCP/IP computer .[9] The threat actor used \nping -n 2 apple.com to either test their internet connection or to \ndetect and avoid virtualization and analysis environments or \nnetwork restrict ions.  \ntaskkill  Used to end tasks or processes .[10] The threat actor used \ntaskkill /F /PID 8952  to probably disable security features. \nCISA was unable to determine what this process was as the process identifier (PID) numbers are dynamic.  \nPowerShell Compress -\nArchive cmdlet Used to create a compressed  archive or to zip files from specified \nfiles and directories.[ 11] The threat actor used parameters \nindicating shared drives as file and folder sources and the \ndestination archive as zipped files. Specifically, they collected sensitive contract -related information from the shared drive s. \n \nOn the second day, the APT cyber actors executed the commands in Table 3 to perform discovery as \nwell as collect and archive data.  \nTable 3 : Windows Command Shell Activity (Day 2)  \nCommand  Description / Use  \nntfsinfo.exe  Used to obtain volume information from the New Technology File \nSystem (NTFS) and to print it along with a directory dump of NTFS meta -data files.[12\n] \n\n  \n    CISA |  FBI | NSA  TLP:WHITE  \n \nPage 16 of 16  |  Product ID: A A22-277A \nTLP:WHITE  \n WinRAR.exe  Used to compress files  a nd subsequently masqueraded \nWinRAR.exe  by renaming it VMware.exe .[13] \n \nOn the third day, the APT cyber actors returned to the organizations network and executed the \ncommands  in Table 4. \nTable 4 : Windows Command Shell Activity (Day 3)  \nCommand  Description / Use  \npowershell -ep bypass \nimport-module \n.\\vmware.ps1;export -\nmft -volume e  Threat actors r an  a PowerShell command with parameters to \nchange the execution mode and bypass the Execution Policy to run \nthe script from PowerShell and add a module to the current section: \npowershell -ep bypass import -module \n.\\vmware.ps1;export -mft -volume e . This module appears to \nacquire and export the Master File Table (MFT) for volume E for further analysis by the cyber actor. [\n14] \nset.exe  Used to display the current environment variable settings. [15] (An \nenvironment variable is a dynamic value pointing to system or user environments  (folders) of the system. System environment \nvariables are defined by the system and used globally by all users, while user environment variables are only used by the user who declared that variable and they override the system environment \nvariables (even if the variables are named the same).  \ndir.exe Used to display a list of a directory's files and subdirectories \nmatching the eagx*  text string, likely to confirm the existence of \nsuch file.  \ntasklist.exe  and \nfind.exe  Used to display a list of applications and services with their PIDs for \nall tasks running on the computer matching the string powers. [16][17][18\n] \nping.exe  Used to send two ICMP echos to amazon.com . This  could have \nbeen to detect or avoid virtualization and analysis environments, \ncircumvent network restrictions, or test their internet connection.[ 19] \ndel.exe  with the /f \nparameter  Used to force the deletion of read -only files with the *.rar  and \ntempg*  wildcards. [20] \n \n\n",
  "cves": [],
  "techniques": [
    "T1497.001",
    "T1070.004",
    "T1074.002",
    "T1059.003",
    "T1016.001",
    "T1021.002",
    "T1059.006",
    "T1562.001",
    "T1036.005",
    "T1567.002",
    "T1560.001",
    "T1059.001"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa_impacket-and-exfiltration-tool-used-to-steal-sensitive-information-from-defense-industrial-base-organization_",
  "source": "nsa",
  "id": "af6fba7c45eb40216bde32880a3bad9cc9c25c426950ea384a809fa961ab301a"
}