{
  "markdown": "  \nU/OO/158036 -21 | PP-21-0782  | JUL 2021 Ver . 1.0 \nFederal Bureau \nof Investigation  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nNational  \nSecurity  \nAgency  \nCybersecurity \nAdvisory  \nRussian GRU Conducting Global Brute Force \nCampaign to Compromise Enterprise and Cloud \nEnvironments  \nExecutive s ummary  \nSince at least mid -2019 through early 2021, Russian General Staff Main Intelligence \nDirectorate (GRU) 85th Main Special Service Center (GTsSS), military unit 26165, used \na Kubernetes cluster to conduct widespread, distributed, and anonymized brute force \naccess attempts against hundreds of government and private sector t argets worldwide. \nGTsSS malicious cyber activity has previously been attributed by the private sector \nusing the names Fancy Bear, APT28, Strontium, and a variety of other identifiers. The \n85th GTsSS directed a significant amount of this activity at organiz ations using Microsoft \nOffice 365 cloud services; however, they also targeted other service providers and on -\npremises email servers using a variety of different protocols. These efforts are almost \ncertainly still ongoing.  \nThis brute force capability allow s the 85th GTsSS actors to access protected data, \nincluding email, and identify valid account credentials. Those credentials may then be \nused for a variety of purposes, including initial access, persistence, privilege escalation, \nand defense evasion. The a ctors have used identified account credentials in conjunction \nwith exploiting publicly known vulnerabilities, such as exploiting Microsoft Exchange \nservers using CVE 2020 -0688 and CVE 2020 -17144, for remote code execution and \nfurther access to target netwo rks. After gaining remote access, many well -known \ntactics, techniques, and procedures (TTPs) are combined to move laterally, evade \ndefenses, and collect additional information within target networks.   \nNetwork managers should adopt and expand usage of multi -factor authentication to \nhelp counter the effectiveness of this capability. Additional mitigations to ensure strong \naccess controls include time -out and lock -out features, the mandatory use of strong \npasswords, implementation of a Zero Trust security mode l that uses additional attributes \nwhen determining access, and analytics to detect anomalous accesses. Additionally, \norganizations can consider denying all inbound activity from known anonymization \nservices, such as commercial virtual private networks (VPN s) and The Onion Router \n(TOR), where such access is not associated with typical use .  \n\n  \n \nU/OO/158 036-21 | PP-21-0782  | JUL 2021 Ver . 1.0 2 NSA, CISA, FBI , & NCSC  | Russian GRU Conducting Global Brute Force Campaign  \n \n \nDescription of targets  \nThis campaign has already targeted hundreds of U.S. and foreign organizations \nworldwide, including U.S. government and Department of Defense entiti es. While the \nsum of the targeting is global in nature, the capability has predominantly focused on \nentities in the U.S. and Europe. Types of targeted organizations include:  \n \nGovernment and military \norganizations[1]  \nPolitical consultants and \nparty organizations[2] \n  \nDefense contractors  \n \nEnergy companies   \nLogistics companies  \n  \nThink tanks  \n \nHigher education \ninstitutions   \nLaw firms   \nMedia companies  \nKnown TTPs  \nThe actors used a combination of known TTPs in addition to their password spray \noperations to exploit target networks, access additional credentials, move laterally, and \ncollect, stage, and exfiltrate data, as illustrated in the figure below. The actors us ed a \nvariety of protocols, including HTTP(S), IMAP(S), POP3, and NTLM. The actors also \nutilized different combinations of defense evasion TTPs in an attempt to disguise some \ncomponents of their operations; however, many detection opportunities remain viabl e to \nidentify the malicious activity.  \n\n\n  \n \nU/OO/158 036-21 | PP-21-0782  | JUL 2021 Ver . 1.0 3 NSA, CISA, FBI , & NCSC  | Russian GRU Conducting Global Brute Force Campaign  \n \n \n \nFigure 1:  Example of several TTPs used together as part of this type of brute force campaign  \nThe following table summarizes the known TTPs used in conjunction with the password \nspray capability. As the structure of target networks can vary greatly, the 85th GTsSS \nmay employ a subset of these TTPs, or other TTPs not included in this summary, \nagainst different victims.  \nTable I: Summary of known tactics, techniques, and procedures  \nTactic  Technique  Procedure/Comments  \nInitial Access  T11901 - Exploitation of \nPublic Facing \nApplications  The actors used a variety of public exploits, including CVE \n2020 -0688 and CVE 2020 -17144 to gain privileged \nremote code execution on vulnerable Microsoft Exchange \nservers. In some cases, this  exploitation occurred after \nvalid credentials were identified by password spray, as \nthese vulnerabilities require authentication as a valid user.  \nInitial Access, \nPersistence \nand Privilege \nEscalation  T1078 - Valid Accounts  The actors used legitimate crede ntials, obtained through \nvarious means, to maintain access to target networks.  \nPersistence  T1078.002 - Valid \nAccounts:  Cloud \nAccounts  The actors used a compromised Office 365 service \naccount with Global Administrator privileges to collect \nemail from user inboxes.  \nPersistence  T1505.003  Web  shell The actors used a modified and obfuscated version of the \nreGeorg web  shell to maintain persistent access on a \ntarget's Outlook Web Access (OWA) server.  \n                                            \n1 T1190 and similar references are MITRE ATT&CK techniques and tactics. MITRE and ATT&CK are registered trademarks of The MITR E Corporation.  \n\n\n  \n \nU/OO/158 036-21 | PP-21-0782  | JUL 2021 Ver . 1.0 4 NSA, CISA, FBI , & NCSC  | Russian GRU Conducting Global Brute Force Campaign  \n \n \nTactic  Technique  Procedure/Comments  \nPersistence  T1098.002 - Account \nManipulation:  Exchange \nEmail Delegate \nPermissions  The actors used a Powershell cmdlet (New -\nManagementRoleAssignment) to grant the \n'ApplicationImpersonation' role to a compromised \naccount.  \nCredential \nAccess  T1110.003 - Password \nSpray  The actors operate a Kubernetes cluster, which allows \nthem to conduct distributed and large -scale targeting \nusing password spray and password guessing.  \nCredential \nAccess  T1003.001 - LSASS \nMemory  The actors dumped LSASS process memory by using \nrundll32.exe to execute the MiniDump function exporte d \nby the native Windows DLL comsvcs.dll.  \nCredential \nAccess  T1003.003 - NTDS  The actors used the ntdsutil.exe utility, which was present \non a target's Active Directory server to export the Active \nDirectory database for credential access.  \nRemote \nServices  T1021.002 - \nSMB/Windows Admin \nShares  The actors mapped network drives using 'net use' and \nadministrator credentials.  \nCollection  T1560.001 - Archive \nCollected Data:  Archive \nvia Utility  The actors used a variety of utilities, including publicly \navailable versions of WinRAR, to archive collected data \nwith password protection.  \nCollection  T1005 - Data from Local \nSystem  The actors collected files from local systems.  \nCollection  T1039 - Data from \nNetwork Shared Drive  The actors collected files located on a ne twork shared \ndrive.  \nCollection  T1213 - Data from \nInformation Repositories  The actors collected files from various information \nrepositories.  \nCollection  T1074.002 - Remote \nData Staging  The actors staged archives of collected data on a target's \nOWA server.  \nCollection  T1114.002 - Remote \nEmail Collection  The actors collected email from Office 365 using a \ncompromised valid service account with elevated \nprivileges.  \nCommand \nand Control  T1115 - Ingress Tool \nTransfer  The actors used certutil.exe, a known \"Living Off the \nLand\" technique, to transfer a file into a target \nenvironment.  \nDefense \nEvasion  T1036 - Masquerading  The actors renamed archive files containing exfiltration \ndata with innocuous looking names and extensions (e.g. \n.wav and .mp4) to resemble benign f iles. \n\n  \n \nU/OO/158 036-21 | PP-21-0782  | JUL 2021 Ver . 1.0 5 NSA, CISA, FBI , & NCSC  | Russian GRU Conducting Global Brute Force Campaign  \n \n \nTactic  Technique  Procedure/Comments  \nDefense \nEvasion  T1036.003 - \nMasquerading:  Rename \nSystem Utilities  The actors renamed the WinRAR utility to avoid detection.  \nDefense \nEvasion  T1036.005 - Match \nLegitimate Name or \nLocation  The actors named one instance of their web  shell \n'outlookconfiguration.aspx' likely for the purpose of \nappearing to be a legitimate webpage on a targeted OWA \nserver.   \nExfiltration  T1048.002 - Exfiltration \nOver Asymmetric \nEncrypted Non -C2 \nProtocol  The actors downloaded archives of collected data \nprevious ly staged on a target's OWA server via HTTPS.  \nExfiltration  T1030 - Data Transfer \nSize Limits  The actors split some archived exfiltration files into chunks \nsmaller than 1MB.  \nDetection and mitigation  \nIn an attempt to obfuscate its true origin and to provide a degree of anonymity, the \nKubernetes cluster normally routes brute force authentication attempts through TOR \nand commercial VPN services, including CactusVPN, IPVanish, NordVPN, \nProtonVPN, Surfshark, and WorldVPN. Authentication attempts that did not use TOR \nor a VPN service were also occasionally delivered directly to targets from nodes in the \nKubernetes cluster.  \nThe scalable nature of the password spray capability means that specific indicators of \ncompromise (IOC) can be easily altered to byp ass IOC -based mitigation. In addition to \nblocking activity associated with the specific indicators listed  in this Cybersecurity \nAdvisory , organizations should consider denying all inbound activity from known TOR \nnodes and other public VPN services to exchange servers or portals where such access \nis not associated with typical use.  \nIP addresses  \nAlthough the exact makeup of the Kubernetes cluster may change over time, a number \nof nodes have been identified as responsible for sending and routing the brute  force \nauthentication attempts. At some point between November 2020 and March 2021, the \nfollowing IP addresses were identified as corresponding to nodes in the Kubernetes \ncluster:  \n\n  \n \nU/OO/158 036-21 | PP-21-0782  | JUL 2021 Ver . 1.0 6 NSA, CISA, FBI , & NCSC  | Russian GRU Conducting Global Brute Force Campaign  \n \n \n 158.58.173[.]40  \n 185.141.63[.]47  \n 185.233.185[.]21  \n 188.214.30[.]76  \n 195.154.250 [.]89  93.115.28[.]161  \n 95.141.36[.]180  \n 77.83.247[.]81  \n 192.145.125[.]42  \n 193.29.187[.]60  \nUser agents  \nIn cases where HTTP was the underlying protocol used to deliver authentication \nrequests, the actors used many different User -Agent strings, which are crafted to \nappear consistent with those sent by legitimate client software. Some of the User -Agent \nstrings delivered in the authentication requests are incomplete or truncated versions of \nlegitimate User -Agent strings, offering the following unique detecti on opportunities:  \n Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like \nGecko) Chrome/70.  \n Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like \nGecko) Chrome/70.0.3538.110 Safari/537.36  \n Mozilla/5.0 (Windows NT 1 0.0; Win64; x64; rv:63.0) Gecko/20100101 \nFirefox/63.0  \n Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like \nGecko) Chrome/70.0.3538.110 Safari/537.36  \n Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_1) AppleWebKit/605.1.15 \n(KHTML, like G ecko) Version/12.0.1 Safari/605.1.15  \n Microsoft Office/14.0 (Windows NT 6.1; Microsoft Outlook 14.0.7162; Pro  \n Microsoft Office/14.0 (Windows NT 6.1; Microsoft Outlook 14.0.7166; Pro)  \n Microsoft Office/14.0 (Windows NT 6.1; Microsoft Outlook 14.0.7143; Pro)  \n Microsoft Office/15.0 (Windows NT 6.1; Microsoft Outlook 15.0.4605; Pro)  \nYara rule  \nThe following Yara rule matches the reGeorg variant web  shell used by the actors. As \nthis is a publicly available web  shell, the rule does not uniquely identify 85th GTsSS \nmalicious activity.[3] \nrule reGeorg_Variant_Web  shell { \n strings:  \n $pageLanguage = \"<%@ Page Language= \\\"C#\\\"\" \n\n  \n \nU/OO/158 036-21 | PP-21-0782  | JUL 2021 Ver . 1.0 7 NSA, CISA, FBI , & NCSC  | Russian GRU Conducting Global Brute Force Campaign  \n \n \n $obfuscationFunction = \"StrTr\"  \n $target = \"target_str\"  \n $IPcomms = \"System.Net.IPEndPoint\"  \n $addHeader = \" Response.AddHeader\"  \n $socket = \"Socket\"  \n condition:  \n 5 of them  \n} \nGeneral mitigations  \nAs with mitigations for other credential theft techniques, organizations can take the \nfollowing measures to ensure strong access control:  \n Use multi -factor authentication w ith strong factors and require regular re -\nauthentication[4]. Strong authentication factors are not guessable , so they would \nnot be guessed during brute force attempts.  \n Enable time -out and lock -out features whenever password authentication is \nneeded. Time -out features should increase in duration with additional failed login \nattempts. Lock -out features should temporarily disable accounts after many \nconsecutive failed attempts. This can force slower brute force attempts, making \nthem infeasible.  \n Some services can check passwords against common password dictionaries \nwhen users change passwords, denying many poor password choices before \nthey are set. This makes brute -force password guessing far more difficult.  \n For protocols that sup port human interaction, utilize captchas to hinder \nautomated access attempts.  \n Change all default credentials and disable protocols that use weak authentication \n(e.g., clear -text passwords, or outdated and vulnerable authentication or \nencryption protocols) or do not support multi -factor authentication. Always \nconfigure access controls on cloud resources carefully to ensure that only well -\nmaintained and well -authenticated accounts have access[5]. \n Employ appropriate network segm entation and restrictions to limit access and \nutilize additional attributes (such as device information, environment, access \npath) when making access decisions, with the desired state being a Zero Trust \nsecurity model[6]. \n Use automated tools to audit access logs for security concerns and identify \nanomalous access requests.  \n\n  \n \nU/OO/158 036-21 | PP-21-0782  | JUL 2021 Ver . 1.0 8 NSA, CISA, FBI , & NCSC  | Russian GRU Conducting Global Brute Force Campaign  \n \n \nWorks c ited \n[1] Norwegian Police Security Service (PST), Datainnbruddet mot Stortinget er ferdig etterforsket , \nDecember 8, 2020. https://www.pst.no/alle -artikler/pressemeldinger/datainnbruddet -mot-\nstortinget -er-ferdig -etterforsket/  \n[2] Microsoft Threat Intelligence Center (MSTIC), STRONTIUM: Detecting new patterns in credential \nharvesting. September 10, 2020. htt ps://www.microsoft.com/security/blog/2020/09/10/strontium -\ndetecting -new-patters -credential -harvesting/  \n[3] National Security Agency, Detect and Prevent Web Shell Malware. April 22, 2020. \nhttps://www.nsa.gov/cybersecurity -guidance  \n[4] National Security Agency, S electing Secure Multi -factor Authentication Solutions. October 16, \n2020. https://www.nsa.gov/cybersecurity -guidance  \n[5] National Security Agency, Mitigating Cloud Vulnerabilities. January 22, 2020. \nhttps://www.nsa.gov/cybersecurity -guidance  \n[6] National Security Agency, Embracing a Zero Trust Security Model. February 25, 2021. \nhttps://www.nsa.gov/cybersecurity -guidance  \nDisclaimer of warranties and endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any wa rranties or \nguarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United \nStates Governmen t, and this guidance shall not be used for advertising or product endorsement purposes.  \nTrademark recognition  \nActive Directory, Microsoft Exchange, Office 365, Office, Outlook, OWA, Powershell, Windows, and Windows NT \nare registered trademarks of Microsof t Corporation.  Kubernetes is a registered trademark of the Linux Foundation.  \nWinRAR is a registered trademark of Roshal, Alexander.  IPVanish is a registered trademark of Mudhook Marketing, \nInc.  NordVPN is a registered trademark of NORDSEC PLC.  Pr otonVPN is a registered trademark of Proton \nTechnologies AG.  S urfshark is a registered trademark of SURFSHARK LTD.  Firefox and Mozilla and are \nregistered trademarks of Mozilla Foundation.  Chrome is a registered trademark of Google, Inc.  Mac and WebKit \nare registered trademarks of Apple, Inc.  \nPurpose  \nThis document was developed  by NSA, CISA, FBI, and NCSC  in furtherance their respective  cybersecurity missions, \nincluding their responsibilities to develop and issue cybersecurity specifications and  mitigations. This information may \nbe shared broadly to reach all appropriate stakeholders.  \nContact  information  \nClient Requirements / General Cybersecurity Inquiries: Cybersecurity Requirements Center, 410 -854-4200, \nCybersecurity_Requests@nsa.gov  \n \nMedia I nquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov  \n\n",
  "cves": [],
  "techniques": [
    "T1114.002",
    "T1190",
    "T1039",
    "T1560.001",
    "T1074.002",
    "T1505.003",
    "T1036.005",
    "T1021.002",
    "T1030",
    "T1078",
    "T1036",
    "T1098.002",
    "T1078.002",
    "T1003.001",
    "T1003.003",
    "T1110.003",
    "T1048.002",
    "T1036.003",
    "T1005",
    "T1213",
    "T1115"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa_gru_global_brute_force_campaign_uoo158036-21",
  "source": "nsa",
  "id": "f358271fa6e328a534855c6cb6b1d80858577e40c84b109594e90a14fcb4c7b9"
}