{
  "markdown": " \n \n 1 \nU/OO/108665 -19          PP-19-0085           25 JANUARY 2019  \n UPDATED GUIDANCE FOR  VULNERABILITIES \nAFFECTING MODERN PRO CESSORS   \nDISCUSSION  \nMultiple side -channel vulnerabilities affect Intel[1], AMD[2], ARM[3], and IBM[4] processors. These vulnerabilities exploit \nweaknesses in speculative execution to leak unauthorized information. Account permissions, virtualization boundaries, and \nprotected memory regions may be bypassed via exploitation. Multiple CVE[5]s have been rele ased for side -channel \nvulnerabilities carrying names like Spectre, Meltdown, and Foreshadow. Vendors have released patches to mitigate \nvulnerabilities. Vulnerable processors are present in several generations of systems widely deployed within National \nSecu rity Systems including DoD networks.  \nMITIGATION ACTIONS  \nIn order to better respond to the continued pace of discovery and development of related vulnerabilities, the following \nwebsites should be used as the most current source of vulnerability and mitigati on information : \n https://github.com/nsacyber/Hardware -and-Firmware -Security -Guidance  \n https://www.us -cert.gov/nc as/alerts/TA18 -004A  \nIn general, however, the following mitigations apply to affected systems : \n1) Apply system UEFI/BIOS firmware updates provided by system vendors.  Firmware updates may not be delivered \nthrough established patching services and may be easi ly missed. Consult vendor support sources, such as Dell[6] or HP[7] \nor similar, for each specific make and model of system.  \n2) Apply microcode updates provided by system vendors and operating system update services.  Microcode updates \nmay have a firmware component update in addition to an operating system kernel update. Follow system vendor guidance \nfor applying firmware updates. Consult operating system vendor security bulletins for software patches.  \n3) Apply all vendor operating system, driver, and appli cation patches. Perform configuration changes as indicated. \nApple[8], Google[9], Linux distributions[10], and Microsoft[11] have released information and updates for the respective \noperating systems. Web browsers, drivers, software applications, virtualization solutions, and development kits are also \naffected. Apply all patches. Flaws and unintentional side effects found in in itial patch releases have been resolved. Some \npatches may require configuration changes to enable the full benefit of mitigations. Ch eck vendor configuration guides.  \n                                                \n1 Addressing Hardware Vulnerabilities https://www.intel.com/content/www/us/en/architecture -and-technology/facts -about -side-channel -analysis -and-intel-products.html  .  Intel is a \nregistered trademark of Intel Corporation  \n2 AMD Processor Security https://www.amd.com/en/corporate/security -updates  .  AMD is a registered trademark of Advanced Micro Devices, Inc.  \n3 Cache Speculation Issues Update https://developer.arm.com/support/arm -security -updates/speculative -processor -vulnerability/latest -updates/cache -speculation -issues -update  .  ARM \nis a registered trademark of  ARM Limited  \n4 IBM Security Bulletins https://www -01.ibm.com/support/docview.wss?uid=nas8N1022433  .  IBM is a registered trademark of  International Business Machines Corporation   \n5 CVE is a registered trademark of The MITRE Corporation  \n6 Dell Support: Microprocessor Side -Channel Vulnerabilities https://www.dell.com/support/meltdown -spectre  .  Dell is a registered trademark of Dell, Inc.  \n7 HP Security Bulletin: Side -Channel Anal ysis Method https://support.hp.com/us -en/document/c05869091  .  HP is a registered trademark of Hewlett Packard Corporation  \n8 About speculative execution vulnerabilities in ARM -based and Intel CPUs https://support.apple.com/en -us/HT208394  .  Apple  is a registered trademark of Apple, Inc.  \n9 Meltdown/Spectre vulnerability status for Chrome OS devices https://www.chromium.org/chromium -os/meltdown -spectre -vulnerability -status  .  Google is a registered trademark of \nGoogle, Inc.  \n10 Meltdown & Spectre  Kern el Side -Chann el Attacks  CVE-2017 -5754 CVE -2017 -5753 CVE -2017 -5715 https://access.redhat.com/security/vulnerabilities/speculativeexecution   .  \nLinux is a registered trademark of Li nus Torvalds  \n11 Protect your Windows devices against Spectre and Meltdown https://support.microsoft.com/en -us/help/4073757/protect -your-windows -devices -against -spectre -meltdown  .  Microsoft is \na registered trademark of Microsoft Corp.  \n\n \n \n 2  U/OO/108665 -19          PP-19-0085          25 JANUARY 2019  \n \n DISCLAIMER OF ENDORS EMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for adver tising or product endorsement purposes.  \nCONTACT  \nCybersecurity Requirements Center  \n410-854-4200  \nCybersecurity_Requests@nsa.gov  \n \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa_updated_guidance_for_vulnerabilities_affecting_modern_processors_20190130",
  "source": "nsa",
  "id": "86f1241ca39b77b4bb9d81d82ecf61ef80d850b77b40a2464e4dd29385fd1692"
}