{
  "markdown": "  \n \n \n \n  \n   \n \nTo report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory , contact \nyour local FBI field office at www.fbi.gov/contact -us/field -offices , or the FBIs 24/7 Cyber Watch (CyWatch) at  \n(855) 292- 3937 or by e -mail at CyWat ch@fbi.gov . When available, please include the following information \nregarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of \nequipment used for the activity; the name of the submitting company or organization; and a designated point of \ncontact. To request incident response resources or technical assistance related to these threats, contact CISA at \nCISAServiceDesk@cisa.dhs.gov . \nThis document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information \ncarries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public \nrelease. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction.  \nFor more information on the Traffic Light Protocol, see http://www.us -cert.gov/tlp/ . \n \nTLP: WHITE    Product ID: A A21-287A  \n October 14, 2021  TLP:WHITE  \n Co-Authored by:  \nOngoing  Cyber Threats to U.S. Water and \nWastewater Systems  \nSUMMARY  \nNote : This Alert uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge \n(ATT&CK) framework, version 9. See the ATT&CK for Enterprise . \nThis joint advisory is the result of analytic efforts \nbetween the Federal Bureau of Investigation (FBI), \nthe Cybersecurity and Infrastructure Agency (CISA), \nthe Environm ental Protection Agency (EPA ), and the \nNational Security Agency (NSA) to highlight ongoing \nmalicious cyber activity by both known and \nunknown actors targeting the information \ntechnology (IT) and operational technology (OT) networks, systems, and devices of \nU.S. Water and \nWastewater Systems (WWS) Sector facilities . This \nactivity which includes attempts to compromise system integrity via unauthorized access threatens \nthe ability of WWS facilities to provide clean, potable water to, and effectively manage the wastewater \nof, their communities. Note: although cyber threats across critical infrastructure sectors  are increasing, \nthis advisory does not intend to indicate specific targeting of t he WWS Sector versus others.  \nTo secure WWS facilities including Department of Defense (DoD) water treatment facilities in the \nUnited States and abroadagainst the TTPs listed below , CISA, FBI, EPA, and NSA strongly urge \norganizations to implement the measures described in the Recommended Mitigations section of this \nadvisory.  Immediate Actions WWS Facilities C an \nTake Now to Protect Against Malicious \nCyber Activity \n Do not click on suspicious links .  \n If you use RDP , secure and monitor it. \n Update  your OS and software. \n Use strong passwords .  \n Use multi -factor authentication . \n\n \n  FBI | CISA  | EPA  | NSA   TLP:WHITE  \n \nPage 2 of 7  |  Product ID : AA21-287A  \nTLP: WHITE    THREAT OVERVIEW  \nTactics, Techniques, and Procedures  \nWWS facilities may be vulnerable to the following common tactics, techniques, and procedures \n(TTPs) used by threat actors to compromise IT and OT networks, systems, and devices.  \n Spearphishing personnel to deliver malicious payloads, including ransomware [T1566 ].  \no Spearphishing is one of the most prevalent techniques used for initial access to IT \nnetworks . Personnel and their potential lack of cyber awareness are a vulnerability \nwithin an organization. Personnel may open malicious attachments or links to execute \nmalicious payloads contained in emails from threat actors that have successfully  \nbypass ed email filtering controls .  \no When organizations integrate IT with OT systems, attackers can gain access either \npurposefully or inadvertently to OT assets  after the IT network has been \ncompromised through spearphishing and other techniques . \no Exploitation of internet-connected services and applications that enable remote access \nto WWS networks  [T1210 ].  \no For example, threat actors can exploit a Remote Desktop Protocol (RDP)  that is \ninsecurely connected to the internet to infect a network with ransomware. If the RDP is \nused for process control equipment, the attacker could also compromise WWS \noperations. Note: the increased use of remote operations due to the COVID -19 \npandemic has likely increased the prevalence of weaknesses associated with remote access.   \n Exploitation of unsupported or outdated operating systems and software. \no Threat actors likely seek to take advantage of perceived weaknesses among \norganizations that either do not have or choose not to prioritizeresources for IT/OT \ninfrastructure modernization. WWS facilities tend to allocate resources to physical \ninfrastructure in need of replacement or repair (e.g., pipes) rather than IT/OT \ninfrastructure. \no The fact that WWS facilities are inconsistently resourced municipal systems not all of \nwhich have the resources to employ consistently high cybersecurity standards may \ncontribute to the use of unsupported or outdated operating systems and software.  \n Exploitation of c ontrol system devices with  vulnerable firmware versions.  \no WWS systems commonly use outdated control system devic es or firmware versions , \nwhich  expose WWS networks to publicly accessible and remotely executable \nvulnerabilities. Successful compromise of these devices may lead to loss of system control, denial of service, or loss of sensitive data [T0827\n]. \nWWS Sector Cyber Intrusions  \nCyber intrusions targeting U.S. WWS facilities highlight vulnerabilities associated with the following \nthreats:  \n Insider threats  from current or former employees who maintain improperly active credentials  \n Ransomware attacks  \n\n \n  FBI | CISA  | EPA  | NSA   TLP:WHITE  \n \nPage 3 of 7  |  Product ID : AA21-287A  \nTLP: WHITE    WWS Sector cyber intrusions from 2019 to early 2021 include: \n In August 2021, malicious cyber actors used Ghost variant ransomware against a California-\nbased WWS facility. The ransomware variant had been in the system for about a month and \nwas discovered when three supervisory control and data acquisition (SCADA) servers \ndisplayed a ransomware message. \n In July 2021, cyber actors used remote access to introduce ZuCaNo ransomware onto a Maine-based WWS facilitys wastewater SCADA computer. The tr eatment system was run \nmanually  until the SCADA computer was restored using local control and more frequent \noperator rounds. \n In March 2021, cyber actors used an unknown ransomware variant against a Nevada -based \nWWS facility. The ransomware affected the victims SCADA system and backup systems. The SCADA system provides visibility and monitoring but is not a full industrial control system \n(ICS).  \n In September 2020, personnel at a New Jersey -based WWS facility discoveredwhat they \nbelieved to beMakop ransomware had compromised files within their system.  \n In March 2019, a former employee at Kansas -based WWS facility unsuccessfully attempted to \nthreaten drinking water safety by using his user credentials, which had not been revoked at \nthe time of his resignation, to remotely access a facility computer. \nRECOMMENDED MITIGATIONS  \nThe FBI, CISA, EPA, and NSA recommend WWS facilities including DoD water treatment facilities \nin the United States and abroaduse a risk -informed analysis to determine the applicability of a \nrange of technical and non-technical mitigations to prevent, detect, and respond to cyber threats.  \nWWS  Monitoring  \nPersonnel responsible for monitoring WWS should check for the following suspicious activities and \nindicators, which may be indicative of threat actor activity:  \n Inability of WWS facility personnel to access SCADA system controls at any time, either \nentirely or in part; \n Unfamiliar data windows or system alerts appearing on SCADA system controls and facility data screens that could indicate a ransomware attack;  \n Detection by SCADA system controls, or by water treatment personnel, of abnormal operating parameters such as unusually high chemical addition rates used in the safe and proper \ntreatment of drinking water; \n Access of SCADA systems by unauthorized individuals or groups, e.g., former employees and current employees not authorized/assigned to operate SCADA systems and controls.  \n Access of SCADA systems at unusual tim es, which may indicate that a legitimate users \ncredentials have been compromised .  \n Unexplained SCADA system restarts. \n Unchanging parameter values that normally fluctuate.   \n\n \n  FBI | CISA  | EPA  | NSA   TLP:WHITE  \n \nPage 4 of 7  |  Product ID : AA21-287A  \nTLP: WHITE    Remote Access Mitigations  \nNote:  The increased use of remote operations due to the COVID -19 pandemic increases the \nnecessity for asset owner -operators to assess the risk associated with enhanced remote access to \nensure it falls within acceptable levels.   \n Require multi -factor authentication for all remote access to the OT network, includ ing from the \nIT network and external networks.  \n Utilize blocklisting and allowlisting  to limit remote access to users with a verified business \nand/or operati onal need.  \n Ensure that all remote access technologies have logging enabled and regularly audit these \nlogs to identify instances of unauthorized access.  \n Utilize manual start and stop features in place of always activated unattended access to \nreduce the ti me remote access services are running.  \n Audit networks for systems using remote access services.  \no Close unneeded network ports associated with remote access services (e.g., RDP   \nTransmission Control Protocol [TCP] Port 3389). \n When configuring access control for a host , utilize custom settings to limit  the access a remote \nparty can attempt to acquire. \nNetwork Mitigations  \n Implement and ensure robust network segmentation between IT and OT networks to limit the \nability of malicious cyber actors to pivot to the OT network after compromising the IT network. \no Implement demilitarized zones (DMZs), firewalls, jump servers, and one- way \ncommunication diodes to prevent unregulated communication between the IT and OT networks. \n Develop/update network maps to ensure a full accounting of all equipment that is connected to \nthe network.  \no Remove any equipment from networks that is not required to conduct operations  to \nreduce the attack surface malicious actors can exploit.   \nPlanning and Operational Mitigations  \n Ensure the organizations emergency response plan considers the full range of potential impacts that cyberattacks pose to operations, including los s or manipulation of view, loss or \nmanipulation of control, and threats to safety.  \no The plan should also consider third parties with legitimate need for OT network access, including engineers and vendors.  \no Review, test, and update the emergency response plan on an annual basis to ensure accuracy.  \n Exercise the ability to fail over to alternate control systems, including manual operation while assuming degraded electronic communications.  \n Allow employees to gain decision-making experience via tabletop exercises  that incorporate \nloss of visibility and control scenarios. Utilize resources such as the Environment Protection \n\n \n  FBI | CISA  | EPA  | NSA   TLP:WHITE  \n \nPage 5 of 7  |  Product ID : AA21-287A  \nTLP: WHITE    Agencys (EPA) Cybersecurity Incident Action Checklist  as well as the Ransomware \nResponse Checklist on p. 11 of the CISA -Multi -State Information Sharing and Analysis Center \n(MS-ISAC) Joint Ransomware Guide .  \nSafety System Mitigations  \n Install independent cyber -physical safety systems. These are systems that physically prevent \ndangerous conditions from occurring if the control system is compromised by a threat actor.  \no Examples of cyber -physical safety system controls include:  \n Size of the chemical feed pump \n Gearing on valves  \n Pressure switches, etc.  \no These types of controls benefit WWS Sector facilities especially smaller facilities  with \nlimited cybersecurity capability because they enable facilit y staff to assess system s \nfrom a worst-case scenario  and determine protective solutions . Enabling cyber -\nphysical safety systems allows operators to take physical  steps to limit the damage, for \nexample, by preventing cyber actors, who have gained control of a sodium hydroxide \npump, from raising the pH to dangerous levels.  \nAdditional Mitigations  \n Foster an organizational culture of cyber readiness. See the CISA Cyber Essentials  along with \nthe items listed in the Resources section below for guidance.    \n Update software, including operating systems, applications, and firmware on IT network \nassets. Use a risk -based assessment strategy to determine which OT network assets and \nzones should participate in the patch management program. Consider using a centralized patch management system.  \n Set antivirus/antimalware programs to conduct regular scan s of IT network assets using up-to-\ndate signatures. Use a risk -based asset inventory strategy to determine how OT network \nassets are identified and evaluated for the presence of malware.   \n Implement regular data backup procedures on both the IT and OT netw orks.  \no Regularly test backups.  \no Ensure backups are not connected to the network to prevent the potential spread of \nransomware to the backups. \n When possible, enable OT device authentication, utilize the encrypted version of OT \nprotocols, and encrypt all wireless communications to ensure the confidentiality and \nauthenticity of process control data in transit.  \n Employ  user account management to:   \no Remove, disable, or rename any default system accounts wherever possible.  \no Implement account lockout policies to reduce risk from brute-force attacks.  \no Monitor the creation of administrator -level accounts by third-party vendors with robust \nand privileged account management policies and procedures.  \no Implement a user account policy that includes set durations for deactivation and \nremoval of accounts after employees leave the organization or after accounts reach a \ndefined period of inactivity. \n\n \n  FBI | CISA  | EPA  | NSA   TLP:WHITE  \n \nPage 6 of 7  |  Product ID : AA21-287A  \nTLP: WHITE     Implement data execution prevention controls, such as application allowlisting and software \nrestriction policies that prevent programs from executing from common ransomware locations, \nsuch as temporary folders supporting popular internet browsers. \n Train users through awareness and simulations to recognize and report phishing and social \nengineering attempts. Identify and suspend access of users exhibiting unusual activity. \nFBI, CISA, EPA, and NSA would like to thank Dragos as well as the WaterISAC for their contributions \nto this advisory. \nRESOURCES  \nCyber Hygiene Services  \nCISA offers a range of no-cost cyber hygiene services including vulnerability scanning and \nransomware readiness assessments to help critical infrastructure organizations assess, identify, and \nreduce their exposure to cyber threat s. By taking advantage of these services, organizations of any \nsize will receive recommendations on ways to reduce their risk and mitigate attack vectors.  \nRewards for Justice Reporting  \nThe U.S. Department of States Rewards for Justice (RFJ) program offer s a reward of up to $10 \nmillion for reports of foreign government malicious activity against U.S. critical infrastructure. See the \nRFJ website  for more information and how to report information securely.  \nStopRansomware.gov   \nThe StopRansomware.gov  webpage is an interagency resource that provides guidance on \nransomware protection, detection, and response. This includes ransom ware alerts, reports, and \nresources from CISA and other federal partners, including:  \n CISA and MS -ISAC: Joint Ransomware Guide  \n CISA Insights: Ransomware Outbreak  \n CISA Webinar: Combating Ransomware  \nAdditional Resources  \nFor additional r esources that can assist in preventing and mitigating this activity, see:  \n FBI-CISA -EPA-MS -ISAC Joint CSA: Compromise of U.S. Water Treatment Facility  \n WaterISAC: 15 Cybersecurity Fundamentals for Water and Wastewater Utilities  \n American Water Works Association: Cybersecurity Guidance and Assessment Tool  \n EPA: Cybersecurity Incident Action Checklist  \n EPA: Cybersecurity Best Practices for the Water Sector  \n EPA: Supporting Cybersecurity Measures with the Clean Water  and Drinking Water  State \nRevolving Funds  \n CISA : Cyber Risks & Resources for the Water and Wastewater Systems Sector  infographic  \n CISA: Critical ICS Cybersecurity Performance Goals and Objectives  \n\n \n  FBI | CISA  | EPA  | NSA   TLP:WHITE  \n \nPage 7 of 7  |  Product ID : AA21-287A  \nTLP: WHITE     CISA Fact Sheet: Rising Ransomware Threat to Operational Technology Assets  \n CISA -MS-ISAC: Joint Ransomware Guide  \n NSA CSA:  Stop Malicious Cyber Activity Against Connected OT  \n CISA: Insider Threat Mitigation Resources  \n NIST: Special Publication (SP) 800-167, Guide to Application Whitelisting  \n NIST: SP 800 -82 Rev. 2, Guide to Industrial Control Systems (ICS) Security  (Section 6.2.1)  \nDISCLAIMER OF ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any \nwarranties or guarantees. Reference herein to any specific commercial products, process, or service \nby trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by  the United States Government, and this guidance shall not be used \nfor advertising or product endorsement purposes. \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa_ongoing_cyber_threats_to_u.s._water_and_wastewater_systems_20211014",
  "source": "nsa",
  "id": "7299fb8598e63c9c163cd4010a451456932da8d7db891cf600e9b9d457d19457"
}