{
  "markdown": "  \nU/OO/106122 -22 | PP-22- 0729  | MAY  2022 Ver 1. 1 \nNational Security Agency  | Cybersecurity Advisory  \nProtecting VSAT Communications  \nVSAT communications are at risk \nCommercial Very Small Aperture Terminal (VSAT) networks are increasingly used for \nremote communications in support of U .S. government missions. Due to the nature of \nVSAT network communication links and recent vulnerabilities discovered in VSAT \nterminals, n etwork communications over these links are at risk of being exposed and \nmay be targeted by adversaries for the sensitive information they contain or to \ncompromise connected networks. Most of these \nlinks are unencrypted, relying on frequency \nseparation or p redictable frequency hopping \nrather than encryption to separate \ncommunications. Public vulnerability research has \nfound certain terminal equipment vulnerable to \ncompromise and illicit firmware modification [1]. \nNSA recommends that VSAT networks enable any available transmission security \n(TRANSEC) protections, segment and encrypt network communications before \ntransmitting across the VSAT links, and keep VSAT equipment and firmware up  to date.  \nRecent Russian cyber activity in Ukraine further underscores the r isk to VSAT \ncommunications for both espionage and disruption. According to a recent U.S. and \nEuropean Union statements, the Russian military launched cyber attacks in late \nFebruary against commercial satellite communications networks to disrupt Ukrainian \ncommand and control during the invasion, and those actions had spillover impacts into \nother European countries. The activity disabled very small aperture terminals in Ukraine \nand across Europe, including tens of thousands of terminals outside of Ukraine th at, \namong other things, support wind turbines and provide Internet services to private \ncitizens  [2]. \nEncrypt network comm unication s over VSAT links  \nVSAT systems (including terminals, modems, and ground stations) should be treated as \nunencrypted wireless ne tworks for cybersecurity purposes. In other words, they should \nnot be relied on to provide confidentiality from motivated cyber actors. Although they \noffer \"virtual\" network separation capabilities, such logical isolation cannot be trusted to NSA recom mends:  \n Enabling TRANSEC  \n Segmenting and encrypting \nnetworks  before VSAT links  \n Updating equipment  and \nfirmware  \n\n \n \n U/OO/106122 -22 | PP-22- 0729 | MAY 2022 Ver 1.1  2 \nNSA | Protecting VSAT Communications  \nprovide acces s control, separation, or confidentiality of sensitive information. Further, \nmany of these networks  can be gateways to the Internet, making them easy targets for \nremote exploitation. When using VSAT networks as with any other untrusted transport \nnetwork information should first be secured using network encryption solutions to \nachieve confidentiality and protect against malicious cyber activity. According to US \npolicy, controlled unclassified information (CUI) should be encrypted with commercial \nnetwork encr yption solutions , such as Internet Protocol Security (IPsec) or Transport \nLayer Security virtual private networks (TLS VPNs) first. Depending on network needs, \nmany solutions exist to provide scalable encryption links.  \nPoint -to-point communications over ot herwise  unencrypted IP -based networks may \nutilize (in accordance with NIST SP 800 -131A rev2 and SP 800 -56A rev3 guidance) \nIKE/IPsec -encrypted VPNs using certificates or pre -shared keys to authenticate peers \nand a Diffie -Hellman (DH) key exchange of at leas t 3072 bits or Elliptic Curve DH \n(ECDH) keys of 384 bits or larger (groups 14, 15, 16, 19, or 20) [ 3]. Point -to-point \ncommunications for National Security Systems should conform to CNSSP  15 standards \n[2]. Pre -shared keys should not be used with aggressive mode and should be protected \nfrom unauthorized disclosure. These IPsec VPNs provide mutual authentication to both \nends of the VPN and protect the confidentiality of the data in transit. Similar \ncryptographic algorithms should be employed for TLS -based VPNs . Multipoint \nencrypted VPNs may be appropriate in architectures where many point -to-point VPNs \nare unmanageable. Examples of commercial multipoint VPN products include Cisco \nGET VPN, Cisco FlexVPN (previously known as DMVPN), and Juniper Auto Discovery \nVPN (ADVPN).  \nEncrypted VPN solutions protect the authenticity, integrity, and confidentiality of network \ntraffic before passing it over the VSAT link. NSA recommends using mutually  \nauthenticated, encrypted TRANSEC. The encryption should be applied down to and \nincluding the outermost vendor -proprietary transmission protocol, using an NSA -\napproved cryptographically generated pseudorandom key stream (AES  256) and key \nmanagement scheme.  \nBest practice guidance on using  commercial satellite communications (SATCOM) is that \nnetwork owners not use descriptive naming conventions and identifiers in SATCOM and \nmobile communications device configurations. This can complicate identification of \ndevices and network topologies by external actors to under stand their purposes.  \n\n \n \n U/OO/106122 -22 | PP-22- 0729 | MAY 2022 Ver 1.1  3 \nNSA | Protecting VSAT Communications  \nAdditional VSAT best practices  \nNSA recommends keeping all IT equipment up  to date. VSAT equipment is no \nexception [ 4]. Networking equipment is increasingly becoming a target for malware, and \nthe vulnerabilities above suggest that VSAT  terminals and network infrastructure could \nbe targeted like other networking technologies. Avoiding direct Internet access can \nreduce the attack surface, but should not be seen as a substitute for closing known \nterminal equipment vulnerabilities through s oftware and firmware updates. Device \nupdates and upgrades should be acquired from trusted, known -good sources.  \nIn addition, VSAT systems utilize vendor -specific default credentials, which are \npublished in user manuals; these passwords can enable root acce ss to VSAT network \nmanagement systems. NSA recommends changing all default credentials . \nVSAT networks are designed for high -availability connections with sometimes little in \nterms of default authentication measures. Due to this, NSA recommend s that VSAT \nnetworks be segmented with approved firewalls and other similar technology . This \nsegmentation should isolate  the management plane of the network, such as the network \nmanagement system, so that it is not accessible by remote VSAT modems apart fro m \nvendor -identified ports and protocols.  \nWorldwide connectivity  \nCommercial VSAT technologies provide valuable, worldwide connectivity options, \nenabling multiple mission types when more robust options are unavailable or \nimpractical. Users of such networks s hould ensure  that data transmissions are \nencrypted , adopt  network hygiene best practices , and seek to continuously monitor the \nVSAT network for unauthorized activity . Users should consider possible threats and the \nassociated mission impacts when selecting SATCOM solutions.  \n  \n\n \n \n U/OO/106122 -22 | PP-22- 0729 | MAY 2022 Ver 1.1  4 \nNSA | Protecting VSAT Communications  \nWorks c ited \n[1] R. Santamarta, Lecture and White Paper, BlackHat USA (2018), Topic: Last Call for SATCOM \nSecurity, Available  at: https://i.blackhat.com/us -18/Thu -August -9/us-18-Santamarta -Last-Call-For-\nSatcom -Security -wp.pdf  \n[2] State Department  (2022), State Department Attribution Statement  Press Release . Available at: \nhttps://www.state.gov/ press -releases/  \n[3] Committee on Na tional Security Systems  (2016), CNSSP 15 Use of Public Standards  for Secure \nInformation Sharing.  Available  at: http://www.cnss.gov/CNSS/issuances/Policies.cfm  \n[4] National Security Agency (2019), Update and Upgrade Software Immediately. Available  at: \nhttps://www.nsa.gov/cybersecurity -guidance    \nDisclaimer of endorsement  \nThe information and opinions contained i n this document are provided \"as is\" and without any warranties or \nguarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise, does not constitute or imply its endorsement, rec ommendation, or favoring by the United \nStates Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nTrademark recognition  \nCisco is a registered trademark of Cisco Technology, Inc.  Juniper is a registered trademark of Juniper Networks, \nInc. \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify \nand disseminate threats to National Security Systems, Department of Defense, and Defense Indu strial Base \ninformation systems, and to develop and issue cybersecurity specifications and mitigations. This information may be \nshared broadly to reach all appropriate stakeholders.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cybersecuri ty Requirements Center, 410 -854-4200, \nCybersecurity_Requests@nsa.gov  \n \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov   \n \nMedia Inquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa_protecting_vsat_communications_05102022",
  "source": "nsa",
  "id": "d8ee17634b449565c0574709eda5d7dacc914ae6df781c58ee16987eb60ff02e"
}