{
  "markdown": "  \nU/OO/132340 -21 | PP-21-0292  | April 2021 Ver. 1.0   \n \nCybersecurity Advisory  \nFederal Bureau \nof Investigation  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nNational  \nSecurity  \nAgency  \nRussian SVR Targets U.S. and Allied Networks  \nExecutive summary  \nRussian Foreign Intelligence Service (SVR) actors (also known as APT29, Cozy  Bear, and The Dukes) frequently use \npublicly  known vulnerabilities  to conduct widespread scanning and exploitation against vulnerable systems in an effort to \nobtain authentication credentials to allow further access. This targeting and exploitation encompasses U.S. and allied \nnetworks, including nati onal security and government -related systems.  \nRecent Russian SVR activities include compromising  SolarWinds Orion software updates,[1] targeting COVID -19 \nresearc h facilities through deploying  WellMess malware ,[2] and leveraging  a VM ware vulnerability  that was a zero -day at \nthe time for follow -on Security Assertion Markup Language (SAML ) authentication abuse .[3] SVR cyber actors also used \nauthentication abuse  tactics following  SolarWinds -based breaches .[4] [5] \nThe SVR has exploited and continues to successfully exploit software  vulnerabilities  to gain initial footholds into victim \ndevices and networks , to include:  \n CVE-2018 -13379 Forti net[2] \n CVE-2019 -9670 Zimbra[2] \n CVE-2019 -11510 Pulse Secure[2] \n CVE-2019 -19781 Citrix[2] \n CVE-2020 -4006 VM ware[3] \nThe National Security Agency ( NSA), Cybersecurity and Infrastructure Security Agency ( CISA ), and Federal Bureau of \nInvestigation (FBI)  previously shared mitigations to defend against  exploit ation  of these vulnerabilities. Knowing t he \ntradecraft that nation -state cyber actors use along with relevant response actions will enable network defenders to focus \non mitigating the  vulnerabilitie s and techniques , enabling  more comprehensive protection against  adversary compromise.  \n  \n\n \n \nU/OO/132340 -21 | PP-21-0292  | April 2021 Ver. 1.0  2 \n  \nNSA, CISA , & FBI | Russian SVR Targets U.S. and Allied Networks  \nDetailed vulnerabilities and mitigations  \nNSA, CISA, and FBI are aware that United States Government, critical infrastructure  (including Defense Industrial Base) , \nand allied networks are consistently scanned, targeted, and exploited  by Russian state -sponsored cyber actors. NSA , \nCISA, and FBI recommend that critical system owners prioritize the following mitigation  actions  to mitigate the loss of \nsensitive information that could impact U.S. policies, strategies, plans, ongoing operati ons, and competitive advantage. \nAdditionally, due to the various systems and networks that could be impacted outside of these sectors, NSA , CISA, and \nFBI recommend that the following mitigations  be prioritized for action by all network defenders.  \nThe techniques leveraged by SVR actors include1: \n Exploit ing public-facing application s (T11902) \n Leveraging e xternal remote services ( T1133 ) \n Compromising s upply chains (T1195 ) \n Using v alid accounts ( T1078 ) \n Exploiting software  for credential access ( T1212 ) \n Forging web credentials: SAML tokens ( T1606.002 ) \nWhile some vulnerabilities have specific additional mitigations below, the follo wing general mitigations apply:  \n Keep systems and products updated and patch as soon as possible after patches are released  since many actors \nexploit numerous vulnerabilities .3 \n Expect that the risk from data stolen or modified (including credentials, accoun ts, and software) before a device was \npatched will not be alleviated by patching  or simple remediation actions . Assume that a bre ach will happen, enforce \nleast -privilege d access, and  make password changes and account  review s a regular  practice.4 \n Disable external management capabilities and set up an out -of-band management network.5 \n Block obsolete or unused protocols at the network edge and disable them in device configurations.6 \n Isolate Internet -facing services in a network Demilitarized Zone (DMZ) to red uce exposure of the internal network.7 \n Enable robust logging of Internet -facing services and authentication functions.  Continuously hunt for signs of \ncompromise  or credential misuse,  particularly within cloud environments .8 \n Adopt a mindset that compromise happens:  prepare  for incident response activities, only communicate about \nbreaches on out -of-band channel s, and take care to uncover a breachs  full scope before remediating .9 \nThe following is a list of specific Common Vulnerabilities and Exposures ( CVEs ) being actively exploited  by SVR actors, a \ndescription of the vulnerability, and the recommended mitigations.  \nCVE Number  Vulnerability Description  Prior Cybersecurity Guidance   \nCVE-2018-13379  In Fortinet Secure Sockets Layer ( SSL) Virtual \nPrivate Network ( VPN) web portals, an Improper \nLimitation of a Pathname to a Restricted Directory \n(\"Path Traversal\") allows an unauthenticated attacker \nto download system files via special crafted HTTP \nresource requests.  Advisory : APT29 target COVID -19 vaccine \ndevelopment  (U/OO/152680 -20) \n \nMitigating Recent VPN Vulnerabilities  \n(U/OO/196888 -19) \nAffects : Fortinet FortiOS  6.0.0 to 6.0.4, 5.6.3 to 5.6.7 and 5.4.6 to 5.4.12  \nCVE-2019 -9670 In Synacor Zimbra Collaboration Suite, the mailboxd \ncomponent has an XML External Entity injection \n(XXE) vulnerability.  Advisory: APT29 target COVID -19 vaccine \ndevelopment  (U/OO/152680 -20) \nAffects : Synacor Zimbra Collaboration Suite 8.7.x before 8.7.11p10 . \n                                                                                       \n1 Refer to CISA Alert: Advanced Persistent Threat Compromise  of Government Agencies, Critical Infrastructure, and Private Sector Organizations  (AA20 -352A ) for more techniques.  \n2 T1190 and similar references are MITRE ATT&CK techniques.  \n3 Refer to  Update and Upgrade Software Immediately  (U/OO/181147 -19). \n4 Refer to Defend Privileges and Accounts  (U/OO/181857 -19) and the assume breach principle of CSI  Embracing a Zero Trust Security Model  (U/OO/ 115131 -21). \n5 Refer to  Perform Out -of-Band Network Management  (U/OO/169570 -20). \n6 Refer to  Hardening Network Devices  (U/OO/171339 -16), Outdated Software and Protocols  (U/OO/802041 -16), and Outdated Network Devices and Unsecured Protocols  (U/OO/802587 -16). \n7 Refer to  Segment Networks and Deploy Application -Aware Defenses  (U/OO/184967 -19). \n8 Refer to CISA Alert Detecting Post -Compromise Threat Activity in Microsoft Cloud Environments  (AA21 -008A ). \n9 Refer to CISA Alert: Technical Approaches to Uncovering and Remediating Malicious Activity  (AA20 -245A).  \n\n \n \nU/OO/132340 -21 | PP-21-0292  | April 2021 Ver. 1.0  3 \n  \nNSA, CISA , & FBI | Russian SVR Targets U.S. and Allied Networks  \nCVE Number  Vulnerability Description  Prior Cybersecurity Guidance   \nCVE-2019 -11510  In Pulse Secure VPNs, an unauthenticated remote \nattacker can send a specially crafted Uniform \nResource Identifier ( URI) to perform an arbitrary file \nread. Advisory: APT29 target COVID -19 vaccine \ndevelopment  (U/OO/152680 -20) \n \nMitigating Recent VPN Vulnerabilities  \n(U/OO/196888 -19) \nAffects:  Pulse Connect Secure (PCS) 8.2 before 8.2R12.1, 8.3 before 8.3R7.1, and 9.0 before 9.0R3.4 .  \nCVE-2019 -19781   Citrix Application Delivery Controller (ADC) and \nGateway  allow  directory traversal.  Advisory: APT29 target COVID -19 vaccine \ndevelopment  (U/OO/152680 -20) \n \nDetect and Prevent Web Shell Malware  \n(U/OO/134094 -20) \n \nMitigate CVE-2019 -19781  (U/OO/103100 -20) \nAffects:  Citrix  ADC and Gateway versions before 13.0.47.24, 12.1.55.18, 12.0.63.13, 11.1.63.15 and 10.5.70.12 and SD -WAN \nWANOP 4000 -WO, 4100 -WO, 5000 -WO, and 5100 -WO version s before 10.2.6b and 11.0.3b . \nCVE-2020 -4006  VMware Workspace One Access, Access Connector, \nIdentity Manager, and Identity Manager Connector \nhave a command injection vulnerability . Russian State -Sponsored Actors Exploiting \nVulnerability in VMware Workspace O NE Access \nUsing Compromised Credentials  (U/OO/195076 -20) \n \nPerform Out -of-Band Network Management  \n(U/OO/169570 -20) \nAffects : VMware One Access 20.01 and 20.10 on Linux, VMware Identity Manag er 3.3.1 - 3.3.3 on Linux, VMware Identity Manager \nConnector 3.3.1  - 3.3.3 and 19.03, VMware Cloud Foundation 4.0  - 4.1, and VMware Vrealize Suite Lifecycle Manager  8.x. \nWorks cited \n[1]  White House (2021 ), White House Public Attribution Statement . Available at:  https://www.whitehouse.gov/briefing -room/   \n[2]  National Cyber Security Centre  (UK), Communications Security Establishment (Canada), National Security Agency , and Cybersecurity and \nInfrastructure Security Agency  (2020), Advisory: APT29 targets COVID -19 vaccine development  (U/OO/ 152680 -20). Available at: \nhttps://www.nsa.gov/cybersecurity -guidance   \n[3]  National Security Agency (2020), Russi an State -Sponsored Actors Exploiting Vulnerability in VMware Workspace ONE Access Using \nCompromised Credentials  (U/OO/ 195076 -20). Available at: https://www.nsa.gov/cybersecurity -guidance   \n[4] National Security Agency (2020), Detecting Abuse of Authentication Mechanisms  (U/OO/198854 -20). Available at: \nhttps://www.nsa.gov/cybersecurity -guidance   \n[5]  Federal Bureau Of Investigation, Cyber Division (2020), Advanced Persistent Threat Actors Leverage SolarWinds Vulnerabilities  (PIN 20201222 -\n001). Available at : https://www.ic3.gov/Media/News/2020/201229.pdf    \nDisclaimer of endorsement  \nThe information and opinions contained in th is document are provided as is  and without any warranties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply i ts endorsement, \nrecommendation, or favoring by the Unit ed States Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed by NSA, CISA and FBI in furtherance of their respective  cybersecurity missions, including their responsibilities to identify \nand disseminate information about threats to U.S. Government and critical infrastructure  information systems, and to develop and issue cybersecurity \nspecifications and mitigations. This information may be shared broadly to reach all appropriate  stakeholders.  \nTrademarks  \nSolarWinds and SolarWinds Orion are registered trademark of SolarWinds Worldwide, LLC.   VMware, VMware Workspace ONE, VMware Identity \nManager (vIDM), VMware Access, VMware Cloud Foundation, and VMware vRealize Suite Lifecy cle Manager are registered trademarks of VMware, \nInc.  Fortinet is a registered trademark of Fortinet, Inc.   Zimbra is a registered trademark of Synacor, Inc.   Pulse Secure is a registered trademark of \nPulse Secure, LLC.   Citrix is a registered trademark of Citrix Systems, Inc.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia I nquiries / Press Desk:  \n NSA Media Relations, 443 -634-0721, MediaRelations@nsa.gov   \n CISA Media Relations, 703 -235-2010,  CISAMedia@cisa.dhs.gov   \n FBI National Press  Office , 202 -324-3691, npo@fbi.gov  \n\n",
  "cves": [
    "CVE-2018-13379"
  ],
  "techniques": [
    "T1606.002"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa_svr_targets_us_allies_uoo13234021",
  "source": "nsa",
  "id": "58f6e3b660a081908f777610c950c2260c9d48b83d59fa33c6bdefb24cea9c52"
}