{
  "markdown": "  \n| U/OO/195076 -20 |  PP-20-1385 | Dec. 2020  Ver 1.0  \nNational Security Agency | Cybersecurity Advisory  \nRussian State -Sponsored Actors  Exploiting Vulnerability in \nVMware Workspace O NE Access  Using Compromised \nCredentials   \nSummary  \nRussian state -sponsored malicious cyber actors are exploiting a vulnerability in VMware1 Access and VMware Identit y \nManager2 products [1], allowing the actors access to protected data  and abusing federated authentication . VMware \nreleased a patch for the C ommand Injection Vulnerability captured in  CVE-2020 -4006 on December 3rd 2020 . NSA \nencourages National Security System (NSS), Department of Defense (DoD), and Defense Industrial Base (DIB) network \nadministrators to prioritize mitigation of the vulnerability on affected servers . \nPassword -based access to the web -based management interface of the device is required  to exploit the vulnerability , so \nusing a strong and unique password lowers the risk of exploitation . The risk is lowered further if the  web-based \nmanagement interface is not accessible from Internet. The vulnerability affects the following products  [2]: \n VMware Access3 20.01  and 20.10  on Linux4 \n VMware vIDM5 3.3.1, 3.3.2, and 3.3.3 on Linux  \n VMware vIDM Connector  3.3.1, 3.3.2, 3.3.3 , 19.0 3 \n VMware Cloud Foundation6 4.x \n VMware vRealize Suite Lifecycle Manager7 8.x \nThe exploitation  (T11908) via command injection (T1059) led to installation of a web shell (T1505.003 ) and follow -on \nmalicious activity where credentials in the form of SAML authentication assertions  were generated and sent to Microsoft9 \nActive Directory Federation Services (ADFS)  (T1212 ), which in turn g ranted the actors  access to protected data  (TA0009 ). \nIt is critical when running products that perform authentication that the server and all the services that depend on it are \nproperly configured for secure operation and integration. Otherwise, SAML assertions could be forged, granting access to \nnumerous resources. If integrating authentication servers with ADFS, NSA recommen ds following Microsofts best \npractices, especially for securing SAML assertions and requirin g multi -factor authentication [3 ] [4]. \nMitigation Actions  \nPatch  \nUpdate affected systems to the latest version as soon as possible according to VMwares instruction s at KB81754  [1] [5]. \nReview and harden configurations and monitoring of federated authentication providers.  \n                                            \n1 VMware is a registered trademark of VMware, Inc.  \n2 VMware Workspace ONE Access, formerly VMware Identity Manager (vIDM), are noted throughout as VMware Access or vIDM  \n3 VMware Access is a registered trademark of VMware, Inc.  \n4 Linux is a registered trademark of Linus Torvalds . \n5 VMware vIDM is a registered trademark of VMware, Inc.  \n6 VMware  Cloud Foundation is a registered trademark of VMware, Inc.  \n7 VMware  vRealize Suite Lifecycle Manager is a registered trademark of VMware, Inc.  \n8 T1190 and similar references are MITRE ATT&CK techniques and tactics. MITRE and ATT&CK are registered trademarks of The MITRE Corporation.  \n9 Microsoft is a registered trademark of Microsoft Corporation.  \n\n \n \n|  U/OO/195076 -20  |  PP-20-1385   |  Dec. 2020 Ver 1.0  2 \nRussian State -Sponsored Actors Exploiting Vulnerability in VMware  \nWorkspace O NE Access  Using Compromised Credentials  \nWorkaround  \nAccording to VMwares Knowledge Base article KB81731 , critical portions of this activity can be blocked by disabling the \nconfigurator service using the following procedures for Linux -based appliances  [6]: \n1. Use ssh to connect to the appliance using  sshuser  credentials configured during installation or when updated \nlater.  \n2. Switch to root by typing su and provide  root  credentials configured during installation or when updated later.  \n3. Run the following commands:  \ncd /opt/vmware/horizon/workspace  \nmkdir webapps.tmp  \nmv conf/Catalina/localhost/cfg.xml webapps.tmp  \nservice horizon -workspace restart  \n \n4. Repeat steps for all Linux -based appliances affected by CVE -2020 -4006.  \nFor Windows -based servers:  \n1. Log in as Administrator.  \n2. Open a Command Prompt window and run the  following commands:   \nnet stop VMwareIDMConnector  \ncd \\VMware\\VMwareIdentityManager \\Connector \\opt\\vmware\\horizon\\workspace  \nmkdir webappstmp  \nmove webapps \\cfg webappstmp  \nmove conf \\Catalina \\localhost \\cfg.xml webappstmp  \nnet start VMwareIDMConnector  \n \n3. Repeat steps for all Windows -based servers affected by CVE -2020 -4006.  \nVMwares KB81731  lists steps to revert the workaround if needed.  \nThis workaround should only be a temporary fix until able to fully patch t he system.  In addition, review and harden \nconfigurations and monitoring of federated authentication providers.  \nDetection  \nNetwork -based indicators are unlikely to be effective at detecting exploitation since the activity occurs exclusively inside \nan encrypt ed transport layer security (TLS) tunnel associated with the web interface. However, i ndications of t his activity \nmay be caught in server logs. The presence of an exit statement followed by any 3 -digit number, such as exit 123, \nwithin the configurator. log would suggest that exploitation activity may have occurred on the system.  This log can be \nfound at /opt/vmware/horizon/workspace/logs/configurator.log  on the server.  Other commands along with encoded scripts \nmay also be present. If such logs are detected, incident response actions should be follo wed. Additional investigation of  \nthe server, especially for web shell malware , is recommended ( see the NSA CSI Detect and Prevent Web Shell Malware  \n[7]). \nRegularly monitor authentication  logs for anomalous authentications, especially successful ones that leverage established \ntrusts but that come from unusual address es or contain unusual properties.  \n\n \n \n|  U/OO/195076 -20  |  PP-20-1385   |  Dec. 2020 Ver 1.0  3 \nRussian State -Sponsored Actors Exploiting Vulnerability in VMware  \nWorkspace O NE Access  Using Compromised Credentials  \nFurther Guidance  \nExploiting the vulnerability  requires authenticated password -based access to the manageme nt interface of the device , \nwhich is encrypted with TLS. That interface typically  runs over port 8443, but it could be over any user -defined port. NSA \nrecommends that NSS, DoD, and DIB network administrators limit the accessibility of the ma nagement interface on \nservers to only a small set of known systems and block  it from direct Internet access (see Perform ing Out-of-Band \nManagement  [8]).  \nSince the server requires that passwords be intentionally chosen upon installation, there are no kno wn default passwords. \nSetting the p assword to a strong unique password would make it more difficult to exploit, but would likely not mitigate an \nexisting compromise.  \nIt is critical when running product s that perform authentication that the server and all t he services that depend on it are \nproperly configured  for secure operation and integration . Otherwise, SAML  assertions could be forged , granting access to \nnumerous resources . If integrating authentication servers with A DFS, NSA recommends  following Microsofts best \npractices, especially for securing SAML assertions and requiring multi -factor authentication [ 3] [4]. \nWorks Cited  \n[1] VMware patch KB81754 . [Online] Available at:  https://kb.vmwa re.com/s/article/81754   \n[2] VMware. VMware Security Advisory VMSA -2020 -0027. [Online] Available at: \nhttps://www.vmware.com/security/advisories/VMSA -2020 -0027.html  \n[3] Microsoft. Best pr actices for securing Active Directory Federation Services. [Online] https://docs.microsoft.com/en -us/windows -\nserver/identity/ad -fs/deplo yment/best -practices -securing -ad-fs \n[4] Microsoft. Best Practices for Secure Planning and Deployment of AD FS. [Online] https://docs.microsoft.com/en -us/windows -\nserver/identity/ad -fs/design/best -practices -for-secure -planning -and-deployment -of-ad-fs \n[5] NSA. Update and Upgrade Software Immediately. [Online] Available at: https://www.nsa.gov/cybersecurity -guidance  \n[6] VMware. WMware Workspace O NE Access, VMware Identity Manager, VMware Identity Manager Connector Workaround \nInstructions for CVE -2020 -4006 (81731). [Online] Available at: https://kb.vmware.com/s/article/81731  \n[7] NSA. Detect and Prevent Web Shell Malware. [Online] Available at: https://www.nsa.gov/cybersecurity -guidance  \n[8] NSA. Performing Out -of-Band Network Management. [Online] Available at: https://www.nsa.gov/cybersecurity -guidance   \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply i ts endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes . \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify an d disseminate threats to \nNational Security Systems, Department of Defense, and Defense  Industrial Base information systems, and to develop and issue cybersecurity \nspecifications and mitigations. This information may be shared broadly to reach all appropria te stakeholders.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [
    "T1190",
    "T1059",
    "T1212",
    "T1505.003"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csa_vmware access_u_oo_195076_20",
  "source": "nsa",
  "id": "93aa627c428733150ae8ff235d177fe6003e1b301f09a027fd9ca0bd762e4cc3"
}