{
  "markdown": "  \nU/OO /136723 -21 | PP-21-0601  | APR 2021  Ver 1.0  \nNational Security Agency | Cybersecurity Advisory  \nStop Malicious Cyber Activity  Against  Connected \nOperational Technology  \nExecutive s ummary  \nA significant shift in how operational technologies (OT) are viewed, evaluated, and secured within the U.S. is needed to \nprevent malicious cyber actors (MCA) from executing successful, and potentially damaging, cyber effects. As OT \ncomponents continue bein g connected to information technology (IT), IT exploitation increasingly can serve as a pivot to \nOT destructive effects[1, 2, 3]. Recent adversarial exploitation of IT management software and its supply chain has resulted \nin publicly documented impacts across the U.S. Government (USG)  and the Defense Industrial Base (DIB) . Malicious \ncyber activities  directed at OT also continue to threaten these networks[4, 5, 6]. \nThis paradigm shift applies to  the stagnant OT assets and control systems  installed and used throughout the USG and \nDIB, many of which are past end -of-life and operated without sufficient resources . To evaluate and improve  the \ncybersecurity of  connected OT  and control systems , NSA recommends  that National Security System (NSS), Department \nof Defense (DoD), and DIB network owners  perform a  detailed risk analysis prior to creating cross -domain connections \n(e.g., IT -to-OT, Internet -to-OT) and for all currently connected OT.  \nFollowing the steps below will enable OT owners and administrators to evaluate risks against their systems and use that \nknowledge to guide network changes  with current resources to realistically monitor and detect malicious activity . Without \ndirect action to harden OT networks and control systems against vulnerabilities introduced through IT and business \nnetwork intrusions, OT system owners and operators will remain at indefensible levels of risk . \n  \n\n \n \n U/OO /136723 -21 | PP-21-0601  | APR 2021  Ver 1.0  2 \nStop Malicious Cyber Activity Against Connected Operational Technology  \nTake i mmediate steps to improve OT cybersecurity  \nFrom corporate leadership down to the OT system operators, many are asking With such limited resourc es, how can we \nimprove O T and control system cybersecurity and ensure mission success? To answer this question, NSA created this  \npragmatic ev aluation methodology and basic cybersecurity improvement approach  for NSS, DoD, and DIB network \nowners . \nHolistically evaluate the value  vs. risk vs. cost for enterprise IT -to-OT connectivity  \n1. Acknowledge that a standalone, unconnected (islanded) OT system  is safer from outside threats than one \nconnected to an enterprise IT system(s) with external connectivity (no matter how secure the outside connections \nare thought to be). An intermittently connected OT system can be  a good compromise because it is only a t risk \nwhen it is connected , which should only be done when required , such as for downloading updates or during times \nwhen remote access is required for a finite period of time.  \n2. Determine the value to the enterprise of connec ting the IT system to the O T network and/or control system \nenvironment s. The value proposition could involve  many aspects, including : \na. Convenience for connectivity and use of process data/information . \nb. Leverag ing existing abilities , such as the IT workforce . \nc. Utilizing or combining with IT tools for system monitoring . \nd. Theoretical synergies  via IT integration , such as managing updates of OT assets . \n3. Determine the risk to the enterprise of connecting the IT system to the OT environment. The risks could in volve  \nmany aspects, including : \na. Loss of process control . \nb. Failure of safety systems/equipment to operate as designed . \nc. Loss of revenue from process interruptions or shutdowns . \nd. Loss of human life should safety systems/equipment not operate appropriately . \n4. Quantify the increased costs associated with  mitigating the additional risks from connecting the existing OT \nnetworks and devices to the enterprise IT system. The costs could involve  many aspects, including : \na. Equipment to segment and protect the (typically) flat OT network and infrastructure  to reduc e risk of a \nwide-scale compromise . \nb. Renewed product or system licensing costs to download and update OT assets to the latest version. This \nis critical to mitigate potential vulnerabilities  that are commonly  known about outdated firmware, software, \netc., and  is necessary to reduce the risk of exploitation in a connected environment . \nc. Costs of OT systems upgrades if OT assets include devices that are at or approaching end -of-life for \nproduct support. This should include not only the cost of the equipment, but any potential loss of revenue \nor mission availability from the OT equipment change -out and testing.  \nd. Additional personnel and resource needs to properly maintain and secure OT assets . \n5. Present leadership with findings so they can effectively evaluate the val ue, risks, and expenses/resources.  \nImprove cybersecurity for connected enterprise IT -to-OT networks  \nAt a high  level, existing resources and freely -available OT tools should  be applied to better secure enterprise IT -\nconnected OT systems.  Additionally, while not as critical, these same recommendations can be applied to islanded and \nto intermittently connected OT networks and systems to improve cyber resiliency and ensure mission readiness.  \n\n \n \n U/OO /136723 -21 | PP-21-0601  | APR 2021  Ver 1.0  3 \nStop Malicious Cyber Activity Against Connected Operational Technology  \n1. Fully manage , cryptographically protect  (encrypt and authenticate) , and apply a n allowlist or a dial -back \napproach1 to all access vectors.  Be sure to log all access attempts.  Access vectors could include many aspects, \nsuch as:  \na. Vendor or any outsourced OT asset support, including vendor laptops with known and unknown remo te \nmonitoring connections . \nb. Remote connectivity for monitoring and/or alarm notification . \nc. Internal access , especially  via existing  open, unmanaged network, server, or device connections . \nd. While not as risky as remote access, d irect physical access  can lead to compromises , too. \n2. Wherever remote access is permitted, add sensor s and monitor all cross -domain connections. It is recommended \nthat all remote access connections be disconnected until such time that active monitoring is in place.  \n3. Create a know n OT network map and device settings baseline , and validate all equipment on the network.  \na. Utilize topographical and physical network mapping and inventorying . \nb. Readily available open -source tools can meet this requirement2. \n4. Create a known OT network communication baseline.  \na. Readily available open -source tools can meet this requirement2. \n5. Assess and prioritize OT network cybersecurity needs to ident ify required mitigations and define short -, medium -, \nand long -term cyber -hardening outcomes.  \na. Depending on in -house IT/OT expertise and capabilities, this step may require external OT expertise. \nHowever, a living cybersecurity improvement plan will identify and prioritize specific OT cybersecurity \nrisks. It will also provide a roadmap for continuously applying mitigations , near-term improvement s, and \nstrategies to achieve long -term cybersecurity goals . \n6. Create an exemplar gold copy baseline to enabl e all OT networks and devices to be repaired and/or re -\ninstantiated.  \na. Gold copy restoration files and capabilities should be stored in locked, unconnected locations.  Do not \nstore gold copy restoration data on -line or on -network.  \nb. Practice OT network re -insta ntiation to ensure success and shorten OT network downtime if an issue  or \nmalicious activity  occurs . \nWhile there are very real needs for connectivity and automating processes, operational technologies and control systems \nare inherently at risk when connect ed to enterprise IT systems.  Seriously consider t he risk, benefits , and cost before \nconnecting  (or continuing to connect)  enterprise IT and OT networks.  Mindfully prioritize  and consider  the risks before \nallowing enterprise IT -to-OT connections . While OT s ystems rarely require outside connectivity to properly function, they \nare frequently connected for convenience without proper consideration of the true risk  and potential adverse business and \nmission consequences . Taking action now can help  improve cyberse curity and ensure mission readiness.  \n  \n                                            \n1 formerly called a whitelist approach  a default deny, with only specific needed items allowed  \n2 Contact your cybersecurity service provider or appropriate government point of contact to help identify the appropriate available tools . \n\n \n \n U/OO /136723 -21 | PP-21-0601  | APR 2021  Ver 1.0  4 \nStop Malicious Cyber Activity Against Connected Operational Technology  \nWorks Cited  \n[1] Federal Bureau of Investigation, Cybersecurity and Infrastructure Security Agency, Environmental Protection Agency, and \nMulti -State Information Sharing and Analysis Center (2021). Alert (AA21 -042A): Compromise of U.S. Water Treatment Facility. \nAvailable at : https://us -cert.cisa.gov/ncas/alerts/aa21 -042a  \n[2] Canadian Centre for Cyber Security, Communications Security Establishment (2020). National Cyber Threat Assessment \n2020. Available at: https://www.cyber.gc.ca/sites/default/files/publications/ncta -2020 -e-web.pdf  \n[3] Cybersecurity and Infrastructure Security Agency (2020). Alert (AA20 -049A): Ransomware Impactin g Pipeline Operations. \nAvailable at: https://us -cert.cisa.gov/ncas/alerts/aa20 -049a   \n[4] Abir Shehod, MIT Cybersecurity Interdisciplinary Systems Laboratory (2016). Ukraine Power Grid Cyberattack a nd US \nSusceptibility: Cybersecurity Implications of Smart Grid Advancements in the US. Available at: \nhttps://web.mit.edu/smadnick/www/wp/2016 -22.pdf  \n[5] Kevin E. Hamsley, Dr. Ronald E. Fisher, Ida ho National Laboratory (2018). History of Industrial Control System Cyber \nIncidents. Available at: https://www.osti.gov/servlets/purl/1505628   \n[6] National Security Agency,  Cybersecurity and Infrastructure Security Agency (2020). NSA and CISA Recommend Immediate \nActions to Reduce Exposure Across all Operational Technologies and Control Systems. Available at: \nhttps://www.media.defense.gov/2020/Jul/23/2002462846/ -1/-1/0/OT_ADVISORY -DUAL -OFFICIAL -20200722.PDF  \nDisclaimer of e ndorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warran ties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply i ts endorsement, \nrecommendation, or favoring by the United States Government, a nd this guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify and di sseminate threats to \nNational Security Systems, Department of Defense, and Defense  Industrial Base information systems, and to develop and issue cybersecurity \nspecifications and mitigations. This information may be shared broadly to reach all appropriate stakeholders.  \nContact  \nClient Requirement s / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia In quiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csa_stop-mca-against-ot_uoo13672321",
  "source": "nsa",
  "id": "fee399c9640ba8579df62e59bf9b5ea1078e2c75dc94a979a11220e18bb5a33c"
}