{
  "markdown": " \n \n \n \n \n \n \n \n \n \nThis document is marked TLP:CLEAR. Recipients may share this information without restriction. Information is subject to stand ard \ncopyright rules. For more information on the Traffic Light Protocol, see  https://www.cisa.gov/tlp . \ncisa.gov  \n central@cisa.gov  \n @CISAgov  @CISACyber  \n @cisagov  As of  August 21, 2023  TLP:CLEAR  \nTLP:CLEAR  \nQUANTUM -READINESS: \nMIGRATION TO POST -QUANTUM  \nCRYPTOGRAPHY  \n \n \n \n \nBACKGROUND  \nThe Cybersecurity and Infrastructure Security Agency (CISA),  the National Security Agency (NSA) , and  the \nNational Institute of Standards and Technology (NIST) created this factsheet to inform organizations  \nespecially those that support Critical  Infrastructure   about the impacts of quantum capabilities, and to \nencourage the early planning for  migration to post -quantum cryptographic standards by developing a \nQuantum -Readiness Roadmap. NIST is working to publish the first set of post -quantum cryptographic (PQC) \nstandards, to be released in 2024, to protect against future, potentially adversarial , cryptanalytically -relevant \nquantum computer (CRQC) capabilities. A CRQC would have the potential to break public -key systems \n(sometimes referred to as asymmetric cryptography) that are used to protect information systems today.  \nWHY P REPARE NOW?  \nA success ful post -quantum cryptography migration will take time to plan and conduct. CISA, NSA , and NIST  \nurge organizations to begin preparing now by creating quantum -readiness roadmaps, conducting inventories, \napplying risk assessments and analysis, and engaging v endors. Early planning is necessary as cyber threat \nactors could be targeting data today that would still require protection in the future (or in other words, has a \nlong secrecy lifetime), using a catch now, break later or harvest now, decrypt later operat ion. Many of the \ncryptographic products, protocols, and services used today that rely on public key algorithms (e.g., Rivest -\nShamir -Adleman [RSA], Elliptic Curve Diffie -Hellman [ECDH], and Elliptic Curve Digital Signature Algorithm \n[ECDSA]) will need to be  updated, replaced, or significantly altered to employ quantum -resistant PQC \nalgorithms, to protect against this future threat. Organizations are encouraged to proactively prepare for future \nmigration to products implementing the post -quantum cryptographic  standards. This includes engaging with \nvendors around their quantum -readiness roadmap  and actively implementing  thoughtful, deliberate measures  \nwithin their organizations  to reduc e the risks posed by a CRQC . \nESTABLISH A QUANTUM -READINESS ROADMAP  \nWhile the  PQC standards are currently in development, the authoring agencies encourage organizations to \ncreate a quantum -readiness roadmap by first establishing a project management team to plan and scope the \norganizations migration to PQC. Quantum -readiness proje ct teams should initiate proactive cryptographic \ndiscovery activities that identify the organizations current reliance on quantum -vulnerable cryptography. \nSystems and assets with quantum -vulnerable cryptography include those involved in creating and valid ating \ndigital signatures, which also incorporates software and firmware updates. Having an inventory of quantum -\n\n \n \n2 \nQUANTUM -READINESS: MIGRATION  TO POST -QUANTUM CRYPTOGRAPHY  TLP:CLEAR  \ncisa.gov  \n central @cisa.dhs.gov  \n @CISA.gov  @CISACyber  \n @cisa.gov  As of August 21, 2023  TLP:CLEAR  vulnerable systems and assets enables an organization to begin the quantum risk assessment processes, \ndemonstrating the prioritization of migrat ion. Lead by an organizations Information Technology (IT) and \nOperational Technology (OT) procurement experts, the inventory should include engagements with supply \nchain vendors to identify technologies that need to migrate from quantum -vulnerable cryptog raphy to PQC.  \nOrganizations are often unaware of the breadth of application and functional dependencies on public -key \ncryptography that exist within the products, applications, and services widely deployed within their operational \nenvironments, leading to  a lack of visibility. The project team should lead the creation of such an inventory. \nThe team should also include the organizations cybersecurity and privacy risk managers who can prioritize the \nassets that would be most impacted by a CRQC, and that wou ld expose the organization to greater risk.  \nPREPARE A CRYPTOGRAP HIC INVENTORY  \n Having an inventory of quantum -vulnerable technology and associated criticality of the data enables an \norganization to begin planning for risk assessment processes to prioritize its migration to PQC. This \ncryptographic inventory will:  \no Help an organization become quantum -ready  a state where a CRQC is not a threat,  \no Help an organization prepare a transition to zero trust architecture,  \no Help identify or correlate outside access to datasets, as those are more exposed and at higher \nrisk, and  \no Inform future analysis by identifying what data may be targeted now and decrypted when a \nCRQC is available.  \n Organizations should create a cryptographic inventory that offers visibility into how th e organization \nleverages cryptography in its IT and OT systems. Cryptographic discovery tools should be used to \nidentify quantum -vulnerable algorithms in:  \no Network protocols, used to identify quantum -vulnerable algorithms in network protocols that \nallow tra ceability  \no Assets on end user systems and servers, including applications and associated libraries, both \nwithin application functionality and for firmware and software updates, and  \no Cryptographic code or dependencies in the continuous integration/continuous delivery \ndevelopment pipeline.  \nNote:  Discovery tools may not be able to identify embedded cryptography used internally within \nproducts, hindering discoverability or documentation. Organizations should ask vendors for \nlists of embedded cryptography within t heir products.  \n Organizations should include in their inventory when and where quantum -vulnerable cryptography is \nbeing leveraged to protect the most sensitive and critical datasets  and include estimates on length of \nprotection for these datasets. Organizat ions should:  \no Correlate cryptographic inventory with inventories available from existing programs, such as \nAsset Inventory, Identity, Credential, and Access Management, (ICAM), Identity & Access \nManagement (IdAM), Endpoint Detection and Response (EDR), and Continuous Diagnostics \nand Mitigation (CDM),  \no Understand which systems and protocols are being used to move or access their most \nsensitive and critical datasets, and  \no Identify quantum -vulnerable cryptography that protects critical processes, especially for C ritical \nInfrastructure.  \n Organizations should feed the quantum -vulnerable inventory into their risk assessment process, \nallowing risk officials to prioritize where to ensure use of PQC as soon as it is available.  \n\n \n \n3 \nQUANTUM -READINESS: MIGRATION  TO POST -QUANTUM CRYPTOGRAPHY  TLP:CLEAR  \ncisa.gov  \n central @cisa.dhs.gov  \n @CISA.gov  @CISACyber  \n @cisa.gov  As of August 21, 2023  TLP:CLEAR  DISCUSS POST -QUANTUM  ROADMAPS WITH TECHNOLOG Y VENDORS  \nCISA and the authoring agencies encourage organizations to start engaging with their technology vendors to \nlearn about vendors quantum -readiness roadmaps, including migration. Solidly built roadmaps should \ndescribe how vendors plan to migrate to  PQC, charting timelines for testing PQC algorithms and integration \ninto products. This applies to both on -premises commercial -off-the-shelf (COTS) and cloud -based products. \nIdeally, vendors will publish their own PQC roadmap, framing their commitment to i mplementing post -quantum \ncryptography. The authoring agencies also urge organizations to proactively plan for necessary changes to \nexisting and future contracts. Considerations should be in place ensuring that new products will be delivered \nwith PQC built -in, and older products will be upgraded with PQC to meet transition timelines.  \nSUPPLY CHAIN QUANTUM -READINESS  \nOrganizations should develop an understanding of their reliance/dependencies on quantum -vulnerable \ncryptography in systems and assets, as well as how the vendors in their supply chain will be migrating to PQC. \nAs noted above, understanding your organizations dependencies on quantum -vulnerable cryptography \ninvolves discovering where quantum -vulnerable algorithms are used in current IT and OT systems  and devices \n(custom -built or COTS) and in the organizations reliance on cloud services, ensuring that plans will reduc e as \nmuch quantum risk as feasible and meet the organizations transition strategy.  \nOrganizations should also begin to ask their vendors  how they are addressing quantum -readiness and \nsupporting migration to PQC. Additional considerations:  \n Prioritization should be given to high impact systems, industrial control systems (ICSs), and systems \nwith long -term confidentiality/secrecy needs.  \n If an organization discovers quantum -vulnerable cryptography in its custom -built technologies, it should \nidentify the risk to data or functions that rely on those technologies. The organization could either \nmigrate to PQC within those technologies or develop sy stem security upgrades that mitigate the risk of \ntheir continued use. Custom -built products, especially those in older systems, will likely require the \nmost effort to make quantum -resistant.  \n For COTS products, engagement with vendors on their PQC roadmap i s critical. Migration to PQC should \nbe viewed as an IT/OT modernization effort. An organizations quantum -readiness roadmap should \ninclude details of when and how each COTS vendor plans to deliver updates or upgrades to enable the \nuse of PQC, as well as th e expected cost associated with migration to PQC.  \n For cloud -hosted products, organizations should engage with their cloud service providers to \nunderstand the providers quantum -readiness roadmap. Once PQC standards are available, \nengagements should evolve to focus on how to enable the use of PQC, for example through \nconfiguration changes or application updates.  \nTECHNOLOGY VENDOR R ESPONSIBILITIES  \nTechnology manufacturers and vendors whose products support the use of quantum -vulnerable cryptography \nshould beg in planning and testing for integration. CISA, NSA , and NIST  encourage vendors to review the NIST -\npublished draft  PQC standards, which contain algorithms, with the understanding that final implementation \nspecifics for these algorithms are incomplete. Ensur ing that products use post -quantum cryptographic \nalgorithms is emblematic of Secure by Design principles. Vendors should prepare themselves to support PQC \nas soon as possible aft er NIST finalizes its standards.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-quantum-readiness",
  "source": "nsa",
  "id": "7f8e573be8b7fa7046a32ed24c04c69de6e0de068c5afcec11b8f9279b18dd35"
}