{
  "markdown": "  \n \n \n U/OO/144967 -19          PP-19-0498            May 2019 LIMITING PTRACE ON PRODUCTION LINUX SYST EMS1 \nINTRODUCTION  \nThe Linux2 kernel is the core component of a family of operating systems that underpin a large portion of government \nand commercial servers and infrastructure devices. Due to the prevalence of Linux systems in public and private \ninfrastructure, ensuring system security by following community best  practices to address current threats and risks is \ncritical.  \nIn Linux, ptrace is a mechanism that allows one process to trace the execution of another process. The tracer is able to \npause execution, and inspect and modify memory and registers in the trac ee process: in short, the tracer maintains total \ncontrol over the tracee. The legitimate use case for this functionality is debugging and troubleshooting. Utilities like strace  \nand gdb use ptrace to perform their introspection duties. Not surprisingly, mal icious implants sometimes use this \nfunctionality to steal secrets from another process or to force them into serving as proxies for anomalous behavior.  \nPROPOSAL  \nProduction systems rarely need to use debugging utilities. For this reason, it is often safe to remove the ability to perform \nptrace- related functions, at least in normal operational mode.  The YAMA Linux Security Module, included in most Linux \ndistributions, can be used to remove the ability for any process to ptrace another. To configure systems to automatically \ndo this on boot, create a service file in /etc/systemd/system  with the following contents:  \n[Unit] \nDescription=Removes, system -wide, the ability to ptrace  \nConditionKernelCommandLine=!maintenance  \n \n[Service]  \nType=forking  \nExecstart=/bin/bash c sysctl -w kernel.yama.ptrace_scope=3  \nExecstop=  \n \n[Install]  \nWantedBy=default.target  \nEnsure that the service file created has read and execute permissions for the owner and group.  \nAfter creating the service file with the correct permissions, run the following command as root : \nsystemctl daemon -reload \nThis command registers the service with the Linux initialization process systemd . Upon the next boot, tracing will be \ncompletely disabledthis also means the strace and gdb utilities will be non- functional. To re- enable these utilities, initiate \n                                                \n1 The information contained in this document was developed in the course of NSAs cybersecurity mission including its responsibilities to identify and disseminate information on threats to \nnational security systems and Department of Defense information tech nologies, develop and issue security implementation specifications for cybersecurity -enabled products, and to \nassist Executive departments and agencies with operational security programs.  The information may be shared broadly to reach all appropriate stak eholders.  \n2 Linux is a registered trademark of Linus Torvalds  \n\n \n \n \n2 U/OO/144967 -19          PP-19-0498           May 2019  a reboot. During boot, edit the kernel arguments to include the value maintenance.  \nOnce troubleshooting is finished, disable ptrace immediately by running the following command :  \n \n \nAPPLICABILITY  \nThis Cybersecurity Information sheet is issued under the authority defined in National Security Directive 42 and applies to \nall Executive Departments and Agencies and U.S. Government contractors who operate or use National Security Systems \n(NSS) as defined in CNSS 4009.  \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this docum ent are provided as is and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not necessarily constitute or imply its endorsement, rec ommendation, or favoring by the United States \nGovernment. The views and opinions of authors expressed herein do not necessarily state or reflect those of the United \nStates Government, and shall not be used for advertising or product endorsement purposes.  \nCONTACT INFORMATION  \nClient Requirements and Inquiries or General Cybersecurity Inquiries  \nCYBERSECURITY REQUIREMENTS CENTER (CRC)  \n410-854-4200  \nCybersecurity_Requests@nsa.gov  \n sysctl -w kernel.yama.ptrace_scope=3  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-limiting-ptrace-on-production-linux-systems",
  "source": "nsa",
  "id": "000cfab09e7e7b335c32c2f13313cfa8f3cb0690e47074f22a604dc86501254e"
}