{
  "markdown": " \n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  National Security Agency   |  Cybersecurity Information Sheet  \nAdvancing Zero Trust Maturity Throughout the \nDevice Pillar  \nExecutive summary   \nContinued cyber  incidents  have called attention to the immense  challenges of ensuring \neffective cybersecurity across the federal government, as with many large enterprises, \nand demonstrate that business as usual approaches are no longer sufficient to defend \nthe nation from cyber threats.  The government  can no longe r depend only on traditional \nstrategies and defenses to protect critical systems and data. [1]  \nA modernized cybersecurity framework Zero Trust integrates visibili ty from multiple \nvantage points, makes risk -aware access decisions, and automates detection and \nresponse. Implementing this framework places  network  defenders in a better position to \nsecure sensitive data, systems, applications, and services. [2]  \nThis cybersecurity information sheet (CSI) provides recommendations for maturing \ndevices the Zero Trust d evice pillarto effectively ensure all devices seeking  access \nearn trust based on device metadata and continual checks to determine  if the device \nmeets the organizations minimum bar for access . The primary  capabilities of the device \npillar are:  \n identification, inventory, and authentication  \n detection of unkn own devices and configuration compliance checks of known \nones  \n device authorization using real time inspections   \n remote access protections  \n hardware updates and software patches  \n device management capabilities  \n endpoint detection and response for threat det ection and mitigation  \nThis CSI further discusses how these capabilities integrate into a comprehensive Zero \nTrust (ZT) framework, as described in Embracing a Zero Trust Security Model . [2] \nNational Security System (NSS), Department of Defense (DoD), and Defense Industrial \nBase (DIB) owners and operators should use this and complementary guidance to \nunderstand how to take concrete steps for maturing device security by implementing the \noutlined capabilities.  \n \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  2 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nContents  \nExecutive summary  ................................ ................................ ................................ .........  1 \nIntroduction  ................................ ................................ ................................ .....................  3 \nAudience  ................................ ................................ ................................ .........................  4 \nBackground  ................................ ................................ ................................ .....................  4 \nDevice pillar  ................................ ................................ ................................ .....................  5 \nDevice inventory  ................................ ................................ ................................ ..........  7 \nDevice detec tion and compliance  ................................ ................................ ................  8 \nDevice authorization with real time inspection  ................................ ...........................  10 \nRemote access protection  ................................ ................................ .........................  10 \nAutomated vulnerability and patch management  ................................ .......................  12 \nCentralized device management  ................................ ................................ ...............  13 \nEndpoint threat detection and response  ................................ ................................ .... 14 \nSummary of guidance  ................................ ................................ ................................ ... 16 \nFurther guidance  ................................ ................................ ................................ ...........  17 \nWorks cited  ................................ ................................ ................................ ...................  17 \n \n  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  3 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nIntroducti on \nCybersecurity threats are increasing and can originate from a variety of sources  from \nnation -state actors conducting organized campaigns  to individual malicious actors \nseeking an easy payday. To better secure networks from these threats, net works need \nto transition from traditional defenses to a Zero Trust (ZT) framework. The ZT security \nmodel is best illustrated as seven pillars that together comprise the complete \ncyber security posture. The seven pillars are : User, Device, Network  & Environm ent, \nApplication  & Workload, Data, Automation & Orchestration, and Visibility  & Analytics . \nEach pillar requires certain criteria and objectives to achieve ZT enactment.  \nThis cybersecurity information sheet  (CSI) focuses on the device  pillar  and includ es \nrecommendations for reaching increasing maturity levels of device pillar capabilities .  \nHaving the ability to identify, authenticate, inventory, authorize, isolate, secure, \nremediate, and control all devices is essential in a ZT approach.  Understanding the \nhealth and  status of devices informs risk decisions , with  real time compliance \ninspection s, continuous risk assessment s, and automated remediation  inform ing every \naccess request.  [3]  \nIn addition to the more common high -level threats to operating systems and application \nsoftware, ZT capabilities must defend systems from p ersistent and ha rd-to-detect \nthreats against devices . Past e xamples of low-level, persistent threats include : \n LoJax boot rootkit [4]  \n MosiacRegressor firmware implant [5]  \n UEFI Secure Boot bypasses BootHole [6] and BlackLotus  [7]  \n Side channel vulnerabilities such as Spectre, Meltdown, Fallout, ZombieLoad, \nNetSpectre, Downfall,  and Inception  \n SSD over -provisioning malware [8]  \nThis ZT device pillar CSI prescribes mechanisms t o shield devices from low -level, \npersistent threats over their entire lifecycle . Adoption of a ZT mindset enables \norganizations to never a ssum e device s within an established environment are secure  or \nthat actors cannot hide from defenses in the OS or applications by delving into \nhardware and firmware . Implementing mature ZT device pillar capabilities enables \norganizations to assess devices and r espond to risks to critical resources in the \nenvironment . \nFor further background on the ZT concept, refer to Embracing a Zero Trust Se curity \nModel . [2] For details on user pillar maturation, refer to  Advancing Zero Trust Maturity \nThroughout the User Pillar . [9]  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  4 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nAudience  \nThis CSI provides guidance primarily intended for NSS, DoD, and the DIB, but may be \nuseful for owners and operators of other systems that might be targeted by \nsophisticated malicious actors. Guidance for system owners and operators is also \navailable via the National Institute of Standards and Technology (NIST), [10] and the \nCybersecurity and Infrastructure Security Agency (CISA). [11] This guidanc e \nincorporates  the DoD ZT guidance [12] referenced at the end of this document.  \nBackground  \nThe Presidents Executive Order on Improving the Nations Cybersecurity  (EO 14028) \nand National Security Memorandum 8  (NSM -8) direct the Federal Civilian Executive \nBranch (FCEB) agencies and NSS owners and operators to develop and implement \nplans to adopt a ZT cybersecurity framework. [1] [13] ZT implementation efforts are \nintended to continually mature cybersecurity protections, responses, and operations \nover time. Progression of capabilities in each of the seven pillars should be seen as a \ncycle of continuous improvement based on evaluation an d monitoring of threats. [2]  \n Figure 1 depicts the ZT pillars, including  the device pillar. The capabilities and \nmilestones for the device pillar component of the ZT maturity model are described in \ndetail throughout this document. Even though they are depicted separately, it is  \n \nFigure 1: Description of the seven pillars of Zero Trust  \n\n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  5 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nimportant to note that the pillars are not independent; many capabilities in the device \npillar depend on or align with capabilities in other pillars, as indicated.  \nIdentity and authentication are based on the user pillar.  Devices hosting users are \nauthenticated and authorized to connect to the requested resources based on device \nattributes . Infrastructure devices are identified and authorized in support of \nmanagement activities aimed at discovering and responding to threat s. Dynamic \nauthentication and authorization decisions are strictly enforced before access is \nallowed.  Recommendations on device connection protocols are included in the network \nand environment, data, and visibility and analytics pillar s. Authentication and  remote \naccess are based on the network environment pillar.  \nEndpoint detection & response ( EDR ) and extended detection & response ( XDR ) tools \nintegrate with both the visibility & analytics and the automation & orchestration pillars.  \nEDR/XDR tools enable  system administrators to identify, detect , and respond to threats \nthat may be pervasive or present  in the environment . Additionally, t hese security \nplatforms support the necessary analytics that assist with achieving a greater \nunderstanding of the performance, behavior, and activities  required to improve detection \nof anomalous behavior  to make real time changes in security policies  and access \ndecisions.  \nDevice pillar \nThe device  pillar is a foundational component of ZT to ensure devices within a n \nenvironment , and devices connected to or attempting to connect to resources , are \nlocated, enumerated, authenticated, and assessed . Devices are  subsequently permitted \nor denied access   based on a dynamic risk calculation  to specific objects or data.  A \ndevic e is only authorized access if it is compliant (meets the environments security \nconditions specified by policy). Devices determined to be non -compliant may be denied \naccess  or granted limited access.  \nEach of t he following key device pillar capabilities has associated  maturity levels : \n Device Inventory: Creating device inventory management systems  and \nmaintaining real  time device inventories . Maintaining a trusted inventory list by \nenrolling all devices authorized to access the network once they are properly \nevaluated  enables e stablishing a deny -by-default access policy for devices . \n Device Detection and Compliance: Detecting devices as they connect to the \nnetwork and ensuring compliance with device policies specific to the device \nfunction and c urrent risk posture .  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  6 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \n Device Authorization with Real Time Inspection:  Establishing and utilizing \npolicies to deny devices access to digital resources by default and explicitly \nallow ing access based on compliance, function, and measured risk.  Continuous \nmonitoring and behavior analysis enables faster remediation  of a broader class \nof security threats.   \n Remote Access  Protection : Creating  policies to allow authenticated and \nauthorized users  and devices to access resources from remote locations.  \n Automated  Vulnerability and Patch Management : Identifying the hardware, \nfirmware, and software versions along with their patch level s on devices, \ncorrelating them with support information and known vulnerabilities, and \nupgrading and patching the  systems  to minimize kn own risks.  \n Centralized Device Management : Establishing tooling to manage, secure , and \ndeploy security configurations and applications for computers and mobile \ndevices. In particular, remotely managing and enforcing security policies on \norganization issued devices .    \n Endpoint Threat Detection and Response : Implementing tooling to monitor, \ndetect, and remediate malicious activity on devices , integrating with network -wide \nvisibility and defense orchestration capabilities .  \nAs capabilities mature and additiona l capabilities are deployed, enterprises advance \nthrough basic, intermediate, and advanced maturity phases and are more able to \noperate according to ZT principles.  \n \nFigure 2 : Zero Trust device  pillar maturity  \n\n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  7 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nDevice inventory  \nKnowing what is in an organizations environment is a foundation to establishing trust in \nthe environment. A device inventory lists what devices are known and expected in the \nenvironment. The device inventory can then be used as the basis for starting to \nestablish trust in a  device.  \nA device inventory must capture device existence, usage, and risks. All devices  that \ncommunicate in an environment  require  a unique identity and  authentication as non-\nperson entit ies (NPE). Device usage can vary  examples include  devices leverag ing \nsession access  protocols , resource devices hosting or providing network for \napplications , or devices running embedded services . Enterprises must understand their \nuse of devices a nd that there is a difference in the wa y these devices present \ncybersecurity risks.  \nThe first step to securing the device pillar in a deny all by default environment is done \nby establishing a complete inventory of registered devices that are allowed to access \nenterprise resources . In some cases, inventory so lutions  can collect hardware  and \nsoftware information , including versions, patch levels, and installed applications , which \nare important in establishing security baselines, application allow listing, and situational \nawareness across all inventoried devices.  Dynamic  inventories may include both \nmanaged and unmanaged devices that have been granted authorized access to \nenterprise resources.  As maturity increases, dynamic inventories are updated in real \ntime.  \nDevices may be added or removed from an inventory over time. The action  of modifying \nan inventory  requires establishing enterprise policies governing:  \n Procurement: Identify criteria governing device purchases. Device Authorization \n discussed later in this document  may involve the need for specific Trusted \nPlatfor m Module (TPM) certificates, firmware configuration, or component part \nrevisions. Vendors may list multiple variants or configurations of the same \ndevice , but only some may have the necessary components and capabilities . \n Acceptance Testing: NIST SP 800-161 calls for enterprises to adopt \nacceptance testing as a mechanism to audit supply chain integrity. Software Bill \nof Materials (SBOM), Reference Integri ty Manifest (RIM), and TPM Platform \nCertificate provide artifacts that establish an auditable chain of custody from the \nproduction factory to the receiving organization.  [14]  \n Deprovisioning: Devices may store protected data within components other \nthan the storage drive. Plan to securely erase storage media, factory reset \nfirmware, securely erase TPM NVRAM memory, reset Baseboard Management \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  8 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nController (BMC) configu ration s, remove UEFI Secure Boot modifications, and \nclean up other organization -specific customizations before retiring a device.  \nInventory should support status records necessary to ensure safe and secure \ndeprovisioning.  \nTable 1: Device i nventory maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \ncreate an \ninventory of \nexisting known \ndevices. The \ninventory is \nprimarily manual \nand may be  \nbased on multiple \npartial inventories \nfrom disparate \nsystems.  Organizations \nhave a complete \nlist of devices in \nseparate \ninventories. \nPlanning for \nmachine \nidentification and \nauthentication \nusing NPE Public \nKey Infrastructure \n(PKI) certificates \nhas started.  The \norganization has \nidentified specific \ncapabilities that \nmust be present \non newly  acquired \nassets.  Organizations have \na complete list of \ndevices with \nstandardized device \nattributes and \nversion information. \nMachine \nidentification and \nauthentication using \nNPE certificates and \na deny all , allow by \nexception  approach \nis mostly \nimplemente d. The \norganization has \nidentified specific \nmake, model, and \nrevisions  of devices \neligible for new \nacquis itions.  \nAutomation has \nbegun to maintain \nthe device list and \nbring together \ndisparate \ninventories.  Organizations have a \ncomplete inventory of \nall devic es updated \nin real time using \nNPE certificates, \nenabling only \napproved devices to \nbe allowed with all \nothers denied by \ndefault.  An \norganization \nacceptance process \nchecks all newly \nacquired devices and \na deprovisioning \nprocess sanitizes all \ndevices retired from \nuse. \nDevice detection and compliance  \nNetworks have many uses and are often intended to be dynamic and adjust to changing \nuses. Devices entering or leaving the network is part of the expected changes to the \nnetwork, along with the state of devices cha nging. Detecting devices and their \ncompliance related to an expected baseline enables managing of the network \nenvironment and deciding whether to grant access to devices.  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  9 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nDetection of devices within an environment is achieved through various protocols  and \nsolutions. The organization must establish device connection policies that assess \ndevice configurations and ensure devices comply with policies established per network \nand organizational policy.  Non-compliant devices represent an unacceptable risk to the \norganization  and should not have access to enterprise resources . For example, one \ncritical area that device configurations affect is the encryption settings a device will use \nfor its communications. In this example, non -compliant configurations could allow  the \nuse of obsolete encryption, enabling malicious actors to hijack communications  to steal \nsensitive data, install malware, and other activities.  Actions and policies for non -\ncompliant or unknown devices must consider  risk posture allowance including ensuring \nlogging, analytics , automat ed responses, and  orchestration.  \nOrganizations must periodically reevaluate compliance policies . Threats to devices may \nnecessitate changes to hardware configuration, firmware version , boot executables , or \nother device prop erties  over time.  Some device vulnerability mitigations may impart a \nperformance impact that requires organizations to balance risk exposure and device \nperformance against organizational objectives.  \nTable 2: Device  detection and c ompliance maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \nemploy asset \nmanagement \nsystems for user \ndevices to report \non compliance \nwith baseline \nconfigurations.  Organizations use \nasset \nmanagement \nsystems for \ndifferent types of \ndevices to r eport \ncompliance.  \nCompliance \nviolations should \nbe logged for later \nremediation if \nappropriate.  Organizations have \nestablish ed a \nminimum sel ection  \nof compliance \nattributes and \nacceptable values . \nOrganizations use \nasset management \nsystems to track \ndevice \nconfigurations and \ncheck for \ncompliance when \ndevices request to \nconnect to the \nnetwork, denying  \naccess for non -\ncompliance.  Organizations track \nconfigurations on all \ndevices, check for \ncompliance \ncontinuously , and \nautomatically \nremediate non -\ncompliance when \nidentified.  When \nremediation is not \nfeasible, the \norganization uses \nestablish ed, risk-\nbased criteria \nspecific to the device \nfunction  and \ncapabilities  in \ndetermining whether \nto allow access and \nhow much . \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  10 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nDevice authoriz ation with  real time inspection  \nManaging a ZT architecture  means actively checking that devices  in the environment \nshould be trusted for access to critical resources. Authorizing those access requests \nshould be based on current checks that the devices should be trusted for  access not \njust based on a history of being granted access  previously . \nMaking  proper authorization decisions requires the most up -to-date information on \nwhich to assess the risk of granting access  to data or resources , using information from \nthe Device Detection and Compliance capability  combined with real time inspection of \nadditional compliance information as needed . For example, real time inspection may \ncompare current device properties against those from the recorded inventory, examine \nthe devices c urrent patch status, or look for unexpected credentials or applications on \nthe device. Authorization with real time inspection provides continual status updates of a \ndevice and its behavior  to the decision points making the access decisions . \nOrganization s should establish  continual authentication policies to ensure re -\nauthentication of devices when new data or resource accesses are  initiated. Each \ndevice must be associated with both its current and expected state . \nTable 3: Device authorization with real time inspection maturity  \nPreparation  Basic  Intermediate  Advanced  \nNone at this level . Organizations \nprovision d evices \nwith a unique \nidentifier  and are \nindividually \nauthorized . Organizations use \ndevice tooling ( e.g., \nNextGen AV, \nApplication Control, \nFile Integrity \nMonitoring (FIM), \nEDR) integration to \nbetter understand \nthe risk posture  of a \ndevice . Access \ndecisions leverage \nthe risk posture and \naccount for device \nintegrity, \nauthentication, and \nencryption.  Organizations  \nintegrate device \nactivity data  into risk \ndecisions as well for \nreal time risk \nassessment of \ndevice behavior . All \naccess requests are \ncontinuously vetted \nprior to allowing \naccess  to any \nenterprise or cloud \nassets.  \nRemote access  protection  \nWhen  organizations allow  remote and hybrid work environments, it is imperative that \nthey authenticate and monitor all internal and external devices that request access to \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  11 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nprotected resources . Challenges organizations faced using the conventional \narchitecture wa s that the users credentials alone were  treated as  adequate to grant \naccess  to network  resources . In a mature ZT architecture, all devices, internal and \nexternal , are continually authenticated and monitored.  \nIn particular, o rganization s should assume  a remote users environment  is hostile  and \nthat all traffic is being monitored and potentially modified  by threat actors , so additional \nscrutiny of those devices and their access requests is needed . If remote access is \nauthorized, cybersecurity policies, stan dards , and procedures should include specific \npolicy guidance for required device attributes . Creating a least  privilege baseline is \ncritical and should be included for this activity.  A thorough authentication, authorization, \nrisk assessment , and determination of acceptable risk must be conducted prior to \nallowing remote access by all devices.  \nOrganizations should audit existing device access processes and tooling to set a least \nprivilege baseline. Remote  access requirements also cover basic  bring your own device  \n(BYOD ) and Internet of things  (IoT) access. They should  use the enterprise  identity \nprovider  (IdP) and only be granted access to  approved applications  and services when \nusing the acceptable  set of device attributes.  To accomplish this,  BYOD domains may \nbe best governed according to ZT principles utilizing a mobile device management \n(MDM) tool. Organizations with BYOD environments should look for MDM solutions with \nseparate enrollment policies for employees who want to use their personal devices.  [15] \n[16]  \nThe following table  shows remote access matu ration  from basic to advance d:  \nTable 4: Remote access protection maturity  \nPreparation  Basic  Intermediate  Advanced  \nNone at this level.  Organizations \nemploy  dynamic \naccess policies \nwith implicit \ndenials, explicit \napprovals,  and \ncentralized \nmanagement \nsolutions  for all \nremote devices . \nControl  device \naccess to \nprotected  Organizations use \ncentralized \nmanagement  \nsystems to track \nremote device \nconfigurations and \ncheck for \ncompliance when \ndevices request to \naccess resources . All protected  services \nrequire dynamic \naccess decisions. \nAutomatically \nremediate non -\ncompliance when \nidentified . \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  12 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nresources and \nreport compliance.  \nAutomated vulnerability and patch management  \nAllowable devices must maintain security updates and patches , otherwise they add \nsignificant known mitigatable risks to the network . Having known vulnerabilities does not \nbuild trust in devices, instead it should decrease trust. A Z architecture should mit igate \nrisks as much as possible, especially  known vulnerabilities that can be patched.  A 2023 \npatch management study  found large companies manage at least 2,900 applications \nacross all devices, but more than half of them are  not up to date with the latest patches. \n[17] Automating vulnerability and patch management is critical to protecting resources \nby defining a  security  baseline and de nying access if this baseline is not met.  Threat \nactors constantly probe for known vulnerabilities   low-hanging fruit  that provide an \nentry route into the targeted  environment. Keeping firmware,  software , and operating \nsystems up to date reduce s the likelihood  of being breached. Patches and updates  \nshould be tested before implemen tation  to ensure environment stability and  that \napplications continue to function . However, they should be prioritized and tested in a \ntimely manner so that devices are not left  vulnerable longer than necessary.   \nThis capab ility is a special case of the D evice Detection and C omplianc e capability \ncombined with the C entralized Device M anagement capability to address critical known \nvulnerabilities since they present a high risk to organizations devices. In many cases, \ncentralized device management solutions can automate vulnerability identification \nbased on known versions and vulnerabilities and can deploy the necessa ry patches and \nupdates.  \nOrganizations must maintain awareness of firmware patches below the s oftware layer . \nThese patches may not be delivered  via OS patch managers or other automated \npatching solutions. Some patches may come from the system vendor , while others may \nbe specific to an individual com ponent manufacturer (e.g. , SSD firmware provided by \nthe storage vendor  not the system vendor ). There are two general realms of device -\nspecific patches:  \n1. Fixed System firmware: System vendors collaborate with sold ered component \nvendors to deliver patches to customers. CPU  microcode and NIC (network \ninterface card) firmware is usually shared by the device's manufacturer.  \n2. Component firmware: Most frequently applies to components with standardized \nconnectors  such as s torage drives or graphics processors . Individual component \nvendors provide firmware  updates for their specific products.  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  13 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nTable 5: Automated vulnerability and patch management maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \ntrack \nvulnerabilities \nand apply \npatches \nmanually.  Organizations use \nautomated feeds to \nbecome aware of \npatches. Patches \nare manually tested \nbefore deployment. \nAll unsupported \ndevices, including \nany unsupported \nhardware \ncomponents or \nsoftware are \nidentified with plans \nfor their upgrade or \nretirement.  Organizations use \nautomated tests to \ncheck patches for \nreliability. Once \ntests are complete, \npatches are \nmanually approved \nfor automated \ndeployment to all \napplicable devices \naccording to a \nschedule  intended \nminimize exposure.  \nAll unsupported \ndevices have been \nremoved from the \nnetwork.  \nManual or \nautomated (if \navailable) \nprocesses to \nmaintain firmware \nare instituted.  Organizations use \nautomated feeds to \ntrigger patch download \nand initial automated \ntesting, followed by \nautomated rollout \nsequencing with \nautomated log and \nperformance analysis to \nensure reliability for \ncontinued rollout. Any \ndevices that become \nunsupported are \nautomatically flagged for \npossible quarantine and \nupgrade or removal.  \nOrganiz ations also  \nleverage a utomated \nasset acceptance testing \nknowledge to carry out  \ncomponent updates on \nspecific devices when \nappropriate.  \nCentralized device management  \nKnowing that devices are configured securely and managed properly helps build trust in \nthem to then trust them with access to resources. Using centralized device \nmanagement  tools allow the Information Technology team to manage, secure, and \ndeploy corporate  resources and applications on any device from a single console. It \ngrants organizations the ability to centrally manage  endpoint devices from a single \nlocation. Additionally, it provides management with a single view of users that utilize \nmore than one device and assist s with retrieving workplace analytics regarding them.  \n[18] It can also improve workplace productivity by continuously providing application and \ncontent access to devices.  These tools provide a  method  for organizations  to manage \nall devices from one ce ntral location, regardless of what platform they function in . These \ncentralized device management tools are often called Unified Endpoint Management \n(UEM) solutions for traditional IT devices and Mobile Device Management (MDM) \nsolutions for mobile devices.  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  14 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nTable 6: Centralized d evice management maturity  \nPreparation  Basic  Intermediate  Advanced  \nNone at this level.  Organizations \nemploy centralized \ndevice \nmanagement  \nsolutions  to \nconfirm device \ncompliance status \nfor user devices \nand report if a \ndevices \ncompliance meets \nminimum \nstandard s.  Organizations have \nstarted integrating  \ncentralized device \nmanagement (both \nUEM and MDM \nsolutions as \nneeded) with \ninventory  \ncapabilities for \nautomated, dynamic \ninventory of devices \ncombined with \ndevice management  \nfor compliance . \nOrganizations check \nthe integrity of \ndevices by \ncollect ing device \nintegrity values from \nthe TPM and si milar \ndevice integrity \nmechanisms . Organization s \ninventory all devi ces \nvia an  automated  \nmanagement \nsolution  for all \nservices . Security \nvulnerabilities are \nidentified and \npatched or mitigated  \nautomatically  by the \ndevice management \nsolutions.  Policy is \nenforce d through IT \nremote management \nof issued mobile \ndevices. Device \nintegrity values are \ncollected and \ncompare d to \nSoftware Bill of \nMaterials ( SBOM ) \nand Records \nInformation \nManagement ( RIM) \nrelevant to the \ndevice.   \nEndpoint threat  detection and response  \nEndpoint threat detection is an essential component of ZT for the device pillar  since \nmalicious activity is assumed to be happening at any time. Devices are expected to \ndetect those activities and actively respond to them to contain any damage and \nremediate the issue . Devices are not inherently trusted, so local  threat detection \ncapabilities on the device are used as one capability to build trust that the device is \nsecure. Endpoint threat detection include s local malware prevention solutions, such as \nantivirus protections, along with other solutions that detect m alicious or anomalous \nbehaviors on the device. Combining threat detection with response options enables the \ndevice to protect itself from malicious threats. Additional ly, reporting of detections and \nanomalies to centralized visibility and orchestration cap abilities (discussed in later \npillars) enables awareness by network defenders and appropriate system or network -\n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  15 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nwide responses to sophisticated threats. Endpoint threat detection and response often \nutilizes abilities of Endpoint Detection and Response (EDR ) or Extended Detection and \nResponse (XDR) products.  \nEDR capabilities build upon prior generation Endpoint Security Systems (ESS) by \nenabling integration of endpoint knowledge with Security Information and Event \nManagement (SIEM) platforms, Security Orche stration, Automation, and Response \n(SOAR) platforms, incident response activities, and other ZT concepts. XDR platforms \nfurther increase visibility and detection of cross -device threats by enabling the \ncorrelation of artifacts from endpoints that differ in design, location, or hardware. \nCorrelation of disparate endpoint and environment information is a key maturity \nmeasurement associated with advanced ZT, and implementation of XDR will enable \norganizations to account for activity beyond traditiona l endpoints.  \nXDR implementation activities are closely related to SIEM/SOAR capabilities within the \nVisibility & Analytics and Automation & Orchestration ZT pillars and may include \nfeatures that support, enhance, or streamline the deployment of other ZT concepts . \nRobust EDR/XDR deployment can also provide enhancements to:  \n Endpoint coverage (visibility & response) across differing device hardware and \nsoftware.  \n Standardization of management interfaces, logging formats, APIs, and endpoint \nsecurity software fo otprints.  \n Integration of EDR/XDR with activities that reside in other ZT pillars , such as \nVisibility & Analytics, Automation & Orchestration, and Application & Workload,  \nand can have compounding effects on achieving higher maturity levels.  \nOther considerat ions for EDR/XDR implementation:  \n EDR platforms benefit from integration with Threat Intelligence and Threat \nReputation providers. Endpoint connectivity should be evaluated to the greatest \nextent possible when assessing  the performance of a solution stack.  \n Evaluation of a solution stack should take other ZT pillar capability requirements \ninto consideration since EDR/XDR will have direct correlation to the achievement \nof other ZT pillar capabilities.  \n EDR/XDR solutions have varying levels of protection featur es that require \nsuitability evaluation for each environment. Ensure the solution provides \ndetection, response, or remediation that corresponds with incident response \nactivity requirements and expectations.  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  16 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \nTable 7: Endpoint threat detection and response  maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \nutilize anti -\nmalware \nsolutions and \nendpoint auditing \nservices to \nsupport manual \nremediation.  Organizations use \nEDR solutions to \nprotect, monitor, and \nrespond to malicious \nand anomalous \nactivities.  \nOrganizations \nprepare to i ntegrate \nComply to Connect \n(C2C) capabilities  for \nexpanded device and \nuser checks  prior to \nallowing access . \nNextGen AV tooling \ncovers maximum \nnumber of \nservices/applications.  Organizations \nutilize  XDR \nsolutions  to protect, \nmonitor, and \nrespond to \nmalicious and \nanomalous \nactivities across \ndevice types . \nIntegrations with \ncross -pillar \ncapabilities have \nbeen identified and \nprioritized based on \nrisks. The riskiest \nintegration points \nare identified and \nintegrated with \nXDR. Basic alerting \nsends analytics \nfrom XDR stack to \nthe SIEM.  Organizations have \ncompleted \nintegrating XDR \nsolution s at all \nintegration points , \nexpanding coverage \nto fullest capacity. \nExceptions are \ntracked and \nmanaged using a \nrisk-based \nmethodical \napproach. Extended \nanalytics enabling \nZT advanced \nfunctionalities are \nintegrated into the \nSIEM and other \nappropriate \nsolutions.  \nSummary of guidance  \nThe information presented here is not a standardized solution that fits all organization s, \nbut rather suggestions and considerations for implementing ZT  concepts for devices . \nDiscovering and defining the organizations mission and identifying the supportin g \nassets that need to be secured will help build a clearer picture of the as -is architecture \nwhich can be compared against the recommendations in th is pillar along with the other \nZT pillar CSIs. This comparison will help all stakeholders to identify organi zational risks  \nand gaps and ultimately inform them  on what a mature ZT architecture will look like for \ntheir organization. Each organization will need to evaluate their individual requirements \nto determine a suitable solution. The goal  is to develop ZT  roadmap strategies  that align \nwith the organizations ZT goals.  The following guidance are the key ideas for  \nimplementing the ZT device pillar: \n Detect and i dentify  devices within or connecting to the environment.  \n Authenticate, and continu ally re-authenticate , device s. \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  17 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \n Use automated solutions to manage device configurations, vulnerabilities, and \npatches.  \n Maintain a dynamic authoriz ation  list with policies and procedures in place for \ndenied device s. \n Conduct risk -based assessment s to determine access  for all devi ces. \n Enforce more stringent access policies for remote access due to the higher risk \nenvironment.  \n Monitor endpoints for signs of threat activities, incorporating  endpoint monitoring \nand responses  into network -wide security capabilities.  \nFurther guidance  \nNSA is assisting DoD customers in piloting Z T architectures , coordinating activities with \nexisting NSS and DoD programs, and developing additional ZT guidance to support \nsystem developers through the challenges of integrating ZT within NSS, DoD, and the \nDIB environments. Upcoming additional guidance will help organize, guide, and simplify \nincorporating ZT principles and designs into enterprise networks.  \nWorks cited  \n[1]  The White House (2021), Executive Order 14028: Improving the Nations Cybersecurity. \nhttps://www.whitehouse.gov/briefing -room/presidential -actions/2021/05/12/executive -order -on-\nimproving -the-nations -cybersecurity/  \n[2]  NSA (2021), Embracing a Zero Trust Security Model. https:// \nhttps://media.defense.gov/2021/Feb/25/2002588479/ -1/-\n1/0/C SI_EMBRACING_ZT_SECURITY_MODEL_UOO115131 -21.PDF  \n[3]  DoD (2022), DoD  Zero Trust Strategy. \nhttps://dodcio.defense.gov/Portals/0/Documents/Library/DoD -ZTStrategy.pdf  \n[4]  Ars Technica (2018), First UEFI malware discovered in wild is laptop security software hijacked \nby Russians. https://arstechnica.com/information -technology/2018/10/first -uefi-malware -\ndiscovered -in-wild-is-laptop -security -software -hijacked -by-russians/  \n[5]  Bleeping Computer (2020),  MosaicRegressor: Second -ever UEFI rootkit found in the wild.  \nhttps://www.bleepingcomputer.com/news/security/mosaicregressor -second -ever-uefi-rootkit -\nfound -in-the-wild/  \n[6]  Eclyp sium (2020),  There's a Hole in the  Boot. https://eclypsium.com/blog/theres -a-hole-in-the-\nboot/  \n[7]  ESET Research (2023) , BlackLotus UEFI bootkit: Myth confirmed. \nhttps://www.welivesecurity.com/2023/03/01/blacklotus -uefi-bootkit -myth -confirmed/  \n[8]  Tom's Hardware (2021) , New Malware Uses SSD Over -Provisioning to Bypass Security \nMeasures. https://www.tomshardware.com/news/ssd -over-provisioning -vulnerability  \n[9]  NSA (2023), Advancing Zero Trust Maturity Throughout the User Pillar.  \nhttps://media.defense.gov/2023/Mar/14/2003178390/ -1/-\n1/0/CSI_Zero_Trust_User_Pillar_v1.1.PDF  \n[10]  NIST  (2020), Special Publication 800 -207: Zero Trust Arc hitecture. \nhttps://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800 -207.pdf   \n[11]  Cybersecurity and Infrastructure Security Agency (2023 ), Zero Trust Maturity Mod el Version \n2.0. https://www.cisa.gov/sites/default/files/2023 -04/zero_trust_maturity_model_v2_508.pdf   \n[12]  DoD (2022), Zero Trust Reference Architecture Versi on 2.0. \nhttps://dodcio.defense.gov/Portals/0/Documents/Library/(U)ZT_RA_v2.0(U)_Sep22.pdf  \n\n \nU/OO/214644 -23 | PP-23-3606  | OCT 2023 Ver. 1.0  18 NSA  | Advancing Zero Trust Maturity Throughout the Device Pillar  \n[13]  The White House (2022), National Security Memorandum 8: Improving th e Cybersecurity of \nNational Security, Department of Defense, and Intelligence Community Systems. \nhttps://www.whitehouse.gov/briefing -room/presidential -actions/2022/01/19/memorandum -on-\nimproving -the-cybersecurity -of-national -security -department -of-defense -and-intelligence -\ncommunity -systems/   \n[14]  NIST (2022 ), NIST Special Publication 800 -161r1: Cybersecurity Supply Chain Risk \nManagement Practices for Systems and Organizations. \nhttps://nvlpubs.nist.gov/nistpubs/Special Publications/NIST.SP.800 -161r1.pdf   \n[15]  NIST (2023), Special Publication 1800 -22: Mobile Device Security: Bring Your Own Device \n(BYOD). https://nvlpubs.nist.gov/nistpubs/ SpecialPublications/NIST.SP.1800 -22.pdf   \n[16]  NIST (2019), NISTIR 8228 Considerations for Managing Internet of Things (IoT) Cybersecurity \nand Privacy Risks. https://nvlpubs.nist.gov/nist pubs/ir/2019/NIST.IR.8228.pdf   \n[17]  Adaptiva (2023), 2023 Report: The State of Patch Management in the Digital Workplace . \nhttps://adaptiva.com/resources/report/state -of-patch -manage ment   \n[18]  Computerworld (2021), What is UEM? Unified endpoint management explained . \nhttps://www.computerworld.com/article/3625231/what -is-uem-unified -endpoint -management -\nexplained.html  \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or \nguarantees. Reference herein to any specific commercial entity, product, process,  or service by trade name, \ntrademark, manufacturer, or otherwise does not constitute or imply its endorsement, recommendation, or favoring by \nthe United States Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of the NSAs  cybersecurity mission, including its responsibilities to \nidentify and disseminate cyber threats to National Security Systems, Department of Defense, and the Defense \nIndustrial Base, and to de velop and issue cybersecurity specifications and mitigations. This information may be \nshared broadly to reach all appropriate stakeholders.  \nContact  \nCybersecurity Report Feedback: CybersecurityReports@nsa. gov \nGeneral Cybersecurity Inquiries or Customer Requests: Cybersecurity_Requests@nsa.gov   \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov  \nMedia Inquiries / Press Desk: NSA Media Relations: 443 -634-0721, MediaRelations@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-device-pillar-zero-trust",
  "source": "nsa",
  "id": "cad1e4622594641583927597d233752a6db28c5eb1f0e2774d46ea8195cdb593"
}