{
  "markdown": " \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  \nNational Security Agency | Cybersecurity Information  \nAdvancing Zero Trust Maturity Throughout the \nAutomation and Orchestration Pillar  \nExecutive summary  \nThe security of government  and industry information  and services is predicated on \ntimely responsiveness to cybersecurity threats. Automation and orchestration can \nrespond to threats much faster than manual methods alone, which may not be fast \nenough to prevent compromise or damage.  \nThe automation and orchestration pill ar is the set of Z ero Trust capabilities that \nautomates security actions  and reactions  based on defined processes and security \npolicies across the enterprise , with a focus on speed and scale. Automation is the use \nof software to control repetitive tasks, a nd orchestration is the coordination of IT \nprocesses and workflows to ensure proper management of tasks. By implementing and \nmaturing automation and orchestration capabilities, an organization can become much \nmore resilient to ever increasing and increasin gly sophisticated cyber intrusion attempts, \neven partially successful ones.  \nThis pillar emphasizes dynamic  security responses across the enterprise using policy \norchestration to enforce policy decisions; critical process automation to improve \nefficiency; a rtificial intelligence / machine learning where applicable to further improve \nautomation; security orchestration, automation, and response (SOAR)  to weave \ntogether response actions;  data exchange standardization to enable interoperability \namong capabilitie s; and security operations and incident response coordination, plans , \nand abilities. This cybersecurity information sheet (CSI) describes these automation and \norchestration pillar capabilities and  recommendations for reaching increasing maturity \nlevels.  \n  \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  2 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nIntroduction  \nZero Trust (ZT) is an evolving set of cybersecurity paradigms that move defenses from \nstatic, network -based perimeters to focus on users, assets, and resources . [1] Unlike a \ntraditional perimeter -based network security model, a ZT approach is primarily focused \non data and services protection through the enforcement of dynamic trust policies \nbetween enterprise assets and subjects (end users, applications, and other non -human \nentities that request information from resources) . To facilitate the development, \ndeployment, and operations of the ZT framework and security model, Department of \nDefense (DoD) guidance organizes the capabilities of ZT int o seven pillars that work \ntogether to provide a comprehensive and effective security model. Those pillars are \nUser, Device , Network and Environment,  Data, Application  and Workload , Visibility and  \nAnalytics , and Automation and Orchestration . Automation and orchestration are the \nautomated implementation  and integration  of the other pillars for dynamic, rapid, and \nscalable effect s. \nAutomation is intended to reduce the burden on network defenders,  but it is not without \nrisk. In addition, a dversarial  tactics are  increasingly being automated a long with the use \nof artificial intelligence ( AI), resulting in  compromises occurring with increasing speed , \nfrequency , and complexity . Automated systems are necessary to respond to these \nthreats at the requisite tempo , but must also be designed with security in mind or \nsystems  will remain just as likely to become compromised  as they were pre -automation . \n[2] While automation creates re peatable processes that make injected human error \ndetectable, it also risks simply automating human error should foundational models not \nbe designed carefully and tested continuously.  \nCybersecurity incidents are on the rise due in part to automation of com mon techniques , \nsuch as phishing, which  as of 2020 account ed for the origination of  over 90% of \nreported  breaches . [3] The ZT model mitigates this problem by limiti ng access to only \nwhat is needed and assuming that a breach is inevitable or has already occurred.  \nThe recommendations provided in this cybersecurity information sheet ( CSI) are \nfocused on improving the ability of a n organization  to detect cyber threats and decreas e \nresponse times to common threats. The recommendations also focus on automation of \nroutine tasks, allowing resources to be focused on investigation of anomalies \nassociated with advanced tactics, techniques, and procedures ( TTPs ). Through the \nautomation and orchestration  process, operations are defined through the development \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  3 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nof playbooks based on detection and effective responses,  which coordinate and \ncombine various security capabilities  to secure data and resource s.  \nA playbook for ZT is a str uctured set of predetermined actions designed to execute \nwithin an automated workflow, activated as needed to address and mitigate incidents. \nAdditionally, p laybooks automate security workflows so that analysts can spend more \ntime performing analysis and i nvestigation. The following cybersecurity  practices are \nemployed in ZT to assist in the automated efforts of security operations centers (SOC) \nby underpinning and enabling playbooks to act quickly and effectively against advanced \nand emerging threats : AI a nd machine learning ( ML), security information and event \nmanagement ( SIEM), and user and e ntity behavior analysis (UEBA) . [3] Additionally, \nsecurity orchestration, automation, and response ( SOAR ) combines these tools to form \na security layer against cybersecurity threats  by providing continuous monitoring , real-\ntime reactions to intrusions, and a baseline of expected behavior to raise alerts for \nunexpected behaviors . \nThis ZT CSI provides guidelines and best practices for maturing the capabilities of the \nZT automation and orchestration  pillar. Adoption of ZT is part o f the National \nCybersecurity Strategy  to build a defensible, resilient digital ecosystem. [5]  \nAudience  \nThis CSI provides guidance primarily intended for National Security System  (NSS), \nDoD, and Defense Industrial Base  (DIB) networks , but may also be useful for other \nowners and operators protecting their critical information and systems from  \nsophisticated malicious actors.  Guidance for other system owners and operators is also \navailable via the National Institute of Standards and Technology (NIST) , [1] and the \nCybersecurity and Infra structure Security Agency (CISA) . [6] This guidance is aligned \nwith DoD efforts and guidance to include the DoDs Cybersecurity Reference \nArchitecture (CSRA) Versi on 5.0,  [7] the DoD Zero Trust Reference Architecture (ZT  \nRA), [8] and the DoD ZT Strategy . [9] \nBackground  \nThe Presidents Executive Order on Improving the Nations Cybersecurity (EO 14028)  \n[10] and National Security Memorandum 8 (NSM -8) [12]  direct the Federal Civilian \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  4 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nExecutive Branch (FCEB) agencies and NSS owners and operators to develop and \nimplement a ZT cybersecurity framework .  \nIn the Embracing a Zero Trust Security Model  CSI, the concept of ZT is defined and \ncontextualized along with the undergirding principles of the seven pillars. The pillars are \ncomposed of capabilities that enable progressive maturity across a comprehensi ve ZT \nframework . [12] The capabilities described in this CSI are intended to continually mature \ncybersecurity protections, responses, and operations over time. Pro gression of \ncapabilities in each of the seven pillars should be seen as a cycle of continuous \nimprovement based on evaluation and monitoring of threats . \nThis CSI offers guidance in accordance with the DoD ZT RA  maturity scale of \npreparation, baseline, intermediate, and advanced. It also complements the ZT Portfolio \nManagement Office (PfMO) guidance for achieving \"target\" and advanced levels . [9] \n \nFigure 1: Description of the seven pillars of Zero Trust  \nFigure 1 displays the seven ZT pillars, including the automation and orchestration  pillar. \nThe capabilities and milestones for th is pillar of the ZT maturity model will be described \nin detail throughout this document. The seven ZT pillars are not independent as each \npillar depends on or aligns with the capabilities in the other pillars.  \n\n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  5 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nAutomation and orchestration pillar  \nThe a utomati on and orchestration pillar in the ZT framework is designed to facilitate \nautomating manual security and other applicable processes to take policy -based actions \nacross the enterprise with speed and at scale.  This pillar details the use of SOAR to \nimprove s ecurity and decrease response times, and SIEM and other automated security \ntools to assist in managing disparate security systems. Processes must be defined and \nsecurity policy enforcement consistent across all environments in a ZT enterprise for \nautomated  security to provide proactive command and control . [8] \nThe automation and orchestration  pillar is composed of the following key capabilities:  \n Policy orchestratio n using policy decision points  \n Critical process automation  \n Artificial intelligence   \n Machine learning  \n Security orchestration, automation, and response  \n Data exchange s tandardization  \n Security operations coordination and  incident response  \n \nFigure 2: Zero Trust automation and orchestration pillar maturity  \n\n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  6 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nPolicy orchestration  using policy decision points  \nSecurity policies describe the ways that access decisions should be made  to protect \ndata and services . Policies and the cont extual data that the policies rely on are stored in \npolicy information points (PIPs), the policies and the contextual data are interpreted by \npolicy decision points (PDP s) to decide whether to grant a particular access request , \nand those access decisions a re implemented by p olicy enforcement point (PEP s). \nThese are instantiated throughout the network architecture by a variety of security \ndevices and capabilities, and are often best understood via network diagrams  that \ndepict data flow s and all the security tools that implement data protection s.  \nIn traditional network environments, many security devices perform all three functions \ntogether, while in a modern ZT environment the functions are often decoupled, enabling \nmore versatile security policies , enforcement , and response actions . For example, in a \ntraditional network environment, a firewall may have a configuration specifying which \nports and protocols to allow (i.e., the policy) and have the protocol metadata of network \ntraffic that enters one of  its network interfaces (i.e., policy -relevant information), may \ndetermine that the traffic should not be allowed (i.e., a policy decision), and then may \nblock the traffic from traversing the device (i.e., policy enforcement).  \nWhereas, i n an example  moder n ZT environment, a ZT-enabled network access \ncapability would receive  network traffic requesting access and send the access request \nalong with network metadata to the access control engine (i.e., a PDP) to determine \nwhether the access should be allowed. T he access control engine would then request \nthe relevant access policy (sometimes called a conditional access policy) from the \ncentral policy store ( i.e., a PIP),  request other relevant attributes and metadata (such as \nidentity information, authenticatio n validation, and environmental confidence levels ) \nfrom other repositories (i.e., PIPs) , evaluate  the access policy using that contextual \ninformation to make an access decision (such as that the user associated with the \nnetwork traffic is not allowed to access the requested  resource) , and then convey that \ndecision back to the network access capability for enforcement (i.e., as a PEP  to block \nthe traffic ). [7], [13]  \nHaving policies in machine readable and enforceable formats enables the policies to be \ninterpreted by PDPs and properly enforced by PEPs. It further can enabl e automated \nchanges to the policies in response to changing conditions, allowing dynamic policies to \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  7 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nadapt to the current risk environment. Utilizing policy as code (PaC) techniques can \nhelp implement dynamic policies. [14] \nTable 1: Policy orchestration  using policy decision points  maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \nuse threat \nmodels, \nexisting access \nrequests  (to \napplications \nand data) , data \nflows, and \nrelated \ncapabilities in \nother ZT pillars \nas guidance for \npotential \npolicies  and \npolicy -relevant \nmetadata that \nare needed . Organizations \nestablish a policy \ninventory and \nenterprise -wide \naccess and security \nprofil es.  \n \nOrganizations initially \ncollect and document \nall existing rule-\nbased policies to \norchestrate across \nthe security stack for \neffective automation.  \n Organizations \nestablish PIPs and \nPDPs separate from \nPEPs  to make data \nand service  access \ndeterminations  \naccording to \npredefined policies \nthat are then \nenforced by the \nPEPs, enabling \nincorporation of \nadditional contextual \ninformation from \nPIPs.  \n \nAccess policies, \nwhere applicable, \nare converted into a \nstandard form for \nuse by a PDP.  \n PDPs , PIPs,  and \nPEPs en sure proper \nimplementation of \ndynamic fine -grained \ndata access policies \nto users  and non -\nperson entities  for all \naccess requests to  \nresources.  \nCritical process automation  \nCritical process automation (CPA) within a ZT framework involves automating an \norganizations critical processes while adhering to the central principle that no entity, \nwhether inside or outside the network, should be trusted by default. This approach aims \nto continuously verify and validate trust for all users and devices accessing resources.  \nRobotic process automation (RPA) plays a role in CPA by automating repetitive tasks \nand workflows, allowing organizations to streamline processes and reduce human error. \nRPA bots can execute tasks such as user provisioning, access request approvals, and \nsecurity policy enf orcement, enhancing operational efficiency within a ZT environment. \nFurthermore, integrating AI and other advanced analytics can enhance an \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  8 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \norganizations ZT posture by providing continuous risk assessment, behavioral \nanalytics, predictive threat detection , and automated response.  \nImplementation of CPA and advanced analytics can offer significant benefits, but does \nnot come without risk. An organization can become overly reliant on automation, leading \nto complacency and reduced human oversight. Additional r isks can include false \npositives  or negatives and training data biases.  \nTo avoid some of the risks of AI, organizations should employ a few best practices. \nStart small  and begin by automating low -risk, repetitive tasks to build a gradual \nconfidence and und erstanding of how AI processes will develop over time. Maintain \nhuman oversight and involvement in processes to make final decisions and intervene \nwhen necessary. Finally, organizations should continuously monitor and evaluate \nautomated processes to ensure  continued accuracy and effectiveness.  \nTable 2: Critical process  automation maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \nidentify critical \nprocesses.  \n \nUse mapping \ntechniques to \ncreate \ndiagrams of \nprocesses to \nbetter \nunderstand \nfunctionality fo r \nautomation.  \n \nBegin \nautomating \nlow-risk, \nrepetitive tasks.  Integration and \nworkflow \nprovisioning is \napplied at small \nscale s, targeting \ncritical processes of \nmost importance \nfirst with simple , \nwell-defined \nautomation rules.  Organizations expand \nautomation by \nemploying tools and \nmethods such as \nrobotic process \nautomation (RPA), to \naddress repetitive and \npredictable tasks \nacross more critical \nfunctions. These can \ninclude data \nenrichment, security  \ncontrols, and incident \nresponse ( IR) \nworkflows according to \nsystem security \nengineering principles.  \n \nExisting processes are \noptimized, response \ntimes and accuracy are \nimproved through \nadvancement of rules \nand models.  Response time and \ncapability is \nimproved with \norchestrated \nworkflows and risk \nmanagement \nprocesses.  \n \nAutomation \nnominates new \nprocesses and \nimprovements to \nensure continually \nmore efficient \noutcomes.  \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  9 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nArtificial intelligence   \nArtificial intelligence (AI) is concerned with building comput ers and machines that can \nreason, learn, and act in such a way that would normally require human intelligence or \nthat involves data whose scale exceeds what humans can analyze. [15] AI is the \nresultant conglomerate of multiple leveraged fields, including computer science, data \nanalytics and statistics, hardware and software engineering, linguistics, neuroscience, \nand others. AI functions as a set of technologies b ased on machine learning, deep \nlearning, robotics, expert systems, and algorithms. [16] As a broader concept, AI is \nabout building machines that seem to perceive a nd reason like humans do . \nAI can provide several benefits to ZT architectures. The ability for AI to analyze vast \namounts of data and identify potential security threats more rapidly enables earlier \nthreat detection and response, likely reducing the negati ve impacts of a breach and \ncontaining the damage. AI -powered systems can monitor user and device behavior \ncontinuously to establish baselines and detect deviations. Additionally, responses can \nbe automated to speed up incident response times.  \nConsider the risks when implementing AI -powered services. Continuous human \nengagement and auditing is important to ensure that models behave as expected over \ntime to reduce error and avoid complacency. Regular training is important, as are \nawareness progra ms for employees to educate themselves on the capabilities and \nlimitations of AI within ZT architectures.  \nTable 3: Artificial i ntelligence maturity   \nPreparation   Basic   Intermediate   Advanced   \nOrganizations \ndefine clear \ngoals and use \ncases for AI \nimplementation \nin their \nnetworks.   \n \nExisting data \nfor AI models is \nassessed for \naccuracy, \ncompleteness, AI tools are obtained \nor developed based \non predetermined \nuse cases .  \n \nAI models are tested \nand evaluate d for \nperformance and \naccuracy.   \n \nAI tools are  \nimplemented in \nlimited scope s to Organizations \nimplement AI/ML \ntools driven by \nanalytics and \nrecommend \nautomation and \norchestration  \nmodifications.  \nAI tools  are \nexpand ed across the \nnetwork according to \nrisk tolerances and \nAI risk principles.  Response time s and \ncapabilit ies are \nimproved with AI \norchestrated \nworkflows and \ngreater automation \nof risk management \nprocesses.   \n \nAdvanced AI models \nautomate greater \nimplementation of \nZT capabilities \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  10 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nconsistency, \nand relevance.   affect critical \nfunctions , such as \nrisk assessment \ndeterminations and \nenvironment \nanalysis , but in a \nway that AI errors \nwould not negatively \nimpact critical \noperations .  \n across ZT pillars, \nespecially for \nprediction, anomaly \ndetection, and \nrecommending, or in \nsome cases, \norchestrating \nappropriate \nresponse actions.  \nMachine learning   \nMachine learning (ML) is a rapidly evolving branch of the AI field that focuses on the \nuse of training data to develop statistical models that enable computers to make reliable \npredictions, decisions , and categorizations for new , previously  unseen , data inputs .  \nModels can be trained through both supervised and unsupervised learning method s to \nprocess large datasets and arrive at meaningful conclusions much faster tha n would \notherwise be possible with manual analysis.  A supervised approach uses labeled data \nto help ML tools learn inputs and outputs, and identify known relationships and patterns. \nAn unsupervised approach is used to discover hidden patterns or categorize  patterns by \nhaving the ML tools explore unlabeled data sets. Within ZT, each method could be used \nto meet different security objectives or be combined in a semi -supervised learning \nmodel to leverage the benefits of each.   \nA ZT environment makes vigorous use of data tagging based on sensitivity and allowed  \naccess. Altogether, large quantities of data are produced from access logs, network \ntraffic, user behavior, device attributes, security events, etc. This large volume of d ata \ncan potentially train ML models with baseline s of activity  for users and system \ncomponents. Data gathering is a foundational step in seeding the analytical information \nbase used by statistical analyses to generate predictions and insights. [17] \nWhen properly trained and implemented, ML solutions can be used to establish \nbaselines and detect previously seen and potentially unforeseen anomalous activities.  \nML model s, among other things, inform UEBA solutions in determining unusual user \nbehavior, perform root cause analysis for faster investigative processes using  large \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  11 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nlanguage models (LLMs) , and be integrated into network access c ontrols and endpoint \nprotection platform (EPP) solutions to mitigate known and possibly unforeseen threats.  \nData gathering with ML modeling can be a powerful capability, but regular testing and \nhuman review should be conducted to improve model accuracy and validate suggested \nactions. AI and  ML capabilities should also carefully adhere to any applicable legal, \nregulatory, privacy, or other requireme nts. [18], [19], [20] \nTable 4: Machine learning maturity   \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \nidentify data \nsources and \nensure data \ntags are \nproperly \nstandardized \nfor machine \nreadability.   Organizations \nimplement data \ntaggin g and \nclassification ML \ntools.   \n  \nOrganizations \nemploy ML tools to \nexecute and \nenhance execution \nof critical functions \nsuch as incident \nresponse, anomaly \ndetection, user \nbaselining, and data \ntagging.   \n \nOrganizations \nanalyze models for \nbiases and address \nthem carefully as \nbroader \nimplementation is \nplanned.  \n  ML tools are \nexpanded to operate \nacross the entirety of \nthe network.  \n \nModel performance \nis evaluated as the \ndataset is increased \nto ensure accuracy, \nprecision, and  recall.   \n \nHyperparameter \ntuning is done to \noptimize model \nperformance.   \n Models self -evaluate \nwith new data to \nimprove performance \nand address new or \nevolving threats.  \nSecurity orchestratio n, automation, and  response  \nSecurity orchestration, automa tion, and  response (SOAR)  refers to technologies that \nenable organizations to collect  and react to  inputs monitored by the security operations \nteam. SOAR can gather and enrich data, provide decision logic, and proceed through \nactions a nd tasks that support security policies. AI/ML augmentation could advance \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  12 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nautonomous adaptive cyber d efense.  This allows organizations to respond to \ncybersecurity compromise attempts and observe, understand, and prevent future \nincidents faster and at a lar ger scale to improve the organizations security posture.  \nA comprehensive SOAR product is designed to operate under three primary software \ncapabilities: threat and vulnerability management, security IR, and security operations \nautomation. Within the ZT fr amework, SOAR functionality facilitates automation and \norchestration  by ingesting alert data and triggering playbooks for automated response \nand remediation. SOAR can gather data,  implement  decision  logic, and proceed \nthrough actions and tasks that support  security policies.  SOAR enables organizations to \nstrengthen their cybersecurity defenses by focusing on incident detection and response, \nsecurity team collaboration, and mitigation of security threats  with speed and scale . [21]  \nTable 5: Security orchestration, automation , and  response maturity  \nPreparation  Basic  Intermediate  Advanced  \nA logging and \naudit policy is \ndeveloped to \nallow a SOAR \nto make \ndecisions, and \nverify that the \ndecisions and \nactions were \ntaken.  \n \nOrganizations \nacquire SOAR \ntools to meet \nthe needs of \ntheir use  \ncase s. \n Policies and SOAR \ntools are \nimplemented.  \n \nPredefined \nplaybooks from \ncollection to IR and \ntriage are utilized to \nenable initial process \nautomation.  \n \nOrganizations \nachieve initial \noperating capability \nof security \ntechnologies to \norchestrate and \nautomate policies \n(e.g., through PEPs \nand PDPs) and \nrulesets to improve \nsecurity operations.  \n SOAR tools are \nrefined to improve \nsecurity operations, \nthreat and \nvulnerability \nmanagement, and \nsecurity responses \nusing ingested alert \ndata and threshold \nalerting which \ntriggers playbooks \nfor automated \nresponse and \nremediation.  \n \nSOAR tools ingest \ndata from UEBA \nsolutions to create \nadditional baselines \nand enhance threat \nhunting playbooks.  \n Process automations \nare tested and \nimproved, and \nperformance \naccelerated to suit \nthe needs of the \norganization.  \n \nComplex decisio n \nlogic is implemented \nas appropriate for \ndetermining \nresponse actions.  \n \nAI/ML are integrated \ninto SOAR \ncapabilities.  \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  13 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nData exchange standardization  \nStandardization of data formats, protocols, and application programming interfaces \n(APIs) can provide  the ability for services and applications to communicate in the same \nmanner, further enabling orchestration and enhancing interoperability. Organizations \nrely on services and applications that are composed of multiple elements that  are often \ntightly integ rated with each other . Standardized methods of exchanging data and \ntriggering functionality help developers regulate information interchange patterns and \navoid developing incompatible applications . Similarly, the growing reliance on cloud \nservices  for ever ything  from security to networking infrastructure, has brought additional \nattention to the need for  standard s to enable interoperability . \nHowever, achieving standardization and interoperability in practice can be challenging. \nOrganizations should strive to  have products that utilize the same standards and APIs in \nthe same ways to orchestrate tasks across capabilities and products. Acquisition \nrequirements may help, but some standards and APIs can be implemented in different \nways that may affect actual inter operability.  \nTable 6: Data exchange standardization maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \ntake inventory \nof processes, \napplications, \nworkloads, and \nsystems , \nespecially the \ncurrent and \nanticipated \nintegration \npoints,  to better \nunderstand the \nlandscape for \nstandardization.  \n \nOrganizations \nresearch \nindustry - \nadopted API s Organizations \nchoose standard s to \nuse and create a \ncomprehensive \ncatalog and unified \nstyle guide for APIs.  \n \nNoncompliant APIs , \ndata formats, and \nprotocols  are altered \nor replaced per \nadopted standards.  \nProduct acquisitions \ninclude \nrequirements to \nadhere to the \nchosen standards.  \n \nRemaining APIs are \nstandardized across Documentation and \nstyle guides are \nenhanced.  \n \nFeedback is \nsolicited from \ndevelopers on \nprevious \nimplementations and \nways forward.  \n \nStandardization \npractices are \nexpanded across \nentire data \nlandscape.  \n \nAdditional function \ntesting i s conducted \nto determine if Organizations \nimplement \nautomated \nmonitoring solutions \nto track \nperformance, errors, \nand usage patterns, \nand to detect \nanomalies  in API, \nprotocols, and \nformats . \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  14 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nPreparation  Basic  Intermediate  Advanced  \nand other  \nstandards.  \n small projects or \ndatasets first, \nchecking fo r \nunintended conflicts.  \n products and \nservices behave as \nexpected  using the \nAPIs and other \nstandards . \n \nSecurity operations coordination and incident response  \nCoordination of security operations and incident response are crucial for an \norganizations security operation. Their function is to detect, respond, and mitigate \nsecurity risks, threats, and intrusions . Security operations centers (SOCs) provide \nsecurity management visibility for status and tactical implementati on. Workflows within \nthe SOC are automated using automation tooling and enrichment provided jointly by \nservice providers and technologies.  \nSOCs can improve  response times though rapid analysis ; automated collection of logs, \nPCAPs, and data ; and automated r esponses to mitigate threats detected . The amount \nof data piping into a SOC is often far more than human analysts can process ; therefore , \na SOAR is needed to increase response time and coverage rate.   \nSOCs should also prepare for incident responses activit ies by developing incident \nresponse plans, testing them  through table top exercises and actual simulations of \npotential scenarios, and updating the plans regularly. Having and following robust \nincident response plans can reduce the potential damage from in trusions and enable \nthe continuity of mission.  \nTable 7: Security operations coordination and  incident response maturity  \nPreparation  Basic  Intermediate  Advanced  \nOrganizations \ndetermine a \nclear scope \nand objectives \nfor a SOC \nand/or IR team.  \nInitial i ncident \nresponse plan If an organization  \nSOC or computer \nnetwork  defense \nservice provider \nSOC doe s not \nalready exist, the \norganization define s \nand stand s up a \nSOC  to deploy, IR plans are \nthoroughly \ndeveloped, tested, \nand updated \nregularly.  \nIdentified data \nsources have fully The SOAR solution \nprovides advanced \nincident response \nworkflow automation \nleveraging t hreat \nintelligence data, \nuser activity \nmonitoring (UAM), \nAI-based anomaly \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  15 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \n(IRP) is \ndeveloped.  \nApplicable \npolicies, data \nsources, and \nother \nrequirements \nare identified.  \nSolutions are \nprocured to \nmeet \nrequirements.  operate, and \nmaintain security \nmonitoring.  \nA SIEM solution \nbegins integrating \ndata sources (i.e., \nendpoint protection, \ndetection, and \nresponse data) and \ninitial monitoring and \nalerting begins.  \nPlaybook  and \nworkflow \nrequirements are \nbeginning \ndevelopment and \nintegration for \nresponse activities.  integrated with the \nSIEM solution.  \nA SOAR solution is \nintegrated to provide \nbasic playbook \nautomation.  \nManual playbooks \nare identified for \nautomation or \ndecommission.  detection , and UEBA \nto determine \npotential issues.  \nAutomated \nresponses (scripts \nand tools) leverage \nML and AI.  \nPlaybooks are fully \nautomated.  \nHistorical data is \nleveraged in decis ion \nmaking.  \nSummary of guidance  \nFor ZT automation and orchestration , there are three key areas that span across the \ncapabilities in this pillar. O rganizations should employ automation methods to address \nrepetitive, labor intensive, and predictable tasks f or critical functions , such as data \nenrichment, security controls, and IR workflows according to system security \nengineering principles. Those tasks should be orchestrated across interoperable \ncapabilities to make them even more efficient and reduce the ma nual burden on \ndefenders.  \nSecond, they should  also employ advanced algorithms and analytics, especially AI/ML, \nto execute (and enhance execution of) critical functions , such as  risk and access  \ndeterminations, environmental analysis , IR, anomaly detection, user baselining, and \ndata tagging . \nThird, an organizations ability to coordinate security operations and incident response \nvia a SOC is vital to its security and should be aided by AI/ML and other automation \nefforts to more quickly and effectively detect,  respond to, and mitigate threats.  \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  16 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \nFurther guidance  \nNSA is assisting NSS owners that are piloting ZT capabilities, coordinating ZT activities \nwith NIST, CISA, the National Manager, and DoD, and developing additional ZT \nguidance to support system developers  through the challenges of integrating ZT within \nNSS, DoD, and DIB environments. Upcoming additional guidance will help organize, \nguide, and simplify incorporating ZT principles and designs into enterprise networks.   \nWorks cited  \n[1] National Institute of Standards  and Technology. Special Publication 800 -207: Zero Trust \nArchitecture. 2020. https://csrc.nist.gov/publications/detail/sp/800 -207/final  \n[2] A. Oseni. N. Moustafa, et al. Securi ty and Privacy for Artificial Intelligence: Opportunities and \nChallenges. Journal of Association for Computing Machinery. 2021 . \nhttps://arxiv.org/pdf/2102.04661   \n[3] Deloitte. 91% of All Cyber Attacks Begin with  a Phishing Email to an Unexpected Victim. 2020. \nhttps://www2.deloitte.com/my/en/pages/risk/article s/91-percent -of-all-cyber -attacks -begin -with-a-\nphishing -email -to-an-unexpected -victim.html   \n[4] S. Aliello. Zero Trust: A Governance Perspective. 2022. http://dx.doi.org/10.2139/ssrn.4146521  \n[5] The White Hous e. National Cybersecurity Strategy. 2023. https://www.whitehouse.gov/wp -\ncontent/uploads/2023/03/National -Cybersecurity -Strategy -2023.pdf   \n[6] Cyberse curity and Infrastructure Security Agency. Zero Trust Maturity Model. 2023. \nhttps://www.cisa.gov/sites/default/files/2023 -04/zero_trust_maturity_model_v2_ 508.pdf  \n[7] Department of Defense. DoD Cybersecurity Reference Architecture (CSRA) Version 5.0. 2023. \nhttps://dodcio.defense.gov/Portals/0/Documents/Library/CS -Ref-Architecture.pdf  \n[8] Department of Defense. Department of Defense (DoD) Zero Trust Reference Architecture v. 2.0. \n2022. https://dodcio.defense.gov/Portals/0/Documents/Library/(U)ZT_RA_v2.0(U)_Sep22.pdf  \n[9] Department of Defense. DoD Zero Trust Strategy. 2022. \nhttps://do dcio.defense.gov/Portals/0/Documents/Library/DoD -ZTStrategy.pdf  \n[10] The White House. Executive Order 14028: Improving the Nation's Cybersecurity. 2021. \nhttps://www.whitehouse.gov/briefing -room/presidential -actions/2021/05/12/executive -order -on-\nimproving -the-nations -cybersecurity/   \n[11] The White House. National Security Memorandum 8: Improving the Cyb ersecurity of National \nSecurity,  Department of Defense , and Intelligence Community Systems. 2022. \nhttps://www.whitehouse.gov/briefing -room/presidential -actions/2022/01/19/memorandum -on-\nimproving -the-cybersecurity -of-national -security -department -of-defense -and-intelligence -\ncommunity -systems/   \n[12] National Security Agency. Embrac ing a Zero Trust Security Model. 2021. \nhttps://media.defense.gov/2021/Feb/25/2002588479/ -1/-\n1/0/CSI_EMBRACING_ZT_SECURITY_MODEL_UOO115 131-21.PDF  \n[13] National Institute of Standards and Technology. Guide to Attribute Based Access Control (ABAC) \nDefinition and Considerations. 2014. \nhttps://nvlpubs.nist.go v/nistpubs/SpecialPublications/NIST.SP.800 -162.pdf  \n\n \n \n \nU/OO/ 182301 -24 | PP-24-2698  | July 2024  Ver. 1.0  17 \nNSA | Advancing Zero Trust Maturity Throughout the Automation and Orchestration Pillar  \n[14] National Security Agency. Enforce Secure Automated Deployment Practices through \nInfrastructure as Code. 2024. https://media.defense.gov/2024/Mar/07/2003407857/ -1/-1/0/CSI -\nCloudTop10 -Infrastructure -as-Code.PDF   \n[15] Google. What is Artificial Intelligence? n.d. https://clo ud.google.com/learn/what -is-artificial -\nintelligence  \n[16] Google. Artificial Intelligence (AI) vs. Machine Learning (ML). n.d. \nhttps://cloud.google.com/learn/artificial -intelligence -vs-machine -learning  \n[17] IBM. What is machine learning? n.d. https://www.ibm.com/topics/machine -learning  \n[18] United Kingdom National Cyber Security Centre et al. Guidelines for secure AI system \ndevelopment.  2023. https://media.defense.gov/2023/Nov/27/2003346994/ -1/-1/0/GUIDELINES -\nFOR -SECURE -AI-SYSTEM -DEVELOPMENT.PDF   \n[19] Australian  Signals Directorate et al. Engaging with Artificial Intelligence (AI). 2024. \nhttps://media.defense.gov/2024/Jan/23/2003380135/ -1/-1/0/CS I-ENGAGING -WITH -ARTIFICIAL -\nINTELLIGENCE.PDF   \n[20] National Security Agency et al. Deploying AI Systems Securely: Best Practices for Deploying \nSecure and Resilient AI Systems. 2024. https://media.defense.gov/2024/Apr/15/2003439257/ -1/-\n1/0/CSI -DEPLOYING -AI-SYSTEMS -SECURELY.PDF   \n[21] Gartner. Security Orchestration, Automation and Response (SOAR). \nhttps://www.gartner.com/en/information -technology/glossary/security -orchestration -automation -\nresponse -soar \nDisclaimer of endorsement  \nThe information and opinions contained in this document are prov ided \"as is\" and without any warranties or guarantees. Reference \nherein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does no t \nconstitute or imply its endorsement, recommendation, or favoring  by the United States Government, and this guidance shall not be \nused for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify and \ndisseminate threats to National Security Systems, Department of Defense, and Defense Industrial Base information systems, and  to \ndevelop and issue cybersecurity specifications and mitigations. This information may be shared broadly to reach all appropria te \nstakeholders.  \nContact   \nCybersecurity Report Feedback: CybersecurityReports@nsa.gov   \nGeneral Cybersecurity Inquiries or Customer Requests: Cybersecurity_Requests@nsa.gov   \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov   \nMedia Inquiries / Press Desk: NSA Media Relations: 443 -634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-zt-automation-orchestration-pillar",
  "source": "nsa",
  "id": "418f5e43e10450de14896b7c364eaa57ae5be9f022af42d7273fa83e8c13c6d1"
}