{
  "markdown": " \nU/OO/ 126071 -24 | PP-24-0581  | March 2024 Ver. 1.0 \n| Cybersecurity Information  \nNational  \nSecurity  \nAgency  \nCybersecurity &  \nInfrastructure  \nSecurity  \nAgency  \nSecure Data in the Cloud  \nExecutive summary  \nAs organizations mov e more of their data i nto cloud environments, the prevention of \nunauthorized access to that data is extremely important. Data stored in the cloud can \ntake many forms depending on the needs of the organization.  For these reasons, \norganizations must understand  the sensitivity of the data they store  in the cloud , select \nthe appropriate  storage  services , and apply pragmatic secu rity methods  to properly \nprotect their data . The purpose of this c ybersecurity information sheet is to provide an \noverview of what cloud storage is and common practices for properly securing and \nauditing cloud storage systems.  \nCloud data types  \nThe three ma in types of data storage that cloud service providers  (CSP) offer are:  \n File, which stores data in a folder -based structure and allows for user access \nvia protocols like network file system or server message block protocols.  \n Object, which stores data obj ects in a key -value data store. Users can access \nthese objects by interacting with the Object storage application  programming \ninterface.  \n Block, which is typically used by cloud compute resources that need large \namounts of hard  drive space, rang ing from Nonvolatile Memory Express \n(NVME), Solid State Drive (SSD), and Hard Disk Drive (HDD) speeds and \nsizes.  [1], [2], [3] \nFile, Object, and Block storage systems  are not only standalone systems , but also are \nused a s the building bl ocks for cloud -specific platform as a service (PaaS) and software \nas a s ervice (SaaS) offerings. PaaS instances are on -demand , comprehensive \nplatforms  used  for deploying custom software in the clo ud. SaaS instances  are ready -\nto-use software , such as email,  collaboration, or file sharing applications. Typically,  \nwhen provisioning PaaS and SaaS offerings, the storage system is not hidden within the \nservice, but instead is directly available and is managed alo ngside the PaaS or SaaS \nsystem.  \n\n\n \n \n \nU/OO/ 126071 -24 | PP-24-0581  | March 2024 Ver. 1.0 2 NSA & CISA  | Secure Data in the Cloud  \nSecuring Data  \nThe f ollowing sections describe common practices for properly securing cloud storage \nsystems. They list several related MITRE ATT&CK and MITRE D3FEND threat and \ndefensive techniques. These are meant as representative examples, but are not \nintended to include all possible related techniques.  [4], [5] \nEncryption  \nEncryption at rest and in  transit is an imperative  for sensitive data. All interactions with \ncloud storage that include sensitive data should be encrypted using Commercial \nNational  Security Algorithm (CNSA ) Suite 1.0 approved encryption mechanisms  at \nminimum. CNSA Suite 2.0 standards should also be considered . [6] Sensitive d ata \nshould never  be accessed over insecure channels. C onnections via the web should be \nencrypted with TLS1. 2 or higher.  Many individual storage offerings that CSPs provide \ninclude easy  to integrate server and client -side encryption methods.  \nMany CSPs  offer their own stan dalone key management services (KMS s) as well as \nprovide  integrations f or data services with other KMS s. Depending on the \nimplementation of the KMS, the  service  can easily generate keys or allow  customers to \nbring their own. KMS s provide  a secure storage solution for keys and the ability t o rotate \nthem . Organizations should consider hardware s ecurity modules (HSM) when there is a \nneed for more security.  \nFor more details on what to consider when choosing a key management solution and \nhow to securely manage key material for cloud environments, see the joint  \nCybersecurity Information sheet (CSI): Use Secure Cloud Key Management Practice s. \nATT&CK Tactic  Technique  \nCollection  Data from Cloud Storage [ T1530 ]  \nCredential Access, Discovery  Network Sniffing [ T1040 ] \n \n \nD3FEND Tactic  Countermeasure  \nPlatform Hardening  Disk Encryption [ D3-DENCR ] \nPlatform Hardening  File Encryption [ D3-FE] \nNetwork Isolation  Encrypted Tunnels [ D3-ET] ATT&CK Mitigation  \nEncrypt Sensitive Information  [M1041] \n\n \n \n \nU/OO/ 126071 -24 | PP-24-0581  | March 2024 Ver. 1.0 3 NSA & CISA  | Secure Data in the Cloud  \nData access policies  \nCSPs have designed access systems around the role-based a ccess control  (RBAC) \nand attribute -based access c ontrol (ABAC) strategies. RBAC grants account \npermissions based on a given role. These can be built -in roles that are set  up by the \nCSP or custom roles created by customers . ABAC assigns individual access attributes \nto a given user or role to limit access to storage devices and limi t an account s ability to \nprovision resources.  \nBoth user and system accounts should only be given the minimal  level of  access \nneeded to perform tasks  by their cloud administrators . Overly permissive policies for \ndata access can have large repercussions for cloud secur ity incidents. Plan to \nimplement roles an d access in a scalable and easy -to-use way. Higher complexity \naround the process of assigning proper permissions may result in overly permissive \naccess . Data access permissions should be granular, and the use of wildcard \npermissions should be severe ly limited.  Consider utilizing a data tagging system or \nsolution, where data is conditionally acce ssed via granular ABAC policies  to protect \ndata. It is also important to separate accounts that grant access to resources from those \nthat manage them  daily.   \nMost CSPs provide capabilities that can assist with the account permission auditing \nprocess. Additionally , commercial products are available to identify insecure \npermissions in cloud environments . These can help , especially in multi -cloud \nenvironments.  \nOrganizations should also consider  data loss prevention (DLP) systems, which can \nidentify systems exposing data unnecessarily. DLP systems often offer both active and \npassive monitoring of data and automatic detecti on and remediation processes. Some \nCSPs offer features or policy systems that provide DLP capabilities . Organizations \nshould evaluate the sensitivity levels of their data and implement a series of controls or \npolicies to prevent accidental data spillage .  \nATT&CK Tactic  Technique  \nCollection  Data from Cloud Storage [ T1530 ]  \nATT&CK Mitigation  \nUser Account Management  [M1018 ] \nRestrict File and Directory Permissions [ M1022 ] \n\n \n \n \nU/OO/ 126071 -24 | PP-24-0581  | March 2024 Ver. 1.0 4 NSA & CISA  | Secure Data in the Cloud  \n \nD3FEND Tactic  Countermeasure  \nOperational Activity Mapping  Access Modeling  [D3-AM] \nPlatform Hardening  Local File Permissions  [D3-LFP] \nLimiting the attack surface  \nAll cloud resources should be regularly audited by cloud administrators for improper \nexposure. Data storage services sh ould never be placed into publicly accessible \nnetworks unless justified by a mission requirement that is periodically reassessed. \nHaving a clearly defined cloud architecture will limit the possibility of accidental public \nexposure.  \nObject storage is one o f the most exploited data storage methods because  of its \npopularity  and how easily it can be misconfigured. Applying proper access policies to \nObject  storage will prevent  unintentional data exposure. For example, major CSPs have \naccess policies that can be  deployed  by cloud administrator s enterprise wide to block \npublicly accessible Object storage by default and allow it only b y exception.  \nATT&CK Tactic  Technique  \nDiscovery  Cloud Storage Object Discovery [ T1619 ] \n \n \nD3FEND Tactic  Countermeasure  \nOperational Activity Mapping  Access Modeling [ D3-AM] \nNetwork Mapping  Network Traffic Policy Mapp ing [D3-NTPM ] \nPlatform Hardening  Local File Permissions [ D3-LFP] \nNetwork Isolation  Inbound Traffic Filtering  [D3-ITF] \nSystem recovery and backup  \nRegardless of size, all users of cloud environments  supporting production systems must \nimplement a recovery and backup solution. Many CSPs now provide a backup service, \nwhich can simplify the process and save backups as immutable. Immutability allows for \na high amount of protection against malicious activit y and ransomware. As well as \nimplementing a recovery backup solution, it is important to properly identify all cloud Data Loss Prevention [ M1057 ] \nATT&CK Mitigation  \nLimit Access to Resource Over Network  [M1035 ] \nRestrict File and Directory Permissions  [M1022 ] \n\n \n \n \nU/OO/ 126071 -24 | PP-24-0581  | March 2024 Ver. 1.0 5 NSA & CISA  | Secure Data in the Cloud  \nresources that need to be backed up, including resources that span multiple regions \nand availability zones. Account access to backups shoul d be continuously evaluated \nand limited to admin istrators who  directly maintain and test backups.  \nATT&CK Tactic  Technique  \nImpact  Data Encrypted for Impact [ T1486 ] \nImpact  Data Destruction [ T1485 ] \n \n \nD3FEND Tactic  Countermeasure  \nAsset Inventory  Data Inventory  [D3-DI] \nRestore Object  Restore File  [D3-RF] \nUnderstanding CSP data procedures  \nCSPs have created complex platforms that are designed for ease of access and \nconvenience . However,  cloud administrators often overlook policies for d ata storage \nand retention. Soft deletion is a feature that enables a deleted object to be recoverable \nfor a certain period of time. NSA and CISA  recommend organizations  utilize soft delete \nfeatures when possible to prevent accidental data loss.  If soft del ete features are \nenabled, its important to understand how this aligns with data retention policies.  \nDeallocation of resources , such as allowing customers to control what resources are \nneeded to run at specific times,  is a signature feature of CSPs . The pr ocess of stopping \nor deallocating resources typically does not mean that the data is deleted or \ninaccessible. It is important to understand the specific resource that stores data and \nwhether the data is truly deleted rather than stopped or deallocated. Dep ending on the \ndata storage resources deployed, there may be a difference in the secure wiping of \nprocesses and the deallocation of resources. Resources that are truly meant to be \ndeleted should go through the secure wipe  or removal  process outlined by the CSP.  [7], \n[8] \nOrganizations should also carefully review cloud service agreements to understand the \nrisk of d ata being stored outside of the U nited States. Depending on the agreement and \nthe laws of the co untry where the data is physically located, the data  could be subject to ATT&CK Mitigation  \nData Backup  [M1053 ] \nRemote Data Storage [ M1029 ] \n\n \n \n \nU/OO/ 126071 -24 | PP-24-0581  | March 2024 Ver. 1.0 6 NSA & CISA  | Secure Data in the Cloud  \nseizure requests by foreign governments . For data that must reside outside the United \nStates , customers can reduce risk by  implementing solutions such as:   \n On-premises  or external  key management solutions , \n Secure compute enclave environments , and \n Other data protection tools.  \nOrganizations should understand that on -premises encryption methods can be a limiting \nfactor to data processing in cloud environments especially when compared wit h secure \ncompute environments in the cloud.  \nBest practices  \nThe following is a summary of best practices for securing data in the cloud:  \n1. Obtain and retain a good understanding of the cloud storage offerings and \nchoose storage types that make sense for the data being stored.  \n2. Use encryption for all data that is sensitive in nature. Manage these keys through \neither a KMS or HSM.  \n3. Have an understandable process of assigning permissions to users and service \naccounts. Always use the principal of least privilege wh en assigning permissions.  \n4. Properly audit and understand cloud datas attack surface. Especially look for \nthose resources that are publicly exposed.  \n5. Use a backup solution and routinely test restoration of critical data and services.  \n6. Review individual cloud provider data retention policies with regards to deleting \ndata. Be sure that systems that carry sensitive data are properly being deleted.  \nFurther guidance  \nSupplementary NSA guidance on ensuring network environments are secure and \ndefendable is available a t NSA Cybersecurity Advisories & Guidance . Those of \nparticular relevance are:  \n Mitigating Cloud Vulnerabilities  \n Top 10  Mitigation Strategies  \n Identity and Access Management Recommen ded Best Practices for \nAdministrators  \n\n \n \n \nU/OO/ 126071 -24 | PP-24-0581  | March 2024 Ver. 1.0 7 NSA & CISA  | Secure Data in the Cloud  \nWorks cited  \n[1] Microsoft.  What is Cloud Storage?  2024.  https://azure.microsoft.com/en -in/resources/cloud -\ncomputi ng-dictionary/what -is-cloud -storage  \n[2] Amazon.  What is Cloud Storage? 2024. https://aws.amazon.com/what -is/cloud -storage/  \n[3] Google.  Product overview of Cloud Storage . 2024. \nhttps://cloud.google.com/storage/docs/introduction  \n[4] The MITRE  Corporation. MITRE ATT&CK. 2024. https://attack.mitre.org   \n[5] The MITRE Corporation. MITRE D3FEND. 2023. https://d3fend.mitre.org   \n[6] NSA.  Announcing the Commercial National Security Algorithm Suite 2.0 . 2022. \nhttps://media.defense.gov/2022/Sep/07/2003071834/ -1/-\n1/0/CSA_CNSA_2.0_ALGORITHMS_.PDF   \n[7] Google. Data deletion on Google Cloud.  2023.  https://cloud.google.com/docs/security/deletion  \n[8] Microsoft, Data -bearing device destruction . 2024. https://learn.microsoft.com/en -\nus/compliance/assurance/assurance -data-bearing -device -destruction  \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference \nherein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does no t \nconstitute or imply its endorsement, recommendation, or favoring by the United States Government, and this guidance sha ll not be \nused for advertising or product endorsement purposes.  \nTrademarks  \nATT&CK and MITRE and are registered trademarks of The MITRE Corporation. D3FEND is a trademark of The MITRE Corporation.  \nPurpose  \nThis document was developed in furtherance of the au thoring agencies  cybersecurity missions, including their responsibilities to \nidentify and disseminate threats to National Security Systems, Department of Defense, and Defense Industrial Base information  \nsystems, and to develop and issue cybersecurity specifications and mitigations.  \nContact  \nCybersecurity Report Feedback: CybersecurityReports@nsa.gov  \nGeneral Cybersecurity Inquiries: Cybersecurity_Req uests@nsa.gov  \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov  \nMedia Inquiries / Press Desk:  \nNSA: 443-634-0721, MediaRela tions@nsa.gov  \nCISA: 703-235-2010, CISAMedia@cisa.dhs.gov  \n\n",
  "cves": [],
  "techniques": [
    "T1486",
    "T1040",
    "T1619",
    "T1530",
    "T1485"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csi-cloudtop10-secure-data",
  "source": "nsa",
  "id": "2ddcdd3dbf74d60e48404cf1b0f4233e27a83b14f9d8b1310800aeca488e23f4"
}