{
  "markdown": "  \n          U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  \nNational Security Agency  | Cybersecurity Information  \nMitigating Cloud Vulnerabilities  \n \nWhile careful cloud adoption can enhance an organizations security posture, cloud services can introduce risks that \norganizations should understand and address both during the procurement process and while operating in the cloud. Fully \nevaluating security  implications when shifting resources to the cloud will help ensure continued resource availability and \nreduce risk of sensitive information  exposures. To implement effective mitigations, organizations should consider cyber \nrisks to cloud resources, just a s they would in an on -premises environment.  \nThis document divides cloud vulnerabilities into four classes (misconfiguration, poor access control, shared tenancy \nvulnerabilities, and supply chain vulnerabilities) that encompass the vast majority of known v ulnerabilities. Cloud \ncustomers have a critical role in mitigating misconfiguration and poor access control, but can also take actions to protect \ncloud resources from the exploitation of shared tenancy and supply chain vulnerabilities. Descriptions of each  vulnerability \nclass along with the most effective mitigations are provided to help organizations lock down their cloud resources. By \ntaking a risk -based approach to cloud adoption, organizations can securely benefit from the clouds extensive capabilities .  \nThis guidance is intended for use by both organizational leadership and technical staff. Organizational leadership can \nrefer to the Cloud Components section, Cloud Threat Actors section, and the Cloud Vulnerabilities and Mitigations \noverview to gain per spective on cloud security principles. Technical and security professionals should find the document \nhelpful for addressing cloud security considerations during and after cloud service procurement.  \nCloud Components  \nCloud architectures are not standardized and each Cloud Service Provider (CSP) implements foundational cloud services \ndifferently. Understanding a CSPs cloud implementation should be part of a customers risk decision during cloud service \nprocurement. Four cloud architectural services are common  to most clouds:  \n Identity and Access Management (IdAM) : IdAM refers to controls in place for customers to protect access to their \nresources as well as controls that the CSP uses to protect access to back -end cloud resources. Secure customer \nand cloud back -end IdAM, both enforcement and auditing, is critical to protecting cloud customer resources .  \n Compute : Clouds generally rely on virtualization and containerization to manage and isolate customer computation \nworkloads. Serverless computing, the dynamic allo cation of cloud compute resources to run customer code, is built \nupon either virtualization or containerization, depending on the cloud service.  \n Virtualization is a cloud backbone technology, not only for customer workloads, but also for the cloud \narchite cture itself. Virtualization is an enabling technology that provides isolation in the cloud for both \nstorage and networking. Virtualization typically implements and secures internal cloud nodes.  \n Containerization is a more lightweight technology that is co mmonly used in clouds to manage and \nisolate customer workloads. Containerization is less secure of an isolation technology than virtualization \nbecause of its shared kernel characteristics, but CSPs offer technologies that help address \ncontainerization secu rity drawbacks.  \n Networking : Isolation of customer networks is a critical security function of the cloud. In addition, cloud networking \nmust implement controls throughout the cloud architecture to protect customer cloud resources from insider threat. \nSoftw are Defined Networking is commonly used in the cloud to both logically separate customer networks and \nimplement backbone networking for the cloud.  \n Storage (Objects, Blocks, and Database Records) : Customer data is logically separated from other customer \ndata on cloud nodes. Security mechanisms must exist to ensure that customer data is not leaked to other \ncustomers and that customer data is protected from insider threat.  \nCloud Encryption and Key Management  \nWhile not a base component of cloud architectures,  encryption and key management (KM) form a critical aspect of \nprotecting information in the cloud. While the CSP uses encryption (among other controls) to protect some aspects of \ncustomer data from other customers and CSP employees, cloud customers should understand the options that they have \nfor further protecting their data. Understanding data sensitivity requirements is crucial for building a cloud encryption and  \nkey management strategy.  \n\n \n \n           U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  2 Cybersecurity Info rmation  | Mitigating Cloud Vulnerabilities  \n \nCustomers can take advantage of CSP -provided encryption and KM services. Cloud -based KM services are designed to \nintegrate with other cloud services, reducing the amount of customer development needed to protect and process data in \nthe cloud. Cloud -based K M services are able to provide audit information to customers about key creation, destruction \nand usage. In addition to software -based solutions, many CSPs offer a Hardware Security Module (HSM) service for \nprotecting customer keys in the cloud. Customers can also choose to provide the cloud with externally generated keys for \nuse in encryption (Bring Your Own Key). Some CSP -provided encryption and KM solutions are accredited to protect \nsensitive but unclassified DoD information.  \nCustomers can also perform e ncryption and KM outside of the cloud, using customer or third -party tools. Keeping \nencryption and KM outside of the cloud ensures that customer data is never exposed to cloud administrators. Additionally, \npre-encrypted data is protected from exposure to o ther customers if there is a failure in the CSP's multi -tenancy controls. \nThe consequences to this solution are that: (1) customers or third -party vendors must build encryption into the application \nor data management layers of their systems and become resp onsible for KM, which requires significant expertise and \neffort; and (2) the solution does not integrate well with other CSP services, requiring the customer to integrate their \nexternal applications or services with the cloud and limiting the adoption of v isualization, AI, and other data -layer services. \nFor example, pre -encrypted data generally cannot be searched or operated on in the cloud.  \nSharing Cloud Security Responsibilities  \nCSPs and cloud customers share unique and overlapping responsibilities to ens ure the security of services and sensitive \ndata stored in public clouds. CSPs are responsible for securing the cloud infrastructure, as well as implementing logical \ncontrols to separate customer data. Organizational administrators are usually responsible f or configuring application -level \nsecurity (e.g., access controls for authorization to data). Many CSPs provide cloud security configuration tools and \nmonitoring systems, but cloud customers are responsible for configuring the service according to organizat ional security \nrequirements.  \nShared responsibility affects routine operations, such as patch management, and exceptional events, such as security \nincident response. Specific responsibilities vary by CSP, by cloud service type (e.g., Infrastructure as a Ser vice [IaaS] vs. \nPlatform as a Service [PaaS]), and by specific product offering (e.g., managed vs. unmanaged virtual machines). Figure 1 \nshows a common mapping of these responsibilities.  \n \n \n                         Figure 1: Cloud Shared Responsibility Mod el \n \nShared responsibility considerations include:  \n Threat Detection : While CSPs are generally responsible for detecting threats to the underlying cloud platform, \ncustomers bear the responsibility of detecting threats to their own cloud resources. CSPs and t hird parties may offer \ncloud -based tools that can assist customers in threat detection.  \n \n\n\n \n \n           U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  3 Cybersecurity Info rmation  | Mitigating Cloud Vulnerabilities  \n Incident Response : CSPs are uniquely positioned to respond to incidents internal to the cloud infrastructure and \nbear responsibility for doing so. Incidents internal t o customer cloud environments are generally the customers \nresponsibility, but CSPs may provide support to incident response teams.  \n \n Patching/Updating : CSPs are responsible for ensuring that their cloud offerings are secure and rapidly patch \nsoftware withi n their purview but usually do not patch software managed by the customer (e.g., operating systems \nin IaaS offerings). Because of this, customers should vigilantly deploy patches to mitigate software vulnerabilities in \nthe cloud. In some cases CSPs offer m anaged solutions in which they perform operating system patching as well.  \nCloud Threat Actors  \nThreat actors may target the same types of weaknesses in both cloud and traditional system architectures. This section \nfocuses on cloud -specific activities, but a dministrators should be aware that traditional tactics still apply. For example, an \nunpatched web application in the cloud bears similar risk of compromise as one served from an on -premises network. The \nfollowing threat actors are relevant to cloud computi ng: \nMalicious CSP Administrators  \n Leverage privileged credentials or position to access, modify, or destroy information stored on the cloud platform;  \n Leverage privileged credentials or position to modify the cloud platform in order to gain access to networks \nconnected to or consuming cloud resources;  \nMalicious Customer Cloud Administrators  \n Leverage privileged credentials to access, modify, or destroy information stored on the cloud platform;  \nCyber Criminals and/or Nation State -Sponsored Actors  \n Leverag e a weakness in the cloud architecture or configuration to obtain sensitive data or consume cloud resources \nat the victims expense;  \n Exploit weak cloud -based authentication mechanisms to obtain user credentials (e.g., password spray attacks);  \n Leverage comp romised credentials or incorrect access privileges to gain access to cloud resources;  \n Gain privileged access to the cloud environment to compromise tenant resources;  \n Leverage the trust relationship between an organizations networks and cloud resources to pivot from clouds into \nprotected networks or vice versa;  \nUntrained or Neglectful Customer Cloud Administrators  \n Expose sensitive data or cloud resources unintentionally.  \nCloud Vulnerabilities and Mitigations  \nCloud vulnerabilities are similar to those in tra ditional architectures, but the cloud characteristics of shared tenancy and \npotentially ubiquitous access can increase the risk of exploitation. The vulnerability classes listed below vary as to \nprevalence and minimum attacker sophistication to discover an d exploit the vulnerabilities. Each section below presents a \ncloud vulnerability class, provides real world examples, estimates vulnerability prevalence, assesses attacker \nsophistication, and discusses mitigations.  \n \n \n \n \n \n \n\n \n \n           U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  4 Cybersecurity Info rmation  | Mitigating Cloud Vulnerabilities  \n \n \nFigure 2: Cloud Vulnerabilities  Prevalence versus Sophistication of Exploitation  \n \nMitigating cloud vulnerabilities is a shared responsibility between the CSP and the customer organization. Critical to an \norganizations success in both transitioning to the cloud and maintaining cloud resources is support from informed \nleadership, which ensures the right governance, budget, and oversight. With this support, administrators are able to \nenable effective mitigations for cloud resources. Cloud technology moves rapidly, making oversight a com plex task. \nOrganizations need dedicated resources commensurate with the size of the organization to ensure adequate protection in \nthe cloud. Additionally, customers should work with their CSPs to understand available vendor -specific countermeasures \nand the ir impact on risk.  \nMisconfiguration  \nPrevalence: widespread; Attacker Sophistication: low  \nWhile CSPs often provide tools to help manage cloud configuration, misconfiguration of cloud resources remains the most \nprevalent cloud vulnerability and can be exploi ted to access cloud data and services. Often ar ising from cloud service \npolicy1 mistakes or misunderstanding shared responsibility, misconfiguration has an impact that varies from denial of \nservice susceptibility to account compromise. The rapid pace of CS P innovation creates new functionality but also adds \ncomplexity to securely configuring an organizations cloud resources.  \nExamples of abused misconfigurations:  \n In May 2017, a large defense contractor exposed sensitive NGA data and authentication credentia ls in publicly \naccessible cloud storage [1];  \n In September 2017, a security researcher discovered CENTCOM data accessible to all public cloud users [2];  \n In September 2019, a research team discovered sensitive travel details of DoD personnel exposed in a pub licly \naccessible Elasticsearch database  [3]. \nProper cloud configuration begins with infrastructure design and automation. Security principles such as least privilege \nand defense -in-depth should be applied during initial design and planning. Well -organized cloud governance is also key to \n                                            \n1 Cloud service policies are technical controls implemented in software that define how cloud services may interact.  \n\n\n \n \n           U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  5 Cybersecurity Info rmation  | Mitigating Cloud Vulnerabilities  \na defensible environment. Technical controls for implementing these principles vary by CSP but often include cloud \nservice policies, encryption, Access Control Lists (ACLs), application gateways, Intrusion Detection Systems (IDSs), Web \nApplication Firewalls (WAFs), and Virtual Private Networks (VPNs). A well -designed and well -implemented cloud \narchitecture will include controls that prevent misconfigurations or alert administrators to improper configurations. For DoD  \norganiza tions, the DoD Cloud Computing Security Requirements Guide (CCSRG) [4] provides sets of requirements that \nare based on data sensitivity. Organizations should be proactive in applying additional controls tailored for specific use \ncases and should take full advantage of cloud -based automation to monitor and enforce security. Lastly, these controls \nand configurations are not static settings but should evolve alongside an organizations cloud adoption and risk \nmanagement.  \nFor organizations to enforce least priv ilege, administrators should:  \n Use cloud service policies to prevent users from sharing data publicly without a mission -justified role;  \n Use cloud or third -party tools to detect misconfigurations in cloud service policies;  \n Limit access to and between cloud r esources with the desired state being a Zero Trust model2; \n Use cloud service policies to ensure resources default as private;  \n Audit access logs with automated tools to identify overly -exposed data;  \n Restrict sensitive data to approved storage and use Data L oss Prevention solutions to enforce these restrictions.  \nAdditionally, for enabling defense -in-depth, administrators should:  \n Ensure proper CSP -specific training for individuals creating or modifying cloud service policies;  \n Enforce encryption of data at rest  and in transit with strong encryption methods and properly configured, managed \nand monitored key management systems;  \n Adhere to applicable standards (e.g., CSP guidance, Center for Internet Security Benchmarks, DoD CCSRG);  \n Configure software in cloud syste ms to update automatically;  \n Control selection of virtual machine images to require hardened baselines and enable predictable cyber defense;  \n Control and audit cloud service policies and IdAM changes;  \n Ensure that logging is enabled at all levels (e.g., user platform activity, network flow logs, SaaS/PaaS activity) to \ncapture the reality of the environment, especially ephemeral resources, and that logs are stored immutably;  \n Apply traditional security practices to the cloud when possible (e.g., enable Endpoint Detection and Response \n[EDR] for cloud -based endpoints);  \n Leverage emerging security features from the CSP as they are uniquely positioned to detect threats;  \n Follow best practices to prevent  the abuse of privileged accounts (e.g., separation of duties, two person controls);  \n Establish automated continuous monitoring for configuration changes and security events;  \n Correlate logs from hybrid or multi -cloud environments;  \n Establish a contract that satisfies organizational needs for redundancy, availability, perfo rmance, data \nownership/sovereignty, physical security, incident handling, and cloud infrastructure transparency;  \n Control and audit cloud service policies and IdAM changes;  \n Identify and eliminate Shadow IT3, which subverts an organizations controls.  \nLastly , to enable well -organized transitions to the cloud, administrators should:  \n Opt to modernize and take advantage of CSP services rather than lift and shift legacy systems;  \n Ensure that transitions are properly defined, funded, reviewed, and under the right  leadership;  \n Evolve architecture and processes to incorporate new features with an understanding of changes to risk;  \n Understand your data and how it flows throughout various systems;  \n Evaluate areas where traditional IT silos of operation or infrastructure can be merged in cloud deployments;  \n Use CSP tools or techniques, such as Infrastructure as Code, to reduce the risk of misconfiguration.  \n                                            \n2 Zero Trust is a model where both internal and external resources are treated as potentially malicious and thus each system verifies all access.  \n3 Shadow IT refers to unmanaged Information Technology, often cloud -based, that house or process an organizations data.  \n\n \n \n           U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  6 Cybersecurity Info rmation  | Mitigating Cloud Vulnerabilities  \nPoor Access Control  \nPrevalence: widespread; Attacker Sophistication: moderate  \nPoor access control occurs when cloud res ources use weak authentication/authorization methods or include \nvulnerabilities that bypass these methods. Weaknesses in access control mechanisms can allow an attacker to elevate \nprivileges, resulting in the compromise of cloud resources.  \nExamples of abus ed poor access control:  \n In October 2019, a CSP reported cyberattacks in which cloud accounts using multi -factor authentication were \ncompromised through password reset messages sent to single -factor authentication email accounts [5];  \n In March 2018, FBI repo rted about the Iran -based Mabna group bypassing multi -factor authentication by using \nalternate single -factor protocols for a cloud -based email service [6].  \nPoor access control can be mitigated by enforcing strong authentication and authorization protocols.  The following list \nhighlights some recommendations for ensuring strong access control:  \n Use multi -factor authentication with strong factors and require regular re -authentication;  \n Disable protocols using weak authentication;  \n Limit access to and between clou d resources with the desired state being a Zero Trust model;  \n When possible, use cloud -based access controls on cloud resources (e.g., CSP -managed authentication between \nvirtual machines);  \n Use automated tools to audit access logs for security concerns;  \n Wher e possible, enforce multi -factor authentication for password resets;  \n Do not include API keys in software version control systems where they can be unintentionally leaked.  \nShared Tenancy Vulnerabilities  \nPrevalence: rare; Attacker Sophistication: high  \nCloud platforms consist of multiple software and hardware components. Adversaries who are able to determine the \nsoftware or hardware used in a cloud architecture could take advantage of vulnerabilities to elevate privileges in the cloud.  \nVulnerabilities in cloud  hypervisors (i.e., the software/hardware that enables virtualization) or container platforms are  \nespecially severe due to the critical role these technologies play in securing cloud architectures and isolating customer \nworkloads.  \nHypervisor vulnerabilitie s are difficult and expensive to discover and exploit, which limits their exploitation to advanced \nattackers. Leading CSPs continuously scan the hypervisor code for vulnerabilities and submit their hypervisors to fuzz \ntesting to identify and remediate vuln erabilities. CSPs also monitor system logs for any evidence of hypervisor \nexploitation.  \nContainerization, while being an attractive technology for performance and portability, should be carefully considered \nbefore deployment in a multi -tenant environment. Containers run on a shared kernel, without the layer of abstraction that \nvirtualization provides. In a multi -tenant environment, such as the cloud, a vulnerability in the container platform could \nallow an attacker to compromise containers of other tenants on the same host.  \nWhile there have been no reported isolation compromises in any major cloud platform, security researchers have \ndemonstrated both hypervisor and container breakouts:  \n At the 2017 Pwn2Own computer hacking competition, two teams successfully demonstrated hypervisor breakout \nattacks, which allowed attacker -controlled execution in the host operating system; [7]  \n At the 2019 USENIX Workshop on Offensive Technologies (WOOT), researchers presented an exploit chain to \nescape the guest environment on a bare metal (Type 1) hypervisor and gain access to the host sy stem;  [8] \n In 2019, a vulnerability was found in a container platform that allowed an attacker to overwrite the container runtime \nand leverage this ability to access other containe rs running on the same platform.  [9] \n \n \n\n \n \n           U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  7 Cybersecurity Info rmation  | Mitigating Cloud Vulnerabilities  \nHardware vulnerabilities in processors can also have a large impact on cloud security. Flaws in chip design can result in \nthe compromise of tenant information in the cloud through side -channel attacks [10]. There have been no docum ented \nattacks using these or other hardware vulnerabilities; however, the use of shared hardware in the cloud will magnify the \nimpact of future vulnerabilities. To counter this, CSPs have an advantage in mitigating hardware vulnerabilities in that they  \ncan patch their environment at a large scale and more quickly than other environments.  \nMitigations for shared tenancy vulnerabilities involve separating organizational resources from other cloud tenants using \nmechanisms provided by the CSP. The recommended mi tigations are:  \n Enforce encryption of data at rest and in transit with strong encryption methods and properly configured, managed \nand monitored key management systems;  \n For DoD organizations, use DoD CCSRG accredited cloud services;  \n For especially sensitive workloads, use dedicated, whole -unit, or bare -metal instances, reducing the risk of an \nadversary collocating and exploiting a hypervisor vulnerability to gain access to your resources;  \n For sensitive workloads, use virtualization for isolation instead of containerization when available;  \n When considering the use of a cloud service (e.g., serverless computing) understand the underlying isolation \ntechnology (e.g. virtualization, containerization) and whether it mitigates risk for the intended use;  \n Select clou d offerings that have had critical components evaluated against National Information Assurance \nPartnership (NIAP) Protection Profiles (PPs), particularly hypervisors that have been evaluated against the NIAP \nServer Virtualization PP.  \nSupply Chain Vulnerabi lities  \nPrevalence: rare; Attacker Sophistication: high  \nSupply Chain vulnerabilities in the cloud include the presence of inside attackers and intentional backdoors in hardware \nand software. CSPs source hardware and software from across the globe and employ  developers of many nationalities. \nThird -party software cloud components may contain vulnerabilities intentionally inserted by the developer to compromise \nthe application. Inserting an agent into the cloud supply chain, as a supplier, administrator or deve loper, could be an \neffective means for nation state attackers to compromise cloud environments.  \nWhile not specific to the cloud environment, some examples of supply chain attacks are:  \n In the ShadowHammer operation, downloads from live update servers were m odified to add malicious functionality. \nHalf a million users downloaded the software, although analysis of the software showed the actors goal was to \nattack specific hosts by targeting MAC addresses. [11]  \n In December 2019, two malicious Python Package Ind ex (PyPI) libraries were discovered stealing credentials from \nsystems where developers unwittingly installed them. [12]  \nMitigating supply chain attacks against the cloud platform is mainly the responsibility of the CSP. Cloud vendors are \naware of supply ch ain risks and look for indications of back doors through software testing and hardware validation. CSPs \nmitigate the risk of inside attackers through controls such as role separation, two -person integrity for especially sensitive \noperations, and alerting o n suspicious administrator activities.  \nTo strengthen an organizations defenses against supply chain compromise, administrators should:  \n Enforce encryption of data at rest and in transit with strong encryption methods and properly configured, managed \nand mo nitored key management systems;  \n Procure cloud resources pursuant to applicable accreditation processes (e.g., CCSRG for DoD components);  \n Select cloud offerings that have had critical components evaluated against National Information Assurance \nPartnership ( NIAP) Protection Profiles (PPs); NIAP evaluations could uncover backdoors in the components;  \n Ensure that development and migration contracts stipulate adherence to internal standards or equivalent processes \nfor mitigating supply chain risk;  \n Control the sel ection of virtual machine images to prevent the use of untrustworthy third party products, such as \nmalicious cloud marketplace offerings;  \n Discuss vendor -specific countermeasures with your CSP to drive risk decisions;  \n Adhere to applicable standards, leverag e secure coding practices, and practice continuous improvement in security, \nintegrity, and resiliency of enterprise applications.  \n\n \n \n           U/OO/106445 -20          PP-20-0025          22 JANUARY 2020  8 Cybersecurity Info rmation  | Mitigating Cloud Vulnerabilities  \nConclusion  \nManaging risk in the cloud requires that customers fully consider exposure to threats and vulnerabilities, not only  during \nprocurement but also as an on -going process. Clouds can provide a number of security advantages over traditional, on -\npremises technology, such as the ability to thoroughly automate security -relevant processes, including threat and incident \nresponse . With careful implementation and management, cloud capabilities can minimize risks associated with cloud \nadoption, and empower customers to take advantage of cloud security enhancements. Customers should understand the \nshared responsibility that they have  with the CSP in protecting the cloud. CSPs may offer tailored countermeasures to \nhelp customers harden their cloud resources. Security in the cloud is a constant process and customers should \ncontinually monitor their cloud resources and work to improve th eir security posture.  \nWorks Cited:  \n[1] Fazzini, K. (2019), A Technical Slip -up Exposes Cloud Collaboration Risks . [Online] Available at: https://www.w sj.com/articles/a -technical -slip-\nup-exposes -cloud -collaboration -risks-1497353313  [Accessed Jan. 9, 2020]  \n[2] Larson, S. (2017), Pentagon exposed some of its data on Amazon server.  [Online] Available at: \nhttps://money.cnn.com/2017/11/17/technology/centcom -data-exposed/index.html  [Accessed Jan. 9, 2020]  \n[3] Clanburn, T. (2019), Messed Western: Vuln hunters say hotel giants Autoclerk  code exposed US soldiers info, travel plans, passwords  \n[Online] Available at: https://theregister.co.uk/2019/10/22/autoclerk_army_data/  [Accessed Jan. 9, 2020]  \n[4] Defense Information Systems Agency (2017), DoD Cloud Computing Security Requirements Guide.  [Online] Available at: \nhttps://public.cyber.mil/dccs -documents/  [Accessed Jan. 9, 2020]  \n[5] Burt, T. (2019), Recent cyberattacks require us all to be vigilant.  [Online] Available at: https://blogs.microsoft.com/on -the-\nissues/2019/10/04/recent -cybe rattacks -require -us-all-to-be-vigilant/  [Accessed Jan. 9, 2020]  \n[6] Federal Bureau of Investigation (2018), ME-000092 -TT FBI Flash: Malicious Cyber Activity of Iran -based Mabna Institute  \n[7] Christopher, K. (2017), The Security Landscape: Pwn2Own 2017.  [Online] Av ailable at: https://blogs.vmware.com/security/2017/03/security -\nlandscape -pwn2own -2017.html  [Accessed Jan. 9, 2020]  \n[8] Zhao, H et al. (2019), Breaking Turtles All th e Way Down: An Exploitation Chain to Break out of VMware ESXi.  [Online] Available at: \nhttps://usenix.org/system/files/woot19 -paper_zhao.pdf  [Accessed Jan. 9, 2020]  \n[9] Avrahami, Y. (2019) Breaking out of Docker via runC  Explaining CVE -2019 -5736 . [Online] Available at: \nhttps://unit42.paloaltonetworks.com/breaking -docker -via-runc-explaining -cve-2019 -5736  [Accessed Jan. 9, 2019]  \n[10] Graz University of Technology (2018), Meltdown and Spectre.  [Online] Available at: https://meltdownattack.com  [Accessed Jan. 9, 2020]  \n[11] OFlaherty, K. (2019), Hackers Used Malici ous Update to Target 1 Million Asus Devices.  [Online] Available at: \nhttps://forbes.com/sites/kateoflahertyuk/2019/03/25 /hackers -used -a-backdoor -to-infect -asus -users -find-out-whos -affected/  [Accessed Jan. 9, \n2020]  \n[12] Bradbury, D. (2019), Machine -raiding Python libraries squashed by community.  [Online] Available at: \nhttps://nakedsecurity.sophos.com/2019/12/05/machine -raiding -python -libraries -squashed -by-community/  [Accessed Jan. 9, 2020]  \nDisclaimer of Endorsement  \nThe information and opinions contained in this docum ent are provided \"as is\" and without any warranties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply i ts endorsement, \nrecommendation,  or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purpo ses. \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cybersecurity Requirements Center (CRC), 410 -854-4200, Cybersecurity_Requests@nsa.gov  \nMedia inquiries / Press Desk : 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-mitigating-cloud-vulnerabilities_20200121",
  "source": "nsa",
  "id": "32aa702b58f3ab117fb980e8bd8792b67de8a83e815f22fb5bfa8ca822c41d78"
}