{
  "markdown": " \nU/OO/ 238782 -23 | PP-23-4432  | JAN 2024 Ver. 1. 1 \nNational Security Agency | Cybersecurity Information  \nRecommendations for Sof tware Bill of Materials \n(SBOM) M anagement  \nExecutive summary  \nThe dramatic increase in cyber  compromises over the past five years, specifically of \nsoftware supply chains, prompted intense scrutiny of measures to strengthen the \nresilience of supply chains  for software used throughout government and critical \ninfrastructure . Several policies and working groups at multiple levels within the U.S. \nGovernme nt focus on this need to ensure the authenticity, integrity , and trustworthiness \nof software products.  The office of the National Manager for National Security Systems  \n(NSS) , working in collaboration with other NSA organizations, researched  and tested \ntools that manage Software Bills of Materials (SBOMs) as part of a Cybersecurity \nSupply Chain Risk Management ( C-SCRM ) strategy. This guidance includes  important  \nrecommendations  for SBOM management tool functionality  derived f rom the research \nand evaluation  of various SBOM management tools.    \nFundamental to C-SCRM is leveraging a list of \n[software] ingredients to understand and mitigate \nthe cyber risks that software can pose to a user \norganization. SBOMs and SBOM management \ntools bridge this gap to support an  improved \ncybersecurity posture.  Specifically, u sers should  \nleverage SBOMs , as part of a cybersecurity tool \nsuite,  to make:   \n Risk Management  decisions about \nacquiring and deploying software , \n Vulnerability Management  decisions about software depl oyment and ongoing \noperations , and   \n Incident Management  decisions to detect and respon d to new software \nvulnerabilities during vital operations.  \nThis guidance can enable NSS software application owners and users to determine an \nappropriate management toolset that leverages SBOMs to achieve these tasks.   \n\n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  2 \nNSA | Recommendations for SBOM  Management   \nContents  \nRecommendations for Software Bill of Materials (SBOM) Management  .........................  1 \nExecutive summary  ................................ ................................ ................................ .........  1 \nIntroduction  ................................ ................................ ................................ .....................  3 \nPurpose and background  ................................ ................................ ................................  3 \nRecommendations  ................................ ................................ ................................ ..........  4 \nGeneral recommendations for software suppliers  ................................ .......................  4 \nGeneral recommendations for software consumers  ................................ ....................  5 \nSpecific guidance for NSS  ................................ ................................ ...........................  6 \nBest practices  ................................ ................................ ................................ ..................  7 \nRecommended tool functionality  ................................ ................................ .....................  7 \nSBOM input  ................................ ................................ ................................ .................  8 \nSBOM output  ................................ ................................ ................................ ...............  8 \nGenerating SBOMs  ................................ ................................ ................................ ...... 9 \nSBOM component handling  ................................ ................................ .........................  9 \nValida tion of SBOM and SBOM component integrity  ................................ ...................  9 \nVulnerability tracking and analysis  ................................ ................................ ...............  9 \nDistinguishing identified vs. exploitable vulnerabilities  ................................ ...............  10 \nUser interface  ................................ ................................ ................................ ............  10 \nOutput forms and methods  ................................ ................................ ........................  11 \nSBOM versioning and configuration management support  ................................ ........  11 \nIntegration and workflow with other systems  ................................ .............................  12 \nSupporting access to data sources  ................................ ................................ ............  12 \nScalable architecture  ................................ ................................ ................................ . 12 \nSBOM t ool setup and configuration  ................................ ................................ ...........  12 \nWorks cited  ................................ ................................ ................................ ...................  13 \n \n  \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  3 \nNSA | Recommendations for SBOM  Management   \nIntroduction  \nAs Software Bills of Material s (SBOM s) become more integral to Cybersecurity Supply \nChain Risk Management ( C-SCRM ) standards , best practices for managing SBOMs will \nbecome critical in ensur ing reliability of the sof tware supply chain. T hose standards and \nbest practices are evolving, but no single solution, or set of solutions, has become \nubiquitous. While a variety of software analysis tools exist for software developers, most \naddress SBOMs peripherally or focus on SBOM pr oduction, rather than on managing \nsoftware risk in acquiring and using software as a consumer.   \nThe C-SCRM activities that this guidance focus es on are software  Risk Management, \nVulnerability Management , and Incident Management  utilizing SBOM s. Within the \nsphere of software C -SCRM practices , Risk Management  involves determining  the \nauthenticity, completeness, and trustworthi ness of software being acquired  and used . It \nincludes  understanding the applicable risks and comparing that information against the \nmissions risk profile to determine the softwares  suitability. Vulnerability Management  \nallows IT security teams to adopt a more proactive security posture by identifying and \nresolving vulnerabilities before they are exploited. The goal of Incident M anagemen t is \nto reduce the organizations overall risk exposure , whether that occurs as part of the \nprocurement process or operationally,  once  an incident has occurred.  \nPurpose  and background  \nThis cybersecurity information sheet (CSI) highlight s best practices and provide s \nrecommendations for users of National Security Systems (NSS) to help them \nincorporate SBOM management functions suitable to their C -SCRM needs.  \nTo achiev e this outcome, the National Manager for NSS team researched and \nevaluate d a variety of software analysis and SBOM management tools, specifically \nthose that would help NSS  users address software Risk Management, Vulnerability \nManagement , and Incident Management tasks. These three management \nresponsibilities are not point -in-time events , but rather, represent a continuous cycle as \nsoftware is added to or retired from operation, as applicable updates  become available  \nor as vulnerabilities are discovered . [1] \nExecutive Order  (EO)  14028 : Improving the Nations Cybersecurity  focuses on \nimproving the nations cybersecurity, in particular  for critical software and services used \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  4 \nNSA | Recommendations for SBOM  Management   \nacross the federal government. [2] National Security Memorandum 8 (NSM -8) builds on \nthe requirements established under EO 14028, assigning responsibilities to the National \nManager  for NSS  and pointing to additional requirement s needed for National Security \nSystems.  [3] Separately, Executive Order 14017 : Executive Order on Americas Supply \nChains  focuses on strengthening U .S. supply chai n resiliency , [4] and Department of \nDefense Instruction  5200.44  focuses DoD efforts on SCRM . [5] Further instruction from \nCommittee on National Security Systems Directive (CNSSD) 505 assigns \nresponsibilities and establishes the minimum criteria for the continued development, \ndeployment, and sustainment of a n SCRM program with the intent of protecting NSS.  \n[6] \nThis CSI communicates the importance of utilizing an appropriate toolset to leverage \nSBOM s for cybersecurity and SCRM goals and to perform Risk Management, \nVulnerability Management , and Incident Management tasks.   \nThe following  section s describe best practices and expected SBOM management \nfunctionality for NSS owners  and operators . The informa tion should  guide future actions \nand decisions in  acquiring and  implementing an SBOM Management ecosystem  with \nsupporting tools  for softw are supplier s and (U .S. Government ) software consumers.  \nRecommendations   \nNSA recommends the following courses of action to enhance the state of the art for \nSBOM usage. The re commendations are organized as  general  guidance for software \nsuppliers  and consumers  followed by  specific guidance for NSS  users.  \nGeneral recommendations  for software suppliers  \n The software pr ovider community and their consumers should  mature the mode \nof SBOM exchange to protect the intellectual property and product security of the \nsoftware suppliers while ensuring authenticity, accuracy, timeliness , and \nefficiency of SBOM information transfer to software consumers.  \n Both industry and government entities should expand SBOM research to better \nunderstand  the minimum requirements for an SBOM to be beneficial, and  share \nbest practices  to standardize soluti ons for other technology platforms susceptible \nto cyber supply chain attacks (for example, Operational Technology, Cloud/SaaS \noperations, Hardware/Firmware).  \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  5 \nNSA | Recommendations for SBOM  Management   \n Software developers must take ownership of their customers security outcomes \nrather than treating  each product as if it carries an implicit caveat emptor. EO \n14028 and NSM -8 lay the foundations to enable users of National Security \nSystems and other critical systems  to require software technology providers to \nmake their products  Secure by Design and by Default . [7] \nSBOMs and SBOM management tools play a part in enforcing the requirement to \nmake software secure by design  as they provide a mechanism to determine \nsoftware component risk and establish a level of confidence in the softwares \nfreedom from vulnerabilit ies.  \nGeneral recommendations for software consumers  \n Software consumers should  leverage the following resources to ensure their \nsuppliers are designing, developing , and delivering secure software:  \n National Institute of Standards and  Technology (N IST) Special Publication \n(SP) 800-218: Secure Software  Development Framework (SSDF) , or an \nalternate secure software development framework that encompasses and \nexpands on it to accommodate NSS -specific considerations . [8] \n Office of Management and Budget (OMB)  Memorandum M-23-16, [9] \nwhich  updates OMB Memorandum M-22-18, [10] requires all federal \nagencies to use  only software suppliers that  comply with NIST SP 800-\n218.  \n The Software Component Verifi cation Standard (SCVS) provide s \nadditional resources that help NSS  users drive the requirement for SBOM \ndata upstream to software supplier sources to ensure as complete and \naccurate as possible information about software component \ndependencies. [11] \n Software consumers can also leverage  controls identified in the  Enduring \nSecurity Framework's Securing the Software Supply Chain: \nRecommended Practices for Software Bill of Materials Consumption [12] \nand from  Open Web Applicati on Security Project (OWASP) , [13] in \naddition to  the Cybersecurity and Infrastructure Security Agencys (CISA) \ndraft Secure Software Development Self -Attestation F orm. [14] \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  6 \nNSA | Recommendations for SBOM  Management   \n Further guidance from collaboration s among CISA , the National \nTelecommunications and Information Administration ( NTIA ), or the National \nManager for NSS, and the cybersecurity community that establish es common \npractices and standardization for automation of SBOM management.  \nSpecific guidance for NSS   \nThe following recommendations build upon information provided by the NTIA Formats \nand Tooling Working Group  in its Software Consumers Playbook. [15] The NTIAs focus \nis broader , and in general, encompasses systems with a lower level of concern  and \nprotection considerati ons than NSS. The Federal Acquisition Regulation (FAR) [16] and \nDefense Federal Acquisition Regulation Supplement (DFARS) [17] contract clauses \nhave not caught up with the stipulations regarding the inclusion of SBOMs as a \nrequirement for software development contracted as a service. The National Manager \nrecommends that NSS owners develop and require contract language for  the following :  \n Inclusion of software component information containing, at a minimum, the NTIA \nrequired field for each component in all delivered software. Additional component \ndetails sh ould be requested and required as the state of the industry matures. \nThis requirement includes the expectation that a supplier enumerate third -party \nsoftware dependencies (both open source and proprietary) incorporated into the \nsupplier s product. Where th e NTIA required information is not available or \nverifiable for open source items, derived components must be disclosed. This \ncomplete listing of component information helps provide the requisite \ntransparency , not only for software risk management, but also  for vulnerability \nand incident management.  \n Identification of runtime or other dependencies for software operation that are not \nspecifically part of the software components listed in the SBOM.  \n Inclusion of a container manifest should be required for all s oftware with \ncontainer components.  \n Use of digital signatures or authenticated hashes to validate component (and \nSBOM) integrity.  \n For NSS-related software specifically developed  under contract , the SBOM \nshould be generated using source code from the build s tage. If not included in \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  7 \nNSA | Recommendations for SBOM  Management   \nthe SBOM itself, runtime  dependenc y information must also be documented and \nprovided as part of the software deliverable.   \n For all delivered software, whe ther the software is acquired or developed under \ncontract, NSS owners should verify the accuracy and completeness of the SBOM \nutilizing an SBOM management tool as part of its delivery acceptance.  \n For delivered software binaries , NSS owner s should seek  contract agreements  \nthat provide  the NSS owners limited rights to reverse -engineer the software for \nthe specific  purpose of validating SBOMs and resolv ing any discrepancies in  a \nmutually agreed -upon manner.  \n Inclusion of contract metrics that enable tracking and assessment of the software \nsuppliers secure by design performance.  \nBest practices  \nIn addition to the recommendations above, NSS owners should implement the following \nbest practices : \n Establish  a secure, common exchange point between software suppliers and \nconsumers.  \n Obtain SBOM s and associated vulnerability a nd code quality information ( e.g., \nCVEs and CWEs) from analysis of software binaries.  While more work is needed \nto improve the accuracy and timeliness of analysis results, this approach \npresents a way forward in managing the risks from legacy software that  does not \nhave accessible source code/build information for the SBOM . \n Integrate data from SBOMs with NSS acquisition security, asset management, \nthreat intelligence, and vulnerability  management . \nRecommended tool functionality   \nThis section describes important functionality considerations for consumer -side SBOM \nmanagement tool s. Many current tools do not include all the functionality listed below. \nAn organization should identify the functionality that is appropriate for their environment \nand then selec t the tool(s) that supports that functionality.   \nAs part of identifying appropriate SBOM management tool functionality, an organization \nshould assess the tools ease of understanding (presenting information at the right level \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  8 \nNSA | Recommendations for SBOM  Management   \nof need and in an easily under stood manner) and ease of use (reducing the number of \nother applications or information required outside the tool to complete the task). Tool \nfunctionality that is not easily understood or used is often not a good fit for an \norganizations environment and processes. SBOM tool providers should continually \nfocus on improving their tools ease of understanding and ease of use.  \nThe tool should be able to:  \nSBOM input  \n Support and manage all SBOM format versions (e.g., the latest  Cyclone DX \n(CDX ) and SPDX version s). Ideally, it should import and support both formats.  \n Import SBOMs as JSON or XML file types. Ideally, it should  import JSON, XML , \nand CSV file types.  \n Check SBOM structure and syntax for compliance with the appropriate format \nspecification  (including for a specific version) when importing SBOMs.  \n Display information regarding the SBOM s compliance with applicable structure \nand syntax rules  for the SBOM format and version. Ideally, it should alert users \nwith a display indicating the assessed quality level , while giving the option to  \ncontinue the import or not.  \n Include a n auto correction option to assist the user in normaliz ing and correct ing \nan SBOM file being imported . \nSBOM output  \n Export SBOMs using  either the CDX or SPDX format. Ideally, it should include \nthe ability to export both formats.  \n Export SBOMs as JSON or XML file types. Ideally, it should include the ability to \nexport JSON, XML , and CSV file types.  \n Conver t one SBOM format to another.  \n Conver t one SBOM file type to another.  \n Aggregate multiple  SBOM s from the SBOM tools repository into one SBOM . \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  9 \nNSA | Recommendations for SBOM  Management   \nGenerat ing SBOM s \n Generate SBOMs from various types of software development process outputs  \n(for example , from a software build  environment , from analysis of a binary file, \nfrom system registry query, etc.).  \nSBOM component handling  \n Display NTIA -minimum SBOM fields  (Supplier Name, Component Name, \nComponent Unique  Identifier (CPE, PURL)/Hash, Component Version, \nComponent Dependency Relationship, Compon ent Author) for each component.  \n Enrich SBOM information using additional reference sources. Ideally, it should \nprovide visual cues indicat ing external information was used to enrich the SBOM \ndata and reference s source sites of the enrichment data.  \n Include mechanisms to graphically represent component dependencies.  \n Display component provenance information, including external enrichments.  \nValidation of SBOM and SBOM component i ntegrity  \n Capture and display hash information for each component. Ideally , this validation \nshould provide a digital signature for the SBOM a nd provenance information for \neach component , as well as the Component Hash, and a PURL or CPE pointer.  \n Include links to information sources where provenance data was gathered \n(supports abili ty to verify integrity and assess risk).  \nVulnerability tracking and analysis  \n Provide daily updates from the National Vulnerability Database (NVD) and other \nvulnerability data.  Ideally , these updates should provide continuous extracts and \nanalysis from asso ciated cyber threat intelligence (CTI) and SBOM data \nenhancement services.  \n Notify users of new vulnerabilities and updates , including alerts of emergent \ncritical vulnerabilities and their severity . Ideally, these notifications  should clearly \ndistinguish be tween a new vulnerability and an update to an existing vulnerability , \nand provide additional information to prioritize vulnerability responses along with \nrisk remediation guidance.  \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  10 \nNSA | Recommendations for SBOM  Management   \n Integrate various sources of threat intelligence in addition to the various  software \nvulnerability/weakness databases.  \n Provide a flexible policy engine, including the ability to apply and update \norganization -specific policy rules. Ideally, this customization  should enable \nintegration of threat intelligence as policy rules.  \n Provide multiple ways to identify and research an emergent vulnerability's \nexistence in the users SBOM repository/asset inventory. Ideally, it should quickly \nidentify specific networks or endpoints containing the software and configurations \naffected by a newly discovered vulnerability.  \n Support and track the timeliness of vulnerability remediation (including \nconfiguration management/traceability to a new SBOM to distinguish the \nvulnerable, replaced software from the remediated/hardened replacement \nsoftware) . \nDistinguishing i dentified vs. exploitable vulnerabilities  \n Indicate whether a vulnerability is actually exploitable and  support accompanying \nevidence  and justification for no n-exploitable claims. Ideally, it should annotate \nand update information about th e exploitability of a component vulnerability using \nVulnerability Exploitability eXchange (VEX) format.  \nUser i nterface  \n Follow Human Computer Interface (HCI) standards.  \n Incorporate accessibility features.  \n Provide mechanisms that make the information easy to assess and, if desired, \nenable  the user to easily delve further (often by hovering the cursor over icons or \nclicking on icons with links ) to view the next level of detail.  \n Provide easily understandable graphic representation methods and formats to \nconvey information attributes about software components, vulnerabilities, \nlicenses, supplier organizations, users , and user organizations.  \n Provide multiple ways to drill down and obtain additional information  for software \ncomponent provenance, vulnerability, license, and risk status.  \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  11 \nNSA | Recommendations for SBOM  Management   \n Provide means to create structured groupings  or categories of SBOMs to \nfacilitate asset tracking, vulnerability management, incident management, etc.  \n Provide the ability to filter /sort/group SBOM  information  according to user -\nselectable attributes (such as, by software/BOM type, software/BOM source, \nsoftware/BOM PoC; component type, component package, component age, \ncomponent versions, security trend; vulnerability severity, vulner ability count; and \norganization level, license type, violation).  \nOutput forms and m ethods  \n Output standardized reports regarding component attributes, vulnerability \ninformation, license information, and component supplier information.  \n Export dependency inf ormation in graphic and/or text format.  \n Output graphic representations of analysis results.  \n Ideally , provide a modular means to export specific text and graphics (whether \nfrom the SBOM itself or derived from analysis and enhancement processes) for \nuse in external communications.  \nSBOM versioning and c onfiguration management su pport  \n Include a scalable configuration management capability for SBOMs. Minimally, it \nshould include mechanisms to organize SBOMs, maintain version history , and \ntrack changes of  SBOMs/ software.  \n Include user -tailorable mechanisms to organize SBOMs on multiple information \nattributes (such as by organization, software supplier, type of software, type of \nBOM, license type, etc.).  \n Include a trend graphic showing the number of vulnerabilities  for each severity \nlevel across each component version  and report  whether the numbers of \ncomponent vulnerabilities are increasing or decreasing with each version \nrelease.  \n Compare SBOM versions for th e same software and highlight s differences (such \nas by different components or different component versions, different sources, \netc.).  \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  12 \nNSA | Recommendations for SBOM  Management   \nIntegration and workflow with other systems  \n Employ \"API First\" design to facilitate import and export of information with other \nsystems.  Ideally, information elements within t he tool should be individually \nexportable/downloadable.  \n Integrate with multiple  types of SBOM  sources and other data that can be \ncombined together for analysis.  \n Leverage format -agnostic, independent, stateless, and scalable API capabilities \n(such as REST)  to automate processes/workflow.  \n Support a secure, integrated Producer/Consumer exchange ecosystem.  \nSupporting access to data sources  \n Integrate AI/ML engines and associated data lakes that analyze SBOM \ncomponent information against diverse types of threa t signatures and patterns.  \n Include an updatable library of open source software license s that the SBOM \nmanagement tool  identifies  and tracks where applicable . \nScalable architecture  \n Include mechanisms to support distinct sub -organizations within an enterprise \nthat may have different risk tolerance rules  or policies.  \n Handle other types of BOMs.  \n Be part of, or support, a suite of tools that work together to accomplish Risk \nManagement, Vulnerability Management, and Incident Management  activities.  \nSBOM tool setup and configuration  \n Provide mechanisms and supporting materials to easily download, setup , and \nintegrate in Linux or Microsoft environments.  Ideally, it should support  both \nenviron ments.  \n  \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  13 \nNSA | Recommendations for SBOM  Management   \nWorks c ited \n[1] National Institute of Standards and Technology. Special Publication 800 -161 Rev. 1 \nCybersecurity Supply Chain Risk Management Practices for Systems and Organizations. 2022. \nhttps://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800 -161r1.pdf   \n[2] Executive Office of the President. Executive Order 14028: Improving the Nation's Cybersecurity. \n2021. https://www.federalregister.gov/documents/2021/05/17/2021 -10460/improving -the-\nnationscybersecurity  \n[3] White House. National Security Memorandum 8:  Memorandum on Improving the Cybersecurity of \nNational Security, Department of Defense, and Intelligence Community Systems. 2022. \nhttps://www.whitehouse.gov/briefing -room/presidential -actions/2022/01/19/memorandum -on-\nimproving -the-cybersecurity -of-national -security -department -of-defense -and-intelligenc e-\ncommunity -systems   \n[4] Executive Office of the President.  Executive Order 14017: Executive Order on Americas Supply \nChains. 2021. https://www.whitehouse.gov/briefing -room/presidential -\nactions/2021/02/24/executive -order -on-americas -supply -chains/   \n[5] Department of Defen se (DoD).  DoD Instruction (DODI) 5200.44: Protection of Mission Critical \nFunctions to Achieve Trusted Systems and N etworks (TSN). 2018. \nhttps://www.esd.whs.mil/Portals/54/Documents/DD/issuances/dodi/520044p.pdf   \n[6] Committee on National Security Systems (CNSS) . CNSS Directive 505: S upply Chain Risk \nManagement (SCRM). 2021. https://www.cnss.gov/CNSS/issuances/Directives.cfm   \n[7] Cybersecurity and Infrastructure Security Agency (CISA) and partners . Shifting the Balance of \nCybersecurity Risk: Principles and Approaches for Secure by Design Software. 2023. \nhttps://media.defense.gov/2023/Apr/13/2003198917/ -1/-1/0/Shifting -the-Balance -of-\nCybersecurity -Risk-Principles -and-Approaches -for-Secure -by-Design -Software.PDF   \n[8] National Institute of Standards and Technology. Special Publication 800 -218: Secure Software \nDevelopment Framework (SSDF): Recommendations for Mitigating the Risk of Software \nVulnerabilities. 2022. https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP .800-218.pdf   \n[9] Office of Management and Budget (OMB). OMB Memorandum M -23-16: Update to Memorandum \nM-22-18, Enhancing the Security of the Software Supply Chain through Secure Software \nDevelopment Practices. 2023. https://www.whitehouse.gov/wp -content/uploads/2023/06/M -23-16-\nUpdate -to-M-22-18-Enhancing -Software -Security.pdf   \n[10] Office of Management and Budget (OMB). OMB Memorandum M -22-18: Enhancing the Security \nof the Software Supply Chain through Secure Software Development Practices. 2022. \nhttps://www.whitehouse.gov/wp -content/uploads/2022/09/M -22-18.pdf  \n[11] Open Worldwide Application Security Project (OWASP). Software Component Verification \nStandard (SCVS). 2023. https://scvs.owasp.org/   \n[12] Enduring Security Framework. Securing the Software Supply Chain: Recommended Practices for \nSoftware Bill of Materials Consumption. 2023. \nhttps://media.defense.gov/2023/Nov/09/2003338086/ -1/-\n1/0/SECURING%20THE%20SOFTWARE%20SUPPLY%20CHAIN%20RECOMMENDED%20PR\nACTICES%20FOR%20SOFTWARE%20BILL%20OF%20MATERIALS%20CONSU MPTION.PDF  \n[13] Open Worldwide Application Security Project (OWASP). OWASP. 2023. https://owasp.org/   \n[14] Cybersecurity and Infrastructure Security Agency (CISA). Request for Comment on Secure \nSoftware Development Attestation Common Form. 2023. https://www.cisa.gov/secure -software -\nattestatio n-form  \n[15] National Telecommunications and Information Administration (NTIA). Software Consumers \nPlaybook: SBOM Acquisition, Management, and Use. 2021. \nhttps://www.ntia.gov/files/ntia/publications/software_consumers_sbom_acquisition_management_\nand_use_ -_final.pdf   \n[16] General Services Administration. Federal Acquisition Regulation. 2023. \nhttps://www.acquisition.gov/browse/index/far   \n\n \n \n \nU/OO/ 238782 -23 | PP-23-4432 |  JAN 2024 Ver. 1.1  14 \nNSA | Recommendations for SBOM  Management   \n[17] Department of Defense. Defense Federal Acquisition Regulation Supplement (DFARS) and \nProcedures, Guidance, and Information (PGI). 2023. \nhttps://www.acq.osd.mil/dpap/dars/dfarspgi/current/index.html   \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce \nherein to any specific c ommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not \nconstitute or imply its endorsement, recommendation, or favoring by the United States Government, and this guidance shall not  be \nused for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify and \ndisseminate threats to National Security Systems, Department of Defense, and Defense Industrial  Base information systems, and to \ndevelop and issue cybersecurity specifications and mitigations. This information may be shared broadly to reach all appropria te \nstakeholders.  \nContact  \nCybersecurity Report Feedback: CybersecurityReports@nsa.gov  \nGeneral Cybersecurity Inquiries or Customer Requests: Cybersecurity_Requests@nsa.gov   \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov  \nMedia Inquiries / Press Desk: NSA Media Relations: 443 -634-0721, MediaRelations@nsa.gov  \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-scrm-sbom-management-v1.1",
  "source": "nsa",
  "id": "cde7bf4998e3922e7b2161a252085e487314d4be49e20311c5dc052a6b4c1a2d"
}