{
  "markdown": " \n \n 1 U/OO/189300 -18          PP-18-0571           29 August 2018  \n CLOUD SECURITY BASIC S \nBACKGROUND  \nCloud services provide enterprise organizations flexibility and new capabilities, however they introduce new risks that \nmust be understood and addressed  before procuring a cloud service provider (CSP). Department of Defense (DoD) \norganizations are charged with handling sensitive data ranging from Personally Identifiable Information (PII) to national \nsecurity information. As more sensitive data is consider ed for storage and manipulation in cloud environments, \norganizations must address new security threats before deploying in an operational environment.  \nINTRODUCTION TO CLOU D \nCloud services hold several distinct advantages over traditional infrastructure, al lowing for rapid large -scale deployment of \ncomputing resources. Organizations have different requirements, which can be met by different types of cloud services \nthat usually fit into three broad categories: Infrastructure as a Service (IaaS), Platform as a  Service (PaaS), and Software \nas a Service (SaaS). Management responsibilities (shown below) vary depending upon the type of service, and whether \nthe cloud environment is hosted privately.  \n \nCloud deployments can be public or private. Public clouds are own ed and managed by a third -party while private clouds \nare usually owned and operated on -premises. Security concerns depend upon the service type as well as where the cloud \nservice is deployed. Security should be a primary consideration when choosing a cloud  service provider and deployment \ntype. Private clouds shift more of the security responsibility to the organization. With public clouds, organizations share \nsecurity responsibilities with the CSP.  \nServices that use the cloud to perform some functions (e.g ., backup software or Personal Security Products) have the \nsame shared responsibility and management requirements as other SaaS cloud services. Organizations should ensure \nthat any product that uses the cloud conforms to federal and DoD requirements before  deploying to their environment.   \n\n\n \n \n2 U/OO/189300 -18          PP-18-0571           29 August 2018  \n Shared Responsibility  \nCloud service providers and DoD  organizations share unique and overlapping responsibilities to ensure the security of \nservices and sensitive data stored in public clouds. Typically CSPs are responsible for physical security of cloud \ninfrastructure, as well as implementing logical contro ls to separate customer data. Organizational administrators are \nusually responsible for application level security configuration such as mandatory access controls for authorization to \ndata. Many CSPs provide cloud security configuration tools and monitorin g systems, but it is the responsibility of DoD \norganizations to configure the service according to their security requirements.  \nThreat Model  \nPrimary risks to cloud infrastructure are malicious adversary activity and unintentional configuration flaws. Publi c cloud \nservices use shared infrastructure which can lead to unintentional vulnerabilities. Foreign Intelligence Services might \nexploit poorly configured clouds to enable collection of sensitive DoD information. Federal law and DoD policy define how \ndiffer ent types of sensitive data should be handled to prevent exposure. Organizations must consider what their security \nrequirements are before making a decision on a cloud service that fits their specific threat model.  \nUsing a public cloud service extends the  trust boundary beyond the organization. New risks are introduced by utilizing \nCSPs, such as insider threats and a lack of control over security operations. Customers should take advantage of cloud \nsecurity services to address mitigation requirements. Whil e some threats can be mitigated entirely through the use of \ntechnical solutions (e.g., encryption), ultimately it is critical to understand and document the shared security \nresponsibilities in order to establish trust with the CSP.  \nFederal and DoD  Requirements  \nThe Federal Risk and Authorization Management Program (FedRAMP) 1 provides a standardized framework for \nassessing and authorizing cloud services. Authorized CSPs 2 are vetted and certified according to a standardized set of \nsecurity requirement s. While FedRAMP accredits cloud service providers according to several standards, DoD \norganizations are still responsible for determining their requirements and whether a particular cloud service provider is \nauthorized to handle their data.  \nThe DoD Cloud  Computing Security Requirements Guide (SRG) 3 outlines the security controls and requirements \nrequisite for utilizing cloud services within DoD. In order to be approved for use by DoD organizations, CSPs must be \naccredited according to requirements set by the SRG. Sensitive data should only be handled by CSPs that are accredited \nfor that type of data. DoD mission owners must integrate SRG requirements regarding cloud security controls into their \ncloud architectures.   \nMANAGING RISK  \nMinimizing risk to cloud s ervices requires careful vetting before acquisition, as well as proper configuration and continuous \nmonitoring. Organizations should determine their threat model, ensure the chosen cloud service meets federal and DoD \nstandards, and implement correct config uration and controls. Administrators should refer to service specific cloud security \nconfiguration guidance published by NSA. Ultimately controlling risk is a process, not a checklist. Major cloud security \nconcerns are listed below, but specific requiremen ts will vary.  \nAccess Control  \nMisconfigured access controls in major cloud storage providers have resulted in the exposure of sensitive data to \nunauthorized parties. Data exposures are especially impactful for DoD  as they erode public trust and in some cases can \ndamage national security.  Controlling access is a key requirement when storing sensitive data. Public cloud storage \n                                                \n1 https://www.fedramp.gov  \n2 https://marketplace.fedramp.gov/#/products?status=Compliant  \n3 https://iase.disa.mil/cloud_security/Pages/index.aspx  \n\n \n \n3 U/OO/189300 -18          PP-18-0571           29 August 2018  \n providers have default access control configurations which differ from the security requir ements of the information being \nstored. Administrators must configure permissions according to what people and systems have a need to access the data. \nLogging and automated systems should be used to confirm correct access control configuration. Many CSPs p rovide \nspecific tooling to manage access permissions and to log unusual or unauthorized activity.  \nCloud Patching  \nTaking advantage of software security updates is a significant part of running a secure cloud environment. The \nresponsibility of applying softw are updates varies depending upon the type of cloud service used and who is responsible \nfor its management. Updates to the underlying infrastructure will be handled by the cloud service provider. However, \norganizations are responsible for applying security  patches to services they manage themselves in the cloud. Applying \nsecurity patches as soon as they are released is critical to preventing data breaches and loss of trust.  \nMulti -Tenancy  \nMulti -tenancy allows sharing of common cloud resources between multipl e collocated cloud customers. Depending upon \nthe type of cloud service (IaaS, PaaS, SaaS), cloud service providers will allocate resources differently. CSPs at a bare \nminimum will implement logical controls to separate user data and operations, however vul nerabilities or unintentional \nconfiguration flaws could be exploited by a collocated malicious actor. FedRAMP and the DoD Cloud SRG define \nrequirements for logical separation, but some organizations may require greater assurance. Private clouds or dedicate d \npublic clouds with physical separation should be used for sensitive operations as required.  \nEncryption  \nProtecting PII and other sensitive data requires encrypting data in transit as well as when stored at rest. Organizations \nmust define a robust policy f or what sensitive data should be encrypted and the process for doing so. Cryptographic keys \nused for encryption operations should be stored securely and separately from the cloud instance of the data being stored. \nKeys should be directly managed by the mis sion owner or by a trusted third -party. Cloud -based key management and \nencryption can be used for some DoD accredited clouds. FedRAMP and the DoD Cloud SRG define several requirements \nfor encryption that CSPs must adhere to in order to be considered compli ant. Depending upon the type of data being \nstored, organizations can encrypt sensitive data before transmitting it to a cloud service. Additionally, sensitive data \nshould be encrypted at rest in accordance with requirements set by the DoD Cloud SRG.  \nUtiliz e Cloud Security Services  \nCloud service providers are uniquely positioned to provide threat information as well as defensive countermeasures. \nCustomers should fully take advantage of cloud security services and supplement them with on -premises tools to add ress \ngaps, implement in -house security tradecraft, or fulfill requirements for sensitive data.  Trust is essential -- the risks of \ntrusting a CSP to correctly implement security functionality must be weighed against the costs of managing security \ncontrols in-house.  \nReliability and Denial of Service  \nCloud denial of service (DoS) attacks prevent users from accessing cloud services by overwhelming the cloud service \nproviders resources. Mature CSPs will employ good defenses against known attacks and quickly re spond to attacks \nwhen they are made aware of them. In order to prevent catastrophic impacts to mission, organizations must determine \nwhether a CSP has implemented the processes and tools to mitigate DoS attacks. Whenever necessary, organizations \nshould dis tribute redundant systems across multiple geographic regions or diverse cloud providers for high availability.  \nData Spillage  \nIn compliance with federal and DoD regulations, cloud service providers should only store and manipulate data they are \naccredited t o handle. Data spillage occurs when sensitive data is unintentionally introduced into a non -accredited cloud \nenvironment. DoD organizations must have clear procedures in place to detect and remediate data spillage events.  \n\n \n \n4 U/OO/189300 -18          PP-18-0571           29 August 2018  \n BOTTOM LINE  \nCloud services enable powerful capabilities and enterprise flexibility. However, organizations should enforce applicable \nsecurity guidance and carefully determine whether their threat model fits with the mitigations offered by the accredited \ncloud service they are  considering.  \nAdditional Information  \nhttps://www.iad.gov  \nDisclaimer of Warranties and Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  Reference  herein to any  \nspecific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not c onstitute or imply its endorsement,  \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nContact Information  \nClient Requirements and General Cybers ecurity Inquiri es \nCybersecurity Requirements Center (CRC), 410 -854-4200, email: Cybersecurity_Requests @nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-cloud-security-basics",
  "source": "nsa",
  "id": "deb0aa6d121f993ec9820fb0e37dd00afbcbeffbd1419ee55739ecff840acb90"
}