{
  "markdown": " \n \n 1 BLOCKING  UNNECESSARY ADVERTIS ING WEB \nCONTENT  \nCyber adversaries can leverage malicious advertising (malvertising) to install malware . Exploit kits in malicious ads can \ntake advantage of unpatched vulnerabilities to silently install malware1. Administrators should ensure that software \nupdates are implemented promptly to prevent malware installation.  Blocking potentially malicious web adv ertisements \nfurther mitigates malvertising . Additionally, blocking such content can decrease traffic across the network boundary , \nstreamlining incident forensics and enhancing network performance.  \nBACKGROUND  \nWeb browsers present a major cyber security risk  due to their frequent interaction with untrusted, Internet -based content. \nDue to the vast Internet landscape, it is generally not possible to predict and catalog the good websites that a user may \nvisit. Instead, blacklisting approaches (such as Microsof t SmartScreen2 and Google Safe Browsing3) enhance \nsecurity by blocking known malicious websites. Content that is neither inherently  useful nor known to be malicious in \nnature, such as advertisements, often go unrestricted. Many w ebsites include space fo r third party  advertisers to display \ncontent. Despite the benign nature of most advertising content, advertising has been a known malware distribution vector4 \nfor over a decade5. This attack, known as \"malvertising,\" allows a malicious actor to target users based on location, \ninterests, browsing habits, and system specific identifiers, such as software versions1. \nRECOMMENDATION  \nOrganizations whi ch have already implemented a comprehensive and rapid patching regime6 can further address \nmalvertising by blocking potentially malicious, internet -based advertisements. While both network and host based \nsolutions are outlined below, network -based solution s provide a similar level of protection to host solutions without \nintroducing additional risk.  \nThere are a variety of advertisement blocking strategies with significant differences in user impact, cost, and infrastructur e \nrequirements. Administrators shou ld use this guidance to determine the best strategy for their environment based on \nexisting network infrastructure.  \nAD-BLOCKING THROUGH NET WORK FUNCTIONS  \nBlocking access to advertisements at the network boundary can often be achieved using technologies already deployed \non the network . Many firewalls and DNS servers provide the necessary building blocks to implement  the end goal.  An \norganization can choose to incorporate more than one of the below network implementations depending on the feature set \nof the deployed systems.   \n                                                \n1 Ill Make You an Offer You Cant Refuse  (2017 -01-04). https://ncsc.gov.uk/blog -post/ill -make -you-offer-you-cant-refuse   \n2 Microsoft and SmartScreen are registered trademarks of Microsoft Corp.  \n3 Google Safe Browsing is a trademark of Google, Inc.  \n4 Weekly Threat Report  (2017 -06-02). https://ncsc.gov.uk/report/weekly -threat -report -2nd-june-2017   \n5 Malvertising  (2007 -12-06). William Salusky SANS ISC. https://isc.sans.edu/diary/Malvertising/3727   \n6 Security Configuration Guide for Browser Updates  (2016 -10-25). https://www.iad.gov/iad/library/ia -guidance/security -\nconfiguration/applications/security -configuration -guide -for-browser -updates.cfm   \n\n \n \n2 U/OO/176814 -18          PP -18-0495          05 July 2018  \n  \nGeneral Network Solutions  \nSome boundary products  like firewalls and proxies  provide universal resource locator (URL) classification engines as part \nof an Intrusion Prevention Service. These products have domains organized into categories, which are either defined by \nthe vendor themselves or can be subscribed to from a third -party  vendor. The firewall will then perform an action based on \npattern matches; an example would be block ing the client request for the ad domain, which would generate a TCP reset . \nThis solution requires the least amount of custom engineering due to the native  functionality provided in IT products. \nHowever, if this service was not purchased, there exist freely available solutions described below.  \nDNS Servers  \nDomain Name System (DNS) servers are an effective means of blocking publicly -known advertising domains due to  \nadvertisers' reliance on domain name lookups. To accomplish DNS ad -blocking, organizations should first ensure that all \nDNS requests are routed through corporate DNS servers. A firewall rule denying DNS traffic except through corporate \nservers ensur es that misconfigured systems cannot bypass ad -blocking protection.  \nPublicly -available ad server lists generally need to be transformed because they were primarily designed for use with host -\nbased software. Because of this, organizations can maintain granu lar control of the internally hosted list. It is important to \nnote that these types of lists are managed by a community of enthusiasts, and additional work may be needed to obtain \nbroader coverage.  \nIngesting these lists will require the parsing of domain names from each line. NSA recommends that network administrators \nscript the downloading, parsing, and formatting of a reputable, public advertiser list to maintain a current advertiser list.  This \nparsed list can be utilized in the firewall solution above i f it is determined that the commercial list is missing domains.  \nResponse Policy Zones (RPZ) allow DNS Servers to substitute query answers. When using RPZ, it is recommended to \nfollow the walled garden approach7 by returning a canonical name (CNAME) to an i nternally owned webserver that will \nserve minimal content to the end user. This will ensure that web requests do not hang while waiting for a response. However, \na black -hole approach is not discouraged.  \nIf RPZ is not implemented in your organizations DNS server, then standard Forward Lookup Zones can be defined for \neach domain to be altered, and a black -hole IP address should be returned. A boundary device upstream should then \nreset the connection so the clients connection does not hang waiting for resour ces to load.  \nADVERTISEMENT BLOCKI NG AT THE HOST LEVEL  \nHost Based Ad -Blocking  \nSome Host/Endpoint -level security systems offer ad -blocking functionality that is bundled with or readily deployed from \nenterprise endpoint security implementations. Organizations  may be able to leverage ad -blocking software provided by \nsolutions already within their infrastructure.  \nBecause of their privileged position in the operating system, endpoint ad -blockers can filter content by blocking  DNS \nrequests or HTTP requests to known advertising domains or IP addresses. Some systems implement their ad -blocking as \na browser extension, which is described in greater detail below.  \nAd-Blocking Browser Extensions  \nWeb based advertisements are primarily targeted at web browsers and browser  extensions can block such content.  \nBrowser extensions are able to incorporate some detection techniques infeasible at the network layer, such as de-\nobfuscation and behavioral heuristics . However , some of these extension s adopt a free -to-use business model that \ngenerates revenue by collecting user information and browsing data. Because browser extensions operate at a privileged \nlevel in the browser environment, they have access to most data entering and exiting the browse r. Implementing a \nmalicious ad -blocking extension should be done with considerable caution. Such software could cause a greater \ncompromise to network security than a malvertising attack, even when installed from reputable browser app stores8. \n                                                \n7 Walled Garden for Remote Access  (2015 -10). https://ncsc.gov.uk/guidance/walled -garden -remote -access -architectural -pattern -2  \n8 Over 20 million Users Installed Malicious Ad Blockers From Chrome Store  (2018 -04-19). https://thehackernews.com/2018/04/adblocker -chrome -extension.html  \n\n \n \n3 U/OO/176814 -18          PP -18-0495          05 July 2018  \n AD-BLOCKING C ONCERNS  \nBreaking Webpage Dependencies  \nSome websites restrict content if an ad -blocker is detected. Though this is currently a rare practice, it could prevent users \nfrom accessing legitimate, useful web content. If ad -blocking is implemented at the host lev el, the user may have the \nability to temporarily permit ads allowing access to the desired content. Ad -blocking implemented at the network level, \nhowever, does not provide users with an immediate means to access the protected content. Depending on how ad -\nblocking is implemented, administrators should ensure that users are trained on adding exceptions to host based ad -\nblocking or are aware of potential content degradation when network based ad -blocking occurs . Most ad -blockers allow \nadministrators to whiteli st specific domains if ad -blocking is hindering a mission essential resource.  \nMalicious Denial of Service Attacks  \nAd-blocking is accomplished through the use of  domain/IP blacklists that are frequently updated by communit ies of \nindividuals. These lists may  not be well -vetted by the ad -blocking vendor themselves creating the potential for untrusted \nindividuals to introduce non -advertisers to the blacklist. In extreme cases, a malicious user could list reputable domains \n(such as *.mil) as known advertisers wh ich could cause the ad -blocker to deny mission critical communications with those \ndomains. To counter this threat, system administrators should whitelist regularly used or highly trusted domains within the \nad-blocking software. Care should be taken not to override blacklists that may match these rules. Suggested whitelisting for \ngovernment customers include s: \n Trusted top level domains: *.mil, *.gov, *. edu \n Operating System vendors (such as *.microsoft.com and *.apple.com)  \n Productivity websites used by the organization (such as *.office.com and *.salesforce.com)  \n Internal/external organization websites and websites regularly used by the organization  \nCareful establishment of such a whitelist will greatly reduce the denial of service risk from mali cious ad -blocking \ncontributors.  \nIncomplete Advertiser Coverage  \nDue to the increasing impact of ad -blocking lists to advertisers, some ad -blockers have productized domain whitelisting. \nAdvertisers can pay these ad -blockers to remove domains from their known advertiser  list. When this occurs, products \nusing the lists will no longer block malvertising attacks from these domains. Administrators are encouraged to use \nreputable advertiser lists which do not engage in the \"pay to advertise\" practice.  \n \n \n \n \n \n \n \n \nDisclaimer of Warr anties and Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  Refer ence herein to any  \nspecific commercial products, process, or service by trade name, trademark, manufacturer , or otherwise, does not constitute or imply its endorsement,  \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nContact Information  \nClient Requirements or General Cybersecurity  Inquiries  \nCybersecurity Requirements Center (CRC), 410 -854-4200, email: Cybersecurity_Requests@nsa.gov   \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-blocking-unnecessary-advertising-web-content",
  "source": "nsa",
  "id": "6a967d166a4a596102482d689d9698781b6bb54e34a684155d6a9bb04a703e13"
}