{
  "markdown": " TLP:CLEAR   \nDisclaimer:  This document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when \ninformation carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures \nfor public release. Subject to standard copyright rules, TLP:CLEAR information may be distributed without \nrestriction. For more information on the Traffic Light Protocol, see cisa.gov/tlp/ . \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPHISHING  GUID ANCE: \nSTOPPING  THE ATTACK \nCYCLE AT PHASE ONE  \n \nPublication: October  2023  \n \n \n \n\n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n2      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \nTABLE OF CONTENTS  \n \nOVERVIEW  ................................ ................................ ....................  3 \nPHISHING TO OBTAIN LOGIN CREDENTIALS  .............................  4 \nMALWARE -BASED PHISHING  ................................ ......................  5 \nMITIGA TIONS  ................................ ................................ ...............  5 \nINCIDENT RESPONSE  ................................ ..............................  11 \nREPORTING  ................................ ................................ ..............  12 \nCISA SERVICES  ................................ ................................ .........  12 \nRESOURCES  ................................ ................................ .............  13 \nACKNOWLEDGEMENTS  ................................ ...........................  14 \nDISCLAIMER  ................................ ................................ .............  14 \nREFERENCES  ................................ ................................ ............  14 \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n3      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n OVERVIEW  \nSocial engineering is the attempt to trick someone  into revealing \ninformation (e.g., a password) or taking an action that can be \nused to compromise systems or networks. Phishing is a form of \nsocial engineering where malicious actors lure victims (typically \nvia email) to visit a  malicious site or  deceive them into  providing \nlogin  credentials.  Malicious actors primarily leverage phishing \nfor: \n Obtaining login credentials.  Malicious actors conduct \nphishing campaigns to steal login credentials for initial \nnetwork access.  \n Malware deployment.  Malicious actors commonly conduct \nphishing campaigns to deploy malware for follow -on activity, \nsuch as interrupting or damaging systems, escalating user \nprivileges, and  maintaining persistence on compromised \nsystem s. \nThe Cybersecurity and Infra structure Security Agency (CISA), \nNational Security Agency (NSA),  Federal Bureau of In vestigation \n(FBI),  and Multi -State Information Sharing and Analysis Center \n(MS-ISAC)  are releasing this joint guide to outline phishing \ntechniques malicious actors common ly use and to provide \nguidance for both  network defenders and software \nmanufacturers . This will help  to reduce the impact of phishing  \nattacks in obtain ing credentials and deploy ing malware.  \nThe guidance for network defenders is applicable to all \norganizati ons but  may not be feasible for  organizations with \nlimited resources. Therefore, this guide includes  a section of \ntailored recommendations  for small - and medium -sized \nbusinesses that may not have the resources to hire IT staff \ndedicated to  a constant defen se against phishing threats.  \nThe guidance for software manufacturers focuses on secure -by-\ndesign and -default  tactics and techniques. Manufacturers \nshould develop and supply software that is secure against the \nmost prevalent phishing threats, thereby increasing the \ncybersecurity posture of their customers.  \n \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n4      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \nPHISHING TO OBTAIN L OGIN CREDENTIALS  \nDEFINITION  \nIn phishing attacks used to obtain login credentials, Malicious actors pose as trustworthy sources \n(e.g., colleagues, acquaintances, or organizations) to lure victims into providing their login \ncredentials. Malicious actors can use the compromised credentials (e.g., usernames and passwords) \nto gain access to enterprise networks or protected resources, such as email accounts.  \nEXAMPLE TECHNI QUES  \nTo obtain login credentials, malicious  actors commonly:  \n Impersonate supervisors, trusted colleagues, or IT personnel to send targeted emails to deceive \nemployees into providing their login credentials.  \n Use smartphones or tablets, along with short mess age system (SMS), to send text messages or \nchats in platforms such as Slack, Teams, Signal, WhatsApp, or Facebook Messenger to lure \nusers into divulging their login credentials.  \no Note: Organizations operating in hybrid environments have fewer face -to-face \ninteractions and frequent virtual exchanges; thus, users in these environments are more \nlikely to be deceived by social engineering techniques tailored towards platforms they \nfrequently use.  \n Use voice over internet protocol (VoIP) to easily spoof caller id entification (ID) which  takes \nadvantage of public trust in the security of phone services, especially landline phones . \nMulti -factor authentication (MFA) can reduce the ability of malicious actors using compromised \ncredentials for initial access . Despite th is, if weak forms of MFA are enabled, malicious actors can \nstill obtain access through  phishing and other techniques. Instances of weak MFA implementation \ninclude the following:  \n Accounts using MFA  without Fast Identity Online (FIDO) MFA or Public Key Infra structure (PKI) -\nbased MFA enabled . These form s of MFA - are susceptible to  malicious actors using \ncompromised legitimate credentials to authenticate as the user in legitimate login portals.  \n Push-notification MFA without number matching . Malicious a ctors can  send a multitude of \napprove or deny push requests until a user either accepts the request, often by accident or in \nfrustration. Thus, malicious actors may authenticate with the compromised users credentials , if \nthey do not have number matching enabled  \n SMS or voice MFA . Malicious actors can convince cellular carrier representatives to transfer \ncontrol of a users phone number to receive any SMS or call -based MFA codes.  Malicious actors \nmay also deceive users by sending an email containing a link to a mal icious website that mimics \na companys legitimate login portal. The user submits their username, password, and the 6 -digit \ncode MFA, which the actors then receive to authenticate as the user in the legitimate login \nportal.  \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n5      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \nNote:  For more information on wea k MFA implementation s, see CISAs Fact Sheet s Implementing \nPhishing Resistant MFA  and Implementing Number Matching in MFA Applications . \nMALWARE -BASED PHISHI NG \nDEFINITION  \nIn malware -based phishing attacks, Malicio us actors pose as trustworthy sources (e.g., colleagues, \nacquaintances, or organizations) to lure a victim into interacting with a malicious hyperlink or \nopening an email attachment to execute malware on host system s. \nEXAMPLE TECHNIQUES  \nTo execute malware on host systems,  malicious  actors commonly:  \n Send malicious hyperlinks or attachments that  cause  a user to download malware, facilitat ing \ninitial access , information stealing, damage or disruption to systems or services, and/or the \nescalation of account privileges.  \no Malicious actors may use free, publicly available tools ( such as GoPhish  or Zphisher ) to \nfacilitate spearphishing campaigns where individua l users are targeted with specific and \nconvincing lures.  \no Malicious actors may send malicious attachments with  macro scripts  or messages with \nseemingly benign or obfuscated links that download malicious executables.  \n Use smartphone or tablet apps, along with SMS, to send text messages or chats in collaboration \nplatforms (i.e., Slack, Teams, Signal, WhatsApp, iMessage, and Facebook Messenger ) to lure \nusers into interacting with a malicious hyperlink or attachment that e xecutes malware.  \nNote:  It can be difficult for a user to detect malicious uniform resource locators ( URLs ) on these \nsmall platforms, as they use constrained user interfaces (UI).  \nMITIGATIONS  \nALL ORGANIZATIONS  \nThe mitigations  below align with Cross -Sector Cybersecurity Performance Goals (CPGs) developed for \norganizations by CISA and the National Institute of Standards and Technology (NIST) to help mitigate \nthe most prevalent cyber threats  to organizational networks . Visit CISAs Cross -Sector Cybersecurity \nPerformance Goals  for more information on the CPGs, including additional recommended baseline \nprotections.  \nPROTECTING LOGIN CREDENTIALS  \nCISA, NSA,  FBI, and MS -ISAC  recommend organizations implement the followi ng to reduce the \nlikelihood of successful login credential phishing.  \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n6      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \n Implement user training on social engineering and phishing attacks [ CPG 2.I ]. Regularly educate \nusers on identifying suspicious emails and links, not interacting with  those  suspicious items, and \nthe importance of reporting instances of opening  suspicious emails, links, attachments, or other  \npotential  lures.  \n Enable Domain -based Message Authentication, Reporting, and Conformance (DMARC)  for \nreceived emails.  \no DMARC, along with Sender Policy Framework (SPF) and Domain Keys Identified Mail \n(DKIM), verify the sending server of received emails by checking published rules. If an \nemail fails the check, it is dee med a spoofed email address, and the mail system will \nquarantine and report it as malicious . \no Multiple recipients can be defined for the receipt of DMARC reports.  \no These tools reject any incoming email that has a domain that is being spoofed when a \nDMARC pol icy of reject is enabled.  \n Ensure DMARC is set to reject for sent emails [ CPG 2.M ]. This provides robust protection \nagainst other users receiving emails that impersonate a domain.  \no Spoofed emails are rejected at the mail server prior to delivery.  \no DMARC reports provide a mechanism for notifying the owner of a spoofed domain \nincluding the source of an apparent forger (information they would not receive \notherwise.)  \no Enable DMAR C policies to lower the chance of cyber threat actors crafting emails that \nappear to come from your organizations domain(s).  \no See CISA Insights  Enhance Email and Web Security  and the Center for Internet Security s \n(CISs) page on DMARC , as well as Microsofts Anti -Spoofing guidance for more \ninformation. [1] \n Implement internal mail and messaging monitoring . Monitoring internal mail and mes saging \ntraffic to identify suspicious activity is essential as user s may be phished from outside  the \ntargeted  network or without the knowledge of the  organizational  security team.  Establish a \nbaseline of normal network traffic and  scrutinize any deviations . \n Implement free security tools , such as OpenDNS Home, to prevent cyber threat actors from \nredirecting users to malicious websites to steal their credentials.  For more information see, \nCISAs Free Cybersecurity Services and Tools  webpage.  \n Harden credentials by:  \no Implementing FIDO or PKI -based MFA [ CPG 2.H ]. These forms of MFA ar e phishing \nresistant and resilient against the threats listed in previous sections . If an organization \nthat uses mobile push -notification  based MFA is unable to implement phishing -resistant \nMFA, use number matching to mitigate MFA fatigue. For further information, s ee CISAs \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n7      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \nfact sheets for Implementing Phishing Resistant MFA  and Implementing Number \nMatching in MFA Applications . \no Note:  Deploying PKI -based MFA requires highly mature identity access and management \nprograms and is not widely supported by commonly used services.  \no Prioritizing phishing -resistant MFA for administrator and privileged user accounts , such \nas those with access to e-discovery tools or broad access to customer or financial data . \no Implementing centralize d logins around a Single Sign On (SSO) program . SSO is a user \nlifecycle management mechanism that among other benefits can reduce the chance of \nusers being socially eng ineered to give up their login credentials, especially when paired \nwith MFA or phishing -resistant MFA. SSO provides IT professionals an audit trail to \nexamine, either proactively or retroactively, after a suspected or confirmed security \nbreach.  \n Review MFA lockout and alert settings and track denied (or attempted) MFA logins  [CPG 2.G ]. \no Perform an account lockout when unusual activity or ongoing malicious login attempts  \nare occurring to prevent malicious actors from bypassing MFA.  \no Minimize unnecessary disruptions. This includes prioritizing the health of organizational \nand consumer data, rather than the short -term productivity of a single employee.  A \nsignificant network secu rity incident would not only impact production by many \nemployees, but also resource availability and potentially customer or partner data.  \no Identify and remediate successful phishing attempts . \no Promptly report phishing incidents  (see the Reporting section).  \no Develop a documented incident response plan. For further information, s ee CISAs fact \nsheet on Incident Response Plan Basics . \nPREVENTING MALWARE EX ECUTION  \nCISA, NSA, FBI, and MS -ISAC  recommend organizations implement the following to reduce the \nlikelihood of successful malware execution following phishing attacks.  \n Incorporate denylists at the email gateway and enable firewall rules  to prevent success ful \nmalware deployment.  \n Use denylists to block known malicious domains, URLs, and IP addresses  as well as file \nextensions such as .scr, .exe, .pif, and .cpl and mislabeled file extensions (e.g., a .exe file that is \nlabeled as a .doc file.)  \no State local trib al and territory (SLTT)  entities should enable malicious domain blocking \nand reporting (MDBR), which is a cloud -based solution with recursive domain name \nsystem (DNS) technology that works to prevent users from connecting to malicious \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n8      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \ndomains.  For more information, visit CIS s webpage on Malicious Domain Blocking and \nReporting  (MDBR) . \no For more information on protective phishing filters, refer to Microsoft, MacOS, or Googles \nguida nce on phishing and malware protection .[2],[3],[4],[5] CISA , NSA,  FBI, and MS -ISAC  \nrecommend reaching out to vendors or service providers to learn about what phishing \nfilters and malware protections are available.  \n Restrict  MacOS and Windows users from having  administrative rights  [CPG 2.E ]. \n Implement the principle of least privilege (PoLP) when administering user accounts , and only \nallow designated administrator  accounts to be used for administrative purposes.  \n Implement application allowlists  [CPG 2.Q ], which are security controls that enumerate  \napplication components authorized to be present within a network based on a defined baseline.  \nFor more information, s ee NISTs Application Allowlisting . \n Block macros by default  [CPG 2.N ]. \n Implement remote browser isolation (RBI) solutions  that prevent malware propagation through \nquarantining the malware sample upon user execution. RBI solutions run applications that \nquarantine malware when a user interacts with a mali cious link or binary to prevent further \nspread into the environment. Configure RBI solutions in remote workstations so that any \nmalware is contained within an isolation boundary and cannot access an organizations \nresources.  \n Implement free security tools l ike Quad9 or Google Safe Browsing to identify and stop malware \nupon user execution.  For more information see, CISAs Free Cybersecurity Services and Tools  \nwebpage.  \n Set up a self -serve app store where customers can install approved apps and block apps and \nexecutables from other sources.  \n Implement a free protective DNS resolver to prevent malicious actors from redirecting users to \nmalicious websites to steal t heir credentials. Several services provide free security tools ranging \nfrom personal to professional use cases, such as OpenDNS Home or Cloudflare Zero Trust \nServices . For more information see, CISAs Free Cybersecurity Services and Tools  webpage.  \nFederal  organizations  should see CISAs fact sheet Protective Domain Name System (DNS) \nResolver Service  for information.  \nSMALL - AND MEDIUM -SIZED BUSINESSES (SMBs) OR ORGANIZATIONS  \nCISA, NSA,  FBI, and MS -ISAC recommend that small - and medium -sized organizations  with limited \nresources  prioritize the following best practices  to protect network resources from prevalent phishing \nthreats : \n User phishing awareness training:  Implement a standard anti -phishing training program and  \nrequire employees to review  phishing training material annually . Additionally , conclude  the \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n9      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \nprogram evolution  with a training  check that certif ies that the employee  has retained all the \ninformation outlined  in the training program . \no Small  businesses  are encouraged to implement commer cial phishing awareness training  \nprograms to employees . Additionally, NIST offers free anti-phishing training resources for \nsmall businesses on their Small Business Cyberse curity Corner: Phishing  webpage.  \no The Department of Justice (DOJ) offers Anti-Phishing Training Program Support  to federal \norganizations . \no The Federal Trade Commission (FTC) offers guidance to protect small businesses from  \nphishing threats on their Cybersecurity for Small Businesses: Phishing  webpage.  \n Identify network phishing vulnerabilities : Federal  organizations  are encouraged to participate in \nCISAs Phishing Vulnerability Scanning  assessment service.  \n Enable MFA : Activating a strong MFA is the best way that small businesses can protect  their \ninternet facing business accounts from  phishing related  threats . \no Learn more about why MFA is important for small business to enable by visiting CISAs  \nMore than a Password  MFA webpage. The webpage includes  an MFA hierarchy, which \nhelps users identify the strongest form  of MFA , and ensures users can select the best \nform of MFA based on their operational  needs.  \nAdditionally, CISA, NSA, FBI, and MS -ISAC recommend  SMBs  implement the technical solutions \nbelow to prevent phishing related compromises : \n Implement strong password policies  to authenticate users. These passwords must adhere to a \npassword strength policy which requires minimum character length, numbers, special \ncharacters, and case sensitivity, along with  prohibiting users from recycling  previously used \npasswords.  \n Implement DNS filtering or firewall denylists to block known malicious sites.  \n Implement  anti-virus solutions to mitigate malware and to stop malware from executing if a \nmalicious hyperlink or attachment from an email is opened . \n Implement file restriction  policies  that prevent malicious high risk file extensions  e.g., .exe or .scr \nfrom being downloaded and executed . These types of files are unnecessary  for daily  operations  \nand shoul d be heavily restricted on standard business accounts.  \n Ensure that software applications are set to automatically update  so that network software is \nalways upgraded to the latest version . This helps to prevent malicious actors from exploit ing \nvulnerabilities within  an organizations  network  software . \n Enable safe web browsing policies so that employees can only access websites that are needed \nfor daily business operat ions. These policies also  prevent use rs from visiting malicious websites \nthat o ften contain malware that can  either harvest user credentials or deploy additional malware \nto damage organizational systems.  \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n10      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \n Implement a secure virtual private network (VPN)  with MFA enabled.  \n Reference the Federal Communications Commissions (FCC)  Cybersecurity Planning Guide . The \nguide includes information on ways small businesses can improve their overall cybersecurity \nposture.  \n Consider migrating to managed cloud -based email se rvices from reputable third -party vendors . \nCISA, NSA, and MS -ISAC encourage small businesses with limited resources to seek managed \ncloud email services from trusted third -party vendors.  \no Migrating from on -premises mail systems to trusted third -party cloud -based mail \nproviders is beneficial for customers  because  providers regularly patch and update their \nsystems . Providers also  commonly perform robust email traffic monitoring and anti -\nphishing malware services . \no For more information  on cloud services, see CISAs Secure Cloud Business Applications \n(SCuBA) project . Although tailored to federal organizations , the SCuBA project provides \nguidance and capab ilities applicable to all organizations with cloud business application \nenvironments.  \nSOFTWARE MANUFACTURERS  \nCISA, NSA,  FBI, and MS -ISAC  recommend software manufacture rs incorporate secure -by-design and -\ndefault principles and tactics into their software d evelopment practices , reducing  the susceptibility of \ntheir customers to  phishing attacks.  For more information on secure by design, see CISAs secure by \ndesign  webpage and joint guide  Shifting the Balance of Cybersecurity Risk: Principles and \nApproaches for Security -by-Design and -Default . \nTo m itigate the success of phishing emails reaching users and users interacting with the email , the \nauthoring organizations recommend the following : \n Perform field testing of email software . Implement threat modeling to test the email software \nagainst various deployment scenarios while considering use -cases for organizations ranging from \nsmall to large and configure the software with secure defaults based on the test findings.  \n Provide email software with DMARC  enabled for received emails by default . \n Provide email software with DMAR C configured to reject for sent emails by default . \n Provide email products with internal mail and messaging monitoring mechanisms enabled by \ndefault . Email software manufacturers are encouraged to include automatic email traffic \nmonitoring mechanisms by d efault that automatically scan email traffic for the presence of \nmalicious attachments or URL s within email messages.  \n Mandate MFA for privileged users . Frequently , malicious actors focus their infiltration techniques  \non administrator  accounts . Administrator accounts have elevated privileges and  should be \nprotected by strong MFA by default.  \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n11      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \no Make MFA  an opt-out feature  rather than opt -in; have the system regularly prompt the \nadministrator to enroll in MFA until they have successfully enabled it on their account.  \n Implement SSO for applications via modern open standards . Examples include Security Assertion \nMarkup Language (SAML) or OpenID Connect (OIDC.) Make this  capability available by default at \nno additional cost . \n Consider implementing security  notifications  for the customer when  non-secure configurations \nare used  in email software products . For example,  if administrators are not enrolled in MFA, send \nrepeated security notifications  warning the organization of the present security risks  so that they \nknow to mitigate the risk . \nTo mitigate successful malware execution following phishing attacks : \n Ensure phishing filtering and blocking mechanisms are packaged with email software by default  \nto prevent successful malware deployment.  \n Provide email softw are with limited administrative rights by default . Only allow designated \nadministrator  accounts to be used for administrative purposes.  \n Provide email software with application allowlists by default . \n Provide a self-serve application store where customers ca n install approved applications . Block \napplications and executables from external, unapproved sources that are not permitted via \norganizational policy.  \n Include mechanisms that block macros by default  with email products.  \n Include RBI solutions by default . \nINCIDENT RESPONSE  \nIf an organization identifies compromised credentials and/or successful malware from phishing \nactivity, remediate the activity by:  \n1. Re-provisioning suspected or confirmed compromise d user accounts  to prevent malicious \nactors from maintainin g continued access to the environment.  \n2. Auditing account access following a confirmed phishing incident  to ensure malicious actors \nno longer have access to the initially impacted account.  \n3. Isolating the affected workstation after the detecti on of a phishing attack . This helps stop the \nexecuted malware from spreading further into the organizations network.  \n4. Analyzing the malware . After isolating the affected workstation (s), have the malware \nanalyzed by a team that specializes in malware analysis . \n \nNote:  This step may require outsourcing to expert third -party consultants. After analysis, \nspecialists will know how to safely handle the malware. Learn more by visiting CISAs \nmalwa re analysis services and resources  webpage.  \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n12      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \n5. Eradicating the malware . Eradicate the malware from the network so other workstations \nwithin the organizations networks can no longer be negatively impacted by the executed \nmalware.  \n6. Restore systems to normal ope rations and confirm they are functioning properly . The main \nchallenges at this phase are confirming that remediation has been successful, rebuilding \nsystems, reconnecting networks, as well as correcting misconfigurations.  \nFor more guidance on how to respond to malicious cyber incidents, see CISAs incident response \nplaybook  and Federal Government Cybersecurity Incident and Vulnerability Response Playbook . \nAlthough tailored to feder al organizations , these playbooks provide operational procedures for \nplanning and conducting cybersecurity incident and vulnerability response activities and detail steps \nfor both incident and vulnerability response.  \nREPORTING  \nOrganizations are encouraged to use reporting features that are built into Microsoft Outlook and \nother cloud email platforms, as well as report spam directly to Microsoft , Apple , and Google , as \napplicable. Reporting suspicious phishing  activity is one of the most efficient methods for protecting \norganizations as it helps email service  provider s identify new or trending phishing attacks.  \n CISA urges organizations to promptly report phishing incidents to CISA at report@cisa.gov  or call \nthe 24/7 response line at (888) 282 -0870.  \n To report spoofing or phishing attempts  (or to report that you've been a victim ), file a complaint \nwith the FBIs Internet Crime Complaint Center (IC3) , or contact your local FBI Field Office to \nreport an incident.  \n State, local, tribal, and territorial (SLTT) government entities can report to the Multi -State \nInformation Sharing and Analysis Center (MS -ISAC)  by emailing SOC@cisecurity.org  or calling \n(866) 787-4722 . \nCISA SERVICES  \n Cyber Hygiene  \n Malware Analysis  \n Phishing Vulnerability Scan ning \n Free Cybersecurity Services and Tools  \nMS-ISAC/CIS Services  \n MS-ISAC Membership and Benefits  \n CIS Critical Security Controls  \n Malicious Domain Blocking and Reporting  \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n13      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \n Albert Network Monitoring and Management  \n CIS Endpoint Security Services   \nRESOURCES  \nCISA  \n Cross -Sector Cybersecurity Performanc e Goals  \n Secure by Design | CISA  \n More than a Password | CISA  \n Counter -Phishing Recommendations for Federal Agencies  \n Zero Trust Maturity Model  \n Incident Response Playbook  \n Enhance Email and Web Security  \n Reducing Spam  \n Cyber Smart Phishing Guidance  \n Phishing Security Postcard  \n Phishing Infographic  \n Anti-Phishing Training Program Support | CISA  \nNSA \n Stop the Snowball: Protect Yours elf from Phishing Scams  \nFBI \n Spoofing and Phishing  \nCENTER FOR INTERNET SECURITY  \n How DMARC Advances Email Security  \n A Short Guide for Spottin g Phishing Attempts  \n CIS Blueprint of a Phishing Attack  \nNIST  \n Application allowlisti ng - Glossary | CSRC (nist.gov)  \n Small Business Cybersecurity Corner: Phishing  \n\n TLP:CLEAR  PHISHING GUIDANCE: STOPPING THE ATTACK CYCLE AT PHASE ONE  \n \n \n14      CISA  | NSA | FBI |  MS-ISAC \n  TLP:CLEAR  \nFCC \n Cybersecurity Pla nning Guide  \nFTC \n Protecting Small Businesses: Phishing  \nACKNOWLEDGEMENTS  \nSpamhaus contributed to this guidance.  \nDISCLAIMER  \nThe information in this report is being provided as is for informational purposes only. CISA , NSA, \nFBI, and MS -ISAC  do not endorse any commercial entity, product, company, or service, including any \nentities, products, or services linked within this document. Any reference to specific commercial \nentities, products, processes, or services by service mark, trademark, manu facturer, or otherwise, \ndoes not constitute or imply endorsement, recommendation, or favoring by CISA , NSA,  FBI, or MS -\nISAC.  \nREFERENCES  \n[1] Microsoft: Anti-spoofing protection in EOP  \n[2] Microsoft: Anti-phishing protection in Microsoft 365  \n[3] Microsoft: Exchange Online Protection Overview  \n[4] Google:  Advanced Phishing and Malware Protection  \n[5] Apple: Protect Your Mac from Malware  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-phishing-guidance",
  "source": "nsa",
  "id": "a75e74b669b927f1891619b0a22b47f836dd40d65fcebf9f28ed9df93556d956"
}