{
  "markdown": " \n \n 1 \nU/OO/133081 -18          PP -18-0146          MARCH  2018  \n UNFETTER  \n \n \nMITRE is a registered trademark of The MITRE Corporation \nATT&CK is a trademark of The MITRE Corporation \nf5J~lilONAII SEGlJBlffiM XGEN6M \nGY.BEBSECURIIY INFORM~lilON --, \\~---c;;c~-.-=-- -------- .. \nNet Defenders Meet Threat Analysts. \nFor the first time, we're bringing together Net Defenders and Threat \nAnalysts. Net Defenders need the ability to make operational decisions \nbased off of complex threat data published by Threat Analysts. \nUnfetter is a unique platform that unifies the Net Defender and Threat Analyst \ncommunities, breaking down barriers through seamless data sharing across \nthe enterprise. \nEnabling the real-time exchange of threat data and analytics based on the MITRE \nATT&CK Framework, Unfetter allows organizations to evaluate and implement \ndefensive measures based on effectiveness and value. \nr,------ ~ Ir -o--o--.::. --\n0 \n0 \n -----\nLEARN HORE unfetter.io o ow NL o Ao https://github.com/unfetter-discover/unfetter \n\n \n \n2 U/OO/133081 -18          PP-18-0146          MARCH  2018  \n  \n \n \n \n \nDisclaimer of Warranties and Endorsement \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes.  \n \nContact Information  \nClient Requirements or General Cybersecurity Inquiries \nCybersecurity Requirements Center (CRC), 410- 854-4200, email: Cybersecurity_Requests@nsa.gov  \nShareable, Actionable \nThreat Data \nUnfetter equips Net Defenders and \nThreat Analysts with two powerful \ntools called Analytic Exchange and \nCapabilities Assessment so threat data \nis not only shareable but actionable. \nBuilt for the Community The Analytic Exchange allows Threat Analysts to publish and share \ncomplex cyber threat information with other analysts. The Exchange \nleverages the MITRE ATT&CK  Framework to categonze analytics \nand establish a common baseline for collaborat10n across the entire \ncyber community. \nCapability Assessments allow Net Defenders to leverage complex \nthreat data from the Analytic Exchange to dynamically defend their \nnetworks. Net Defenders can objectively assess defenses. compare \nexisting and future capabilities . and quickly discover analytics to guide \ninvestments and implement mitigations to defend their environments. \nUnfetter is a community-driven suite of open source tools leveraging the MITRE ATT&CK  Framework , shifting \nthe focus from indicators to a threat driven, behavior-based methodology . This allows you to more effectively \nassess your nsk. advance your security posture. and implement mitigations in a systemic, measurable, and \nmeaningful way. \n--:=--_____ ,__ \n-- ... ..._ -~------------------ Octe Unleash the Power \nLearn more about how Unfetter can \ndefend your network by visiting our \nwebsite, or download the platform \non GitHub today. \nLEARN HORE unfetter.io \nDOWNLOAD https://github.com/ \nunfetter-discover/unfetter \nUnfetter isa Cybersecur ity mission at the National Security Agency \n{nsa.govl, \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi-unfetter",
  "source": "nsa",
  "id": "0d7ec7f84bef8ba17bce483cfb9cd61b2bd1f7e609847f663b1b72458f487a56"
}