{
  "markdown": " \nU/OO/  | PP-19-1728  and PP-20-0535  | AUG  2021 Ver 1.1 \nNational Security Agency | Keeping Safe on Social Media  \nKeeping Safe on Social Media  \nSocial media sites and apps  are great ways to connect and share information. User \nprofiles, timelines, social media status, friend lists, and message services grant  your \ncontacts insights into your day -to-day activities. However, these sites can also provide \nadversaries with the critical information they need to disrupt  your life  and harm or \nharass you, your co-workers,  or even your family members .[1] The following guidance \ncan better prepare you to protect against online threats.  \nPracticing good operations security (OPSEC) and using simple countermeasures will \nminimize the risks that come  from using social media and help you protect your critical \ninformation.  The first step in this process is to identify this  critical information.  \nIdentify Critical Information  \nCritical information is any information considered sensitive or that could do harm if \ncompromised . Here are some examples:  \n Names , photos , and relationships   \n Usernames, passwords, computer \nand networking information  \n Operational, security, and logistical \ndata \n Mission capabilities or limitations  \n Job title, location, salary, grade, \nand clearance  \n Schedules , travel itineraries , and \nlocations  \n Social Security  numbers , credit \ncards,  and banking information  \n Work or personal addresses and \nphone numbers  \n Interests, hobbies, likes, and dislikes  \n\n\n \n \n \n \nU/OO/  | PP-19-1728  and PP-20-0535  | AUG  2021 Ver 1.1 \n 2 \nNSA | Keeping Safe on Social Media  \nVulnerabilties and Risks  Whats the Problem?  \nUnauthorized access to data is a growing problem , especially for critical information . \nPeople unwittingly expose private information, privileged work data, medical details, and \ntravel plans. Exposure of this information can lead to monetary loss, identity theft, and \nloss of prope rty. Social media exploit s, such as phishing and malware -embedded \ngames, can lead to account take over, misuse of materials, and escalated access into \nusers private life. Exposed personal information is also used to craft targeted \nspearphishing emails, which can lead a person to unwittingly download  malware or give \naway login credentials. Compromised personal accounts can be used to message \nfriends, family, and work colleagues, further spreading the damage. Understanding the \nrisks a ssociated with your social media presence is key to limiting your overall \nexposure.  \nTo find where you are vulnerable, consider the following countermeasures  and what you \nmight not be doing to protect your information.  Based on these vulnerabilities and the  \npotential consequences described  above, y ou may  realize that you were  unaware of the \nrisks that come with exposure  of your critical information . \nApply Countermeasures  \nAfter identifying critical information, analyzing vulnerabilities, and assessing risk, its \ntime to apply countermeas ures. These countermeasures include practicing good \nsecurity hygiene ; locking down location information, privacy settings, and passwords ; \nand familiarizing yourself with social engineering and misinformation tactics, among \nother things.  \nUpdate immediately and frequen tly review privacy settings  \nAdversaries prefer easy targets. Ensure computing devices, software , and applications \nare updated as soon as patches are available. Review your privacy settings after each \nupdate to en sure they have not reset.  \nProtect your location data  \nUsing a mobile device can potentially expose location data. \nMobile devices inherent ly trust cellular networks and \nproviders, which  receive real -time location data for a mobile \ndevice every time it connects to the network. Apps, even when installed using the \napproved app store, may collect, aggregate, and transmit information that potenti ally What you post on social media, \neven when that information is \nset for private audiences, could \nsomeday become public  \n\n \n \n \n \nU/OO/  | PP-19-1728  and PP-20-0535  | AUG  2021 Ver 1.1 \n 3 \nNSA | Keeping Safe on Social Media  \nexposes a users location. Many apps request location permission and other resources \nthat are not needed to function. Users with OPSEC concerns should be extremely \ncareful about sharing location information on social media. If errors occur in the priv acy \nsettings on social media sites, critical information may be exposed to a wider audience \nthan intended. Pictures posted on social media may be recognizable or have additional \ndata stored in metadata, which may expose a persons location. Tracking featur es can \npotentially allow outside parties to monitor activities for malicious gain. Applications may \nshare location details that may be vulnerable to unauthorized collection.  \nTo mitigate this, disable location services settings on the device/application an d dont \nvoluntarily give your location away by using social media platforms to geo -tag or check -\nin at various public locations. Additionally, apps should be given as few permissions as \npossible, especially social media apps.  \nKnow your friends  \nAdversari es may create duplicate or copycat profiles of current friends, family, or \ncoworkers to get critical information. Fake or impersonated accounts can expose you to \nfraud. Targeted spear -phishing, where adversaries query you for privileged information, \ncan re veal personal information. Verify every friend request you receive to make sure it \nis actually the person you know . Call or meet the person face -to-face to confirm they \nsent the invite. Dont accept invites from people you dont know.  \nLock  down your privacy  settings  \nWhat  you post on social media, even when that information is set for private audiences,  \ncould some day become public  due to  data breaches, poor data management practices, \nor data brokering.  In some cases, a sites terms of service explicitly  claim ownership of \nall posted content.   \nEnable strict privacy settings that block data sharing  between apps . Opt out of saving \nlogin passwords within application settings. Disable all error/debug reports . Review \nprivacy settings quarterly. Failure to set security measures can provide adversaries \naccess to your data.  \nDont post critical information  \nIf you dont want it public, dont post it. Details normally protected from public view can \nbe exposed if you arent cautious.  Internet archives take snapshots o f profiles and store \nthem, which may make  them publicly available  forever : nothing deleted from  the Internet \n\n \n \n \n \nU/OO/  | PP-19-1728  and PP-20-0535  | AUG  2021 Ver 1.1 \n 4 \nNSA | Keeping Safe on Social Media  \nis ever truly removed. Additionally,  refrain from filling out surveys asking personal \nquestions for social media posts. These surveys often ask for  personal information such \nas, Where was your first date with your spouse? This information may be used by \nadversaries to compromise accounts and reset passwords if the information posted \nmatches potential security questions.  \nDont post sensitive, privi leged, or proprietary data in your status messages or timelines. \nWhen selecting who can access your posts, pages, or profiles, limit access to friends -\nonly and avoid allowing full public access to any of your content. Malicious parties can \nalso use picture s and private messages to blackmail you .[2] For social media, gaming, \nand entertainment , use separate machines from the ones you use for banking, credit \ncard services, and medical activities.  \nMinimize pivoting  to home and work networks  \nLeisure activities on social media may seem safe, but may hide malicious compromises  \n(such as by viruses or  ransomware) that allow cyber actors access to or control over \nhome and work networks, including the data stored on those networks. Adversarie s can \nleverage information on your social media accounts or use social media to conduct \nphishing operations to compromise your personal devices. Then, t hey can use that \naccess as a foothold to get further into your network. Avoid connec ting personal \naccounts to work networks and work devices.  \nBe aware of your physical and virtual surroundings  \nAccessing social media applications from open Internet hotspots provided at hotels, \ncafs, and airports may leave devices susceptible for adversaries to physically and \nvirtually spy on activities. Adversaries can also access devices and information if \nBluetooth and Wi -Fi are enabled.  If you need to c onnect to a public wireless hotspot, \nuse a virtual private network ( VPN) to encrypt your web traffic. Dont connect to \nnetworks if youre not familiar with them or cant verify  their authenticity .  \nSecure  and strengthen your password s \nUse unique and strong  passwords for each online account.  Reusing passwords across \nmultiple accounts can expose data from all of the accounts if the password is \ndiscovered.  Make sure that your password is of adequate length and complexity, using \na combination of letters, number s, and special characters. Where possible, implement \nmulti -factor authentication using an authentication token or app so that someone cant \n\n \n \n \n \nU/OO/  | PP-19-1728  and PP-20-0535  | AUG  2021 Ver 1.1 \n 5 \nNSA | Keeping Safe on Social Media  \naccess your account even if your password is compromised. Never share passwords  \nand avoid using information that could be guessed based on  your social media profiles \nor public information . \nMonitor your cyber footprint  \nSearch for yourself online to determine what information about \nyou is already easily available to an adversary. It is critical to \nknow what information can be found by a free, open -source search, as it is likely the \nadversarys first step in reconnaissance. Disallow tagging, as friends may not be as \ndiligent wit h their location settings. Be wary of information posted about you on your \nown profile and the profiles of close friends and family. Photos and information they post \nabout you may reveal your critical information. This includes posting pictures while still  \non vacation or traveling. Dont let those you trust tell the adversaries what they want to \nknow.  \nReport  suspicious a ctivities  \nAdversaries employ phishing techniques to get you to click on a link or download an \nattachment that may contain malicious software (malware). A social media  site that \nlooks legit imate  can hide malicious embedded web links that can secretly redirect users \nto other sites. If you  are unsure of something, navigate directly to the site or use a \nsearch engine instead of clicking the link. Be careful of  web links embedded on a user \npage. Enable anti -spam and anti -phishing security features. Domain checkers can be \nuseful to gauge the origin of the unknown link.  \nIf you see that your account has been compromised, reach out to the site support staff \nimmediately. They should be able to help you get access to your account again. If you \nsee that a friend or family member may be compromised, reach out to them through \nother means and ask them to verify any posts you thin k might be fraudulent. That way, if \ntheyve been compromised, they can take the necessary steps to regain control of their \naccounts. A compromised account can be used to compromise other accounts, so be \naware of friends posting in suspicious ways.  \nRecog nize social engineering tactics  \nThe weakest link in any cyber defense is always going to be the user, and the easiest \nway to get confidential informa tion from someone is to ask for it. This is especially \nprevalent on social media. Be aware of surveys, shar ed posts, or quizzes that ask for Nothing deleted from  \nthe Internet is ever \ntruly removed.  \n\n \n \n \n \nU/OO/  | PP-19-1728  and PP-20-0535  | AUG  2021 Ver 1.1 \n 6 \nNSA | Keeping Safe on Social Media  \npersonal information that could lead to an answer for a security question. For example, \na seemingly innocuous  post may state:  Everyone remembers their first concert! Share \nyours in the comments below!  Since this is a com mon security question, an adversary \ncan use posts like these to collect answers for future malicious attempts . \nAdversaries can also use professional networking sites to try to lure users to click a \nmalicious link, either with an article about a certain ind ustry or a fake job posting. If \nanyone is asking for personal information, be cautious and think who might use that \ninformation and for what purposes.  \nSocial engineers can use inflammatory language with clickbait to get users to go to \nmalicious sites. Be wary of unknown blog sites that ask you for login credentials or have \nyou download something.  \nClose the window into your private life  \nBy identifying cr itical information, learning how it can be used against you, and applying \ncountermeasures to deny access to that information, you make it harder for malicious \nactors to harm or exploit  you. You also  keep yourself, your friends, coworkers, and \nfamily and ev eryones personal data a little bit safer.  \n  \n\n \n \n \n \nU/OO/  | PP-19-1728  and PP-20-0535  | AUG  2021 Ver 1.1 \n 7 \nNSA | Keeping Safe on Social Media  \nWorks cited  \n[1]  A. Holmes. 533 million Facebook users phone numbers and personal data have been leaked online. Business \nInsider, 3 April 2021.  [Online article.] Available: https://www.businessinsider.com/stolen -data-of-533-million -\nfacebook -users -leaked -online -2021 -4  \n[2]  Two Federal Cases Illustrate the Consequences  of Sextortion. Federal Bureau of Investigation, 30 October \n2018. [Online article.] Available: https://www.fbi.gov/new/stories/sentences -in-separate -cyberstal king-cases -\n103018   \nDefense -in-Depth - Compl ementary Cybersecurity Guidance  from \nnsa.gov  \n Mobile Device Best Practices  \n Telework Best Practices  \n Identity Theft Threat and Mitigations  \n Limiting Location Data Exposure  \n Compromised Personal Network \nIndicators and Mitigations   Transition to Multi -factor \nAuthentication  \n Best Practices for Ke eping Your \nHome Network Secure  \n NSAs Top Ten Cybersecurity \nMitigation Strategies  \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or \nguarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise,  does not constitute or imply i ts endorsement, recommenda tion, or favoring by the United \nStates Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed to share operations security guidance and in furtherance of NSAs cybersecurity \nmissions, including its responsibilities to identify and disseminate threats to National Security Systems, Department of \nDefense, and Defense  Industrial Base information systems, to develop and issue cybersecurity specifications and \nmitigations. This informati on may be shared broadly to reach all appropriate stakeholders.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cybersecurity Requirements Center, 410 -854-4200, \nCybersecurity_Requests@nsa .gov \nMedia Inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_keeping_safe_on_social_media_20210806",
  "source": "nsa",
  "id": "9cd32f4d09c4a6f9ea494cfd5949afbb99de6eb23b52603a82973a2a25d9f3b8"
}