{
  "markdown": "  \nThis document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information carries minimal or \nno foreseeable risk of misuse, in accordance with applicable rules and  procedures for public release. Subject to standard copyright \nrules, TLP:CLEAR information may be distributed without restriction. For more information on the Traffic Light Protocol, see  \ncisa.gov/tlp . \nU/OO/ 164464 -23 | PP-23-1426  | JUN 2023 Ver. 1.0 |  Cybersecurity Information  \nCybersecurity  and \nInfrastructure \nSecurity Agency  \nNational  \nSecrity  \nAgency  TLP:CLEAR  \nTLP:CLEAR  Harden  Basebo ard Management Controller s \nSummary  \nBaseboard management controllers (BMCs) are trusted components designed into a computers \nhardware that operate separately from the operating system and firmware to allow for remote \nmanagement and control, even when the system is shut down. This Cybersecurity Information  \nSheet  (CSI), authored by  the National Security Agency ( NSA) and the Cybersec urity and \nInfrastructure Security Agency ( CISA ), highlights threats to BMC s and details  actions \norganizations  can use to harden them . NSA and CISA encourage all organizations managing \nrelevant servers to apply the recommended actions in this CSI.  \nMalicious actors target overlooked firmware  \nA BMC differs from the basic input output system (BIOS)  and the Unified Extensible Firmware \nInterface  (UEFI ), which have a later role in booting a computer, and manageme nt engine (ME), \nwhich has different remote management functionality . BMC firmware is highly privileged, \nexecutes outside the scope of operating system (OS) controls, and has access to all resources \nof the server -class platform on which it resides. It execu tes the moment power is applied to the \nserver. Therefore, boot to a hypervisor or OS is not necessary as the BMC functions even if the \nserver is shutdown.  \nMost BMCs provide network -accessible configuration and management, and BMC management \nsolutions administer large numbers of servers without requiring a physical touch. They  take the \nform of a dedicated circuit chip with discrete firmware that must be maintained separately from \nautomated or OS -hosted patching solutions. Most BMCs do not provide integr ation with user \naccount management solutions. Administrators must perform updates and all administrative \nactions affecting BMCs via commands delivered over network connections.  \nMany organizations fail to take the minimum action to secure and maintain BMC s. Hardened \ncredentials, firmware updates, and network segmentation  options are frequently overlooked , \nleading to a vulnerable BMC . A vulnerable BMC broadens the attack vector by provid ing \nmalicious actors the opportunity to employ tactics such as establish ing a beach head with pre-\nboot execution potential. [1] Additionally,  a malicious actor could disable security solutions such \nas the trusted platform  module (TPM ) or UEFI secure boot, manipulate data on any attached \nstorage media, or propagate implants or disruptive instructions across a network infrastructure. \nTraditional tools and security features including  endpoint detection and response (EDR)  \nsoftware , intrusion detection/ prevention system s (IDS/IPS), anti -malware suites , kernel security \n\n \n \n U/OO/ 164464 -23 | PP-23-1426  | JUN 2023 Ver. 1.0 2 NSA, CISA  | Harden Baseboard Management Controller s TLP:CL EAR  \nTLP:CLEAR  enhancements, virtualization  capabilities , and TPM  attestation are ineffective at mitigating a \ncompromised BMC.  For these reasons, NSA and  CISA recommend orga nizations  pay attention \nto the security of their BMC s and apply  the hardening actions detailed in the following section.  \nRecommended actions  \nThese recommended actions align with the cross-sector cybersecurity performance goals \n(CPGs) CISA and the National  Institute of Standards and Technology (NIST)  developed . The \nCPGs provide a minimum set of practices and protections that CISA and NIST recommend all \norganizations implement. Visit CISAs Cross -Sector Cybersecurity Performance Goals  for more \ninformation on the CPGs, including additional recommended baseline protections.  \n1. Protect  BMC credentials  \nChange the default BMC credentials as soon as possible. Establish unique  user accounts for \nadministrators , if supported. Always use strong passwords compliant with NIST guidelines such \nas SP 800 -63B. [2] Do not expose default credentia ls to an internet connection or untrusted \nsegment of an enclave  [CPG 2.A, 2.B, 2.C, 2.E, 2.L]. \n2. Enforce VLAN separation  \nEstablish a virtual local area netwo rk (VLAN) to isolate BMC network connections  since  many \nBMC products have a dedicated network port not shared with the OS or virtual machine \nmanager ( VMM ). Limit t he endpoints that may communicate with BMC s in the enterprise \ninfrastructure commonly referred to as an Administrative VLAN . Limit or b lock BMC access to \nthe internet. If the BMC requires internet access to update, create rules such that only update -\nsupporting traffic is permitted during the update download  [CPG  2.F, 2.X]. \n3. Harden configuration s \nConsult vendor guides and recommendations for hardening BMC s against unauthorized access \nand persistent threats. UEFI hardening configuration guidance may apply to many BMC settings  \n[CPG 1.E, 2.V, 2.W , 2.X]. [3] \n4. Perform routine BMC update checks  \nBMC updates are delivered separately from most other software and firmware updates. \nEstablish a routine to conduct monthly or quarterly checks for BMC upd ates according to the \nsystem vendors recommendations and scheduled patch releases. Combine BMC update \ninstallations  with routine server maintenance and scheduled downtime when possible. Note that \nsome servers require a restart after BMC updates, while  some can restart  the BMC independent \n\n \n \n U/OO/ 164464 -23 | PP-23-1426  | JUN 2023 Ver. 1.0 3 NSA, CISA  | Harden Baseboard Management Controller s TLP:CL EAR  \nTLP:CLEAR  of the OS or VMM . BMC updates may be provided via the internet, a local executable, an image \nstored on removable media, or network file storage [CPG  1.E]. \nRemember : OS patch maintenance solutions  do not deliver BMC updates . \n5. Monitor BMC integrity  \nSome BMC s report integrity data to a root of trust (RoT). The RoT could take the form of a TPM, \ndedicated security chip or coprocessor (multiple trademarked names in use), or a central \nprocessing unit (CPU)  secure memory enclave. Monitor integrity features for unexpected \nchanges and platform alerts  [CPG 2.T ]. \n6. Move sensitive workloads to hardened devices  \nOlder server and cloud nodes may lack any BMC integrity monitoring  mechanism . The presence \nof a TPM does not guarantee that BMC integrity da ta is collected. Place sensitive workloads on \nhardware designed to audit both the BMC firmware and the platform firmware  [CPG 2.L ]. \n7. Use firmware scanning tools periodically  \nSome modern EDR and platform scanning tools support BMC firmware capture. Establish a \nschedule to collect and inspect BMC firmware for integrity and unexpected changes. Include \nfirmware audits in comprehensive anti -malware scanning tasks.  \n8. Do not ignore BMC s \nA user  may accidentally connect and expos e an ignored and disconnected BMC  to malicious \ncontent. Treat an unused BMC as if it may one day be activated. Apply patches. Harden \ncredentials. Restrict network access. If a BMC cannot be di sabled or removed, carry out \nrecommended actions appropriate to the sensitivity of the platforms data  [CPG 1.E, 2.C, 2.F, \n2.K, 2.W, 2.X]. \nWorks c ited \n[1] Eclypsium Inc. (2022), The iLOBleed Implant: Lights Out Management Like You Wouldnt \nBelieve.  https://eclypsium.com/2022/01/12/the -iloble ed-implant -lights -out-management -like-you-\nwouldnt -believe   \n[2] National Institute of Standards and Technology (NIST) (2020), Special Publication 800 -63B \nDigital Identity Guidelines: Authentication and Lifecycle Management.  \nhttps://pages.nist.gov/800 -63-3/sp800 -63b.html   \n[3] National Security Agency (NSA) (2018), UEFI Defensive Practices  Guidance.  \nhttps://www.nsa.gov/portals/75/documents/what -we-do/cybersecurity/professional -resources/ctr -\nuefi-defensive -practices -guidance.pdf   \n\n \n \n U/OO/ 164464 -23 | PP-23-1426  | JUN 2023 Ver. 1.0 4 NSA, CISA  | Harden Baseboard Management Controller s TLP:CL EAR  \nTLP:CLEAR  Disclaimer of endorsement  \nThe information and opinions contained in this document  are provided \"as is\" and without any warranties or \nguarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or  favoring by the United \nStates Government , and this guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of the authoring agencies  cybersecurity missions, including their \nresponsibilities to identify and disseminate threats and to develop and issue cybersecurity specifications and \nmitigations. This information may be shared broadly to reach all appropriate stakeholders.  \nContact  \nCybersecurity Report Feedback: CybersecurityReports@nsa.gov  \nGeneral Cybersecurity Inquiries: Cybersecurity_Requests@nsa.gov  \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov  \nCISA's 24/7 Operations Center to report incidents and anomalous activity: Report@cisa.gov  or (888) 282 -0870  \nMedia Inquiries / Press Desk:  \n NSA Media Relations: 443 -634-0721, MediaRelations@nsa.gov  \n CISA Media Relations: 703 -235-2010, CISAMedia@cisa.dhs.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_harden_bmcs",
  "source": "nsa",
  "id": "18675e0b67d0d060af223098a167857c3a6a06ee08d5d473ec41ac35242baafc"
}