{
  "markdown": "  \nU/OO/105622 -23 | PP-22-1805  | JAN  2023 Ver. 1.0 \nNational Security Agency | Cybersecurity Information Sheet  \nIPv6 S ecurity Guidance  \nExecutive s ummary  \nNearly all networked devices use the Internet Protocol (IP) for their communications. IP \nversion 6 (IPv6) is the current version of IP and provides advantages over the legacy IP \nversion 4 (IPv4). Most notably, the IPv4 address space is inadequate to support the \nincreasing number of networked devices  requiring routable IP addresses , whereas IPv6 \nprovides a vast address space to meet current an d future needs.  \nWhile some technologies, such as network infrastructure, are more affected  by IPv6 \nthan others, nearly all networked hardware and software are affected in some way  as \nwell. As a result, IPv6 has broad impact on cybersecurity that organizati ons should \naddress with due diligence.  \nIPv6 security issues are quite similar to those from IPv4 . That is, the security methods \nused with IPv4 should typically be applied to IPv6 with adaptations as required to \naddress the differences with IPv6. Security i ssues associated with an IPv6 \nimplementation will generally surface in networks that are new to IPv6, or in early  \nphases of the IPv6 transition.  \nThese networks lack maturity in IPv6 configurations  and network security  tools . More \nimportantly, they lack overall experience by the administrators in the IPv6 protocol. Dual \nstacked networks (that run both IPv4 and  IPv6 simultaneously)  have additional security \nconcerns, so  further countermeasures are needed to mitigate the se risks due to the \nincreased attack surf ace of having both IPv4 and IPv6 . \n  \n\n \n \n \nU/OO/105622 -23 | PP-22-1805  | JAN 2023 Ver. 1.0 2 \nNSA | IPv6 Security Guidance  \nIntroduction  \nFederal and Department of Defense  networks are moving from legacy IPv4 to IPv6 -\nonly. During this transition, IPv4 will continue to be used , and many networks will \noperate dual stack  (running both IPv4 and IPv6 protocols simultaneously)  as an interim \nsolution toward an IPv6 -only end state. However, operating d ual stack increases  \noperational burden and the attack surface . System owners and administrators should \nimplement cybersecurity mechanism s on both IP protocols  to protect the network.  \nThe network architecture and knowledge of those who configure and manage an IPv6 \nimplementation ha ve a big impact on the overall security of the network. As a result, the \nactual security posture of an IPv6 imp lementation can vary . \nIPv6 security concerns and recommendations  \nTo get a good start in implementing IPv6 networks and their potential security concerns, \nNSA recommends the following :  \nAuto -configuration  \nStateless address auto-configuration (SLAAC) is an automatic method to self -assign an \nIPv6 address to a host. In some cases, such as for important servers, static addresses \nmay be preferred, but allowing devices to automatically self -assign or request an IPv6 \naddress dynamic ally is easier in most cases. In SLAAC, a  host configures its own \nnetwork address based on a network prefix received from a router. The assigned IPv6 \naddress incorporates media access control (MAC) address information from the network \ninterface and may all ow for host identification via interface ID, network interface card, or \nhost vendor. This leads to privacy concerns  by linking movements to a specific device \nand deduc ing an individual associated with that equipment , as well as exposing the \ntypes of equipm ent used in a network . \nNSA recommends assign ing addresses to hosts via a Dynamic Host Configuration \nProtocol version 6 (DHCPv6) server to mitigate the SLAAC privacy issue. Alternatively, \nthis issue can also be mitigated by using a randomly generated interf ace ID ( RFC 4941 \n Privacy Extensions for Stateless Address Auto -configuration in IPv6 ) [1] that changes \nover time, making it difficult to correlate activity  while  still allowing network defenders \nrequisite visibility . \n\n \n \n \nU/OO/105622 -23 | PP-22-1805  | JAN 2023 Ver. 1.0 3 \nNSA | IPv6 Security Guidance  \nAutomatic t unnels  \nTunneling is a transition technique t hat allow s one protocol to be transported , or \ntunneled , within another protocol. For example, a tunnel can be used to transport IPv6 \npackets within IPv4 packets. A network might use tunneling for its Internet connection , \nand some devices or apps might be designed to tunnel IPv6 traffic. Some operating \nsystems will automatically establish an IPv6 tunnel when a client connects to a server, \npotentially causing an unwanted entry point to the host.  \nUnless transition tunnels are required, NSA recommends avoiding tunnels  to reduce \ncomplexity and the attack surface. Configure p erimeter security devices to detect and \nblock tunneling protocols that are used as transition methods. In addition, disable \ntunneling protocols (6to4  [2], ISATAP  [3], Teredo  [4], etc.) on all devices  where \npossible . Tunneling  protocols can be allowed if they are required during a transition, but \nthey should be limited to only approved systems  where  their usage is well understood  \nand where they are explicitly configured . \nDual stack \nA dual stack environment exists  when devices r un both IPv4 and IPv6 protocols \nsimultaneously. This is a preferred method for staged IPv6 deployment, but it can be \nmore expensive and tends to increase the attack surface. This approach provides a \ntransition method to IPv6 because it allows devices to us e IPv6 for communications that \nsupport IPv6 while maintaining the ability to use IPv4 for communications that do not \nsupport IPv6. As IPv6 deployments increase, a dual  stack environment will transition to \nIPv6-focused operations by increasing the use of IP v6 and decreasing the use of IPv4.  \nWhen deploying a dual  stack network, organizations should implement IPv6 \ncybersecurity mechanisms that achieve parity with their IPv4 mechanisms or better. For \nany security mechanism implemented for IPv4, a corresponding security mechanism \nshould be implemented  for IPv6, with the IPv6 mechanism addressing any  differences \nfor IPv6. [5] For example, firewall rules that filter higher level protocols (such as TCP or \nUDP) should be applied to both IPv6 and IPv4 protocols . Many modern network security \nmechanisms support both IPv 4 and IPv6, although administrators should verify specific \nproduct compatibility.  Also, other transition mechanisms , such as tunneling and \ntranslation,  should be avoided at this step in the transition strategy  as they add transport \nand cybersecurity comple xities . \n\n \n \n \nU/OO/105622 -23 | PP-22-1805  | JAN 2023 Ver. 1.0 4 \nNSA | IPv6 Security Guidance  \nHost s with multiple IPv6 addresses  \nUnlike IPv4, multiple network addresses are commonly assigned to an interface in IPv6. \nMultiple address es create a wider attack surface th an a single address . Generating \nfiltering rules or access control lists (AC Ls) can be a challenge . It also requires  firewalls \nand intermediate security devices to be aware of all of the addresses in order to be \neffective.  \nTo mitigate th is concern, carefully review ACLs to ensure they deny all traffic by default, \nso only traffic f rom authorized addresses are permitted through the firewalls and other \nsecurity devices. Ensure all traffic is logged, and review the logs on a regular basis to \nensure the allowed traffic matches the organization's policies.  \nIPv6 education  \nA successfully secured IPv6 network requires, at a minimum, a fundamental knowledge \nof the difference s between the IPv4 and IPv6 protocols and how they operate. The lack \nof this knowledge could lead to IPv6 misconfigurations. Misconfigured IPv6 -enabled \ndevices (resulting  from an error in the configuration) could introduce vulnerabilities, \nmaking the devices more prone to compromise.  \nLearning the IPv6 protocol and knowing how to configure IPv6 effectively are the most \ncritical things to protect and enhance IPv6 security o n a network. NSA recommends \nensur ing all network administrators have received the proper training and education to \nadequately administer  IPv6 networks.  \nAdditional c onsiderations  \nWhile there are convincing reasons to transition from IPv4 to IPv6, security i s not the \nmain motivation. Security risks exist in IPv6 and will be encountered, but they should be \nmitigated with a combination of stringent ly applied  configuration guidance and training \nfor system owners and administrators during the transition. In addit ion to the potential \nsecurity issues previously described, what follows is a list of additional considerations to \nsecure IPv6 networks:  \nUse split domain name system (Sp lit DNS)  \nThe Domain Name System (DNS) has been expanded for IPv6 with a new AAAA record \nthat provides IPv6 addresses in addition to the A record that provides IPv4 addresses. \n\n \n \n \nU/OO/105622 -23 | PP-22-1805  | JAN 2023 Ver. 1.0 5 \nNSA | IPv6 Security Guidance  \nTherefore, a dual  stack DNS implementation may need to support both A and AAAA \nrecords. Due to SLAAC and other mechanisms, sensitive information could be included \nin the  AAAA records for internal hosts. Split DNS uses two separate DNS servers \ncreated for the same domain, one for the external network and one for the internal \nnetwork. The goal of split DNS, as opposed to a single DNS, is to increase security and \nprivacy by not inadvertently exposing sensitive information in a DNS record from the \ninternal network to the external network. NSA recommends implementing split DNS, for \nboth IPv4 and IPv6 networks.  \nFilter IPv6 traffic (boundary  protection ) \nIPv6 traffic should be fil tered according to the organization's network policies. A network \nthat has not yet deployed IPv6 should block all IPv6 at the network border, including any \nIPv6 that is tunneled in IPv4. A network that has deployed IPv6 should only allow IPv6 \ntraffic that is permitted by policy , with ACLs allow ing authorized flows and protocols  and \nblocking all others by default.  Although the IPv6 filtering policy may be based on an \nexisting IPv4 policy, the IPv6 policy should reflect IPv6 -specific issues.  In addition, the \nfiltering policy should reflect that Internet Control Message Protocol for IPv6 (ICMPv6)  is \nmore fundamental to IPv6 communications than the corresponding ICMP for IPv4. \nSpecific ICMPv6 messages , such as neighbor discovery and router advertisement , may \nneed to be permitted even if the corresponding message in ICMP for IPv4 is blocked.  [6] \n[7] \nProtect the local link \nIPv6 defines network functions that operate on the local  link. This includes link-layer \naddress resolution, router discovery, and stateless auto -configuration of addresses.  [8] \n[9] Compared to IPv4, local -link operations for IPv6 are more complex and provide more \nattack surface. Therefore, any relevant mitigations (i.e., Router Advertisement (RA) \nGuard [10] [11] to protect against rogue RA messages, Dynamic Host Configuration \nProtocol for IPv6 (DHCPv6) Shield  [12] to protect against rogue DHCPv6 servers) \nprovided by switches and routers should be considered.  \nAvoid network address and protocol translation  \nIPv6-only networks will likely implement translation, such  as NAT64/DNS64 (Network \nAddress Translation between IPv6 hosts and IPv4 servers  synthesizes DNS AAAA \nrecords from A records) or 464XLAT (translation between IPv4 private address es, IPv6 \n\n \n \n \nU/OO/105622 -23 | PP-22-1805  | JAN 2023 Ver. 1.0 6 \nNSA | IPv6 Security Guidance  \naddress es, and IPv4 global address es), to communicate with other netw orks that do not \nyet support IPv6. As dual stack and IPv6 -only deployments increase, translation use will \ndecrease, and eventually, the translation functions will no longer be used and can be \nremoved.  \nOther than using NAT64/DNS64  [13] [14] or 464XLAT [15] for IPv6 -only networks, \naddress translation should generally not be used. In particular, many IPv4 networks use \nNAT, specifically NAT44, to translate between internal and external addresses . On the \nother hand, IPv6 networks should in stead use global addresses on all systems that \nrequire external communications  and non -routable addresses inside the network . If \nunique local addresses [16] are use d on internal systems, any system that requires \nexternal communications should also have a global address.  \nPlan for IPv6 stumbling blocks  \nAs with all network changes, new security issues or variations of existing ones , will arise \nduring the transition to I Pv6. As described  in this cybersecurity information sheet,  \naddressing the issues up front in IPv6 implementation plans, configuration guidance, \nand appropriate training of administrators will aid organizations  to avoid security pitfalls \nduring the transition and to leverage IPv6 benefits properly.  \nWorks c ited \n[1] Narten, T., Draves, R., Krishna S.  (2007) , Privacy Extension for Stateless Address \nAutoconfiguration in IPv6, RFC 4941 . https://datatracker.ietf.org/doc/html/rfc4941  \n[2] Carpenter, B. and Moore, K.  (2001) , Connection of IPv6 Domains via IPv4 Clouds , RFC 3056. \nhttps://datatracker.ietf.org /rfc/rfc3j056.html  \n[3] Templin, F., Gleeson, T., and Thaler, D.  (2008) , Intra -Site Automatic Tunnel Addressing Protocol \n(ISATAP), RFC 5214. https://datatracker.ietf.org/doc/rfc5214  \n[4] Huitema, C.  (2006) , Teredo: Tunneling IPv6 over UDP through Network Address Translations \n(NATs), RFC 4380.  https://datatracker.ietf.org/doc/html/rfc4380  \n[5] National Institute of Standards and Technology (NIST) (2010), SP 800 -119 Guidelines fo r the \nSecure Deployment of IPv6.  \nhttps://nvlpubs.nist.gov/nistpubs/legacy/sp/nistspecialpublication800 -119.pdf  \n[6] Davies, E. and Mohacsi, J.  (2007) , Recommendations for Filtering ICMPv6 Messages in \nFirewalls , RFC 4890. https://datatracker.ietf.org/doc/rfc4890/  \n[7] Chittimaneni, K., Chown, T., Howard, L., Kuarsingh, V., Pouffary, Y., and Vync ke, E.  (2014) , \nEnterprise IPv6 Deployment Guidelines,  RFC 7381.  https://datatracker.ietf.org/doc/rfc7381/  \n[8] Narten, T., Nordmark, E., Simpson, W., and Soliman, H.  (2007) , Neighbor Discovery for IP \nversion 6 (IPv6), RFC 4861.  https://datatracker.ietf.org/doc/rfc4861  \n[9] Thomson, S., Narten, T., and Jinmei, T.  (2007) , IPv6 Stateless Address Autoconfiguration, RFC \n4862.  https://datatracker.ietf.org/doc/rfc4862/  \n[10] Levy -Abegnoli, E., Van de Velde, G., Popoviciu, C., and Mohacsi, J.  (2011) , IPv6 Router \nAdvertisement Guard, RFC 6105.  https://datatracker.ietf.org/doc/html/draft -ietf-v6ops -ra-guard  \n\n \n \n \nU/OO/105622 -23 | PP-22-1805  | JAN 2023 Ver. 1.0 7 \nNSA | IPv6 Security Guidance  \n[11] Gont, F.  (2014) , Implementation Advice for IPv6 Router Advertisement Guard (RA -Guard), RFC \n7113.  https://datatracker.ietf. org/doc/rfc7113  \n[12] Gont, F., Liu, W., and Van de Velde, G.  (2015) , DHCPv6 -Shield: Protecting against Rogue \nDHCPv6 Servers, RFC 7610.  https://datatracker.ietf.org/doc/rfc7610  \n[13] Bagnulo, M., Matthews, P., a nd van Beijnum, I.  (2011) , Stateful NAT64: Network Address and \nProtocol Translation from IPv6 Clients to IPv4 Servers, RFC 6146 . \nhttps://datatracker.ietf.org/doc/rfc6146  \n[14] Bagnulo, M., Sullivan, A., Matthews, P., and van Beijnum, I.  (2011) , DNS64: DNS Extensions for \nNetwork Address Translation from IPv6 Clients to IPv4 Servers, RFC 6147.  \nhttps://datatracker.ietf.org/doc/rfc6146   \n[15] Mawatari, M., Ka washima, M., and Byrne, C., 464XLAT: Combination of Stateful  and Stateless \nTranslation, RFC 6877, 2013.  https://datatracker.ietf.org/doc/rfc6877/  \n[16] Hinden, R. and Haberman, B., Unique Local IPv6 Unica st Addresses, RFC 4193, 2005 . \nhttps://www.rfc -editor.org/rfc/rfc4193  \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or  guarantees. Reference \nherein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does no t \nconstitute or imply its endorsement, recommendation, or favoring by the United States Government, and this  guidance shall not be \nused for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify and \ndisseminate threats to National Security Systems , Department of Defense, and Defense Industrial Base information systems, and to \ndevelop and issue cybersecurity specifications and mitigations. This information may be shared broadly to reach all appropria te \nstakeholders.  \nContact  \nReport Feedback / General  Cybersecurity Inquiries: CybersecurityReports@nsa.gov   \nDefense Industrial Base Inquiries and C ybersecurity Services: DIB_Defense@cyber.nsa.gov  \nMedia I nquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov   \n \n \n \n  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_ipv6_security_guidance_",
  "source": "nsa",
  "id": "d7b1d73704d09b54ba57a71a5ddd5ac6efab79801f1aedef5722b0bced87387b"
}