{
  "markdown": " \nU/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  \nNational Security Agency | Cybersecurity Information Sheet  \nCisco Password Types: Best Practices  \nThree years ago, the Department  of Homeland Security (DHS) released an alert on how \ncyber adversaries obtained hashed password values and other sensitive information \nfrom network infrastructure configuration files. Once the hashe s were obtained, the \nadversaries  were able to compromise network devices . That alert show ed the results of \nwhat happens when cyber adversaries compromise device configurations that have  \ninsecure, reversible hashes: they are able \nto extract sensitive information  and \ncompromise networks  [1]. \nThe rise in the number of compromises of \nnetwork infrastruc tures in recent years  is a \nreminder that  authentication to network \ndevices is a n important consideration . \nNetwork  devices could be compromised due to:  \n Poor password choice (vulnerable to brute force password spraying) , \n Router configuration files (which co ntain hashed passwords) sent via \nunencrypted email , or \n Reused passwords (where passwords recovered from a compromised device \ncan then be used to compromise other devices) . \nUsing passwords by themselves  increases  the risk of device exploitation . While NSA \nstrongly recommends multi -factor authentication for administrators managing \ncritical devices , sometimes passwords alone must  be used.  Choosing  good password \nstorage algorithms can make  exploitation  much more difficult . \nCisco devices  offer a variety of different password  hashing and  encryption schemes to \nsecure passwords stored in configuration files.  Cisco systems come in a variety of  \nplatforms and are widely used within many infrastructure networks worldwide. Cisco \nnetworking devices are configured to propagate network traffic among various subnets . \nThey also protect network information that flows into these subnets. The devices \ncontain a plaintext configuration file that is loaded after the Cisco operating system \nboots. The configuration file:  NSA recom mends using :  \n Multi -factor authentication when \nfeasible  \n Type 8 for passwords  \n Type 6 for VPN keys  \n Strong, unique  passwords  \n Privilege levels for least privilege  \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  2 \nNSA | Cisco Password Types: Best Practices  \n Contains  specific settings that control the behavior of the Cisco device , \n Determines how to direct traffic within a network , and  \n Stores pre -shared keys and user authentication information . \nTo protect this sensitive data, Cisco devices can use hashing or encryption  algorithms \nto secure this information, but only if they are  properly configured to do so.  \nHashing is a one -way algorithm . It produces output that is difficult to reverse back to the \noriginal string. A random salt is often added to a password prior to has hing, making  it \ndifficult to use precomputed hashes to reverse the password. If the salted hash of a \nstrong password (i.e., one that is both long and complex, making it hard for a computer \nto guess) is captured by a malicious actor , that hash should be of little use since the \nactor could not recover the actual password.  \nEncryption is an algorithm that uses a key to produce output that is difficult to reverse \nback to the original plaintext string without a key. The encryption is either symmetric, \nwhich uses the same key for encryption and decryption, or asymmetric, which uses a \npublic key for encryption and a corresponding private key for decryption back to the \noriginal string. Cisco Type 6 passwords, for example, allow for secure, encrypted \nstorage of plaint ext passwords on the device . \nWhen configuration files are not properly protected, Cisco devices that are configured to \nuse a weak password protection algorithm do not adequately secure the credentials. \nThis can lead to compromised devices, and potentially  to compromised entire network s. \nSeverity of the vulnerability  \nHashed or encrypted forms of passwords can be stored in configuration files for \nauthentication purposes to protect the plaintext password. When the configuration file \ndisplays on the Command Lin e Interface , or if it is copied from the device, the user sees \nthe protected form of the password with a number next to it. The number indicates the \ntype of algorithm used to secure the password. The password protection types for Cisco \ndevices are 0, 4, 5,  6, 7, 8, and 9.  \nFor an overview of the Cisco password types, the following table lists them,  their \ndifficulty to crack and recover the plaintext password, their vulnerability severity, and \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  3 \nNSA | Cisco Password Types: Best Practices  \nNSAs recommendations for use. For details on each password type, refer to the \nfollowing sections:  \nTable : Cisco password types  \nPassword type  Ability to crack  Vulnerability severity  NSA recommendation  \nType 0  Immediate  Critical  Do not use \nType 4  Easy  Critical  Do not use \nType 5  Medium  Medium  Not NIST approved , use only when Types 6, \n8, and 9 are not available  \nType 6  Difficult  Low Use only when reversible encryption is \nneeded , or when Type 8 is not available  \nType 7  Immediate  Critical  Do not use \nType 8  Difficult  Low Recommended  \nType 9  Difficult  Low Not NIST approved  \nPassword types  \nType 0  \nDO NOT USE : Passwords  are NOT  encrypted or hashed. They are stored in plaintext \nwithin the configuration file. NSA strongly  recommends against using Type 0 . \nExample  of a Type 0 password shown in a Cisco configuration:  \nusername bob password 0 P@ssw0rd  \nType 4  \nDO NOT USE : Introduced  around 2013 , it uses the Password -Based Key Derivation \nFunction version 2 (PBKDF2)  and was originally added to reduce the vulnerability to \nbrute force attempts. However, due to an implementation issue , the Type 4 algorithm \nonly perform s a single iteration of SHA -256 (without a salt) over the provided plaintext \npassword, making it weaker than Type 5 and less resistant  to brute  force att empt s. The \npasswords are stored as hashes within the configuration file. Type 4 was deprecated \nstarting with Cisco operating systems developed after 2013 . NSA strongly \nrecommends against using Type 4.  \nExample of a Type 4 password shown in a Cisco configuration:  \nusername bob secret 4 g1rTD89b38NIXbGJse.zLc7Cega1TBTlKQNvYDh9Qo6  \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  4 \nNSA | Cisco Password Types: Best Practices  \nType 5  \nNOT NIST APPROVED : Introduced around 1992. It uses a very simple  Message -Digest \n5 (MD5 ) hashing algorithm  - 1,000 iterations of MD5 with a 32 -bit salt. The MD5 \nalgorithm is not NIST a pproved. Type 5 passwords are relatively  easy to brute force \nwith modern computers and tools available on the Internet that make it possible  to find \ncollisions for MD5 hashes.  The passwords are stored as hashes within the configuration \nfile. \nOnly u se Type 5 if the hardware cannot utilize software that support s Type s 6, 8, \nor 9. NSA also recommends upgrading the hardware to support the newer password \nencryption algorithms  and more recent Internetwork Operating System ( IOS) versions \nto take advantage of newer security features.  \nExample of a Type 5 password shown in a Cisco configuration:  \nusername bob  secret 5 $1$w1Jm$bCt7eJNv.CjWPwyfWcobP0  \nType 6  \nUSE ONLY WHEN REVERSIBLE ENCRYPTION IS NEEDED OR WHEN TYPE 8 IS \nNOT AVAILABLE : Type 6 u ses a reversible 128 -bit Advanced Encryption Standard \n(AES) encryption algorithm , meaning that the device can decrypt the protected \npassword into the plaintext password . Type 6 is more secure than Type 7 for cases \nwhere the device needs the plain text password , such as for use as virtual private \nnetwork ( VPN) keys. To use Type 6 or convert existing password types (Type 0 or Type \n7) to Type 6, configure the primary key  with the key config -key password -\nencrypt  command . This  key is not saved in the running configuration file and is used \nto encrypt and decrypt the passwords.  \nThen enable  AES encryption by issuing the \"password encryption aes \" command . \nExisting and newly created plaintext passwords are then stored in Type 6 format in the \nconfiguration f ile. NSA recommends always using Type 6 for VPN keys. Other than \nfor VPN keys, NSA only recommend s using Type 6 for passwords if Type 8 is not \navailable  (which typically implies that T ype 9 is also unavailable) . \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  5 \nNSA | Cisco Password Types: Best Practices  \nExample  of a Type 6 password and VPN pre -shared key shown in a Cisco configuration \nafter converting from Type 0 or 7:  \nusername bob  password 6 fZbe^WdXO`^O[YF`XLCfBV \\BK`hMge]HF  \ncrypto isakmp key 6 FLgBaJHXdYY_AcHZZMgQ_RhTDJXHUBAAB \naddress <ip address>  \nType 7  \nDO NOT USE : Uses  a simple alphabetical substitution Vigenere cipher  with a \nhardcoded publicly known  key. It can be reversed immediately  into plaintext by using \ntools on the Internet . The passwords are stored as encoded string s within the \nconfiguration file . Consider them obfuscated , instead of  encrypted [2]. NSA strongly \nrecommends against using Type 7 . \nExample of a Type 7 password shown in a Cisco configuration:  \nusername bob  password 7 08116C5D1A0E550516  \nType 8  \nRECOMMENDED : Starting  with Cisco operating systems developed after 2013, Type 8 \nis what Type 4 was meant to be. Type 8 passwords are hashed with the Password -\nBased Key Derivation Function version 2 (PBKDF2), SHA -256, an 80-bit salt, and \n20,000 iterations , which makes it more secure in comparison to the previous password \ntypes . The passwords are stored as hashes within the configuration file. Type 8 is less \nresource intensive than Type 9 passwords . No known  issues have bee n found \nregarding Type 8 passwords . NSA recommends using Type 8. \n To enable Type 8 privilege EXEC mode passwords:  \nRouter(config)# enable algorithm -type sha256 secret \n<password>  \n To create a local user account with a Type 8 password:  \nRouter(config) #username bo b algorithm -type sha256 secret \n<password>  \n Example of a Type 8 password shown in a Cisco configuration:  \nusername bob  secret 8 \n$8$kMehFGHe4ew.chRm.d3hge68ECor21viE35NAMV72qPho75fl/lsFlyEFl  \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  6 \nNSA | Cisco Password Types: Best Practices  \nType 9  \nNOT NIST APPROVED : Also  starting with Cisco operating systems developed after \n2013, Type 9 was introduced using the Scrypt hashing algorithm, with an 80 -bit salt, \nand 16384 iterations. Type 9 is designed to make it difficult to crack the password since \nit requires a significant amount of hardware resources to do so, raising the cost for an \nadversary to brute force. The passwords are stored as hashe s within the configuration \nfile. Cisco and industry recommend Type 9 hashes . However, the algorithm has not \nbeen evaluated a gainst NIS T-approved standards and therefore is not recommended by \nNSA nor approved for use on National Security Systems (NSS).  \n To enable Type 9 privilege EXEC mode passwords:  \nRouter(config)#enable algorithm -type scrypt  secret \n<password>  \n To create a local user accou nt with a Type 9 password:  \nRouter(config)#username bob algorithm -type scrypt secret \n<password>  \n Example of a Type 9 password shown in a Cisco configuration:  \nusername bob  secret 9 \n$9$ApsgnGtdkTswkfjucj./4w7dcjhGFsjkdT7mAup2lveHuu25fL.hgvfiq  \nMitigate  password  storage  vulnerabilities  \nFor enterprises utilizing Cisco devices, NSA highly recommends using strong , \napproved  cryptographic algorithms that will protect the password within the \nconfiguration file . Password exposure due to a weak algorithm may allow for elevated \nprivileges, which in turn, can lead to a compromised network. Ciscos Type 8 and Type \n9 hashing algorithms are available on Cisco operating systems developed after 2013. \nNetwork administrat ors should fully use these methods to protect sensitive credentials. \nIf a network device does not support Type 8 and Type 9 password protection, then the \ndevice should be upgraded.  \nUse Type 8 and refrain  from using Type 0 , 4, 5, and  7 \nType 8 should be enab led and used for all Cisco devices running software  developed \nafter 20 13. Devices running software from before 2013 should be upgraded \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  7 \nNSA | Cisco Password Types: Best Practices  \nimmediately. Types  0, 4, 5, and 7 should not be used  on Cisco devices due to weak \nhashing  algorithms  that can result in e xpos ing user credentials . Type 6 passwords \nshould only be used if specific keys need to be encrypted and not hashed , or when \nType 8 is not available ( which typically implies that T ype 9 is also unavailable) . \nUse a strong password for access into privilege EXEC mode  \nTo provide as much protection as possible, use strong passwords  to prevent them  from \nbeing cracked and converted to plaintext . Comply with a password policy that:  \n Consists  of a combination of lowercase and uppercase letters, symbols , and \nnumbers ; \n Is at least 15 alphanumeric characters ; and  \n Patterns that are  not: \n A keyboard walk  \n The same as a user name  \n The default password  \n The same as a password used anywhere else  \n Related to the network, organization, location, or other function identifiers  \n Straight from a dictionary, common acronyms, or easy to guess  \nTo enforce password complexity, the password policy should be edited to implement \ncomplex passwords for each user:  \nRouter(config)# aaa new-model \nRouter(config)# aaa common -criteria policy  policy_n ame \nRouter(config -cc-policy)# char changes  number \nRouter(config -cc-policy)# max-length number \nRouter(config -cc-policy)# min-length number \nRouter(config -cc-policy)# numeric-count number \nRouter(config -cc-policy)# special-case number \nRouter(config -cc-policy)# exit \nRouter(config)# username  user common-criteria -policy \npolicy_name  password  password  \nRouter(config)# exit  \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  8 \nNSA | Cisco Password Types: Best Practices  \nUse privilege levels to restrict access  \nIn larger enterprise networks, the level of privileges within the command line should be \nused  to provide role separation. Cisco devices have 16 privilege levels that range from \n0 to 15. Level 0 access allows only five commands, while level 15 access allows \ncomplete administrative control of the Cisco device. Administrators should customize \nprivile ge levels to restrict executing specific commands. Restricting access to specific \ncommands through privilege EXEC mode can prevent certain users from accessing the \nrunning configuration. Once the privilege level is customized, an encrypted password \ncan be set for that privilege level. To create a new privilege level for a command , do the \nfollowing : \nRouter(config)#privilege_mode level [0 -15] command_string  \nRouter(config)#enable secret level [0 -15] password_string  \nRouter(config)#exit  \nCisco password types best practices summary  \nThe importance of implementing password security for Cisco network devices will \ngreatly decrease the chances of any network being compromised. If one is mindful of \nthe hash and encryption algorithms that are available within Cisco device s, more secure \nconfigurations can be set to prevent password exposure as follows:  \n Use password Type 8.  Do not use Types 0, 4 , and 7. Only use Type 5 when \nTypes 6, 8, and 9 are  not available , and upgrade hardware and software to \nsupport modern hash algorith ms. Use password Type 6 when reversible \nencryption must be used.  \n Use strong password policies to get into privilege EXEC mode.  Along with \nusing strong password hash and encryption algorithms, creating a password that \nis very difficult to guess can prevent a network compromise. A complex password \ncan prevent an unauthorized user from gaining elevated privileges and exposing \nthe configuration file.  \n Use privilege levels. Do not apply level 15 to all user accounts. Provision \nvarious privileged levels to user accounts and commands based on user roles.  \n  \n\n \n \n \n \n U/OO/ 114249 -22 | PP-22-0178  | FEB 2022 Ver. 1.0  9 \nNSA | Cisco Password Types: Best Practices  \nWorks cited  \n[1] Cybersecurity and Infrastructure Security Agency  (2018),  Alert (TA18 -106A) Russian State -\nSponsored Cyber Actors Targeting Network Infrastructure Devices. Available at: \nhttps://www.cisa.gov/uscert/ncas/alerts/TA18 -106A  \n[2] S. Singh, Cisco Systems, Inc. (2020),  Cisco Guide to Harden Cisco IOS Devices. Available at: \nhttps://www.cisco.com/c/en/us/support/docs/ip/access -lists/13608 -21.html  \nRelated works  \n Y. Auda (2020),  Cisco Routers Password Types. Available at: \nhttps://l earningnetwork.cisco.com/s/article/cisco -routers -password -types . \n T. Glen (2021),  Understanding the differences between the  Cisco password \\ secret Types.  \nAvailable at: https://community.cisco.com/t5/networking -documents/understanding -the-\ndifferences -between -the-cisco -password -secret/ta-p/3163238 . \n Router -switch.com  (2020). Six Types of Cisco Password. Available at: https://www.router. -\nswitch.com/faq/six -types -of-cisco -password.html    \n P. Paluch (2013) . When to Use Type -6 Encrypted or Type -7 Encrypted? Available at: \nhttps://community.cisco.com/t5/switching/when -to-use-type-6-encrypted -or-type-7-encrypted/td -\np/2200854 . \nTrademarks  \nCisco and Cisco IOS are registered trademarks of Cisco Systems , Inc.  \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or \nguarante es. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United \nStates Government, and this guidance  shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify \nand disseminate threats to National Security Systems, Departm ent of Defense, and Defense Industrial Base \ninformation systems, and to develop and issue cybersecurity specifications and mitigations. This information may be \nshared broadly to reach all appropriate stakeholders.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cybersecurity Requirements Center, 410 -854-4200, \nCybersecurity_Requests@nsa.gov  \nMedia I nquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov   \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_cisco_password_types_best_practices_20220217",
  "source": "nsa",
  "id": "022e5d9453babfe843a336ecc2e1a4dd8376243e063b8c444f42e4ccc94a3474"
}