{
  "markdown": " \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  \nNational Security Agency | Cybersecurity Information Sheet  \nTLP:CLEAR  \nTLP:CLEAR  Best Practices for Securing Your Home Network  \nExecutive s ummary  \nDon't be a victim ! Malicious  cyber actors may leverage your home network to gain \naccess to personal, private, and confidential information. Help protect yourself, your \nfamily, and your work by practicing cybersecurity -aware  behaviors, observing some \nbasic configuration guidelines , and implementing the following mitigations on your home \nnetwork , including : \n Upgrade and update all equipment and software regularly , including routing \ndevices  \n Exercise secure habits by backing up your data and disconnecting devices when \nconnections are not n eeded  \n Limit administration to the internal network only  \nFigure: Several best practices for securing your home network   \n\n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  2 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR  Recommendations for d evice security  \nElectronic computing devices , including computers, laptops, printers, mobile phones, \ntablets, securi ty cameras, home appliances, cars, and other Internet of Things (IoT) \ndevices must all be secured to reduce the risk of compromise . Most home \nentertainment and utility devices, such as home monitoring systems, baby monitors, IoT \ndevices, smart devices, Blu-ray players, streaming video players, and video game \nconsoles , are capable of accessing the Internet , recording audio, and/or capturing \nvideo. Implementing  security measures can ensure these devices dont become the \nweak link in your home protection.  \nUpgrade to a m odern operating  system and k eep it up-to-date \nThe most recent version of any operating system (OS) contains security features not \nfound in previous versions. Many of these security features are enabled by default and \nhelp prevent common attack vectors. Increase the difficulty for an adversary to gain \nprivileged access by using the latest available and supported OS for desktops, laptops, \nand smart devices. IoT  devices on a  home network are often overlooked , but also \nrequire updates. Enable automatic update functionality when available . If automatic \nupda tes are not possible, download and install patches and updates from a trusted \nvendor on a monthly basis.  \nSecure routing d evices and keep them  up-to-date \nYour Internet Service Provider (ISP) may provide a modem/router as part of your \nservice contract. To ma ximize administrative control over the routing and wireless \nfeatures of your  home network, consider using a personally owned routing device that \nconnects to the ISP -provided modem/router. In addition, use  modern router features to \ncreate a separate wireles s network for guests, for network separation  from your more \ntrusted and private devices .  \nYour router is the gateway into your home network . Without proper security and \npatching , it is more likely to be compromised , which can lead to the compromise of \nother devices on the network  as well . To minimize vulnerabilities and improve security, \nthe routing devices on your home network should be updated to the latest patches , \npreferably through automatic updates . These devices should also be replaced when \nthey reac h end -of-life (EOL) for support. This  ensures that all devices  can continue to \nbe updated and patched as vulnerabilities are discovered.  \n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  3 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR  Implement WPA3 or WPA2 on the wireless network  \nTo keep your wireless communications confidential, ensure your personal or ISP -\nprovided WAP is capable of Wi -Fi Protected Access 3 (WPA3). If you have devices on \nyour network that do not support WPA3, you can select WPA2/3 instead. This allows \nnewer device s to use the more secure method while still allowing older devices to \nconnect to the network over WPA2.  \nWhen configuring WPA3 or WPA2/3, use a strong passphrase with a minimum length of \ntwenty characters. When available, protected management frames should  also be \nenabled for added security. Most computers and mobile devices now support WPA3 or \nWPA2. If you are planning to purchase a new device, ensure it is WPA3 -Personal \ncertified. Change the default service set identifier (SSID) to something unique. Do no t \nhide the SSID as this adds no additional security to the wireless network and may cause \ncompatibility issues.  \nImplement wireless network segmentation  \nLeverage network segmentation on your home network to keep your wireless \ncommunication secure. At a mini mum, your wireless network should be segmented \nbetween your primary Wi -Fi, guest Wi -Fi, and IoT network. This segmentation keeps \nless secure devices from directly communicating with your more secure devices.  \nEmploy firewall capabilities  \nEnsure that your pe rsonally owned routing device supports basic firewall capabilities. \nVerify that it includes network address translation (NAT) to prevent internal systems \nfrom being scanned through the network boundary. Wireless access points (WAP) \ngenerally do not provide  these capabilities so it may be necessary to purchase a router. \nIf your ISP supports IPv6, ensure your router supports IPv6 firewall capabilities.  \nLeverage s ecurity software  \nLeverage security software that provides layered defense via anti -virus, anti -phishing, \nanti-malware, safe browsing, and firewall capabilities. The security suite may be built \ninto the operating system or available to install as a separate product on computers, \nlaptops , and tablets. However, s ome devices , such as home assistants, smart  devices , \nand other IoT devices , may not support installing security suites. Modern endpoint \ndetection and response software use cloud -based reputation services for detecting and \n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  4 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR  preventing execution of malware. Full disk encryption should be implemented where \npossible on laptops, tablets , and mobile phones to prevent data disclosure if that device \nis lost or stolen many mobile devices enable disk encryption by default and security \nsoftware can make it as easy as pushing a button . \nProtect passwords  \nEnsure that passwords and answers to challenge questions are properly protected \nsince they provide access to personal information. Passwords should be strong, unique \nfor each account, and difficult to guess. Passwords and answers to challenge questions \nshould not  be stored in plain text form on the system or anywhere a malicious actor \nmight have access. Using a password manager is highly recommended because it \nallows you to use unique, complex passwords without needing to remember them . \nLimit use of the administra tor account  \nThe highly privileged administrator account can access and potentially overwrite all files \nand configurations on your system. Because it can access more files, malware can \nmore effectively compromise your system if it is executed while you are logged on as an \nadministrator. To prevent this, create a non -privileged user account for normal, \neveryday activities, such as web browsing, email access, and file creation/editing. Only \nuse the privileged account for maintenance, installations, and updat es. \nSafeg uard against e avesdropping  \nBe aware that home assistants and smart devices have microphones and are listening \nto conversations, even when you are not actively engaging with the device. If \ncompromised , the adversary  can eavesdrop on conversation s. Limit sensitive \nconversations when you are near baby monitors, audio recording toys, home assistants , \nand smart devices.  Consider muting their microphones when not in use.  For devices \nwith cameras (e.g., laptops, monitoring devices  and toys)  cover cameras when you are \nnot using them . Disconnect Internet access if a device is not commonly used , but be \nsure to update it when you do use it .  \nExercise secure user habits  \nTo minimize ransomware risks, back  up data on external drives or portable media. \nDisconnect and securely store external storage when not in use. Minimize charging \nmobile devices with computers; use the power adapter instead. Avoid connecting \n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  5 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR  devices to public charging stations. Leave computers  in sleep mode  to enable  \ndownload ing and install ing updates automatically . Regularly reboot computers to  apply \nthe updates . Turn off devices or d isconnect their Internet connections when they will not \nbe used for an extended time, such as when going on vacation . \nLimit administration to the i nternal network  only \nDisable the ability to perform remote administration on the routing device. Only make \nnetwork configuration changes from within your internal network. Disable Universal \nPlug-n-Play (UPnP). These measures help close holes that may enable an attacker t o \ncompromise your network.  \nSchedule f requent device reboot s \nTo minimize the threat of non -persistent malicious code on your personally  owned \ndevice , reboot the device periodically . Malicious implants have been reported to infect \nhome routers without persis tence. At a minimum, you should schedule weekly reboots \nof your routing device, smartphones, and computers. Regular  reboots help to remove \nimplants and ensure security. For more guidance on better protecting your smartphone, \nrefer to the Mobile Device Best Practic es CSI.  \nEnsure confidentiality during t elework  \nThe security of your home  network can directly affect not only your personal \ninformation, but also your work information and networks when teleworking. Using a \nvirtual private network (VPN) to remotely connect to your internal corporate network via \na secure tunnel is one solution for securely accessing work information. This provides \nan added layer of security while allowing you to take advantage of services normally \noffered to on -site users. For more guidance on securing your VPN, refer to the  \nSelecting and Hardening Remote Access VPN Solutions  cybersecurity information \nguidance (CSI).  \nWhen connecting to other work services, such as websites and cloud -based office apps, \nbe sure that it is also through a secure tunnel by checking for a lock icon on the web \nbrowsers address bar. If you utilize commercial collaboration services, choose one that \nprovides strong encryption, preferably end -to-end encryption. For an in -depth look at \nsome commercial collaboration platforms refer to the  Selecting and Safely Using \nCollabora tion Services for Telework  CSI. \n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  6 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR  Recommendations for online behavior  \nSpearphishing, malicious ads, email attachments, and untrusted applications can \npresent concerns for home Internet users. To avoid revealing sensitive information, \nabide by the following guidelines while accessing the Internet.  \nFollow email best practices  \nEmail is a potential attack vector for hackers. The following recommendations help \nreduce exposure to threats:  \n Avoid opening attachments or links from unsolicited emails. Exercise cyber \nhygiene; do not open unknown emails or click on their attachments or web links. \nCheck the identity of the sender via secondary methods (phone call, in -person) \nand delete the email if verification fails. For those emails with embedded links, \nopen a browser a nd navigate to the web site directly by its well -known web \naddress or search for the site using an Internet search engine.  \n To prevent reusing any compromised passwords, use a different password for \neach account. Consider using a password manager to create and remember \nstrong, unique passwords.  \n Avoid using the out-of-office message feature unless it is necessary. Make it \nharder for unknown parties to learn about your activities or status.  \n Always use secure email  protocols, particularly if using a wireless ne twork. \nConfigure your email client to use the transport layer security (TLS) option \n(Secure IMAP or Secure POP3) to encrypt your email in transit between the mail \nserver and your device.  \n Never open emails that make outlandish claims or offers  that are too good to be \ntrue.  \nUpgrade to a modern browser and keep it up -to-date \nModern browsers are much better at prompting users when security features are not \nenabled or used. Modern browsers help protect the confidentiality of sensitive \ninformation in transit ov er the Internet. The browser should be kept up -to-date. When \nconducting activities such as account logins and financial transactions, the browsers \nURL tab indicates that transit security is in place, usually with a lock icon.   \n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  7 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR  Take precautions on s ocial networking sites \nSocial networking sites are a convenient means for sharing personal information with \nfamily and friends. However, this convenience also brings a level of risk. To protect \nyourself, refer to the Keeping Safe on Social Media  CSI guidance  and do the following:  \n Avoid posting information, such as addresses, phone numbers, places of \nemployment, and other personal information, that can be used to target or harass \nyou. Some scam artists use this information, along with pet names, first car make \nor model, and streets you have lived on, to figure out answers to account security \nquestions.  \n Limit access of your information to friend s only and verify any new friend \nrequests outside of social networking.  \n Be cautious of duplicate or copycat profiles of current friends, family, or \ncoworkers. Malicious actors may use impersonated accounts to query you for \nprivileged information or target  you for spear phishing.  \n Review the security policies and settings available from your social network \nprovider quarterly or when the sites Terms of Use  policy changes, as the \ndefaults can change. Opt -out of exposing personal information to search \nengines.  \n Take  precautions concerning unsolicited requests and links . Adversaries may \nattempt to get you to click on a link or download an attachment that may contain \nmalicious software.  \nAuthentication safeguards  \n Enable strong authentication on your router. Protect  your login passwords and \ntake steps to minimize misuse of password recovery options.  \n Disable feature s that allow web sites or programs to remember passwords. Use \na password manager instead.  \n Many online sites use password recovery or challenge questions. T o prevent an \nattacker from leveraging personal information to answer challenge questions, \nconsider providing a false answer to a fact -based question, assuming the \nresponse is unique and memorable.  \n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  8 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR   Use multi -factor authentication (MFA) whenever  possible. Ex amples of multi -\nfactor authentication include secondary confirmation phone/email, security \nquestions, and app/device -based identification. Some forms of MFA, such as \napp/device -based identification , are more secure and should be used over less \nsecure metho ds, such as confirmation phone/email. When available, prefer using \nphishing -resistant MFA  options.  \nExercise caution when accessing  public hotspots  \nMany establishments, such as coffee shops, hotels, and airports, offer wireless hotspots \nor kiosks for customers to access the Internet. Because the underlying infrastructure of \nthese is unknown and security may be  weak, public hotspots are more susceptible to \nmalicious activity. If you must access the Internet while away from home, avoid direct \nuse of public wireless . When possible, u se a corporate or personal Wi -Fi hotspot with \nstrong authentication and encryption . If public access is necessary, refer to Securing \nWireless Devices in Public Settings  CSI for guidance  and do the following:  \n If possible , use the cellular network (that is, mobile Wi -Fi, 4G , or 5G  services) to \nconnect to the Internet instead of public hotspots. This option generally requires \na service plan with a cellular provider.  \n If you must use public Wi -Fi, use a trusted VPN. This opti on can protect your \nconnection from malicious activities and monitoring.  \n Exercise physical security in  the public place. Do  not leave devices unattended.  \nDo n ot exchange home and work content  \nThe exchange of information between home systems and work systems via email or \nremovable media may put work systems at an increased risk of compromise. Ideally, \nuse organization -provided equipment and accounts to conduct work while away from \nthe office. If using a personal device, such as through a Bring Your Own  Device (BYOD)  \nprogram, use corporate -mandated security products and guidance for accessing \ncorporate resources and networks. Try to connect  to a remote desktop or terminal \nserver inside the corporate network rather than make copies of files and transport them \nbetween devices. Avoid using personal accounts and resources for business \ninteractions. Always use a VPN or other secure channel to connect to corporate \nnetworks  and services  to ensure your data is secured through encryption.  \n\n \n \n \nU/OO/ 119184 -23 | PP-23-0270  | FEB 2023 Ver. 1.0  9 \nNSA | Best Practices for Securing Your Home Network  TLP:CLEAR  \nTLP:CLEAR  Use separate devices for different activities  \nEstablish a level of trust based on a devices security features and its usage. Consider \nsegregating tasks by dividing them between devices dedicated to different purposes. \nFor example, one device may be for financial/personally identi fiable information (PII) \nuse and another for gam es or entertainment for children.  \nAdditional guidance  \nNSA cybersecurity guidance :  \n Mobile Device Best Practices  \n Secure Collaboration Plat forms  \n Compromised Personal Network Indicators and Mitigations  \n NSAs Top Ten Cybersecurity Mitigation Strategies  \n Phishing resistant MFA  \n Keeping Safe on Social Media  \n Securing Wireless Devices in Public  \nGeneral topics:  \n National Information Assurance  Partnership  \nStandards:  \n NIST SP 800 -124 Guidelines for Managing the Security of Mobile Devices in the \nEnterprise  \n NIST SP 800 -63 Digital Identity Guidelines  \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guaran tees. Reference \nherein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does no t \nconstitute or imply its endorsement, recommendation, or favoring by the United States Government, and this guidan ce shall not be \nused for advertising or product endorsement purposes.  \nTrademarks  \nBlu-ray is a trademark of Blu -ray Disc Association.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to ident ify and \ndisseminate threats to National Security Systems, Department of Defense, and Defense Industrial Base information systems, and  to \ndevelop and issue cybersecurity specifications and mitigations. This information may be shared broadly to reach all app ropriate \nstakeholders.  \nContact  \nGeneral cybersecurity inquiries: CybersecurityReports@nsa.gov   \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov  \nMedia Inquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_best_practices_for_securing_your_home_network",
  "source": "nsa",
  "id": "6b576886320c5a04354d16d3a83ef3bf58a917187b64f1f975aec99079f30804"
}