{
  "markdown": " \nU/OO/186992 -21 | PP-21-1362  | SEP 2021 Ver. 1.0 | Cybersecurity Information Sheet  \nCybersecurity and \nInfrastructure \nSecurity Agency  \nNational  \nSecurity  \nAgency  \nSelecting and Hardening Remote Access VPN \nSolutions  \nVirtual Private Networks (VPNs) allow users to remotely connect to a corporate network \nvia a secure tunnel. Through this tunnel, users can take advantage of the internal \nservices and protections normally offered to on -site users, such as email/collaboration \ntools, sensitive document repositories, and perimeter firewalls and gateways. Because \nremote access VPN servers are entry point s into protected networks, they are targets \nfor adversaries. This joint NSA -CISA information sheet provides guidance on:  \nSelecting standards -based VPNs from reputable vendors that have a proven \ntrack record of quickly remediating known vulnerabilities and  following best \npractices for using strong authentication credentials.  \n \nHardening the VPN against compromise by reducing the VPN servers  attack \nsurface through:  \n   \nConfiguring strong \ncryptography and \nauthentication  Running only strictly \nnecessary features  Protecting and \nmonitoring access to \nand from the VPN  \n \nActive Exploitation  \nMultiple nation -state  Advanced Persistent Threat  (APT) actors have exploited  public \nCommon Vulnerabilities and Exposures (CVEs) to compromise vulnerable VPN devices \n[1], [2], [3]. In some cases, exploit code is freely available online. Exploitation of these \npublic CVEs can enable a malicious actor to perform:  \n Credential harvesting  \n Remote code execution of arbitrary code on the VPN device  \n\n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  2 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \n Cryptographic weakening of encrypted traffic sessions  \n Hijacking of encrypted traffic sessions  \n Arbitrary reads of sensitive data (e.g., configurations, credentials, keys) from the \ndevice  \nThese effects usually lead to further malicious access through the VP N, resulting in \nlarge -scale compromise of the corporate network or identity infrastructure and \nsometimes of separate services as well.  \nConsiderations for Selecting Remote Access VPNs  \nWhen choosing a remote access VPN, consider these recommendations : \n Avoid selecting non-standard VPN solutions, including a class of products \nreferred to as Secure Sockets Layer/Transport Layer Security (SSL/TLS) VPNs. \nThese products include custom , non -standard  features to tunnel traffic via TLS. \nUsing custom or non -standard fe atures  creates additional risk exposure, even \nwhen the TLS parameters used by the products are secure.  NSA and CISA \nrecommend standardized Internet Key Exchange/Internet Protocol Security \n(IKE/IPsec)  VPNs  that have been validated against standardized secur ity \nrequirements fo r VPNs.  \n Refer to the National Information Assurance Partnership (NIAP) Product \nCompliant List (PCL)  for validated  VPNs (Conformance Claim: \nEP_VPN_GW  or MOD_VPNGW ) [4]. NIAP -certified devices are rigorously \ntested by third -party labs against well-defined security features and \nrequirements. Proprietary protocols may or may not have defined security \nrequirements and may not have been analyzed and tested as much as \nstandards -based protocols.  \n Carefully read vendor documentation to ensure potential  products support \nIKE/IPsec VPNs. Documentation for some products may not provide \ncomprehensive information about the protocols they support when establishing \nVPN tunnels. Avoid products that do not clearly identify the standards they follow \nor claim to us e proprietary methods to establish VPNs.  \n Identify whether the product uses SSL/TLS in a proprietary  or non-standards -\nbased  VPN protocol when unable to establish an IKE/IPsec VPN.  Understand the \ncircumstances that would cause the failure of IKE/IPsec negoti ations. Disable the \nSSL/TLS proprietary or non-standards -based VPN fallback, if possible.  \n\n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  3 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \n Ensure that potential products use FIPS -validated cryptographic modules  and \ncan be configured to use only approved cryptographic algorithms [5]. \n Check that a product supports strong authentication credentials and protocols \nand disables weak credentials and protocols by default. Plan to use multi -factor  \nauthentication and select products that support the credentials to be used [6]. \n Research and select a vendor with a proven track record of supporting products \nvia regular software updates and quickly remediating known vulne rabilities. \nEnsure support timeframes cover the entire expected usage lifetime of the \nproduct; replace the product before it becomes end -of-life. \n Request and validate a products Software Bill of Materials  (SBOM) s o the risk of \nthe underlying software components can be adjudicated [7]. Many vendors use \noutdated versions of open -source software in their products, including many with \nknown vulnerabilities, so this risk is critical to ma nage.  \n Ensure the product has a robust method to validate the integrity of its own code \nand regularly perform code validation. As a security device on a networks \nperimeter, VPN gateways are popular targets for an adversary. Without the ability \nto validate the integrity of a device, it is often impossible to detect intrusions.  \n Ensure the product includes protections against intrusions, such as:  \n Use of signed binaries or firmware images  \n A secure boot process that verifies boot code before it runs  \n Integrity validation of runtime processes and files  \n Understand the risk of not being able to inspect the product on your own. Some \nVPN vendors encrypt the devices in a manner that prevents timely incident \nresponse. Products that do not allow for full inspection of t he device by the \nproduct owner introduce added risk and can result in the manufacturer being a \nproduct support choke point. Delays in the incident response process can allow \nsophisticated actors the time they need to cover their tracks.  \n Review additional f eatures of the prospective device against your organizations \nrisk appetite. While many additional features, such as remotely accessible \nadministrative pages  or web -based access to internal services , can be useful, \nsuch features carry risk because they inc rease the product's attack surface and \nare often targeted and exploited by adversaries. Choose products that focus on \nprotecting the core VPN functionality and do not have many additional features, \norat a minimum ensure that additional features can be dis abled and, \npreferably, are disabled by default.  \n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  4 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \nActive Hardening  \nOnce the selected VPN solution is deployed, the following actions will further \nharden the VPN against compromise.  \nRequire only strong, approved cryptographic protocols, \nalgorithms,  and aut hentication credentials:  \n National Security Systems (NSS) are required to use the \nalgorithms in the NSA -Approved Commercial National Security Algorithm (CNSA) \nSuite (see Annex B of Committee o n National Security Systems Policy (CNSSP) \n15) [8]. Non-NSS U.S. Government systems are required to use the algorithms \nas specifi ed by NIST, which includes the  algorithms approved to protect NSS.  \nNSA and CISA recommend that other systems also use the cryptographic \nalgorithms included in the CNSA Suite .  \n Configure the VPN to use IKE/IPsec and disable SSL/TLS VPN functionality and \nfallback options if feasible.  \n For IKE/IPsec VPNs, CNSSP 15 -compliant c ryptographic algorithms are \nrequired for IKE and Internet Security Association and Key Management \nProtocol (ISAKMP)  for NSS  [9], [10]. CNSSP 15 requirements are \nexplained in the draft IETF document Commercial National Security \nAlgorithm (CNSA) Suite Cryptography for Internet Protocol Security \n(IPsec)  and NIST requirements for other U.S. Government systems are in \nSP 800 -77rev1  [11], [12]. \n If SSL/TLS VPNs must be used, require the remote access VPN to only \nuse strong TLS (i.e., TLS 1.2 or later) and reject all earlier versions of SSL \nand TLS [13]. Other CNSSP 15 requirements for NSS are explained in the \ndraft IETF document Commercial National Security Algorithm (CN SA) \nSuite Profile for TLS and DTLS 1.2 and 1.3  and NIST requirements for \nother U.S. Government systems are in SP 800 -52rev2  [14], [15]. \n For server authentication, use trusted server certificates and update them \nperiodically (e.g., every year). Discourage the use of self -signed and wildcard \ncertificates because they should  not be trusted or are trusted for an overly broad \nscope , respectivel y. \n If available, use client certificate authentication. Some VPN solutions may \nsupport client certificate authentication for remote clients attempting to access \n\n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  5 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \nthe VPN such as by use of a smartcard which is a stronger form of \nauthentication than using pas swords. Whenever  supported, use client certificate \nauthentication so that the VPN prohibits connections from clients that do not \npresent valid, trusted certificates.  \n If client certificate authentication is not available, then use other supported \nforms of m ulti-factor authentication to prevent malicious actors from \nauthenticating with compromised passwords [6].  \nReduce the remote access VPN attack surface:   \n Immediately apply patches and updates to mitigate known \nvulnerabiliti es that are often rapidly exploited (sometimes within \nless than 24 hours) [16], [17]. \n Explicitly follow all vendor patch guidance. For example, if a vendor, as \npart of regular patch guidance, recommends changing all password s that \nare associated with the device, then the organization should be ready to \nchange every single password within their infrastructure, without \nexception.  \n When performing a major update or  updating from a vulnerable version \nthat is known to have been ex ploited, consider:  \n Updating VPN user, administrator, and service account credentials.  \n Revoking and generating new VPN server keys and certificates, \nwhich may require redistributing VPN connection information to \nusers.  \n Reviewing accounts to ensure that all accounts are expected and \nneeded for remote access. Anomalous accounts can indicate a \ncompromise.  \n Restrict external access to the VPN device by port and protocol:  \n For IKE/IPsec VPNs, only allow UDP ports 500 and 4500 and \nEncapsulating Security Payload.  \n For SSL/TLS VPNs, only allow TCP port 443 or other necessary ports and \nprotocols.  \n If possible, allowlist known VPN peer IP addresses and block all others. Note: \nthis may be difficult if it is expected that unknown peer IP addresses will be \naccessing the VPN.  \n\n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  6 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \n Disable non -VPN-related functionality and advanced features that are more likely \nto have vulnerabilities. Features such as web administration, Remote Desktop \nProtocol, Secure Shell, and file sharing are convenient , but not necessary for the \noperation of re mote access VPNs.  \n Restrict management interface access via the VPN. Malicious cyber actors that \nmanage to compromise administrator credentials could try to authenticate into \nmanagement interfaces and maliciously perform privileged operations. Do not \nallow VPN administrators to log into the management interface via the remote \naccess VPN; instead, restrict administrative access to dedicated internal \nmanagement networks. Investigate any attempts to use administrator credentials \nto access the remote access VPN [18]. \nProtect and monitor access to and from the VPN:   \n Deploy an intrusion prevention system in front of the remote \naccess VPN to inspect session negotiations and detect unwanted \nVPN traffic.  \n Use Web Application Firewalls (WAFs). Some WAFs that are compatible with \nTLS VPN traffic may detect and block web application exploitat ion attempts, such \nas specially crafted Hypertext Transfer Protocol (HTTP) requests containing \nmalformed strings that exploit VPN vulnerabilities. Work  with WAF and VPN \nvendors to assess compatibility and deploy WAFs for protection, whenever \nsupported.  \n Enable enhanced web application security. Some remote access VPN solutions \nmay provide features for enhanced web application security to prevent \ncompromis e attempts against the VPN web applications, such as malicious reuse \nof users previous session information to bypass authentication. Enable these \nfeatures whenever supported.  \n Employ appropriate network segmentation and restrictions to limit access , so \nonly services that are needed remotely are accessible via the VPN. U se \nadditional attributes (such as device information, environment of originating \naccess request, strength of credentials, and access path risks) when making \naccess decisions [19], [20]. \n Enable local and remote logging to record and track VPN user activity, including \nauthentication and access attempts, configuration changes, and network traffic \nmetadata. Continuously monitor and conduct analytics on all logs to l ook for \n\n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  7 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \nunauthorized access, malicious configuration changes, anomalous network \ntraffic, and other indicators of compromise [21]. \nSecure the network entrance  \nRemote access VPNs are entryways into corporate networks and all t he sensitive data \nand services they have. This direct access makes them prized targets for malicious \nactors. Keep malicious actors out by s electing a secure , standards -based VPN and \nhardening its attack surface . This is  essential for ensuring a networks c ybersecurity.  \n  \n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  8 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \nWorks c ited \n[1] National Security Agency (2019), Mitigating Recent VPN Vulnerabilities. Available: \nhttps://www.nsa.gov/cybersecurity -guidance  \n[2] National Cyber Security Center, Cybersecurity and Infrastructure Security Agency, Federal \nBureau of Investigation, and National Security Agency (2021), Advisory: Further TTPs associated \nwith SVR cyber actors. Available: https://www.ncsc.gov.uk/files/Advisory Further TTPs associated \nwith SVR cyber actors.pdf  \n[3] National Security Agency (2020), Chinese State -Sponsored Actors Exploit Publicly Kno wn \nVulnerabilities. Available: https://www.nsa.gov/cybersecurity -guidance  \n[4] National Information Assurance Partnership (NIAP) (2021), NIAP Product Compliant List (PCL) . \nAvailable: https://www.niap -ccevs.org/Product/PCL.cfm   \n[5] National Institute of Sta ndards and Technology (2021), Cryptographic Module Validation Program \nCMVP. Available: https://csrc.nist.gov/projects/cryptographic -module -validation -program   \n[6] National Security Agency (2019), Transition to Multi -factor Authentication. Available: \nhttps://www.nsa.gov/cybersecurity -guidance  \n[7] National Telecommunications and Information Administration (2021), Software Bill of Materials. \nAvailable: https://www.ntia.gov/SBOM   \n[8] Committee on National Security Systems (CNSS) (2016), CNSS Policy 15. Available: \nhttps://www.cnss.gov/CNSS/issuances/Policies.cfm   \n[9] National Security Agency (2020), Securing IPsec Virtual Private Networks. Available: \nhttps://www.nsa.gov/cybersecurity -guidance  \n[10] National Security Age ncy (2020), Configuring IPsec Virtual Private Networks. Available: \nhttps://www.nsa.gov/cybersecurity -guidance  \n[11] Corcoran, Jenkins, NSA (2021), Commercial National Security Algorithm (CNSA) Suite \nCryp tography for Internet Protocol Security (IPsec). Available: \nhttps://datatracker.ietf.org/doc/html/draft -corcoran -cnsa -ipsec -profile   \n[12] National Institute for Standards an d Technology (2020), SP 800 -77 Rev. 1: Guide to IPsec VPNs. \nAvailable: https://csrc.nist.gov/publications/detail/sp/800 -77/rev -1/final   \n[13] National Security Agency (2021), Elimina ting Obsolete Transport Layer Security (TLS) Protocol \nConfigurations. Available: https://www.nsa.gov/cybersecurity -guidance   \n[14] Cooley, D, NSA (2021), Commercial National Security Algorithm (CNSA) Sui te Profile for TLS \nand DTLS 1.2 and 1.3. Available: https://datatracker.ietf.org/doc/html/draft -cooley -cnsa -dtls-tls-\nprofile   \n[15] National Institute for Standards and Tech nology (2020), SP 800 -52 Rev. 2: Guidelines for the \nSelection, Configuration, and Use of Transport Layer Security (TLS) Implementations. Available: \nhttps://csrc.nist.gov/public ations/detail/sp/800 -52/rev -2/final   \n[16] National Security Agency (2019), Update and Upgrade Software Immediately. Available: \nhttps://www.nsa.gov/cybersecurity -guidance  \n[17] Cybersecurity and Infrastructure Security Agency (2020), Enterprise VPN Security. Available: \nhttps://us -cert.cisa.gov/ncas/alerts/aa20 -073a   \n[18] National Security Agency (2020), Performing Out -of-Band Network Management. Available: \nhttps://www.nsa.gov/cybersecurity -guidance  \n[19] National Security Agency (2019), Segment Networks and Deploy Application -Aware Defenses. \nAvailable: https://www.nsa.gov/cybersecurity -guidance  \n[20] National Security Agency (2021), Embracing a Zero Trust Security Model. Available: \nhttps://www.nsa.gov/cybersecuri ty-guidance  \n[21] National Security Agency (2019), Continuously Hunt for Network Intrusions. Available: \nhttps://www.nsa.gov/cybersecurity -guidance  \n\n \n \n \nU/OO/186992 -21 | PP-21-1362 |  SEP 2021 Ver. 1.0  9 NSA, CISA  | Selecting and Hardening Remote Access VPN Solutions  \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference \nherein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does no t \nconstitute or imply its endor sement , recommendation , or favoring by the United States Government, and this guidance shall not be \nused for advertising or product endorsement purposes.  \nPurpose  \nNSA and CISA developed this document in furtherance of their respective cybersecurity  missions, including their responsibilities to \ndevelop and issue cybersecurity  specifications and mitigations. This information may be shared broadly to reach all  appropriate \nstakeholders.  \nContact  \nClient Requirements / Inquiries: Cybersecurity Requirements  Center, 410 -854-4200,  Cybersecurity_Requests@nsa.gov  \nMedia Inquiries / Press Desk:  \n NSA Media Relations, 443 -634-0721, MediaRelations@nsa.gov   \n CISA Media R elations, 703 -235-2010, CISAMedia@cisa.dhs.gov   \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_selecting-hardening-remote-access-vpns-20210928",
  "source": "nsa",
  "id": "f906d8e1fa685eb58c7673aa65d34bfefc160f2b519ea614932d28861e8cee59"
}