{
  "markdown": "  \nContact  \nCybersecurity Inquiries: 410 -854-4200, Cybersecurity_Requests@nsa.gov  \nMedia Inquiries: 443 -634-0721, MediaRelations@nsa.gov  \nU/OO/102904 -21 | PP-21-0016  | January 2021 Ver. 1.0  \nNational Security Agency  | Cybersecurity Information  \nAdopting  Encrypted DNS in Enterprise Environments  \nExecutive s ummary  \nUse of the Internet relies on translating domain names (like nsa.gov) to Internet P rotocol  addresses. This is the job of \nthe Dom ain N ame System (DNS) . In the past, DNS lookups were generally unencrypted, since they have to be handled \nby the network to direct traffic to the right locations. DNS  over Hypertext Transfer Protocol over Transport Lay er Security \n(HTTPS), often referred to as DNS over HTTPS ( DoH), encrypts DNS requests by using HTTPS to provide privacy, \nintegrity, and last mile source authentication  with a clients DNS resolver . It is useful to prevent eavesdropping and \nmanipulation  of DNS  traffic . While DoH can help protect  the privacy of DNS requests and the integrity of responses, \nenterprises that use DoH will lose some of the control needed to govern DNS usage within their networks  unless they \nallow only their chosen DoH resolver to be used.  Enterprise DNS controls  can prevent numerous threat techniques used \nby cyber threat actors for initial access , command and control, and exfiltration . \nUsing DoH with external resolvers can be good for home or mobile users and networks that do no t use DNS security \ncontrols. For enterprise networks, however, NSA recommends using only designated enterprise DNS resolvers  in order to \nproperly leverage essential  enterprise cybersecurity defenses , facilitate access to local network resources, and protec t \ninternal network information. The enterprise DNS resolver may be either an enterprise -operated DNS server or an \nexternally hosted  service. Either way, the enterprise resolver should support encrypted DNS requests, such as DoH, for \nlocal privacy and integ rity protections, but  all other encrypted DNS  resolvers should be disabled  and blocked. However , if \nthe enterprise DNS resolver does not support DoH, the enterprise DNS resolver  should still be used and all encrypted \nDNS  should be disabled and blocked until encrypted DNS capabilities can be fully integrated into the enterprise DNS \ninfrastructure.  \nThis guidance explains the purpose behind the DoH design and the importance of configuring enterprise networks \nappropriately to add benefits to, but not hinder, th eir DNS security controls. The following recommendations will assist \nenterprise network owners and administrators to balance DNS privacy and governance.   \n\n \n \n U/OO/102904 -21 | PP-21-0016  | January 2021 Ver. 1.0  2 \nNSA | Adopting  Encrypted DNS in Enterprise Environments  \nWhat is DoH ? \nDom ain N ame System (DNS) over Hypertext Transfer Protocol over Transport Layer S ecurity (HTTPS), often referred to \nas DNS over HTTPS ( DoH), encrypts DNS requests to provide privacy, integrity, and last mile source authentication for \nDNS transactions with a clients DNS resolver . It is useful to prevent eavesdropping and manipulation  of DNS  traffic  \n(T1040, T1565.002 ).1 While DoH can help protect  the privacy of DNS requests and the integrity of responses, enterprises \nthat use DoH will lose some of the control needed to govern DNS usage within their networks  unless they allow only their  \ndesignated DoH resolver to be used. These essential protective DNS controls can prevent numerous threat techniques \nused for initial access , command and control, and exfiltration , such as phish ing links to malicious domains, connections \nusing dynamic name resolution , and commands hidden in DNS traffic (TA0001 , TA0011, TA0010, T1566.002 , T1568 , \nT1071.004 ). The enterprise DoH resolver may be either an enterprise -operated DNS server or an external resolver from a \nprotective DNS provider. However, if the enterprise DNS resolver does not support DoH, the enterprise resolver  should \nstill be used and all encrypted DNS  should be disabled and blocked until encrypted DNS capabilities can be fully \nintegrated into the enterprise DNS infrastructure.  \nHow do DNS and DoH work?  \nDNS  translates domain name s to the ir corresponding  Internet Protocol (IP)  addresses , allowing web users to more easily \naccess websites. With traditional enterprise DNS architectures, once a client submits a DNS query, it will first go to the \nenterprise recursive DNS resolver , often assigned via Dynamic  Host Configuration  Protocol  (DHCP). The enterprise DNS \nresolver will either return the answered query from its cache or forward the query through the enterprise gateway to the \nexternal authoritative  DNS servers. The DNS response will return through the enterprise gateway, to the enterprise DNS \nresolver , and then finally to the client. During this exchange, both the enterprise DNS resolver  and the enterprise gateway \ncan see the plaintext query and res ponse and log it for analysis or block it if it seems malicious or violates enterprise \npolicies.  \n \nFigure 1: How common enterprise DNS architectures work  \n1. The user wants to visit a website they do not know is malicious  and types the domain name  into the web browser.  \n2. The request for the domain name  is sent to the enterprise DNS resolver with a plaintext packet on port 53. Queries that violate DNS monitoring policies \nmay generate alerts and/or be blocked . \n                                            \n1 T1040 and similar notations identify MITRE ATT&CK techniques and tactics. MITRE ATT&CK is a registered trademark of The MITRE Corporation. \n\n\n \n \n U/OO/102904 -21 | PP-21-0016  | January 2021 Ver. 1.0  3 \nNSA | Adopting  Encrypted DNS in Enterprise Environments  \n3. If the IP address for the domain  is not in the enterprise DNS resolvers cache of domains and the domain is not filtered, it will send a DNS query through \nthe enterprise gateway.  \n4. The enterprise gateway forwards the plaintext DNS request to an e xternal DNS server . It also blocks DNS requests not from the enterprise DNS resolver.  \n5. The response to the query with the IP address of the domain , the address of another DNS server with more information, or an error is returned in plaintext \nback through the enterprise gateway.  \n6. The enterprise gateway forwards the response back to the enterprise DNS resolver. Steps 3 -6 repeat until either the IP address for the requested domain \nname is found or there is an error.  \n7. The DNS resolver returns the response back to the users web browser, which then requests the webpage from the IP address in the response.  \nThe DNS resolver to query can be configured in the operating system (OS) or sometimes in a specific  application , such as  \na web browser. When a client has  DoH enabled and configured to use a DoH resolver not designated  by the enterprise, \nthe DoH traffic will be sent directly to the enterprise gateway as HTTPS encrypted traffic over port 443, bypassing the \nenterprise DNS resolver entirely. The request will then go to the client -selected  DoH resolver, which will either return the \nresponse or pass it along to the authoritative servers to resolve the request. The answered query returns from the DoH \nresolver through the enterprise  gateway back to the client over port 443. The transaction between the client and DoH \nresolver is encrypted, therefore the plaintext request and response  usually cannot be analyzed by the enterprise gateway. \nIf the DoH resolver cannot answer the query, or is inaccessible, the original query may be re -sent using traditional DNS.  \n \nFigure 2: How DoH with an external DoH resolver works  \n1. The user wants to visit an unauthorized website , and types the domain  into the web browser.  \n2. The DoH request is encrypted and sent t hrough  the enterprise gateway over port 443. The enterprise DNS resolver  is bypassed , therefore circumventing  its \nblocking and monitoring capabilities.  \n3. The enterprise gateway forward s the encrypted request to the external DoH  resolver , just like it would forward any other HTTPS request to an external \nserver . Logging and visibility at the enterprise gateway is usually not possible.  \n4. The external DoH resolver performs DNS resolution and responds to the query with the IP address of the site . \n5. The enterprise gateway forwards the encrypted DoH response back to the user s web browser, which then requests the webpage from the IP address in the \nresponse .  \nIn addition to DoH, there are  other protocols that  encrypt  DNS communication with a DNS resolver . DNS over Transport \nLayer Security (DoT), is another implementation  that encrypts DNS transactions. Instead of using HTTPS over port 443, \nDoT uses T ransport Layer Security (TLS)  over port 853, so it is easier to detect than DoH. Oblivious DoH (ODoH) is \nanother protocol that adds a proxy layer to DoH requests for additional privacy protection. The majority of the issues and \nmitigations that apply to Do H also apply to DoT and ODoH , but are no t covered in this guidance.  \nWhat are the benefits of using DoH?  \nDoH protects DNS traffic between a client and a DNS resolver from unauthorized access to its information by cyber threat \nactors. Since the traffic is encrypted and blends in with other HTTPS t raffic to websites, it is difficult for cyber threat actors \nto determine which packets contain DNS requests or responses and see which domains and IP addresses were \n\n\n \n \n U/OO/102904 -21 | PP-21-0016  | January 2021 Ver. 1.0  4 \nNSA | Adopting  Encrypted DNS in Enterprise Environments  \nrequested. The responses from the DNS resolver are also authenticated and protected from un authorized modification. In \ncontrast, traditional DNS transactions occur in plaintext on a port that is exclusively used for DNS, so cyber threat actors \ncan easily read and modify the traditional DNS traffic.  \nWhat are the issues with using DoH?  \nDoH provid es the benefit of encrypted DNS transactions, but it can also bring issues to enterprises , including  a false \nsense of security, bypassing of DNS monitoring and protections, concerns for internal network configurations and \ninformation , and exploitation of upstream DNS traffic . In some cases, individual client applications may enable DoH using \nexternal resolvers, causing some of these issues automatically.  \nA false sense of security  \nDoH is not a panacea. DoH does not guarantee protection from cyber threat act ors and their ability to see where a client \nis going on the web. DoH is specifically designed to encrypt only the DNS transaction between the client and resolver, not \nany other traffic that happens after the query is satisfied. While this  allows clients to  privately obtain an IP address based \non a domain name, there are other ways cyber threat actors can determine information without reading the DNS request \ndirectly, such as monitoring the connection a client makes after the DNS request. That connection w ill still have the \ndestination IP address unencrypted and may reveal the domain or server name. This and other traffic analysis techniques \ncould identify domains [1, 2]. If there is a concern that a users activity is being tracked and they must conceal thei r \nactivity, DoH alone will  not fully address the problem . \nBypassing DNS monitoring and protections  \nEnterprises may use network monitoring tools to inspect DNS traffic and look for indications of anomalous activity. Many \ntools typically inspect plaintext DNS traffic. DoH encrypts the DNS traffic, which prevents enterprises from monitoring DNS \nwith these network -based tools unless they are breaking and inspecting TLS traffic. If DoH is used with the enterprise \nresolver, then i nspection can still occur at th e resolver or us ing resolver logs . However, if external DoH resolvers are not \nblocked and DoH is enabled on the users browser or OS to use a different resolver, there could be issues gaining \nvisibility into that encrypted DNS traffic.  \nMany organizations u se enterprise DNS resolvers or specific external DNS providers  as a key element in the overall \nnetwork security architecture. These protective DNS services may filter domains and IP addresses based on known \nmalicious domains, restricted content categories,  reputation information, typosquatting protections, advanced analysis, \nDNS Security Extensions (DNSSEC) validation,  or other reasons.2 When DoH is used with external DoH resolvers and the \nenterprise DNS service is bypassed, the organization s devices can l ose these important defenses. This also prevents \nlocal-level DNS caching and the performance improvements it can bring.  \nMalware can also leverage DoH to perform DNS lookups that bypass enterprise DNS resolver s and network monitoring \ntools, often for comman d and control or exfiltration purposes ( T1071.001, T1071.004, T1568 , T1573, and T1572 ) [3]. \nConcerns for i nternal network configurations and information  \nIf a device or application is configured to use an external DoH resolver and connects to an enterprise network, it will \nignore the address of the DNS resolver  assigned to it through the DHCP  and connect straight to its preferred DoH \nresolver. This is a security concern because if a client is trying to connect to an internal domain, the query will be sent t o \nthe external DoH resolver first before failing over to the enterprise DNS resolver , which can spill internal network \ninformation to a third party. In addition, if an enterprise uses a split DNS configuration where the same domain name is \nresolved to diffe rent addresses depending on whether the client is within the enterprise network, an internal client using \nan external DoH resolver will receive the address intended for external clients instead. This may cause internal enterprise \nservices to be inaccessibl e, confuse the user, or cause other issues [ 4]. \n                                            \n2 Recommendations on protective DNS will be discussed in an upcoming NSA guidance document.  \n\n \n \n U/OO/102904 -21 | PP-21-0016  | January 2021 Ver. 1.0  5 \nNSA | Adopting  Encrypted DNS in Enterprise Environments  \nExploitation of upstream DNS traffic  \nTypically, DoH occurs only in the last mile between the client system initiating the DNS request and the DoH resolver the \nclient is configured to use. DoH requests and responses are protected from modification and other cyber threat activities \nbetween the resolver and client. DNS traffic for the rest of the DNS process, such as between the DoH resolver and the \ntop-level root DNS servers on the i nternet, often do not use DoH and are not encrypted. For parts of the DNS process that \nare not encrypted, cyber threat actors could still passively view the plaintext DNS traffic or try to redirect the traffic to  \nmalicious DNS servers, just as with any traditional DNS traffic. Even  with DoH protection, resolvers that communicate with \nmalicious servers upstream could still be susceptible to DNS cache poisoning techniques. DNSSEC should be used to \nprotect the upstream responses, but the DoH resolver may not validate DNSSEC. Enterprise s that do not realize which \nparts of the DNS process are vulnerable could fall into a false sense of security [5].  \nMitigating DoH issues  \nFor home, mobile, and teleworking users without enterprise DNS controls, DoH can be a good way to protect the \nconfiden tiality and integrity of DNS traffic. There are even several reputable DNS resolvers that are free for public use that \nprovide additional protections, such as malicious site blocking, family -oriented filters, and DNSSEC validation. For \nenterprises, NSA rec ommends that the enterprise DNS resolver supports encrypted DNS, such as DoH, and that only that \nresolver be used in order to have the best DNS protections and visibility. If protective DNS capabilities are provided by an \nexternal source, then encrypted DN S should be allowed for that specific resolver and all others should be blocked. \nHowever, if the enterprise DNS service provides DNS protections, but does not support encrypted DNS, then there has to \nbe a tradeoff. In this case, the loss of enterprise secu rity controls outweighs the protections offered by DoH, so NSA \nrecommends that enterprises disable encrypted DNS within their network and continue to use only the enterprise DNS \nservice.3 \nOnly use the enterprise DNS resolver and disable all others  \nIf an enterprise wants to use DoH, ensure that the DoH clients  only send queries  to the enterprise DNS resolver .  Disable \nand block all other DoH resolvers.  To disable all other DoH on an enterprise network, configure network security devices \nat the enterprise gat eway to block known DoH resolvers so hosts cannot circumvent DNS security controls and cyber \nthreat actors cannot easily use it to hide their actions. There are several public lists of known DoH resolver domain names \nand IP addresses. In addition, disable DoT by blocking transmission control protocol port 853 at the enterprise gateway. \nFor web browsers, applications, and operating systems  that support DoH, especially the ones that may enable it \nautomatically, disable it in standard configurations and set ca nary domains so that DoH is automatically disabled. For \nexample, Firefox4 and Chrome5 automatically disable DoH if ent erprise policies are configured.  Enterprise policies can \nalso be used to configure DoH to use the enterprise DoH resolver  [79]. \nBlock u nauthorized DoH resolvers and traffic  \nEnterprise administrators  should understand the limitations of DHCP for devices connecting to their network. If clients use \ntheir own default DoH resolver, the clients will attempt to send DoH requests to that resolver  first before the DNS resolver  \nfrom the DHCP configuration is used. An enterprise that chooses to disable DoH should block known DoH resolver IP \naddresses and domains, so devices on the network will fail to resolve a domain name using DoH and usually  rever t back \nto traditional DNS, going through the DNS resolver  assigned by DHCP.  \nEnterprises may monitor encrypted network traffic using TLS inspection. These enterprises should apply signatures in the \ndevices that break and inspect the TLS traffic to block unauthorized DoH requests. Note that the TLS inspection devices \nmust be able to properly decrypt and interpret DoH requests for this to be effective since the decrypted DNS requests \nwould not come over port 53 like traditional DNS  requests . \n                                            \n3 This recommendation i s consistent with the DHS requirement for federal networks to only use approved DNS resolvers [6].  \n4 Firefox is a registered trademark of Mozilla Foundation.  \n5 Chrome is a registered trademark of Google LLC.  \n\n \n \n U/OO/102904 -21 | PP-21-0016  | January 2021 Ver. 1.0  6 \nNSA | Adopting  Encrypted DNS in Enterprise Environments  \n \nFigure 3: NSA recommended  enterprise DNS architecture  with DoH  \n1. The user wants to visit a compromised web site  and types the domain  into the web browser.  The enterprise configuration on the client configures DoH for \nthe enterprise DNS resolver  or disables DoH.  \n2. The DoH request for the domain  is encrypted and sent to the enterprise DNS resolver  over port 443. The resolver  blocks queries that violate DNS \nmonitoring policies and known malicious  domains, possibly generating alerts. It responds with  an error for the canary domain, signaling to disable all other \nDoH that has not been properly configured  by the enterprise . The resolver also logs  requests and responses.   \n3. If the IP address for the domain  is not in the enterprise DNS resolver s cache and the domain is not filtered, it will send a DNS query through the enterprise \ngateway.  \n4. The enterprise gateway forwards the plaintext DNS request to an external DNS server . It also blocks DNS, DoH, and DoT r equests to external resolvers \nand DNS servers that are not from the enterprise resolver.  \n5. The response to the query with the IP address is returned over plaintext back through the enterprise gateway.  \n6. The enterprise gateway forwards the response back to the enterprise DNS resolver .  \n7. The DNS resolver  validates the DNSSEC information in the response and then returns it as a n encrypted  DoH response back to the users web browser, \nwhich then requests the webpag e from the IP address in the response.  \nUtilize host and device DNS logs  \nEnterprises that want to enable DoH should not rely solely on network monitoring tools to inspect DNS traffic. DNS \nlogging on all network devices and hosts can increase the network vi sibility that is lost with less DNS network monitoring \ncapability. Supplement DNS protection with threat reputation services on a firewall or through an intrusion detection \nsystem to help keep up with increasing and changing malicious domains and block kno wn bad traffic.6  \nConsider a VPN for additional privacy protection  \nEnterprises  that are concerned with passive surveillance may use virtual private networks (VPN) or proxies to keep their \ntraffic more private, especially in mobile and teleworking environme nts. Enterprises that decide to use DoH should avoid \nusing obsolete TLS. Only use current TLS versions to protect against issues in the underlying HTTPS [ 11]. \nValidate DNSSEC and use protective DNS capabilities  \nEnterprises must understand which parts of th e DNS process are DoH -protected and account for the unprotected parts \nand other vulnerabilities. DoH is independent from, but compatible with DNSSEC. E nsure that the enterprise DNS \nresolver validates DNSSEC  to authenticate traffic from other DNS servers. P rotective DNS capabilities are an essential \n                                            \n6 For more information on threat reputation serv ices, please refer to Integrate Threat Reputation Services on nsa.gov [10].  \n\n\n \n \n U/OO/102904 -21 | PP-21-0016  | January 2021 Ver. 1.0  7 \nNSA | Adopting  Encrypted DNS in Enterprise Environments  \npart of network defense. When using an external resolver, ensure that the DoH resolver chosen by the enterprise has a \nreputation for security and reliability.  \nBalance found: a better sense of security  \nDoH provides privacy benefits for users, but can present issues to enterprises wanting to achieve governance and DNS \ntraffic monitoring. Enterprises can implement DoH on their DNS service to gain both the benefits of DoH and best practice \nDNS protections. Howe ver, enterprises that allow DoH without a strategic and thorough approach can end up interfering \nwith network monitoring tools, preventing them from detecting malicious threat activity inside the network, and allowing \ncyber threat actors and malware to byp ass the designated enterprise DNS resolvers.  \nWorks cited \n[1]  Sandra Siby, Marc Juarez, Claudia Diaz, Narseo Vallina -Rodriguez, and Carmela Troncoso (2020), Encrypted DNS => Privacy? A Traffic Analysis \nPerspective. Available at: https://www.ndss -symposium.org/wp -content/uploads/2020/02/24301 -paper.pdf  \n[2]  Bert Hubert (2019), Centralised DoH is bad for Privacy, in 2019 and beyond. Available at: https://labs.ripe.net/Members/bert_hubert/centralised -\ndoh-is-bad-for-privacy -in-2019 -and-beyond  \n[3]  New Jersey Cybersecurity & Communications Integration Cell (2019),  Godlua  NJCCIC Threat Profile. Available at: \nhttps://www.cyber.nj.gov/threat -center/threat -profiles/trojan -variants/godlua  \n[4]  The Implications of DNS over HTTPS and DNS over TLS. Available at: https://icann.org/en/system/files/files/sac -109-en.pdf  \n[5]  National Security Agency (2019), Defending Your DNS Infras tructure. Available at: https://www.nsa.gov/cybersecurity -guidance  \n[6]  Cybersecurity & Infrastructure Security Agency (2020), Addressing Domain Name System Resolution on Federal Networks. Availabl e at: \nhttps://www.cisa.gov/sites/default/files/publications/Addressing_DNS_Resolution_on_Federal_Networks_Memo.pdf  \n[7]  Mozilla Cor poration (2020), Firefox DNS -over-HTTPS. Available at: https://support.mozilla.org/en -US/kb/firefox -dns-over-https  \n[8]  Google LLC (2020), A safer and more private browsing experie nce with Secure DNS. Available at: https://blog.chromium.org/2020/05/a -safer -and-\nmore -private -browsing -DoH.html   \n[9]  Mozilla Corporation (2020), Canary domain - use-application -dns.net. Available at: https://support.mozilla.org/en -US/kb/canary -domain -use-\napplication -dnsnet  \n[10]  National Security Agency (2019), Integrate Threa t Reputation Services. Available at:  https://www.nsa.gov/cybersecurity -guidance  \n[11]  National Security Agency (2020), Eliminating Obsolete TLS Protocol Configurations. Available at: https://www.nsa.gov/cybersecurity -guidance  \nDisclaimer of e ndorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce h erein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply i ts endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be u sed for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify and di sseminate threats to \nNational Security Systems, Department of Defense,  and Defense Industrial Base information systems, and to develop and issue cybersecurity \nspecifications and mitigations. This information may be shared broadly to reach all appropriate stakeholders.  \nContact  \nClient Requirements / General Cybersecurity Inqui ries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia Inquiries / Press Desk: Media Relations, 443 -634-0721, MediaRel ations@nsa.gov    \n\n",
  "cves": [],
  "techniques": [
    "T1565.002",
    "T1573",
    "T1040",
    "T1071.001",
    "T1568",
    "T1566.002",
    "T1071.004",
    "T1572"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csi_adopting_encrypted_dns_u_oo_102904_21",
  "source": "nsa",
  "id": "660bcb9799ae1a08b5a85043f0913bde74fc8dcfb84ba1820ba82aa2b5529542"
}