{
  "markdown": " \nU/OO/ 126083 -24 | PP-24-0822  | March 2024 Ver. 1.0  \nNational Security Agency | Cybersecurity Information Sheet  \nManage Cloud Logs for Effective Threat Hunting  \nExecutive summary  \nThe many ways of accessing and managing a cloud tenant  (often from anywhere in the \nworld) can complicate the problem of security monitoring. Since cloud networks are \nvirtualized, getting to ground truth can be difficult. Defense of a cloud tenant hinges on \nmaintaining logs that record the right level of detail on security -relevant events. It also  \ndepends on logs that cannot be modified by actors to cover their tracks , even when they \ncan act as administrators. Cloud access policies, system logs, and administrative audits \nmust be controlled and monitored  by security engineers and system administrato rs to \nprevent access abuse.  \nCloud Service P roviders  (CSP)  must have a strong focus on security to maintain reliable \nbusiness models and to help secure cloud infrastructure. Organizations need to know \nwhat should be logged and how those logs should be mana ged, stored, and analyzed. \nSecurity logs can help in several ways , including  threat hunting, investigating security \nincidents, and meeting compliance and audit requirements.  \nCloud log benefits  \nAppropriate cloud logging can provide several benefits for an o rganization, including  for: \n Threat hunting operations  - Cloud security logs provide a detailed record of \nactivity, which can be used to detect security threats early on. Under MITREs \nD3FEND matrix, the use of logs is broadly applicable under the Detect \ncategory . [1] By monitoring security logs, organizations can identify suspicious \nactivity, such as command and control activity, lateral movement, or other \ntechnique s as described in MITREs ATT&CK matrix.  [2] Detection would then \nallow network defenders to take appropriate mitigation actions against  the threat.  \nD3FEND Tactic  Countermeasures  \nDetect  Network Traffic Analysis [ D3-NTA] \nDetect  Platform Monitoring [ D3-PM] \nDetect  Process Analysis [ D3-PA] \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  2 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \nD3FEND Tactic  Countermeasures  \nDetect  User Behavior Analysis [ D3-UBA] \n \n Investigation of security incidents  - Cloud security logs can provide context \nabout a potential security incident and the root cause. Logs can be used to \nreconstruct the sequence of events leading up to the incident, identify sources, \nand determine the extent of the exposu re.  \n Compliance and audit requirements  - Regulatory and compliance \nrequirements are prevalent, and cloud security logs can help organizations \ncomply with regulations , such as the Health Insurance Portability and \nAccountability Act (HIPAA ), PCI Data Security Standard (PCI -DSS) , and \nEuropean Unions General Data Protection Regulation (GDPR ).  \nWhat should be logged in the cloud?  \nOrganizations cannot realistically log, organize, and analyze everything in an \nenvironment as the operational cost prevents tha t. However, CSPs may not enable \ncritical logs by default or require critical logs to be configured to work properly with \ncollection mechanisms , leading to a dearth of information during investigations and \nthreat hunting operations. [3] Organizations must find a balance between logging \nrequirements and resource constraints. Organizations should also prioritize choosing \nCSPs that embrace secure by design principles an d provide appropriate logging.  [4], [5] \nLogging requirements will vary among organizations depending on things such as \nbusiness needs, known threats, and relevant regulations. Resource constraints \ninvariably include costs, product  and tool interoperability, network speed and bandwidth, \nand other complex restrictions. Therefor e, prioritizing which logs to collect and analyze \nmust be part of a thorough cloud security plan. Start with two questions:  \n1. From what  sources should logs be collected ?  \n2. What types of logs should be collected from those sources?  ATT&CK Tactic  Technique  \nCommand and Control  Non-Application Layer Protocol [ T1095 ] \nLateral Movement  Remote Services [ T1021 ] \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  3 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \nLog sources  \nDuring the SolarWinds incidents, Russian actors were able to use cloud  APIs to \nexfiltrate data from their targets cloud environments. They were also able to add \ncredentials, authenticate to cloud services , add permissions to applications, and move \nlaterally througho ut the cloud using specific cloud APIs , which prevented their activity \nfrom being logged in conventional web console logs. The SolarWinds incident served as \na wake -up call to the industry on how  malicious  agents might exploit cloud operations  in \nways that are difficult to detect . [6], [7] \nTo help detect similar breaches in cloud networks, organizations need to enable or add \nlogging capabilities for business critical applications, hosts, networks, and cloud API \ncalls. Cloud logs for the security of infrastructure include:  \n Authentication and authorization  - User and service even ts, such as login, \nauthentication, and authorization attempts, and changes to user roles or \npermissions  along with the creation of new users . \n Network and security  - Networking related e vents , such as firewall services \nblocking incoming network connections, network flow s, intrusion detection \nsystem events , and network configuration changes . \n System and application  - System and application security events, such as \nchanges to system configurations  and security policy violations .  \n Audit and compliance  - Events for audit and compliance requirements, such as \nfor data access, data protection, and compliance with regulatory standards.  \n Application programming interface (API)  - Events in a cloud platform , such as \nresource provisioning, usage and cost analysis, and service configuration \nchanges.  \n Short -term cloud resources  - Resource events , such as virtual machines, \ncontainers, or other services that are rapidly spun up or down . \nAnalyzing these logs helps to identify security risks, detect incidents and anomalies, and \nrespond to events quickly. However, many applications and data sources that handle \ncritical information produce logs with few details and security context. Organizations \nmust prioritize logs b ased on their value and completeness.  \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  4 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \nEvent types  \nCloud event types depend on the services and actions being performed , including:  \n1) User and resource actions  - Events or actions by users and applications, such \nas user logins , account creation , API calls, a nd configuration changes, or actions \ntaken on cloud resources, such as launching a resizable computing capacity \ninstance, modifying a database, or deleting a storage resource.  \n2) Security, error, and performance events  - Security -related activities, such as \nattempts to access a resource without authorization, changes to security settings, \nor the detection of a threat; as well as, events related to errors and performance \nissues, such as failed API calls, resource timeouts, or service disruptions.  \n3) Compliance a nd billing events  - Events related to costs, policy compliance, \nand privacy, such as changes to access policies, data privacy violations, or audit -\nrelated events; as well as billing and cost -related activities, such as changes to \npricing plans, usage -based  billing events, or cost optimization recommendations.  \nLogging of these event types is critical for understanding actions within a cloud \nenvironment and for detecting and responding to threats, performance issues, \ncompliance violations, and other importan t events.  \nCloud log management  \nDue to the potential for an immense amount of data to come in from logs, a robust log \nmanagement strategy is vital. The use of Security Information and Event Management \n(SIEM) and/or Security Orchestration, Automation, and Re sponse (SOAR) tools to \nefficiently manage and process the data into actionable alerts will likely prove to be \nimperative.  Even in short -lived resource environments where traditional SIEMs do not \nhave significant visibility, a number of offerings exist  from vendors who have the \ncapability to handle logs in temporary  environments. In addition to SIEM and SOAR \nproducts, CSPs often offer log centralization services where logs can be sent to a \ncentralized location for any related analysis.  \nLogs stored in a centr alized location make log monitoring and analysis easier. Retention \nguidelines vary among organizations based on what is logged and the regulations that \nthe data is subject to. Limits may be placed on a CSPs log retention based on policy or \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  5 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \npricing. Managi ng cloud logs correctly can prevent inundation  by implementing the \nfollowing strategies, including:  \n Log filtering  - Filter logs to remove noise and reduce the data volume. Logs can \nbe filtered on criteria such as type, severity, IP address, or keywords.  \n Log sampling  - Sample logs to reduce the data being retrieved or analyzed. \nThis takes a representative sample of logs rather than every event.  \n Log aggregation  - Aggregate logs from multiple sources into a single stream, \nwhich can reduce the volume of log data being stored and analyzed .  \n Log compression  - Compress logs to reduce the file size, the data transmitted, \nand also allow for longer retention.  \n Log streaming  - Stream logs to an analysis tool for processing as they are \ngenerated rather than storing th em locally, to reduce stored data.  \n Log retention  - Define retention policies that specify log storage and deletion. \nThis can reduce the amount of log data being stored over time.  \nThese  strategies should be applied differently to different log sources and event types \nas appropriate. For example, sampling of network metadata logs may be appropriate, \nwhile sampling user authentication logs may not.  \nPreventing inundation requires strategies that balance the need for capturing important \nevents while reducing  the log volume. The location and storage method of security logs \ncan vary depending on the cloud platform and the logging service being used, but some \ncommon storage options include:  \n1. Cloud -based storage service  - Cloud platforms offer storage for security logs. \nThese can store large amounts and offer features such as versioning, access \ncontrol, and data durability.  \n2. Cloud -native logging services  - Platforms offer services that are specifically \ndesigned for stori ng and analyzing logs generated within a cloud environment.  \n3. Third -party log management  - In some cases, organizations may choose to \nuse third -party log management tools to store and analyze security logs \ngenerated within the cloud environment.  \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  6 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \nSecurity lo gs must be stored and protected from unauthorized access and prevent any \nediting, alteration, or deletion. This includes employing measures such as encrypting, \nrestricting access, and implementing monitoring and alerting to detect any suspicious \nactivity r elated to the logs.  \nCloud log analysis  \nAs previously described, the use of a SIEM and SOAR solution is important, as vast \namounts of data and information could come in at any time.  Cloud platforms often have \ninternal tools that collect and analyze data fr om various sources, including cloud \nprovider resources, associated operating systems, and applications to provide insights \non the health , performance , and security  of system resources and services.  \nThe following steps help with log collection and analysis in cloud platforms:  \n1. Identify sources  - Find sources that generate security events. Sources such as \nvirtual machines, storage accounts, databases, security groups and more. An \nadministrator defines the criteria for analysis, such as unusual or suspicious \nactivity, failed login attempts, unauthorized access attempts, and so on.  \n2. Enable, review, and adjust settings  - Enable and configure the logging settings \nto capture, analyze, and store data , such as user and application activity, \ntransactions, and changes t o configurations. Regularly review and adjust these \nlog settings and tools to ensure that a system is capturing all relevant data and \nthat the analysis techniques are effective.  \n3. Collect and store logs  - Collect and store logs from different sources in a \ncentralized location. Use log management tools to collect and store logs.  \n4. Normalize and enrich logs  - Normalize the logs from different sources to a \ncommon format and enrich them with context and metadata, such as IP \naddresses, user identities, and timestamp s. Adhere  to a public standard for log \nformats , such as the NCSA Log Format for web services or the Open \nCybersecurity Schema Framework.  [8], [9] \n5. Analyze logs  - Choose a primary log analysis tool for log formatting and custom \nqueries. This  tool can be used to investigate and analyze the root cause of an \nincident and identify any suspicious or anomalous activity. Look for events that \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  7 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \ncould indicate security risks, such as unauthorized access attempts, changes to \nconfigurations, and unusual p atterns of behavior.  \n6. Correlate logs  - Correlate logs from different sources to identify patterns that \ncould indicate a security incident. For example, multiple failed login attempts from \ndifferent IPs for the same user account could indicate brute  force attempts .  \n7. Perform active threat hunting  - Investigate security incidents by reviewing the \nrelevant logs and taking appropriate actions, such as revoking user access.  \n8. Support vulnerability assessment and penetration testing  - Use logs to help \nidentify expos ed cloud resources and weaknesses in the cloud environment.  \n9. Create queries and alerts  - Once security logs are collected and stored, create \nqueries to retrieve and analyze the data. SIEM and SOAR products, as well as \nCSP tools, may aid in creating useful q ueries. Use these to gain insights into \nalerts, vulnerabilities, and compliance status. Custom queries help to make \nsecurity processes much more efficient when data targets are previously known. \nA user can configure alerts when certain events or conditions  occur in the \nsecurity logs.  \nAnalyzing security logs to gain insight into an organizations security posture requires a \ncombination of technical expertise, analytical skills, and an understanding of the \nenvironment. These steps help a user to analyze cloud  platform security logs, hunt \nthreats, and respond to incidents in the cloud environment.  \nCloud log security  \nWhen a system does not implement  controls to track and log user actions, it opens itself \nto manipulation, forging, or deletion of not only data an d files, but also the logs that \nwould reveal such activity.  \nFor example, in 2016 Russian actors hacked the Democratic National Convention and \nwiped away traces of their operations by destroying system logs . [10], [11] MITREs \nATT&CK matrix documents how potential malicious actors could manipulate logs to \ntheir advantage . Examples include Indicator Removal where adversaries remove logs \nshowing evidence of their actions or Impair Defense s in which logs could be disabled \nentirely . Allowing for these malicious log manipulations can degrade security and allow \nfor impersonat ion and spoofing.  \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  8 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \nATT&CK Tactic  Technique  \nDefense Evasion  Impair Defenses: Disable Cloud Logs [ T1562.008 ] \nDefense Evasion  Indicator Removal [ T1070 ] \n \nUnauthorized alteration or deletion of logs will invalidate any operations based on those \nlogs. Organizations should take the security of their logs just as seriously as that of  their \ncritical applications.  \nAn inability to properly control logs allows for manipulation of identities and actions, and \nprevents user -action accountability. Maintaining accountability is vital in any setting; \nhowever, the communal nature of the public cloud stresses the need for security and \naccountability to keep records and to prevent any false accusations, as seen in the \nSTRIDE threats: [12], [13] \n \n \n Spoofing identity  to impersonate an entity during authentication.  \n Tampering with data  unauthorized data alteration.  \n Repudiation  denying and/or covering up ones own ac tions.  \n Information disclosure  the unauthorized release of system information.  \n Denial of service  forced service unavailability.  \n Elevation of privilege  illicit acquisition of additional higher -level privileges.  \nFor example, repudiation refers to when m alicious actors are able to deny attribution of \nany actions. The countermeasure to repudiation is to establish accountability \nmechanisms that verify that a user performed a specific action. Cloud logs help protect \nagainst repudiation by providing a trail o f evidence that can be used to verify the \nauthenticity and integrity of transactions and events. Events , such as user actions that \nare inconsistent with the expected behavior or unauthorized changes to configurations, \ncan indicate tampering of data. Logs help to generate audit trails for a complete and \naccurate record of actions , including information such as user identity, time stamps, and \ntransaction details. Users with cloud access cannot falsely deny performing an action. \nNot only does this allow a hos t to track individual actions, but maintaining proper logs \nwill also help prevent false accusations of users  actions . [14]  \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  9 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \nBest practices  \nCloud logs can help protect networks by providing visibility into network activity and \ndetecting and alerting on potential security threats. Cloud admin istrator s should \nimplement the following as a baseline:  \n1. Log as much security relevant information as possible  - Organization s need \nto determine their logging capabilities, log everything possible up to that extent  \nthat is security relevant , and should prioritize the event sources and types listed \nin the What should be logged in the cloud?  section.  \n2. Implement a management plan for the logs  - Poorly managed logs will hinder \nan organization and make forensic and hunting operations infeasible. Establish \ngood log management plans  and practices , including, but not limited to, centrally \naggregating logs, applying filters, and following a retention plan suitable for \nwhatever regulations and practices apply. Many CSPs provide log aggregation \ntools that can ease log collection and mana gement for organizations.  \n3. Use a SIEM and/or SOAR to analyze logs and improve hunt and forensic \noperations  - Cloud defenders will be easily overwhelmed if they were to \nmanually search through logs for hunt and forensic operations. Organizations \nshould use a SIEM to help organize and process log data so that defenders can \nproperly analyze events to discover and respond to threats. Most CSPs offer \nmachine -learning -based log analytic tools. This can be beneficial, as traditional \nSIEM tools may not effectively map actions across cloud resources.  \n4. Protect  the logs - Malicious agents can target logs and logging infrastructure to \nhide their presence, erase evidence, or o therwise repudiate their actions. \nControls on who may access and modify logs, primarily  using a log administrator \nrole that is distinct and isolated from other administrator roles , should be \nestablished . Network communications with log data should be encry pted to help \nprotect the integrity of logs. Ensure that the logs and the logging service are \navailable when they are needed by using a robust logging service and by \nhardening the central logging appliance  or repository.  \nCloud logs are an essential tool for  defending networks by providing visibility into \nnetwork activity, identifying security threats, and supporting swift incident response. By \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  10 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \nusing cloud logs effectively, organizations can develop their security posture and defend \ntheir networks from cyber threats.  \nAdditional references  \nReaders can obtain additional details and guidance from the following publications:  \n NIST Special Publication 800 -92: Guide to Compu ter Security Log Management   \n Guidance  for Implementing M -21-31: Improving the Federal Governments \nInvestigative and Remediation Capabilities   \n https://www.whitehouse.gov/wp -content/uploads/2021/08/M -21-31-Improving -the-\nFederal -Governments -Investigative -and-Remediation -Capabilities -Related -to-\nCybersecurity -Incidents.pdf  \nWorks cited  \n[1] The MITRE Corporation.  MITRE D3FEND : A knowledge graph of cybersecurity \ncountermeasures. 2023. https://d3fend.mitre.o rg  \n[2] The MITRE Corporation. MITRE ATT&CK: ATT&CK Matrix for Enterprise. 2024. \nhttps://attack.mitre.org/   \n[3] SANS Institute. A  SANS 2021 DFIR Cloud Report: Partly Cloudy with a Bunch of DFIR . 2021.  \nhttps://www.sans.org/white -pape rs/sans -2021 -dfir-cloud -report -partly -cloudy -with-bunch -dfir/  \n[4] Cybersecurity and Infrastructure Security Agency et al. Shifting the Balance of Cybersecurity \nRisk: Principles and Approaches for Secure by Design Software. https://www.cisa.gov/resources -\ntools/resources/secure -by-design    \n[5] Cybersecurity and Infrastructure Security Agency. When Tech Vendors Make Important Logging \nInfo Available for Free, Everyone Wins. 2023. https://www.cisa.gov/news -events/news/when -\ntech-vendors -make -important -logging -info-available -free-everyone -wins \n[6] Cybersecurity an d Infrastructure Security Agency. AA21 -008A: Detecting Post -Compromise \nThreat Activity in Microsoft Cloud Environments. 2021. https://www.cisa.gov/news -\nevents/cybersecurity -advisories/aa21 -008a   \n[7] Cybersecurity and Infrastructure Security Agency. AA20 -352A: Advanced Persistent Threat \nCompromise of Government Agencies, Critical Infrastructure, and Private Sector Organizations. \nhttps://www.cisa.gov/news -events/cybersecurity -advisories/aa20 -352a   \n[8] Microsoft. NCSA Logging. 2019. https://learn.microsoft.com/en -us/windows /win32/http/ncsa -\nlogging   \n[9] Open Cybersecurity Schema Framework. OCSF Schema. 2024. https://schema.ocsf.io/   \n[10] U.S. Department of Justice. United States of America v. Viktor Borisovich Netyksho et al. 2018. \nhttps://www.justice.gov/file/1080281/download   \n[11] CrowdStrike. CrowdStrikes work with the Democratic National Committee: Setting the record \nstraight. 2020. https://www.crowdstrike.com/blog/bears -midst -intrusion -democratic -national -\ncommittee/   \n[12] Microsoft Corporation . Microsoft Threat Modeling Tool threats.  2022. \nhttps://learn.microsoft.com/en -us/azure/security/develop/threat -modeling -tool-threats   \n[13] Open Worldwide Application Security Project (OWASP). Threat Modeling Process. 2023. \nhttps://owasp.org/www -community/Threat_Modeling_Process#stride   \n\n \n \n \n U/OO/126083 -24 | PP-24-0822 | March 2024 Ver. 1.0  11 \nNSA | Manage Cloud Logs for Effective Threat Hunting  \n[14] Open Worldwide Application Security Project (OWASP). Repudiation Attack . 2020. \nhttps://owasp.org/www -community/attacks/Repudiation_Attack   \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce \nherein to any spec ific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not \nconstitute or imply its endorsement, recommendation, or favoring by the United States Government, and this guidance shall not  be \nused for advertisi ng or product endorsement purposes.  \nTrademarks  \nATT&CK and MITRE and are registered trademarks of The MITRE Corporation. D3FEND is a trademark of The MITRE Corporation.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, incl uding its responsibilities to identify and \ndisseminate threats to National Security Systems, Department of Defense, and Defense Industrial Base information systems, and  to \ndevelop and issue cybersecurity specifications and mitigations. This information may  be shared broadly to reach all appropriate \nstakeholders.  \nContact  \nCybersecurity Report Feedback: CybersecurityReports@nsa.gov   \nGeneral Cybersecurity Inquiries or Customer Requests: Cybersecurity_Requests@nsa.gov   \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov   \nMedia Inquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [
    "T1562.008"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csi_cloudtop10-logs-for-effective-threat-hunting",
  "source": "nsa",
  "id": "93d8ab0c3d98a0ba97d0986d7975077bc5994edd75d454a8bb862ca2e77ab2dd"
}