{
  "markdown": "  \nU/OO/184192 -20 | PP-21-0827  | JUN 2021 Ver. 1. 1 \nNational Security Agency  | Cybersecurity Information  \nDeploying Secure Unified Communications /Voice \nand Video over IP Systems  (Abridged)  \nUnified Communications (UC) and Voice and Video over IP (VVoIP) call -processing \nsystems provide rich collaboration tools and offer fl exible ways to communicate by \ncombining  voice, video conferencing, and instant messaging in the modern workplace. \nToday  these systems are integrated into an enterprises existing Internet Protocol (IP) \ninfrastructure, use co mmodity software, and are likely to use open -source and standard \nprotocols.  \nHowever, the same  IP infrastructure that enables  UC/VVoIP systems also extends the \nattack surface into an enterprises network, introducing vulnerabilities and the potential \nfor unauthorized access to communications. These vulnerabilities were harder to reach  \nin earlier telephony systems, but now v oice serv ices and infrastructure are accessible to \nmalicious actors who penetrate the IP network . \nIf properly secured, a UC/VVoIP system  limits the risk to data confidentiality and \ncommunication system availability. This security requires careful consideration, detailed \nplanning and deployment, and continuous testing and maintenance.  \nNSA has released a comprehensive Cybersecurity Technica l Report , Deploying Secure \nUnified Communications /Voice and Video over IP Systems , which  outlines best \npractices for the secure deployment of UC/VVoIP  systems and presents mitigations for \nvulnerabilities due to inadequate network design, configurations, and connectivity.  This \nreport  is separated into four parts. Each part speaks to the system administrators who \nwill lead mitigation efforts in each area of the system. It describes the mitigations and \nbest practices to use when:  \n Preparing  networks  \n Establishing perimeters  \n Using enterprise session controllers (ESCs)  \n Adding UC/VVoIP endpoints for deployment of a UC/VVoIP system  \nThis abridged report captures some of the key takeaways. System administrators are \nencouraged to access the full report for a complete list of best practices and mitigations.  \n\n \n \nU/OO/184192 -20 | PP-21-0827  | JUN 2021 Ver. 1. 1  2 \nNSA | Deploying Secur e UC/VVoIP Systems  \nWhat are the vulnerabilities?  \nLegacy telephony systems were more isolated from other networks due to the use o f \ndedicated infrastructure. Additionally, they were based on proprietary software and \nprotocols  that could not communicate with other devices . On the other hand, UC/VVoIP \nsystems are integrated into the enterprises existing IP infrastructure, use commodit y \nsoftware, and are likely to use open source and standard protocols. These systems and \nprotocols are very familiar to malicious actors, making UC/VVoIP systems potentially \nsusceptible to the same malicious activity  constantly targeting existing IP systems , \nincluding through  spyware, viruses, software vulnerabilities, or other malicious means. \nThese avenues of attack can be used to eavesdrop on conversations, impersonate \nusers, or perpetrate denial of service effects  if robust mitigations are not put in pla ce. \nCompromises can lead to high -definition room audio and/or video being covertly \ncollected and delivered to a malicious actor using the IP infrastructure as a transport \nmechanism.  \nSharing the IP infrastructure also creates a single point of failure in an  organizations \ncommunication capabilities. If the IP network fails or there is a widespread denial of \nservice, all UC/VVoIP services could be severely degraded or lost.  \nUC/VVoIP endpoint devices offer a richer set of capabilities than legacy telephony \nendpoints , but also come with an increased attack surface . When using a UC/VVoIP \nsystem, many of these devices on the enterprise network could be offering services \nsuch as Hypertext Transfer Protocol (HTTP), Simple Network Management Protocol \n(SNMP), telnet, and Wi -Fi and Bluetooth connectivity. These UC/VVoIP devices must \nbe examined and configured to protect against vulnerabilities in these services , just like \ncomputers and other network endpoints . In addition to UC/VVoIP endpoints, UC/VVoIP \nservers  can be vulnerable to exploitation like other servers on th e enterprise network, \nincluding from remote access  capabilities.   \nEven though fraud existed in legacy telephony systems, the scope of impact was limited \nbased on the number of phone lines compromised. In U C/VVoIP systems, once a \nphone line is compromised, multiple calls can be made with that phone line \nsimultaneously, greatly increasing the severity of the fraud. Fraud, in both legacy and \nUC/VVoIP systems, can target either subscribers (service customers) o r service \nproviders. The aim of fraud at either the subscriber -level or service -provider level is to \nmake free calls and/or financial gain.  \nCritical emergency services based on physical location, such as 911, can also present \nchallenges. Users of UC/VVoIP  systems can move their endpoint devices between \n\n \n \nU/OO/184192 -20 | PP-21-0827  | JUN 2021 Ver. 1. 1  3 \nNSA | Deploying Secur e UC/VVoIP Systems  \nphysical locations , but function as if they were in the office. Examples include taking an \noffice endpoint device to a remote site to work for the day or taking it home to telework. \nIf proper procedures are not in place to account for these moves, a call from the \nendpoint device reporting an emergency may result in first responders arriving at the \nwrong location.  \nWhat can be done?  \nUC/VVoIP systems introduce a new class of attacks that did not pertain to legac y \ntelephony systems. To minimize the risk of having  your telephony system on the data \nnetwork , follow the guidelines  below . For more details, r eference the full -length  \nDeploying Secure Unified Communications /Voice and Video over IP Systems  \nCybersecurity Technical Report for a comprehensive set of mitigations related to \nnetwork security, perimeter security, enterprise session controller security, and \nUC/VVoIP endpoints.  \n \nSegment the n etwork  \n \nVirtual Local Area Networks (VLANs) can be used t o segment voice and video traffic \nfrom data traffic and separate IP address ranges to limit access to a common set of \ndevices. Create VLANs for:  \n IP phones  \n UC/VVoIP servers  \n Public Switched Telephone Network (PSTN) gateways  \n Administrative access to infrastru cture  \n Existing data devices  \nIn addition to using VLANs, use access control lists and routing rules to limit access to \ndevices across VLANs. This makes it more difficult for a malicious actor to access open \nservices on phones and servers from outside of the  VLAN.  \nConverged services, such as unified messaging, should be placed in a demilitarized \nzone (DMZ)  similar to the DMZ between trusted and untrusted networks. Tightly control \ntraffic with stateful filtering, application layer proxies, and malware scanning . \nLastly, exclusive reliance on softphones  (software a pplication s installed on a personal \ncomputing device to make telephone calls ) can be risky because the security and \n\n\n \n \nU/OO/184192 -20 | PP-21-0827  | JUN 2021 Ver. 1. 1  4 \nNSA | Deploying Secur e UC/VVoIP Systems  \navailability of them depend on the underlying general -purpose device. In addition, it \nviolates the principle of UC/VVoIP and data network separation. When softphones are \nused, either use them only as a secondary voice device and establish a separate VLAN \nfor PCs with softphones, or require that they connect through an IP gateway.  \n \nImplement layer  2 protections  \n \nAdd layer 2 protections , such as port security, assigning stat ic media access control \n(MAC) addresses to switch ports, and other Address Resolution Protocol (ARP) and IP \nspoofing defenses . Only use switches that offer these p rotections. Using a packet \nsniffer, ensure switches embedded in IP phones (to enable PC port connectivity) \nproperly handle VLANs and limit access to the phone from the connected computer. \nPrevent Dynamic Host Configuration Protocol (DHCP) abuse by designat ing trusted \nswitch ports for DHCP server responses.  \n \nProtect the PSTN and Internet perimeters  \n \nPSTN gateways should authenticate all UC/VVoIP connections and not allow calls \ndirectly from IP phones without permission of the UC/VVoIP server. When using \nUC/VVoIP trunks over public IP networks, session border controllers (SBCs) should \ncontrol access to internal UC/VVoIP resources, deal with network address translation \n(NAT) traversal issues, and encrypt traffic. In addition, SBCs inspect UC/VVoIP traffic at \nthe application layer to check for Request for Comment (RFC) compliance and \nmalicious data embedded into the UC/VVoIP packets. NSA recommends deploying \nSBCs evaluated under the National Information Assurance Partnerships (NIAP) \nExtended Package for Session  Border Controller  Protection Profile . When using VVoIP \ntrunks over VPNs, be sure to maintain VLAN security across the VPN.  \n \nStay up to date with patching   \n \nPatches should be signed by the vendor and only downloaded from trusted sources. \nBefore applying patches to a production network, they should first be vetted on a test \nnetwork to ensure no unexpected or adverse conditions are caused by the software \n\n\n \n \nU/OO/184192 -20 | PP-21-0827  | JUN 2021 Ver. 1. 1  5 \nNSA | Deploying Secur e UC/VVoIP Systems  \nupdate.  Once vetted, they should be applied to the system immediately. Timely patching \nhelps to mitigate software vulnerabilities that exist in UC/VVoIP systems and devices.  \n \nAuthenticate and encrypt signaling and media traffic  \n \nAuthentication and encryption  of all signaling and media traffic prevents impersonation \nand eavesdropping by malicious actors. Mutual authentication of signaling traffic is \ncritical to prevent intruders from easily impersonating legitimate users. When \nauthenticating to UC/VVoIP server s, it is strongly recommended to use multi -factor \nauthentication. UC/VVoIP traffic should be protected using a trusted channel employing \nstrong encryption protocols, such as Transport Layer Security (TLS) or Internet Protocol \nSecurity (IPsec). Unencrypted UC/VVoIP traffic can lead to a malicious actor gaining \nvaluable information about the UC/VVoIP endpoints and details of the call s. \n \nPrevent fraud  \n \nDeploy  an SBC to monitor UC/VVoIP traffic at the perimeter and between service \nprovider networks. Audit cal l data records (CDRs) using fraud detection solutions that \nmonitor CDRs and detect fraud in near real -time. Block calls to destination countries \nknown to have high incident rates of fraud.  \n \nEnsure availability   \n \nMaintain  backups of software configurations  and installations, acquire high availability \nhardware, build redundant network paths, and hav e standby hardware. Provide backup \npower to servers, phones, and network infrastructure in case of power outages. For \nphones this may mean supplying power over Et hernet and expanding backup power \ncapacity in network closets. Use monitoring software that alerts administrators to any \nhardware failures and temperature spikes on critical servers.  \n \n\n\n \n \nU/OO/184192 -20 | PP-21-0827  | JUN 2021 Ver. 1. 1  6 \nNSA | Deploying Secur e UC/VVoIP Systems  \n \nManage denial of service attacks   \n \nUtilize rate limiting settings, qua lity of service controls, and secondary connections to \noutside networks. Limit the number of incoming calls to prevent overloading of the \nUC/VVoIP servers. Implement quality of service controls to ensure UC/VVoIP traffic has \npriority even on a saturated ne twork. Have secondary Internet connections to UC/VVoIP \nservice providers or backup circuit -switched PSTN connections.  \n \nControl physical access   \n \nSecure areas with network and UC/VVoIP infrastructure (e.g. routers, switches, and \nservers). Locks requiring identification cards, biometrics, or other electronic means can \nalso provide useful auditing information about access to equipment. Two -person access \ncontrol is recommended. These areas should also include measures to reduce the risk \nof other potential phy sical threats, such as from fire or flooding.  \n  \nVerify features and configurations  in a test bed  \n \nTest before adding devices to operational networks. Do not allow rogue devices to auto \nconfigure themselves with the UC/VVoIP  servers. Choose a single, secure remote \nmanagement protocol. Disable all others and block them on the network.  \nFinal word  \nTaking advantage of the benefits of a UC/VVoIP system, such as cost savings in \noperations or advanced call processing, come s with the  potential for additional risk. A \nUC/VVoIP system introduces new potential security vulnerabilities. Understand the \ntypes of vulnerabilities and mitigations to better secure your UC/VVoIP deployment. \nNSA recommends deploying the technology using the guidan ce presented in this paper. \nFor more detaile d guidance, please consult the Deploying Secure Unified \nCommunications /Voice and Video over IP Systems  Cybersecurity Technical Report on \nNSA.gov . \n\n\n \n \nU/OO/184192 -20 | PP-21-0827  | JUN 2021 Ver. 1. 1  7 \nNSA | Deploying Secur e UC/VVoIP Systems  \nDisclaimer of e ndorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or \nguarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise, does not constitute or imply its endorsement, re commendation, or favoring by the United \nStates Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibiliti es to identify \nand disseminate threats to National Security Systems, Department of Defense, and Defense Industrial Base \ninformation systems, and to develop and issue cybersecurity specifications and mitigations. This information may be \nshared broadly to re ach all appropriate stakeholders.  \nTrademarks  \nBluetooth is a registered trademark of Bluetooth Special Interest Group (SIG), Inc.  \nContact  \n Client Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  \nCybersecurity_Requests@nsa.gov   \n Media  Inquiries / Press Desk: Media Relations,  443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_deploying secure vvoip systems",
  "source": "nsa",
  "id": "f041a667a6cc7ec753f75ba4bf37a726ad248a6ad1478e4fea3bfd647105975c"
}