{
  "markdown": "  \nU/OO/117652 -21 | PP-21-0251  | May 2021 Ver. 1.2  \nCybersecurity Information  National  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nSelecting a Protective DNS Service  \nWhy Protective DNS?  \nThe Domain Name System (DNS) is central to the operation of modern networks, translating human -readable domain \nnames into machine -usable Internet Protocol (IP) addresses. DNS makes navigating to a website, sending an email, or \nmaking a secure shell connect ion easier, and is a key component of the Internet's resilience. As with many Internet \nprotocols, DNS was not built to withstand abuse from bad actors intent on causing harm. Protective DNS (PDNS) is \ndifferent from earlier security -related changes to DNS  in that it is envisioned as a security service  not a protocol   that \nanalyzes DNS queries and takes action to mitigate threats, leveraging the existing DNS protocol and architecture.  \nProtecting users DNS queries is a key defense because cyber threat ac tors use domain names across the network \nexploitation lifecycle: users frequently mistype domain names while attempting to navigate to a known -good website and \nunintentionally go to a malicious one instead ( T1583.001 ); threat actors lace phishing emails with malicious links \n(T1566.002 ); a compromised device may seek commands from a remote command and control server ( TA0011 ); a threat \nactor may exfiltrate data from a compromised device to a remote host ( TA0010 ).1 The domain names associated with \nmalicious content are often known or knowable, and preventing their resolution protects individual users and the \nenterprise.  \nDue to the centrality of DNS for cybersecurity, the Department of Defense (DoD) included DNS filtering as a requirement \nin its Cybersecurity Maturity Model Ce rtification (CMMC) standard (SC.3.192). The Cybersecurity and Infrastructure \nSecurity Agency issued a memo and directive requiring U.S. government organizations to take steps to mitigate related \nDNS issues. Additionally, the National Security Agency has pu blished guidance documents on defending DNS [1, 2, 3].  \nThis guidance outlines the benefits and risks of using a protective DNS service and assesses several commercial PDNS \nproviders based on reported capabilities. The assessment is meant to serve as inform ation for organizations, not as \nrecommendations for provider selection. Users of these services must evaluate their architectures and specific needs \nwhen choosing a service for PDNS and then validate that a provider meets those needs.  \nHow does it work?  \nWidely implemented DNS security enhancements  that address the integrity and authenticity of DNS records (e.g., DNS \nSecurity Extensions, or DNSSEC) or that support the privacy and integrity of client DNS queries and responses (e.g., \nDNS over Transport Layer Security [DoT], and DNS over HTTPS [DoH])  do not address the trustworthiness of upstream \nDNS infrastructure that may be compromised or DNS registrations that may be maliciously provisioned.  \nTo address this shortcoming, PDNS uses a policy -implementing DN S resolver that returns answers based on policy \ncriteria. This is often called Response Policy Zone (RPZ) functionality in DNS documentation. The resolver usually checks \nboth the domain name queries and the returned IP addresses against threat intelligence , and then prevents connections \nto known or suspected malicious sites. PDNS can also protect a user by redirecting the requesting application to a non -\nmalicious site or returning a response that indicates no IP address was found for the domain queried. In addition, many \nenterprise DNS resolvers still do not validate DNSSEC or support DoH/DoT, but many PDNS providers add these DNS \nsecurity enhancements as well [4].   \nIt should be noted that one inherent constraint of PDNS is that it is bypassed by any traffic  using IP addresses directly \nwithout doing DNS lookups. For this reason, customers should not rely on it alone to detect and prevent malicious traffic. \nSome PDNS services may provide additional non -DNS related capabilities or integration with other securit y capabilities. \nSome network device equipment, such as firewalls, may have DNS protection capabilities as well. These devices and \ntheir functions or integrations with other capabilities are not covered in this guidance.  \n                                            \n1 T1583, TA0010,  and similar notations identify MITRE ATT&CK techniques and tactics .  \n\n \n \n U/OO/117652 -21 | PP-21-0251  | May 2021 Ver. 1.2  2 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \n Selecting a Protective DNS Service  \nService setup  \nThe setup costs for a new security service is an important decision point for many organizations. A key benefit of PDNS is \nthat it can be set up in a simple deployment just by changing an organizations recursive resolver to use the PDNS \nproviders DNS server.  \nMore complex and  secure deployments of PDNS may involve software changes on hosts. This may include lightweight \nDNS clients or virtualized applications that can keep the protections working in a variety of environments and enable a \nfaster response to incidents. Additional ly, enterprises should take measures to limit the use of alternative DNS resolvers, \ne.g., by configuring firewalls to block unauthorized DNS ports or DoH servers. PDNS systems may also support multiple \npolicies for different groups, users, and/or devices.  \nDomain classification  \nA core capability of PDNS is the ability to categorize domain names based on threat intelligence. PDNS services typically \nleverage open source, commercial, and governmental information feeds of known malicious domains. These feeds ena ble \ncoverage of domain names found at numerous points of the network exploitation lifecycle. Some solutions may also \ndetect novel malicious domains based on pattern recognition. The types of domains typically addressed by a PDNS \nsystem include the followin g: \n Phishing : Sites known to host applications t hat maliciously collect personal or organizational information, \nincluding credential harvesting scams.  These domains may include typosquats  or close lookalikes of common \ndomains. PDNS can protect users from accidentally connecting to a potentially malicious link.  \n Malware distribution and command and control : Sites known to serve malicious content or used by threat \nactors to command and control malware. For example, these may include sites hosting malicious Ja vaScript files \nor domains that host advertisements that collect information for undesired profiling. PDNS can block and alert on \nknown malicious connection attempts.  \n Domain generation algorithms : Sites with programmatically generated domain names that are  used by malware \nto circumvent static blocking.  Advanced malware  including some botnets  depend on the ability to \ncommunicate with command and control (C2) infrastructure. Cyber threat actors use domain generation \nalgorithms (DGAs) for malware to circum vent static blocking  either by domain name or IP  through \nprogrammatically generating domain names according to a pre -set seed. PDNS can offer protection from malware \nDGAs by analyzing every domains textual attributes and tagging those associated with known DGA attributes, \nsuch as high entropy.  \n Content filtering : Sites whose content is in certain categories that are against an organizations access policies. \nAlthough an ancillary benefit to malware protection, PDNS can use a categorization of various do mains use \ncases (e.g., gambling) and warn or block on those that are deemed a risk for a given environment.  \nResponse to identified domain names  \nA PDNS service may take several actions to respond to a malicious or suspicious domain name query. Of the pro tective \nactions, PDNS may restrict communication with a domain by returning an NXDOMAIN response, which means that there \nis no IP address answer for the domain name query. PDNS may also prevent the connection by redirecting to a block \npage, possibly offeri ng a reason for the block to the user. It may also sinkhole the domain and provide a custom \nresponse. These responses delay or prevent further malicious actions  such as cryptolocking by ransomware or the use \nof command and control protocols  enabling an organization to conduct an investigation into a domains provenance or \ninitiate follow -on infection hunting.  \nInteractions with the PDNS platform  \nTypical administrative interactions with PDNS systems are through a web interface, an application programmin g interface \n(API), or a Security Information and Event Management (SIEM) integration. Cybersecurity leaders and administrators will \n\n \n \n U/OO/117652 -21 | PP-21-0251  | May 2021 Ver. 1.2  3 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \n Selecting a Protective DNS Service  \nneed to consider the increased workload of responding to PDNS alerts and integrating evolving network knowledge into \ntheir P DNS deployment plans.  \nAdditionally, PDNS providers should collect and store the logs of DNS queries or provide them to the organization for it to \nkeep. In either scenario, historical DNS logs can prove useful for retroactively searching for indications of earlier intrusions \nusing indicators that only become known later on.  \nCybersecurity best practices and PDNS  \nThe following best practices address only the use of DNS resolver services. They do not address the management of an \norganizations own authoritative  DNS zone(s) and related attributes  including availability, reliability, security, and \nperformance.  \nUse a PDNS provider  \nSelect and use a PDNS system as part of a layered defense -in-depth strategy. See below for some options for enterprise \nPDNS services. Other reputable PDNS services that are available and free for public use may be appropriate for personal \nuse cases, but enterprise PDNS services that provide malicious activity alerts, enterprise dashboard views, historical \nlogging and analysis, and other enterprise -focused features are recommended for enterprise networks. Additionally, due \nto DNS being foundational to most online activity, ensure that PDNS is provided as a high availability service.  \nBecause an organizations PDNS provider can view their DN S queries, selecting a provider has privacy and security \nimpacts. Obtain an understanding of how the service provider may use the organizations generated PDNS data  \nespecially whether the provider will use the data for any non -security purposes.  \nBlock un authorized DNS queries  \nUnless required for operations, take measures to harden internal DNS resolution to prevent bypass. These measures \nshould include blocking outbound port 53 (DNS) and port 853 (DoT) to thwart malwares potential use of DNS services, \ncircumventing PDNS. In addition, block traffic to unauthorized DoH servers. Also, configure client applications  especially \nweb browsers  with enterprise policies that configure DoH solely for designated resolvers, or disable DoH entirely. See \nNSAs Adopting Encrypted DNS in Enterprise Environments  for more information [5].  \nAccount for hybrid enterprise architectures  \nClasses of users may require different PDNS policies depending on their environments, and the prevalence of mobile and \nhome network use can create additional challenges to PDNS implementations. One PDNS policy will not often fit the \nentire enterprise. Ensure that the chosen PD NS solution is flexible enough to adapt to your architectural and mission \nrequirements. Deployment flexibility is typically achieved through the providers implementation of a lightweight or \nroaming DNS client.  \nPDNS provider analysis  \nThis document uses p ublic information to provide an assessment of how some commercial providers may satisfy the \nabove criteria as of February 2021. The selection of services for this initial assessment was based on publicly available \ninformation about enterprise PDNS services , as defined by this document, offered by vendors that are registered for \nfederal contracts; this is not a comprehensive list of services or all possible criteria. NSA and CISA welcome providers to \nsubmit additional information that can be included in this  guide to Cybersecurity_Requests@nsa.gov . Analysts gathered \nmaterial from published company literature and product specifications, supplemented by other openly published analyses. \nNo formal testing was performed on products or services for this analysis. NSA and CISA do not affirm the recency or \naccuracy of the data provided. This assessment is meant to serve as information for organizations, not as \nrecommendations for provider selection. Users of these services must evaluate their architectures and specific needs \nwhen choosing a service for PDNS and then validate that a provider meets those needs.  \n\n \n \n U/OO/117652 -21 | PP-21-0251  | May 2021 Ver. 1.2  4 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \n Selecting a Protective DNS Service  \nTable 1: PDNS performance attributes comparison based on reported capabilities  (note  disclaimer below)  \nCapability  Akamai \nETP BlueCat \nNetworks \nDNS Edge Cisco \nUmbrella \nDNS SE  Cloudflare \nGateway  EfficientIP \nDNS \nGuardian  HYAS \nProtect  Infoblox \nBloxOne \nThreat \nDefense \nCloud  Neustar \nUltraDNS  Nominet \nProtective \nDNS  \nBlocks malware \ndomains  X X X X X X X X X \nBlocks phishing \ndomains  X X X X X X X X X \nMalware Domain \nGeneration \nAlgorithm (DGA) \nprotection  X X X X X X X X X \nLeverages \nmachine learning \nor other heuristics \nto augment threat \nfeeds  X X X X X X X X X \nContent filtering  X X X X X X X X X \nSupports API \naccess for SIEM \nintegration or \ncustom analytics  X X X X X X X X X \nWeb i nterface \ndashboard  X X X X X X X X X \nValidates DNSSEC  X  X X X X X X X \nDoH/DoT capable  X  X X X X X X X  \nEnables \ncustomizable \npolicies by group, \ndevice, or  network  X X X X X X X X X \nDeploys across \nhybrid \narchitectures  X X X X X X X X X \nDisclaimer of Endorsement  \nThis document does not constitute a Qualified Products List, within the meaning of the definition of Federal Acquisition Regu lation (FAR) 2.101 or a \nQualified Manufacturers List under FAR subpart 9.2 Qualification Requirements. The government has not undertaken any testing or evaluation of the \nproducts listed under this analysis, but has only reviewed the published attributes of the products. The lis t is not all -inclusive. This list may be amended \nand supplemented from time to time as market research discloses other items or as new products become available.  \n \nThe information and opinions contained in th is document are provided as is  and without any  warranties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply i ts endorsement, \nrecommendation, or favoring by the United States Govern ment, and this guidance shall not be used for advertising or product endorsement purposes.  \n  \n\n \n \n U/OO/117652 -21 | PP-21-0251  | May 2021 Ver. 1.2  5 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \n Selecting a Protective DNS Service  \nWorks Cited  \n[1]  Cybersecurity and Infrastructure Security Agency  (2020), Addressing Domain Name System Resolution on Federal Networks . Available at: \nhttps://www.cisa.gov/sites/default/files/publications/Addressing_DNS_Resolution_on_Federal_Networks_Memo.pdf   \n[2]  Cybersecurity and Infrastruct ure Security Agency, (2019) Emergency Directive 19 -01: Mitiga te DNS Infrastructure Tampering. Available at: \nhttps://cyber.dhs.gov/ed/19 -01/  \n[3]  Office of the Undersecretary of Defense for Acquisition & Sustainment (2020), Cybersecurity Maturity Model Certification . Available at: \nhttps://www.acq.osd.mil/cmmc/draft.html    \n[4] UK National Cyber Security Centre (2017), Protective DNS (PDNS). Available at: https://www.ncsc.gov.uk/information/pdns   \n[5]  National Security Agency (2020), Adopting Encrypted DNS in Enterprise Environments. Availab le at: https://www.nsa.gov/cybersecurity -guidance  \nPurpose  \nThis document was developed in furtherance of the NSA and CISA  cybersecurity missions, including their responsibilities to identify and dis seminate \nthreats to National Security Systems, Department of Defense, Defense Industrial Base , U.S. government, and critical infrastructure  information systems, \nand to develop and issue cybersecurity specifications and mitigations. This information may be shared broadly to reach all appropriate stakeholders.  \nTrademarks  \nMITRE ATT&CK is a registered trad emark of The MITRE Corporation.   JavaScript is a registered trademark of Oracle Corporation.   Akamai is a \nregistered trademark of Akamai Technologies, Inc.  BlueCat and BlueCat DNS Edge are registered trademarks of BlueCat Networks Inc.  Cisco is a \nregistered trademark of Cisco Systems, Inc.  Cloudflare is a registered trademark of CloudFlare, Inc.  Efficient IP is a tr ademark of EfficientIP SAS.  \nHYAS i s a trademark of HYAS InfoSec Inc.   Infoblox and BloxOne are registered trademarks of Infoblox Inc.   Neustar UltraDNS is a registered \ntrademark of Neustar, Inc.  Nominet is a registered trademark of Nominet UK.  \nContact  \nClient Requirements / General Cybe rsecurity Inquiries: Cybersecurity Requirements Center, 410 -854-4200, Cybersecurity_Requests@nsa.gov      \nMedia Inquiries / Press Desk:  \n NSA Media Relations, 443 -634-0721, MediaRelations@nsa.gov   \n CISA Media Relations, 703 -235-2010, CISAMedia@cisa.dhs.gov   \n \n\n",
  "cves": [],
  "techniques": [
    "T1583",
    "T1583.001",
    "T1566.002"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csi_selecting a protective dns service_u00117652-21",
  "source": "nsa",
  "id": "d3127ae16c164099a04d6cc501b40484b98612ae41d10438017e28621447026e"
}