{
  "markdown": " \nU/OO/ 194427 -22 | PP-24-1178  | April 2024 Ver. 2 .0 \nNational Security Agency | Cybersecurity Information Sheet  \nThe Commercial National Security Algorithm Suite \n2.0 and Quantum Computing FAQ  \nSections  \n Background  \n CNSA 2.0  \n Timeframe  \n Preparation  \n CNSSP  15 \n Quantum alternatives  \n CSfC and NIAP  \n Future cryptographic algorithms  \n Hybrids  \n Further information  \nBackground  \nQ: To whom are these requirements addressed?  \nA. These are mainly addresse d to the following audiences:  \n National Security System (NSS)  owners/operators , who need  to know the \nrequirements for their systems  \n Vendors , who need  to know what to implement to meet NSS requirements  \nNSA is not using these requirements to dictate or recommend to any other entity \noutside of NSS  and the Defense Industrial Base ( DIB) what algorithms they should \nuse, although NSA recognizes that interoperability requirements or other interests \nmay lead to scenarios where  these recommendations  are used by a larger \ncommunity . \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 2 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: What is a quantum computer, and how is it different from the computers we \nuse today?  \nA: In place of ordinary bits used by todays computers, quantum computers use qubits \nthat behave in surprising ways, efficiently performing certai n mathematical algorithms \nexponentially faster than a classical computer. Small examples of quantum computers \nhave been built.  \nQ: What is a  cryptanalytically relevant quantum computer (CRQC)?   \nA: Also written as cryptographically relevant quantum comput er, CRQC describe s \nquantum computers that are capable of attacking real world cryptographic systems.  \nWhether the C indicates  cryptanalytically or  cryptographically is a matter of writers \npreference, as the two terms are essentially equivalent in th is context.  This term \ndistinguishes a CRQC from any other quantum computer technologies used in other \nsettings without the performance metrics required to attack real world cryptographic \nsystems . \nQ: What is the threat if a CRQC were developed?  \nA: A CRQC,  if built, would be capable of undermining the widely  deployed public -key \nalgorithms currently used for asymmetric  key exchanges and digital signatures with \npotentially devastating impact to systems . National security systems (NSS) use public -\nkey cryptogra phy as a critical component to protect the confidentiality, integrity, and \nauthenticity of national security information.  \nQ: Can I continue to use larger sizes of RSA  or ECC to address the threat?  \nA: No. RSA and Elliptic Curve Cryptography are the main algorithms that need to be \nreplace d to achieve quantum resistance.  \nQ: What is quantum -resistant or post -quantum cryptography?   \nA: Quantum -resistant (QR), quantum -safe, and post -quantum (PQ) cryptography \nare all terms used to describe cryptographic a lgorithms that  can be run on computers \ntoday and are believed to be resistant to cryptanalytic attacks from both classical and \nquantum computers.  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 3 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: What is the Commercial National Security Algorithm Suite 2.0 (CNSA 2.0)?  \nA: CNSA 2.0 is the suite of QR al gorithms approved for eventual NSS use. The \nfollowing table lists the algorithms and their functions, specifications, and parameters.  \nTable: Commercial National Security Algorithm  Suite 2.0  \nAlgorithm  Function  Specification  Parameters  \nAdvanced Encryption \nStandard (AES)  Symmetric block cipher \nfor information \nprotection  FIPS PUB 197  Use 256 -bit keys for all \nclassification levels.  \nML-KEM (aka \nCRYSTALS -Kyber ) Asymmetric algorithm \nfor key  establishment  FIPS PUB 203  Use Category 5 \nparameter , ML-KEM -\n1024,  for all \nclassification levels.  \nML-DSA (aka \nCRYSTALS -Dilithium ) Asymmetric algorithm \nfor digital signatures  in \nany use case , including \nsigning firmware and \nsoftware  FIPS PUB 204  Use Category 5  \nparameter , ML-DSA-\n87, for all classification \nlevels.  \nSecure Hash Algorithm \n(SHA)  Algorithm for \ncomputing a \ncondensed \nrepresentation  of \ninformation  FIPS PUB 180 -4 Use SHA -384 or SHA -\n512 for all classification \nlevels.  \nLeighton -Micali \nSignature (LMS)  Asymmetric algorithm \nfor digitally signing \nfirmware and softwar e NIST SP 800 -208  All parameters \napproved for all \nclassification levels. \nLMS SHA-256/192 is \nrecommended.  \nXtended Merkle \nSignature Scheme \n(XMSS)  Asymmetric algorithm  \nfor digitally signing \nfirmware and software  NIST SP 800 -208 All parameters \napproved for all \nclassification levels.  \nCNSA 2.0  \nQ: Where should CNSA 2.0 algorithms be used?  \nA: CNSA 2.0 algorithms will be required for all products that employ public -standard \nalgorithms in NSS, whether a future design or currently fielded.  Any usage of Suite B or \nCNSA 1.0 algorithms will be required to transition to CNSA 2.0 usage. The Timeframe  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 4 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nsection of this FAQ and the Advisory Memorandum have transition t imeframe \ninformation. More details will  be released on an ongoing basis as industry adjusts to the \nnew technology . \nQ: How did NSA choose the CNSA 2.0 alg orithms?  \nA: NSA chose algorithms from among those selected for standardization by the National \nInstitute of Standards and Technology ( NIST ), the U .S. Government lead for \ncommercial algorithm approval . NSA believes they offer optimal performance for given \nNSS security requirements.  \nQ: How strong does NSA believe CNSA 2.0 algorithms are?  \nA: NSA performed its own analysis of CNSA 2.0 algorithms and considers them  \nappropriate for long-term use in protecting the varied missions of U.S. NSS.   \nQ: Does NSA intend to produce implementation guidance for CNSA 2.0 similar to \nthe IETF RFCs1 produced for CNSA 1.0?  \nA: NSA will provide implementation guidance for CNSA 2.0 algorithms, and is working \nwith the IETF to produce them through the RFC series . RFCs detail protocol options in \naddition to algorithm choices, and NSA expects to provide  similar protocol guidance \nregardless of algorithm selection.  \nQ: For whom is this guidance intended?  \nA: NSA makes CNSA 2.0 requirements, anticipated timing, and this related FAQ widely \navailable to assist NSS owners and operators in their transition planning and to inform \nindustry of NSS requirements.  \nQ: Does CNSA 2.0 apply  to fielded equipment?  \nA: Even NSS systems that are in current use will need to  be upgraded in a timely \nfashion unless the system received a waiver through the approved process. This is in \n                                            \n1 Internet Engineering Task Force Requests for Comments.  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 5 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nagreement with National Security Memorandums (NSMs) 82 and 103 as well as CNSSP \n11 and CNSSP 15 . \nQ: What policies should I follow to meet NSS algorithm requirements?  \nA: High -grade equipment will follow the guidance in CJCS N 65104 and CNSSAM 01 -07-\nNSM5. Commercial equipment will follow CNSA 1.0  until the transition mandated by \nCNSSP  156, expected to occur sometime between 2025  and 2030, depending on \nequipment type. In accordance with NSM -10 and CNSSP -11, QR algorithms should be \nimplemented in NSS mission systems  as National Information Assurance Partnership \n(NIAP ) validated products or in accordance with other implementation -specific \nguidance. Typically , this will include, but not be limited to, requiring modules be \nvalidated by the NIST Cryptographic Module Validation Program (CMVP).  \nQ: Where can I learn more about hash -based signatures?  \nA: Refer to  NIST standardized stateful  hash -based signatures in NIST SP 800 -2087. \nThis standard also provides references to other technical documentation on the topic. \nNSA recommends using  Federal Informa tion Processing Standards ( FIPS )-validated \nLMS or XMSS hash -based signatures to protect NSS in the specialized scenarios \noutlined in the s tandard e.g., for firmware signing and software signing. NSAs \npreferred parameter set is Section 4.2, LMS with SHA-256/192.   \nQ: Can I use HSS or XMSSMT  from NIST SP 800 -208?  \nA: From NIST SP 800 -208, NSA has only approved LMS and XMSS for use in NSS. \nThe multitree algorithms HSS and XMSSMT are not allowed.  \n                                            \n2 Memorandum on Improving the Cybersecurity of National Security, Department of Defense, and Intelligence Community System s, \n19 January 2022.  \n3 National Security Memorandum on Promoting United States Leadership in Quantum Computing While Mitigating Risks to \nVulnerable Cryptographic Systems, 4 May 2022.  \n4 Chairman of the Joint Chiefs of Staff Notice 6510, Information Assurance  Cryptographic Device Modernization Requirements, \nAugust 2019.  \n5 Committee on National Security Systems Advisory Memorandum 01 -07-NSM, Cryptographic Equipment Modernization Planning, \n20 March 2022.  \n6 Committee on National Security Systems Policy 15, Use of  Public Standards for Secure Information Sharing.  \n7 NIST Special Publication 800 -208, Recommendation for Stateful Hash -Based Signature Schemes.  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 6 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: Can I use SLH -DSA (aka SPHINCS+) to sign software?  \nA: While SLH -DSA is hash -based, it is not part of CNSA and is not approved for any \nuse in NSS . \nQ: I'm going to adopt LMS or XMSS for software/firmware validation. Which \ncomponents need to be validated, and how? If my hardware security module \n(HSM ) is not FIPS -validated, can I get a waiver?  \nA: Signature verification is expected to be performed by cod e that has been validated by \nNISTs Cryptographic Algorithm Validation Program ( CAVP ). It is expected that signed \ncode may be received from a variety of sources (signers).  If your product is only \nvalidating signatures, CAVP testing is all that is required.  \nCode sources (signers) that are NSS are required to produce signatures according to \nNIST SP 800 -208, which requires hardware validated by NIST s Cryptographic Module \nValidation Program  (CMVP ), or via other NSA guidance . Waivers will not be granted for \nthis. \nWhile code sources (signers) that are not NSS are not subject to CNSA requirements, \nthey are expected to use code that meets the same development and operational \nquality as the validat ed code , that is, code that can pass CAVP testing .  \nNote : to avoid we akening the security of these signatures, one should implement \nsigning and state management in hardware, such as an HSM. Backup flows, which may \ninvolve transferring keys between modules, must prevent state re -use. \nQ: As a commercial vendor, how do I know if my NIST SP 800 -208 implementation \nmeets CNSA 2.0?  \nA: NIAP validates products against its published Protection Profiles, which will start \nincluding quantum -resistant signatures in line with our published transition timelines. For \ncommercial vendors, we do not anticipate NIAP Protection Profiles will perform \nsignature generation within the Target of Evaluation (TOE) boundary, only signature \nverification. As si gnature generation is the component of LMS/XMSS that require s state \nmanagement, if only signature verification is being performed, only CAVP validation (not \nCMVP) will be expected  for such products.   \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 7 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: Why are signatures for software - and firmware -signing  listed separately?  \nA: The reasons for choosing separate algorithms for software - and firmware -signing are \nas follows :  \n NIST has standardize d the algorithms in NIST SP 800 -208 already  and has \nCAVP validation available, while other post -quantum signatures are not yet \nstandardized,  \n This signature use -case is more urgent,  \n This selection places hash -based algorithms , with their substantial history of \ncryptanalysis , in a use case where their well-described potential performa nce \nissues have minimal impact. In particular, this usage coincides well with the \nrequirement for keeping track of state that is, how many times a given public \nkey was used in signing software or firmware  when deploying these signatures . \nQ: Why are firmware signatures more urgent?  \nA: In many firmware -signing cases  the validation algorithm  is not easily updated . Thus , \nfirmware -signing algorithms are frequently locked in for the life of a system.  Even in \nsystems that are designed for extensibility and cryptographic agility , a quantum -\nresistant root of trust may be required  in the firmware years before the rest of the \nsystem upgrade s to quantum -resistance.  NSA prioritize s this in our timelines to avoid \nunexpected costs and security issues later in our tr ansition.  \nQ: Can I use SHA -3 as a hash?  \nA: No, neither SHA -3 nor SHAKE are approved for use in CNSA as a hash  algorithm . \nWhile NSA allows any parameter set of LMS, including some that call SHA -3 as a \nfunction, NSA has not approved SHA -3 as a hash  algorith m. Its use is strictly limited to \nthose cases where it is prescribed by the standard  describing an NSA -approved \nalgorithm , such as LMS within NIST SP 800 -208.  \nThe SHA -2 selections are sufficient for security, and their ubiquity in the commercial \nworld ensures interoperability. Using SHA -3 or SHAKE outside th ose narrowly defined \napplications where it is called as a function significantly increases the interoperability \ntesting burden and breaks many use cases for CNSA  2.0. \n \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 8 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: Where can I learn more about  lattice -based key encapsulation mechanism s \n(KEMs) and digital signatures?  \nA: NIST  announced  it would  standardize  lattice -based KEMs and digital signatures. \nNIST s post-quantum standardization page  includes reports from previous rounds of the \nstandardization effort . These reports include summaries of the cryptography under \nconsideration and many references.  \nQ: Why did NSA choose ML-DSA  over FN-DSA (aka Falcon) ? \nA: For NSS, NSA agrees with NIST : ML-DSA is preferred,  as FN-DSA seems more \nsusceptible to implementation errors that may affect security. As NIST has prioritized \nstandardizing ML-DSA, it will likely be available sooner.   \nQ: Can I use ML-DSA  for firmware or software signing?  \nA: At this time LMS and XMSS are the only ap proved digital  signing algorithms  which \nhave finished standards  and validation paths . Firmware roots of trust are  a critical \ncomponent to upgrade and NSA expects this to be implemented  for some long -lived \nsignatures in 2025, before validated ML-DSA is wide ly available.  NSA prefers to see \nthis transition begin now rather than wait for ML-DSA due to the long timeframes \ninvolved in moving from small components and/or early designs to completed products.  \nML-DSA is approved for all signing use cases and when it is available (i.e., \nstandardized and validated) it may be reasonable for some software/firmware signing \nuse cases . For example , when a  users software signing strategy requires more \nsignatures than can be reasonably use d with a single LMS or XMSS key , or in software \ndevelopment environments with a distributed signing system, it would be reasonable to \nuse ML -DSA.  \nQ: Will NSA add more selections to CNSA in the future?  \nA: NSA do es not currently plan  to add future NIST post quantum standards to CNSA . \nCircumsta nces could change in ways we do not currently foresee, but adding more \nalgorithms generally makes interoperability more complex (although admittedly less so \nfor algorithms for software and firmware signing).  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 9 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: What if my solution uses hash functions other  than SHA -384 or SHA -512?  \nA: SHA -384 remains approved in the newest CNSA Suite,  as NSA believe s it provide s \nsufficient security for NSS. Designers often prefer to use SHA -512 for performance \nreasons. This is now supported by CNSA 2.0 ; however,  customers ne ed to be certain \nthat using SHA-512 does not lead to interoperability issues.  \nWhere NSA has approved an algorithm or cryptographic application that incorporates a \ntruncated hash value or other NIST -approved hash function (e.g. SHA -3) as part of its \ndesign,  using those hash functions is acceptable within the scope of the algorithm or \ncryptographic application. General purpose use of such hash functions is not approved \nat this time.  \nJust as SHA -512 was added to CNSA, NSA may in the future add another NIST \nalgorithm if it achieves ubiquity in a key area of the ecosystem, satisfies our \nindependent security requirements, and is unlikely to  interfere with interoperability .  \nQ: How is CNSA 2.0 implementation enforced in NSS?  \nA: Authorizing officials will be reporting regularly on adoption in accordance with \nNSM -10. It is important they use the tools and resources available to ensure all systems \nthat use cryptography for security (including software update mechanisms) implement \nCNSA 2.0 algorithms. Report a ny deviations to NSA  in accordance with NSM -10 \nprocesses .  \nQ: Can a commercial product be used in my NSS that runs cryptography other \nthan in CNSA 2.0?  \nA: If a commercial product does not use CNSA 2.0 algorithms , it is not allowed to  be \nused to protect NSS  unless it is approved through the waiver process . CNSA 2.0 relies \non NIST standardized algorithms , which have been widely vetted as quantum resistant , \nand other  algorithms should not be employed.  Further, CNSSP -11 requires that \ncommercial products used in NS S be NIAP validated, and this validation will generally \nrequire CNSA 2.0 compliance.  \nQ: When should deployment of CNSA 2.0 algorithms in mission systems begin?  \nA: When validated products become available they should be deployed in mission \nsystems. Meanwhil e, NSA encourages responsible testing in vendor and government \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 10 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nresearch environments now to understand the effects of deployment of the new \nalgorithms  on particular systems given the increased sizes used in these algorithms.  \nTimeframe  \nQ: What timeframe information can NSA provide for adoption of CNSA 2.0?  \nA: NSA intends that all NSS will be quantum -resistant by 2035, in accordance with the \ngoal espoused in NSM -10. NSA relies upon NIST -approved commercial cryptography \nfor commercial solutions. After NIST has finalized the standards associated with  \nCNSA 2.0, NSA will update CNSSP  15.  \nNew cryptographic developments will be required to support CNSA 2.0 algorithms as an \noption once appropriate standards for the given technology are in place . All appropriate \nsystem components should be configured to prefer CNSA 2.0 algorithms. As products \nmature, those components should be configured to accept only CNSA 2.0 algorithms.  \nNSA will provide guidance and updated protection profiles as industry develops the \nappropria te standards because  product lines may develop at different speeds. CNSA \n1.0 algorithms will continue to be used until current solutions can operate in a CNSA 2.0 \nmode. NSAs current view on timing is as follows:  \n Software - and firmware -signing:  begin trans itioning immediately, support and \nprefer CNSA 2.0 by 2025  where available , exclusively use CNSA 2.0 by 2030.  \n Web browsers/servers and cloud services : support and prefer CNSA 2.0 by \n2025, exclusively8 use CNSA 2.0 by 2033.  \n Traditional networking equipment ( e.g., virtual private networks, routers):  \nsupport and prefer CNSA 2.0 by 2026 , exclusively  use CNSA 2.0 by 2030.  \n Operating systems : support and prefer CNSA 2.0 by 2027, exclusively  use \nCNSA 2.0 by 2033.  \n Niche equipment (e.g., constrained devices, large public -key infrastructure \nsystems) : support and prefer CNSA 2.0 by 2030, exclusively  use CNSA 2.0 by \n2033.  \n Custom applications and legacy equipment : update or replace by 2033.  \n                                            \n8 Even though NSA may allow or require hybrid solutions due to protocol standards, product availability, or inte roperability \nrequirements  CNSA 2.0 algorithms will become mandatory to select at the given date, and selecting CNSA 1.0 algorithms alone will \nno longer be approved.  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 11 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: What is the timeline for new deployments?  \nA: NIAP and the Commercial Solution s for Classified ( CSfC ) program  will update  their \nprofiles and requirements in accordance with industry adoption. NSA intends an \naggressive timeframe for adoption (see the bullet s above) and requests industry \nsupport.  \nQ: What is the timeline for transition ing fielded equipment?  \nA: As industry adopts CNSA 2.0 algorithms, NSA will require transition of fielded \nequipment to CNSA 2.0 as well. In some circumstances, this may  require a hardware \nrefresh. NSA encourage s NSS owners and operators to plan for this.  \nCryptographic agility is necessary to accomplish this transition in a timely manner; even \nequipment purchased before support is mandated should have sufficient memory and \nprocessing power when possible to run new algorithms , as well as capacity for future \nalgorithms and protocols so that any future enhancements can be included  via a \nsoftware update .  \nQ: When will NIST standards  become completed/finalized?  \nA: This question is best addressed to NIST . See NISTs Post-Quantum Cryptography \nStandardization  project page for more information.  \nQ: When will IETF RFCs for implementing NSAs algorithms be available?  \nA: IETF and other standards development organizations (SDO) are independent bodies. \nNSA is working with IETF and other SDOs to produce  RFCs and other documentation  \nwith the appropriate level of security and implementation analysis that these imp ortant \nstandards are due. NSA encourages CNSA 2.0 adopt ion in standards and deploy ment  \nin vendor products.   \nPreparation  \nQ: What can developers and programs do to prepare for a future quantum -\nresistant algorithm suite?  \nA: AES -256, SHA -384, SHA -512, and the NIST hash -based signatures listed in NIST \nSP 800 -208 are considered safe against attack by a large quantum computer. \nDevelopers should deploy these algorithms today. They should also  begin implementing \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 12 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nthe other quantum -resistant algorithms NIST and NSA chose and provide feedback \nabout any issues they discover. NSS owners and operators should test implementations \nof algorithms in lab networks to prepare for the transition.  \nQ: How do I begin to transition to a quantum -resistant system?  \nA: The CNSA 1.0 Suite  continues to represent the interim strategy as the commercial \nspace transitions to the algorithms in CNSA 2.0. Following forthcoming NSA guidance \nand NIST efforts , including NISTs forthcoming 1800 -38 series,  will best position NSS \nowners and operators to make this transition.  \nQ: Is t here a quantum -resistant public -key algorithm  that commercial vendors \nshould adopt today?  \nA: NSA encourages vendors to use  CNSA 2.0 approved hash -based signatures for \nsoftware - and firmware -signing. NSA does not approve using pre-standardized or non -\nFIPS -validated CNSA 2.0 algorithms (even in hybrid modes) for NSS  missions . \nHowever, NSA does recommend limited use of pre -stand ardized or non -FIPS -validated \nCNSA 2.0 algorithm s and modules in research settings to prepare for the transition. \nNSA requests vendors begin preparing to implement CNSA 2.0 algorithms so they are \nprimed  to provide products soon after NIST complet es standar dization.  \nCNSSP  15 \nQ: What is CNSSP  15? \nA: Committee on National Security Systems Policy 15 (CNSSP  15) specifies \ncommercial cryptographic algorithms for protecting NSS, in conjunction with other \nCNSS - and NSA -documented processes. Originally, it specified NSA Suite B , and \nthen it was revised to specify  the CNSA 1.0 Suite  in CNSSP 15 Annex B . It will include \nCNSA 2.0 algorithms as NIST completes standardizing the selections from Round 3  of \nthe standardization process . Further details about CN SS are at www.cnss.gov .  \nQ: What will happen with CNSSP  15? \nA: The October 2016 update to CNSSP  15 m ade three significant changes , as follows:  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 13 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \n1. It replaced the previous requirement to transition systems to Suite B standards, \nspecif ying a larger selection of algorithms ( i.e., CNSA ) to allow extended use of \nexisting solutions while post -quantum standards are developed.  \n2. It consolidated the two security levels of Suite B into a single set of requi rements \nfor use at all levels.  \n3. Finally , while the previous version of CNSS P 15 focused  exclusively  on \nclassified information, the updated policy applies to all NSS, both  classified and \nunclassified.  \nNSA plans to update algorithms in CNSSP  15 with the CNSA 2.0 suite of algorithms as \nthe recent  cybersecurity advisory,  Announcing the Commer cial National Security \nAlgorithm Suite 2.0 , notes, and to deprecate CNSA 1.0 algorithms in the next version. \nNSA plans to keep the other previous cha nges as they are , having a single set of \nrequirements for both unclassified and all levels of classified NSS . \nQ: How does CNSSP  15 relate to CNSSI 1253, NIST SP 800 -53, and the RMF \nprocess?  \nA: CNSS  Instruction 12539 mandates us ing the Risk Management Framework (RMF) as \ndocumented in NIST SP 800-3910 and NIST SP  800-5311 in mana ging Nationa l Security \nInformation Systems.  NIST SP 800 -53 includes security controls (e.g. , SC-12) that \nrelate to cryptography. NSS requires the NSA Approved se lection. Unless NSA states \notherwise , the NSA Approved cryptography selection include s CNSA 1.0 algorithm \nrequirements as well as all other relevant NSA guidance on product validation and \noperation.  \nQ: How should the broader government community understa nd CNSSP  15 \nrequirements?  \nA: NSA est ablishes NSS requirements. Often these systems require protection for long \nperiods  against targeted efforts sophisticated and well -resourced adversaries conduct in \n                                            \n9 Committee on National Security Systems Instruction 1253, Security Categorization and Cont rol Selection for National Security \nSystems.  \n10 NIST Special Publication 800 -39, Managing Information Security Risk: Organization, Mission, and Information System View.  \n11 NIST Special Publication 800 -53 Rev.5, Security and Privacy Controls for Information S ystems and Organizations.  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 14 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \npotential wartime settings. NIST establishes  cryptograph ic standards  for other \ngovernment systems.   \nNSA selected the a lgorithms in CNSSP 15 from those chosen by NIST in order to \nsatisfy both NSA requirements for NSS and to simplify implementation and \ninteroperability by aligning with NIST standards  for general government use.  If you are  \nuncertain whether NSS requirements apply to a specific system, contact  NSA for \nassistance . Also see NIST SP  800-5912. \nQuantum alternatives  \nQ: Can I mitigate the quantum threat by using a pre -shared key?  \nA: Many commercial protocols allow a pre -shared  key option that may mitigate the \nquantum threat, and some allow the combination of pre -shared and asymmetric keys in \nthe same negotiation. However, this issue can be complex. Customers who wish to \nexplore this option should contact NSA  or follow guidance the CSfC program  provides.  \nQ: Will quantum computers affect non -public-key (i.e., symmetric) algorithms?  \nA: Quantum computing techniques are generally considered much less effective against \nsymmetric algorithms than against current widely used  public -key algorithms. While \npublic -key cryptography requires fundamental design  changes , symmetric algorithms \nare considered secure, provided the key size is  sufficiently large . CNSA 2.0 symmetric \nalgorithms , which essentially are the same as their CNSA 1.0 counterparts, are \nquantum -resistant.  \nQ: Why does NSA care about quantum computing today? Isnt quantum \ncomputing a long way off?  \nA: NSA does not know when there will be a  CRQC. Expert assessments disagree \nsignificantly about timing. Because NSS often h ave very long lifecycles , NSA must  \nproduce requirements today for systems that will be used many decades in the future . \nConsequently, the data these systems protect will still require cryptographic protection \nfor decades after these systems are at end of l ife. There is growing research in the area \n                                            \n12 NIST Special Publication 800 -59, Guideline for Identifying an Information System as a National Security System.  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 15 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nof quantum computing, and enough progress that NSA must act now to protect NSS by \nproviding the requirements for the transition to CNSA 2.0 .  \nQ: What is quantum key distribution (QKD)?  \nA: The field of quantum cryp tography involves specialized hardware using the physics \nof quantum mechanics to protect the confidentiality of sensitive information . The most \ncommon example today uses quantum physics to distribute keys for use in a traditional \nsymmetric algorithm, known  as quantum key distribution or QKD.  This technology \nexists today and is distinct from the quantum computing technology that might one day \nattack cryptographic algorithms. The sole function of QKD is to distribute keys between \nusers . Hence, it is only one part of a cryptographic system.  \nQ: Can I use a QKD system to protect my national security s ystem from a \nquantum computer?  \nA: No. The technology involved is of significant scientific interest, but it only addresses \nsome security threats and requires sig nificant engineering modifications to NSS \ncommunications systems. NSA does not generally consider QKD a practical securit y \nsolution for protecting N SS. NSS owners should not us e or research QKD at this time \nwithout  consult ing NSA directly . For specific questions, NSS owners can contact NSA . \nQ: What is a quantum random number generator (quantum RNG)?  \nA: Quantum random  number generators are hardware random number generators that \nuse specific quantum effects to generate nondeterministic randomness. The decision on \nwhich  RNG is appropriate in a specific scenario depends on many factors . In addition, \nany properly certified /approved RNG should be acceptable if you implement  it within the \nconstraints of that approval.  \nCommercial Solutions for Classified (CSfC) and National \nInformation Assurance Partnership (NIAP)  \nQ: Can I use any CNSA 1.0 - or CNSA 2.0 -capable product(s) in my  NSS without \ngoing through NIAP/CSfC?  \nA: No, CNSSP  11 states that all commercial -off-the-shelf information a ssurance (IA) \nand IA -enabled information t echnology products acquired to protect information on NSS \nshall comply with NIAP program requirements acco rding to  NSA-approved processes \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 16 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nand, where applicable, the requirements of FIPS cryptographic validation programs. \nFurthermore, CNSSP  7 states that a CSfC solution may protect NSS provided the \nappropriate Authorizing Official approved it and regist ration  with NSAs CSfC Program \nManagement Office showed it  compliant with an NSA -provided Capability Package .  \nQ: I have long data life concerns and want to adopt CSfC  solutions. How can I \nensure my communications and data remain secure against an adversary with a \nquantum computer?  \nA: Some CSfC solutions may be implemented today using symmetric, pre -shared keys \nthat protect against the long -term quantum computing threat . NSA considers using pre-\nshared symmetric keys in a standards -compliant fashion a better near -term post \nquantum solution than implementing experimental post -quantum asymmetric algorithms \npossibly in compatible with NIST standards. Eventually, NSA will prov ide capability \npackages to coincide with commercial technological development to implement \nCNSA 2.0 algorithms.  \nFor details,  contact the CSfC program office .  \nFuture cryptographic algorithms  \nQ: What algorithms should I use  for other areas of cryptography ( e.g., \nBlockchain, Private Information Retrieval, Identity Based Encryption)?  \nA: NSA wants to  know about  potential use cases for any of the innovative cryptography \nlisted below (or other similar cryptographic innovation). C NSSP  15 mandates u sing \npublic standards, while allowing exceptions for additional NSA -approved options when \nneeded. Neither NSA nor NIST ha s produced standards for these areas, and NSA has \nnot issued any general approval for  using these technologies.   \nMany  of these topics involve novel security properties  requir ing further scrutiny. NSS \nowners should consult NSA  before us ing any cryptography that CNSA 1.0 or CNSA 2.0 \nand other published guidance  do not specify . In particular, th e following have no \ngenerally approved solutions:  \n Distributed ledgers or blockchains  \n Private information retrieval (PIR)  \n Private set intersection (PSI)  \n Identity -based encryption (IBE)  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 17 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \n Attribute -based encryption (ABE)  \n Homomorphic encryption (H E) \n Group signatures  \n Ring signatures  \n Searchable encryption  \n Threshold signatures  \nQ: I have a novel cryptographic solution. How do I get my solution NSA \nApproved?  \nA: NSA has programs for certifying solutions built to protect classified information. This \ncertification process applies to developments  intended specifically for government use \nor control. NSA also participates in efforts such as NIAP and runs the Commercial \nSolutions for Classified program , both of which  require strict ly compl ying with  traditi onal \ncrypto graphic standards and designs.  \nNSA does not accept direct requests from commercial vendors to validate their products \nor offer a general use vendor certification for  novel cryptographic solutions.  If an NSS \ncustomer believes they have a mission  need to use cryptography beyond  what  is \ncurrently available , they should engage with NSA  directly to discuss their unique \nsituation.   \nQ: Will NSA be adopting the standards from NISTs Lightweight Cryptography \neffort?  \nA: NSA does not intend to add the ciphers resulting from NISTs Lightweight \nCryptography effort to CNSA. The Lightweight Cryptography effort resulted in the \nselection of symmetric primitives based on the Ascon family . Their targeted security is \nsubstantial ly less than AES -256, rendering them  generally un suitable for NSS use \ncases . If CNSA 2.0 algorithms do not meet mission system performance requirements, \nearly consultation with NSA is required.  \nHybrids  \nQ: What is a hybrid cryptographic solution?  \nA: A hybri d solution for a protocol is one us ing multiple algorithms to perform the same \nfunction, such as key agreement or authentication. The solution uses algorithms in a \nway that requires an att acker to break each one to comp romise system security . Hybrid \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 18 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nsoluti ons can consist of many traditional or QR algorithms. Component algorithms are  \nindividual algorithms used in a hybrid solution .  \nQ: What is NSAs position on the use of hybrid solutions?  \nA: NSA has confidence in CNSA 2.0 algorithms  and will not require NSS developers to \nuse hybrid certified products for security purposes. Product availability and \ninteroperability requirements may lead to adopting hybrid solutions.  \nNSA recognizes that some standards may require using hybrid -like constru ctions to \naccommodate the larger sizes of CRQC algorithms and will work with industry on the \nbest options for implementation.  \nQ: What complications can using a hybrid solution  introduce ?  \nA: Hybrids add complexity to protocols, as designers need to incorp orate additional \nnegotiation and error handling  and implementers need to modify APIs and testing . \nRather than ease the transition to quantum resistance, h ybrid deployments introduce \nadditional interoperability concerns, now that  all algorithms plus the me thod of \nhybridization must be  features  common to  all parties  to a communication. Similarly, \nhybrid deployments add a second transition later as users eventually move away from \nclassical algorithms in the future.   \nAt the same time , hybrid solutions  make the implementations  more complex , so one \nmust balance the risk of flaws in an increasingly complex implementation with th e risk  of \na cryptanalytic breakthrough.  Because m ore security product s fail due to \nimplementation or configuration errors than failures in the ir underlying cryptographic \nalgorithms, spending limited resources to add cryptographic complexity can at times \nweaken security  rather than improve it . \nWhere NSA recognizes a need to s upport a hybrid solution, extensive work will be \nperformed to ensure that it can be safely implemented, including engineering to a high \ndegree  of robustness, and facilitat ion to  a straightforward transition to QR -only \nsolutions.  \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 19 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nQ: Is there an example wher e NSA will recommend hybrid solutions?  \nA: Due to technical details of how the IKEv2 protocol operates with post -quantum \ncryptographys larger messages, it is not possible to directly replace the CNSA 1.0 \npublic key algorithms with their CNSA 2,0 counterpar ts in IKEv2. Because \nimplementations will already require the use of new messages and code to support \npost-quantum extensions, NSA anticipates keeping the initial CNSA 1.0 algorithms as a \nhybrid layer together with CNSA 2.0 algorithms for key establishment  within IKEv2 \nindefinitely.  \nQ: Should one use a hybrid or other non -standardized QR solution while waiting \nfor a final NIST post -quantum standard?  \nA: Do not use a  hybrid or other non -standardized QR solution on NSS mission systems  \nexcept for those excepti ons NSA specifically recommends to meet standardization or \ninteroperability requirements . NSA encourages limited purchase and us e for research \nand planning , but only to prepare for transition ing to a CNSA 2.0 Suite. Because NSA is \nconfident that CNSA 2.0 a lgorithms will sufficiently  protect NSS, it does not require a \nhybrid solution for security purposes.  \nUsing non-standard solutions entails a significant risk of establishing incompatible \nsolutions. Using a hybrid solution that involves a symmetric key in accordance with \nestablished standards (e.g., RFC 8446 , RFC 8784 ) may be appropriate, but key \nmanagement complexity generally restricts this to specialized applications.  \nFurther information  \nQ: Where can I get more  information?  \nA: For CSfC -specific questions,  customers should contact the Commercial Solutions for \nClassified Program Management Office at CSfC@nsa.gov .  \nOther specific questions from NSS users may be addressed via e -mail to \nNSACryptoToday@nsa.gov  or through normal business channels.  \nDisclaimer of endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or \nguarantees. Reference herein to any specific commercial product, process, or service by trade name, trademark, \n\n \n \n \nU/OO/194427 -22 | PP-24-1178 |  April 2024 Ver. 2.0  \n 20 NSA | CNSA Suite 2.0 and Quantum Computing FAQ  \nmanufacturer, or otherwise, does not const itute or imply its endorsement, recommendation, or favoring by the United \nStates Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity miss ions, including its responsibilities to identify \nand disseminate threats to National Security Systems, Department of Defense, and Defense Industrial Base \ninformation systems, and to develop and issue cybersecurity specifications and mitigations. This infor mation may be \nshared broadly to reach all appropriate stakeholders.  \nContact  \nCybersecurity Report Inquiries and Feedback: CybersecurityReports@nsa.gov  \nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov  \nMedia Inquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_cnsa_2.0_faq_",
  "source": "nsa",
  "id": "347488b2d6a5bcc1592359760ce0458d5b1841b74ee4f7ea8cec21706ab438ea"
}