{
  "markdown": "  \n U/OO/155603 -20 | PP-20-0535  | Aug 2020  \nNational Security Agency  | Cybersecurity Information  \nLimiting Location Data Exposure  \nMobile devices store and share device geolocation data by design. This data is essential to device communications and \nprovides features such as mapping applications that users consider indispensable. Mobile devices determine location \nthrough any combination of Global Positioning System (GPS) and wireless signals (e.g., cellular, wireless (Wi -Fi1), or \nBluetooth2 (BT)). Location data can be extremely valu able and must be protected. It can reveal details about the number \nof users in a location, user and supply movements, daily routines (user and organizational), and can expose otherwise \nunknown associations between users and locations.  \nMitigations reduce, but do not eliminate, location tracking risks in mobile devices. Most users rely on features disabled by \nsuch mitigations, making such safeguards impractical. Users should be aware of these risks and take action based on \ntheir specific situation and risk t olerance. When location exposure could be detrimental to a mission, users should \nprioritize mission risk and apply location tracking mitigations to the greatest extent possible. While the guidance in this \ndocument may be useful to a wide range of users, it  is intended primarily for NSS/DoD system users.3  \nMobile devices expose location data  \nUsing a mobile device even powering it on exposes location data. Mobile devices inherently trust cellular networks and \nproviders, and the cellular provider receives real -time location information for a mobile device every time it connects to the \nnetwork. This means a provider can track users across a wide area. In some scenarios, such as 911 calls, this capability \nsaves lives, whereas for personnel with location sensitivi ties, it may incur risks. If an adversary can influence or control the \nprovider in some way, this location data may be compromised. Public news articles have reported that providers have \nbeen known to sell data, including near -real time location data, to t hird-parties [1].  \nLocation data from a mobile device can be obtained even without provider cooperation. These devices transmit identifying \ninformation when connecting to cellular networks. Commercially available rogue base stations allow anyone in the loc al \narea to inexpensively and easily obtain real -time location data and track targets. This equipment is difficult to distinguish \nfrom legitimate equipment, and devices will automatically try to connect to it, if it is the strongest signal present [2].  \nAdditionally, location data is stored on the mobile device. Past location information can be used to forecast future \nlocations [3]. Other examples of risk exist: websites use browser fingerprinting to harvest location information [4], and Wi -\nFi access points and Bluetooth sensors can reveal location information [5].  \nLocation services  GPS  \nA mobile device provides geolocation data as a service to apps. This is known as location services, and users can disable \nthem in the settings of a device. Perhaps the most important thing to remember is that disabling location services on a \nmobile device does not turn off GPS, and does not significantly reduce the risk of location exposure. Disabling location \nservices only limits access to GPS and location data by apps. It d oes not prevent the operating system from using \nlocation data or communicating that data to the network.  \nAlso important to remember is that GPS is not the same as location services. Even if GPS and cellular data are \nunavailable, a mobile device calculates location using Wi -Fi and/or BT. Apps and websites can also use other sensor data \n(that does not require user permission) and web browser information to obtain or infer location information [6].  \n  \n                                            \n1 Wi-Fi is a registered trademark of Wi -Fi Alliance.  \n2 Bluetooth is a registered trademark of Bluetooth SIG, Inc.  \n3 The information contained in this document was developed in the course of NSAs Cybersecurity mission, including its responsi bilities to assist Executive departments and agencies with \noperations security programs.  \n\n \n \n U/OO/155603 -20 | PP-20-0535 | Aug 2020  2 \nNSA | Limiting Location Data Exposure  \nLocation can often be determined even if cellular is turned  off \nEven if cellular service is turned off on a mobile device, Wi -Fi and BT can be used to determine a users location. \nInconspicuous equipment (e.g., wireless sniffers) can determine signal strength and calculate location, even when the \nuser is not activ ely using the wireless services. Even if all wireless radios are disabled, numerous sensors on the device \nprovide sufficient data to calculate location. Disabling BT completely may not be possible on some devices, even when a \nsetting to disable BT exists. When communication is restored, saved information may be transmitted.  \nIf a mobile device has been compromised, the user may no longer be able to trust the setting indicators. Detecting \ncompromised mobile devices can be difficult or impossible; such devices  may store or transmit location data even when \nlocation settings or all wireless capabilities have been disabled.  \nThe risk isnt limited to mobile devices  \nAnything that sends and receives wireless signals has location risks similar to mobile devices. This includes, but is not \nlimited to , fitness trackers, smart watches, smart medical devices, Internet of Things (IoT) devices, and built -in vehicle \ncommunications. Personal and household smart devices (e.g. , light bulbs, cookware, thermostats, home security, e tc.) \noften contain wireless capabilities of which the user is unaware. Such IoT devices can be difficult to secure, most have no \nway to turn off wireless features, and little, if any, security built in. These security and privacy issues could result in t hese \ndevices collecting and exposing sensitive location information about all devices that have come into range of the IoT \ndevices [7]. Geolocation information contained in data automatically synced to cloud accounts could also present a risk of \nlocation dat a exposure if the accounts or the servers where the accounts are located are compromised.  \nApps and social media  \nApps, even when installed using the approved app store, may collect, aggregate, and transmit information that exposes a \nusers location. Many ap ps request permission for location and other resources that are not needed for the function of the \napp.  \nUsers with location concerns should be extremely careful about sharing information on social media. If errors occur in the \nprivacy settings on social media sites, information may be exposed to a wider audience than intended. Pictures posted on \nsocial media may have location data stored in hidden metadata. Even without explicit location data, pictures may reveal \nlocation information through picture conte nt [8].  \nMitigations  \nDifferent users accept different levels of risk regarding location tracking, but most users have some level of concern. The \nfollowing general mitigations can be used for those with location sensitivities:  \n Disable location services setti ngs on the device.  \n Disable radios when they are not actively in use: disable BT and turn off Wi -Fi if these capabilities are not needed. \nUse Airplane Mode when the device is not in use. Ensure BT and Wi -Fi are disabled when Airplane Mode is \nengaged.4 \n Apps should be given as few permissions as possible:  \n Set privacy settings to ensure apps are not using or sharing location data.  \n Avoid using apps related to location if possible, since these apps inherently expose user location data. If \nused, location privacy/p ermission settings for such apps should be set to either not allow location data usage \nor, at most, allow location data usage only while using the app. Examples of apps that relate to location are \nmaps, compasses, traffic apps, fitness apps, apps for findi ng local restaurants, and shopping apps.  \n Disable advertising permissions to the greatest extent possible : \n Set privacy settings to limit ad tracking, noting that these restrictions are at the vendors discretion.  \n Reset the advertising ID for the device on a  regular basis. At a minimum, this should be on a weekly basis.  \n                                            \n4 For iOS devices: Only use the Settings app to disable Wi -Fi/BT. Settings for these features in the control center may not work as expected.  \n\n \n \n U/OO/155603 -20 | PP-20-0535 | Aug 2020  3 \nNSA | Limiting Location Data Exposure  \n Turn off settings (typically known as FindMy or Find My Device settings) that allow a lost, stolen, or misplaced \ndevice to be tracked.  \n Minimize web -browsing on the device as much as possible, and set browser privacy/permission location settings to \nnot allow location data usage.  \n Use an anonymizing Virtual Private Network (VPN) to help obscure location.  \n Minimize the amount of data with location information that is stored in the cloud, if possible . \nIf it is critical that location is not revealed for a particular mission, consider the following recommendations:  \n Determine a non -sensitive location where devices with wireless capabilities can be secured prior to the start of any \nactivities. Ensure that  the mission site cannot be predicted from this location.  \n Leave all devices with any wireless capabilities (including personal devices) at this non -sensitive location. Turning \noff the device may not be sufficient if a device has been compromised.  \n For missi on transportation, use vehicles without built -in wireless communication capabilities, or turn off the \ncapabilities, if possible.  \nProtect data, protect privacy, protect the mission  \nWhile it may not always be possible to completely prevent the exposure of lo cation information, it is possible through  \ncareful configuration and use to reduce the amount of location data shared. Awareness of the ways in which such \ninformation is available is the first step.  \nWorks Cited  \n[1] Pai, Ajit, Status of the FCCs Investigation  into the Disclosure of Consumers Real -Time Location Data, Federal Communications \nCommission, 31 January 2020. [Online] Available  at: https://docs.fcc.gov/public/attachments/DOC -362222A1.pdf   \n[2] J. Dunn, Security weaknesses in 5G, 4G, and 3G could expose users locations. Sophos, 04 February 2020. [Online] Available  at: \nhttps://nakedsecurity.sophos.com/2019/02/04/security -weaknesses -in-5g-4g-and-3g-could -expose -users -locations/   \n[3] S. Lee, J. Lim, J. Park, K. Kim. Next Place Prediction Based on Spatiotemporal Pattern Mining of Mobile Device Logs. PubMed Central, US \nNational Library of Medicine, 23 January 2016. [Online] Available  at: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4801523   \n[4] Y. Cao, S. Li , E. Wijmans. (Cross -) Browser Fingerprinting via OS and Hardware Level Features. The Network and Distributed System \nSecurity Symposium, 27 February 2017. [Online] Available  at: https://www.ndss -symposium.org/ndss2017/ndss -2017 -programme/cross -\nbrowser -fingerprinting -os-and-hardware -level-features/   \n[5] Moz://a location service Overview. Mozilla, 2012 -2020. [ Online ] Available  at: https://location.services.mozilla.com   \n[6] A. Mosenia, X. Dai, P. Mittal, N. Jha. PinMe: Tracking a Smartphone User around the World. Cornell University, 05 February 2018. [Online] \nAvailable  at: https://arxiv.org/pdf/1802.01468.pdf  \n[7] FTC Staff Report, internet of things: Privacy & Security in a Connected World. Federal Trade Commission, 09 January 2015. [ Online] \nAvailable  at: https://www.ftc.gov/system/files/documents/reports/federal -trade -commission -staff-report -november -2013-workshop -entitled -\ninternet -things -privacy/150127iotrpt.pdf   \n[8] T. Weyand, I. Kostrikov, J. Philbin. PlaNet - Photo Geolocation with Convolutional Neural Networks. Cornell University, 17 February 2016. \n[Online] Available: https://arxiv.org/abs/1602.05314   \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process,  or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes . \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "csi_limiting_location_data_exposure_final",
  "source": "nsa",
  "id": "028c829a8cd2eda8634560427c52c6e7656b735c42b61216886d1a27550be2d9"
}