{
  "markdown": " TLP:CLEAR  \nPublication: June  6, 2023 \nDisclaimer: This document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information carries minimal or no \nforeseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright  rules,  TLP:CLEAR  \ninformation  may  be distributed  without  restriction.  For more  information  on the Traffic  Light  Protocol, see http://www.cisa.gov/tlp/. \nGUIDE TO  \nSECURING REMOTE \nACCESS SOFTWARE \n\n TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \n \nTABLE OF CONTENTS  \n \nOVE\nRVIEW: REMOTE ACCESS SOFTWARE .2 \nMALICIOUS USE OF REMOTE ACCESS SOFTWARE 3  \nASSOCIATED TTPS.. 4 \nDETECTION ..6 \nRECOMM ENDATIONS FOR ALL ORGANIZATIONS .6  \nRECOMMENDATIONS FOR MSP AND SAAS CUSTOMERS ...8  \nRECOMMENDATIONS FOR MSPS AND IT ADMINISTRATORS .8 \nRECOMMENDATIONS FOR DEVELOPERS OF  \nPRODUCTS WITH REMOTE ACCESS CAPABILITIES .. .....9  \nDISCLAIMER . .................10  \nACKNOWLEDGEMENTS . .............10  \nRESOURCES . ..................10  \nREFERENCES . .................10  \n\n2    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \n \nOVERVIEW:  REMOTE  ACCESS SOFTWARE  \nRemote  access  software  and tools  comprise a broad  array  of capabilities  used \nto maintain  and improve IT, operational  technology (OT),  and industrial  control \nsystems (ICS) services; they allow a proactive and flexible approach for \norganizations to remotely oversee networks, computers, and other devices.  \nRemote access software, including remote administration solutions and remote \nmonitoring and management (RMM), enables manag ed service providers \n(MSPs), software -as-a-service (SaaS) providers, IT help desks, and other  \nnetwork  administrators  to remotely  perform  several  functions,  including \ngathering data on network and device health, automating maintenance, PC \nsetup and configur ation, remote recovery and backup, and patch management.  \n \nRemote  access  software  enables  a user to connect  to and access  a \ncomputer, server, or network remotely.  \n  \n Remote administration solution is software  that grants \nnetwork  and application access  and administrative  control  to a \ndevice remotely.   \n \n Remote monitoring and management is an agent that is \ninstalled  on an endpoint  to continuously  monitor  a machine  or \nsystems health  and status,  as well as enabling  administration \nfunctions.   \n \nLegitimate use of remote access software enables efficiency within IT/OT management allowing  MSPs,  IT help desks,  and other providers to maintain \nmultiple networks or devices from a distance.  It also serves as a critical \ncomponent for many business environments, both small and large empowering IT, OT, and ICS professionals to troubleshoot issues and play a significant role  in business  continuity  plans  and disaster recovery  strategies.  \n[1]\n However,  many  of the beneficial  features of remote  access  software  make it \nan easy and powerful tool for malicious actors to leverage, thereby rendering these businesses vulnerable.  \nThis \n guide,  authored  by the  Cybersecurity and Infrastructure  Security Agency \n(CISA),  National  Security  Agency  (NSA),  Federal  Bureau  of Investigation  (FBI), \nMulti -State Information Sharing & Analysis Center (MS -ISAC), and Israel \nNational Cyber Directorate (INCD), with contributions from private sector \npartners listed on page 10,  provides an overview of common exploitations \nand associated tactics, techniques, and procedures (TTPs). It also includes recommendations to IT/ OT and ICS professionals and organizations on best practices for using remote capabilities and how to detect and defend against mali cious actors abusing this software.  \n\n3    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \n \nMALICIOUS  USE OF REMOTE  ACCESS SOFTWARE  \nRemote  access software  provides  IT/OT teams  with flexible ways  to detect anomalous  network  or device issues  \nearly  on and proactively monitor  systems.  Cyber  threat  actors are increasingly  co-opting  these  same tools for easy \nand broad access to victim systems.  While remote access software is used by organizations for legitimate \npurposes, its use is frequently not flagged as malicious by security tools or processes.  Malicious actors exploit this \nby using remote access software to establish network connections through c loud-hosted infrastructure while \nevading detection.  This type of intrusion falls into the category of living off the land (LOTL) attacks, where inherently \nmalicious files, codes, and scripts are unnecessary, and cyber  threat  actors use tools  already  presen t in the \nenvironment  to sustain  their  malicious  activity. For additional information and examples of LOTL attacks, see the \njoint Cybersecurity Advisory People's Republic of Chin a  State -Sponsored Cyber Actor Living off the Land to Evade \nDetection . \nRMM software in particular has significant capabilities to monitor or operate devices and systems as well as attain \nheightened permissions, making it an attractive tool for malicious actors to maintain persistence and move laterally on compromised networks.  This enables MSPs or IT help desks to monitor multiple devices and networks \nat once, however these same  features  also make  managing  multiple  intrusions  easier  for cyber  threat actors. In this \nway, remote access software has become a common, high -value instrument for cyber threat actors, especially \nransomware groups.  Small - and mid -sized businesses rely on MSPs and the use of various types of remote access \nsoftware to supple ment their own IT, OT, and ICS infrastructures, and scale network environments without  having  \nto develop those capabilities internally.  This makes businesses that  much more  vulnerable  to service provider \nsupply  chain  compromises, exploitation, or malicious use  of remote capabilities.  \nRemote  access software  is particularly appealing  to threat  actors  because  the software:  \n D\noes not always trigger security tools. Remote access software is often used for legitimate purposes, so it \ngenerally blends into the environment and does not trigger antivirus (AV), antimalware,  or endpoint  \ndetection  and response  (EDR)  defenses.  RMM software  is signed  with valid code signing certificates issued \nby trusted certificate authorities, meaning that it will not appear  inherently  suspicious to AVs and EDRs.  \nOften  RMM install  paths  are excluded  from  EDR inspection.  \n D\noes not require extensive capabilities development. Remote access software enables cyber threat  \nactors to avoid  using  or developing  custom  malware,  such  as remote  access  trojans  (RATs). The way remote  \naccess products are legitimately  used  by network  administrators  is similar  to how malicious RATs are used \nby threat actors. [2] \n Ma y  allow  actors  to bypass  software  management  control  policies.  While  a bypass  or exclusion can be \nrequired, remote access software also can be downloaded as self -contained, portable executables  that \nenable  actors to bypass  both  administrative  privilege  requirements  and software management control \npolicies.  \nN\note: Portable executables launch within the users context without installation. Additionally, because  \nthe use of portable  executables often  does  not require  administrator  privileges,  they can allow \nexecution of  other unapproved software, even if risk management controls may be in place to audit or \nblock the same softwares installation on the network. Threat actors can leverage a portable executable with local user rights to a ttack other vulnerable machines within the local intranet or \nestablish long -term persistent access as a local user service.  \n C\nould allow actors to bypass firewall rules. In addition to bypassing software management controls,  many  \nremote  management  agents  use end-to-end encryption. This could  allow  a threat actor to download files that \nwould typically be detected and blocked at the firewall.  \n C\nan facilitate  multiple cyber intrusions . Remote access software enables threat  actors to manage multiple \nintrusions at  once.  In addition, initial  access brokers may sell  network  access to many different  \ncybercriminals, enabling  multiple  intrusions  to the same  network,  as well as expanding  the reach and ability  \nof these  cyber  threat  actors. If these actors first compromise  an MSP,  they could gain access to a large \n\n4    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \nnumber of the affected MSPs customers networks and data.  \n \n \nASSOCIATED  TTPS  \nCyber threat actors use remote access software for initial access, maintaining persistence, deploying addit ional  \nsoftware  and tools,  lateral  movement,  and data  exfiltration.  As such,  remote  access  software  and RMM in \nparticularis often used by cybercriminals in ransomware incidents, and in certain APT campaigns. For an example \nof APT usage, see the joint Cybersecurity Advisory Iranian Government - Sponsored Actors Conduct Cyber  \nOperations Agai nst Global Government and Commercial Networks  \nBefore leveraging remote access software as part of an intrusion, cyber actors may exploit vulnerable software. This may include exploiting legitimate servers that  are then leveraged for malicious purposes. It may also include \ngeneral network exploitation activities such as installing or placing remote access client software for persistence.  \nThreat actors may also obtain legitimate, compromised remote access software credentials that ultimately enab le \nthem to exercise control over remote endpoints associated with the compromised account.  Once initial access is \nobtained threat actors often use PowerShell or similar  command  line tools  to silently  deploy  the RMM  agent.  Often,  \nthreat  actors leverage multiple  RMM mechanisms at once.  Sometimes malicious actors also use RMM software in \nconcert with commercial penetration testing tools such as Cobalt Strike or remote access malware to enable multiple, often redundant, forms of access to ensure pe rsistence.  \nThreat actors use remote access software to perform multiple functions and carry out several commonly \nassociated TTPs (e.g  . credential dumps and escalating privileges.) See Table 1 for common tactics and techniques \nmapped to the MITRE ATT&CK for Enterprise  framework, version 13.  N\n ote: For assistance with  mapping  threat  \nactivity  to the MITRE  ATT&CK  framework, see CISAs  Best  Practices for MITRE  ATT&CK  Mapping Guide  and Decider  \nTool. MI TRE also provides  tactics  and techniques  specific to ICS, which  can be found in the ICS Matrix . \n \nTable  1: Common  Threat  Actor  MITRE  ATT&CK  Tactics  and Techniques  \nRESOURCE  DEVELOPMENT  \nTechnique  Title  ID Use \nObtain  Capabilities: \nTool T1588 .002  Threat  actors  can obtain  software  capabilities  by buying,  stealing,  or \ndownloading tools and using them for capabilities other than their intended \nuse. \nINITIAL  ACCESS  \nTechnique  Title  ID Use \nExternal  Remote \nServices  T1133  Threat  actors  exploit  externally -facing  remote  services,  such  as virtual \nprivate networks (VPNs), to enable initial access and persistence into a \nnetwork from remote locations.  \nSupply  Chain \nCompromise  T1195  Threat  actors  manipulate  legitimate  RMM software  with modified versions.  \nPhishing  T1566  Threat actors have used phishing campaigns to lead victims to download  \nlegitimate  RMM software.  For more  information,  see the joint Cybersecurity \nAdvisory Protecting Against Malicious Use of  Remote Monitoring and \nManagement Software . \nValid  \nAccounts  T1078  Threat  actors  may exploit  vulnerable  versions  of remote  access software or \nuse legitimate, compromised credentials.  \nTrusted  \nRelationship  T1199  Threat  actors  may leverage  third  party  relationships  to gain initial access to \nintended victims.  \n\n5    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \n \nEXECUTION  \nTechnique  Title  ID Use \nCommand and \nScripting  Interpreter: \nPowerShell   \nT1059 .001  Threat  actors  may use PowerShell to silently  deploy  remote  access \nsoftware.  Industry has observed PowerShell being used to install RMM \nitself.  \nDEFENSE  EVASION  \nTechnique  Title  ID Use \nMasquerading  T1036  Industry  has observed  cyber threat  actors  renaming a NetSupport binary to \nctfmon.exe.[2]  \nDISCOVERY  \nTechnique  Title  ID Use \nRemote  System \nDiscovery   \nT1018  Remote access software may allow threat actors to find lists of other  \nsystems on a network  that may be used  for lateral  movement from the \ncurrent system.  \nLATERAL  MOVEMENT  \nTechnique  Title  ID Use \nRemote Service Session  Hijacking  T1563  Threat  actors  may exploit  existing  remote  services  to move  laterally \nthroughout a network.  \nRemote  Services  T1021  Threat  actors  may exploit  valid  accounts  to log into a network  or service \ndesigned to accept remote connections.  \nExploitation  of Remote \nServices   \nT1210  Threat actors may exploit remote services to gain unauthorized access to \ninternal systems to move  laterally  throughout  a network.  \nCOMMAND  AND CONTROL  \nTechnique  Title  ID Use \nRemote  Access \nSoftware  T1219  Threat  actors  may establish  command  and control channels  using \nlegitimate remote access software.  \n\n6    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \n \nDETECTION  \nNetwork  administrators  and defenders  should  first establish  a security  baseline  of normal  network  activity; in other \nwords, it is critical for network defenders to be thoroughly familiar with a softwares baseline behavior in order to \nrecognize abnormal behavior and detect anomalous and malicious use.  Network defenders should correlate \ndetected activity with other suspicious behavior to reduce false positives.  \nThe authoring agencies recommend that organizations monitor for unauthorized use of remote access software  \nusing  EDR tools.  Remote access  software  cyber  threat  actors may leverage  includes, among others, the following:  \n \n ConnectWise Control  (formerly  ScreenConnect)   Pulseway  \n A nydesk   RemotePC  \n R emote Utilities   Kaseya  \n N etSupport  GoToMyPC  \n Sp lashtop   N-Able \n Ate\nra  Bomgar  \n T\neamViewer   Zoho  Assist  \n LogMeIn   \nRemote access software geared toward OT networks includes, among others, the following:  \n BeyondTrust (Bomgar)   Claroty  \n P CAnywhere   Xage  \n XO NA Systems   Zscaler  \n \nR\nEPORTING  \nU.S. organizations: To report suspicious or criminal activity related to information found in this joint guidance, co\nntact your local FBI field office at fbi.gov/contact-us/field -offices  or report the incident to the FBI Internet \nCrime Complaint Center (IC 3) at ic3.gov . When available, please include the following information regarding the \nincident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activ ity; the name of the submitting company or organization; and a designated point of contact.  To \nrequest incident response resources or technical  assistance related  to these  threats,  contact  CISA  at \nReport@cisa.dhs.gov . Fo\n r NSA cybersecurity report feedback, contact CybersecurityReports@nsa.gov . SLTT \norganizations should report incidents to MS -ISAC (866 -787-4722 or SOC@cisecurity.org ). \nIsraeli organizations:  Contact the CERT -IL center hotline for cyber incident handling by calling 119, 24 hours a day, or via \ne-mail at 119@cyber.gov.il , or via encrypted e - mail download pgp key. To contact the International Operative Liaison for \nCERT -to-CERT engagement, email International@cyber.gov.i l. \n \nRECOMMENDATIONS FOR ALL ORGANIZATIONS  \nThe authoring agencies recommend that organizations, specifically MSPs who leverage this software t o conduct \nregular business, implement the mitigations below to defend against malicious use of remote access software.  \nNote : These mitigations align with the Cross -Sector Cybersecurity Performance Goals (CPGs) developed by CISA \nand the National Institute o f Standards and Technology (NIST).  The CPGs provide a minimum set of practices and \nprotections that CISA and NIST recommend all organizations implement. CISA  and NIST  based  the CPGs  on existing \ncybersecurity frameworks and guidance  to protect against the most common and impactful threats, tactics, \ntechniques, and procedures.  Visit CISAs  Cross -Sector Cybersecurity Performance Goals  for more information on \nthe CPGs, including additional recommended  baseline  protections. For additional  information,  see the related  joint \n\n7    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \nCybersecurity Advisory, Protecting Against Malicious Use of Remote Monitoring and Management Software . \nARCHITECTURE,  ACCOUNTS,  AND  POLICY  RECOMMENDATIONS  \n M aintain  a robust  risk management  strategy  based  on common  standards,  such  as the N ational  \nInstitute of Standards and Technology Cybersecurity Framework . \n W hen  possible,  employ  zero trust solutions or least -privilege -use configuration which  can be \nendpoint - or identity -based.  \n Im\nplement a user training  program  and phishing  exercises to raise  users  awareness  of the risks \nof visiting suspicious websites, clicking on suspicious links, and opening suspicious attachments \n[C\nPG 2  .I]. \nSee CISAs  Enhance  Email  & Web  Security . \n W ork with a security  operations  center  (SOC)  team  that can assist  with monitoring systems [ C PG 1 .B]. \n Au dit  Active  Directory for inactive  and obsolete  accounts  or misconfigurations.  \n E\nnable  just-in-time  access  and/or  two-factor  authentication  based  on the level  of risks.  \n U\nse safeguards for mass scripting and a script approval process. For example, if an account attempts  to \npush  commands  to 10 or more  devices  within  an hour,  retrigger  security  protocols,  such as multifactor \nauthentication (MFA), to ensure the source is legitimate \n[3] \n Us e  a software  bill of materials  (SBOM)  to maintain  an inventory  of components  within  a software \nproduct. For more information on SBOM, see CISAs S\noftware Bill of Materials (SBOM) | CISA . \n L everage external attack surface management (EASM) to enhance visibility across systems and \ninfrastructures. EASM provides continuous monitoring to determine unknown assets, provide information  \nabout  systems,  and aid in compliance by identifying non-compliant technology,  missing legal disclaimers, \nand expired copyright notices.  \n \nHOST -BASED  CONTROLS  \n Au dit  remote  access  software  and their  configurations  on devices  on your network  to identify \ncurrently used and/or authorized RMM software [ C\nPG 1  .A]. \n Us e  security  software  to detect  instances of RMM software  only being  loaded  in memory.  \n R\neview  logs with complete data,  including  executing  binary,  request  types,  IP addresses,  and date/ time, \nfor execution of remote access software to detect abnormal use of programs running as a portable \nexecutable \n[CPG 2 .T ]. \n Im plement application controls, including zero-trust principles and segmentation, to manage and control  \nexecution  of software,  including allowlisting  RMM programs and limiting actions  the software can take [ CPG \n2 .Q]. \n Es tablish  a regular  frequency for patching,  prioritizing software  and systems  that directly access  or are \naccessed from the Internet, including remote access and management servers and agents.  \n \nNETWORK -BASED  CONTROLS  \n Im plement network  segmentation  to minimize  lateral  movement  and restrict access to devices,  data, and \napplications \n[CPG 2 .F ]. \nSee CISAs  Layering  Network  Security  Through  Segmentation . \n B lock  both  inbound  and outbound  connections  on common  RMM ports and protocols  at the network \n\n8    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \nperimeter and enforce only legitimate use of the tools employing those ports.  Remote access software  \nshould  have local  instances in the  environment  and avoid operating over  HTTPS  port 443.  \n R\nequire  authorized  RMM solutions  only be  used  from  within  your network  over approved remote access \nsolutions, such as VPNs or virtual desktop interfaces (VDIs) [C\nPG 2 .F]. \n E nable  a web application  firewall  (WAF)  to protect remote  access software  by filtering  and \nmonitoring HTTP traffic [ C\nPG 2 .K ]. \nWhile  this mitigation  is valuable,  the authoring  agencies  recommend  IT administrators  test before \ndeploying in a production environment, WAFs have been known to disrupt normal operation of \nremote access tools.  \n \n \nRECOMMENDATIONS FOR MSP  AND SAAS CUSTOMERS  \nThe authoring  agencies  recommend  MSP  and SaaS  customers:  \n E\nnsure that the y have a thorough understanding of the security services their administrators are \nproviding via the contractual  arrangement  and address  any security requirements that fall outside the \nscope of the contract.  Note: Contracts should detail how and when MSPs and other providers notify the \ncustomer of an incident affecting the customers environment.  \n E\nnable  effective  monitoring  and logging of their  systems.  If customers choose  to engage  an MSP or \nSaaS provider to perform monitoring and logging, they should ensure that their contractual \narrangements require their providers to [\nCPGs 1  .I, 1 .G, 1 .H]: \nImplement comprehensive  security  event  management  that enables  appropriate monitoring and \nlogging of provider -managed customer system s. \nProvide visibility as specified in the contractual arrangement to customers of logging activities,  \nincluding  providers presence, activities,  and connections  to the customer  networks Note: Customers \nshould ensure that MSP accounts are properly monitored  and audited.  \n N\notify MSP  of confirmed  or suspected  security events and incidents  occurring on the providers \ninfrastructure and administrative networks and send these to a SOC for analysis and triage.  \n K\neep direct access  to log servers and the ability  to delete or alter  logsout of reach  of RMM  tools.  \n \n \nRECOMMENDATIONS FOR MSPS  AND IT ADMINISTRATORS  \nMSPs and  other IT administrators provide services that  usually require both trusted network connectivity and  \nprivileged  access or special access beyond  that of a standard  user-- to and from  customer  systems. Many \norganizations ranging from large critical infrastructure organizations to small- and mid -sized businesses use \nMSPs  to manage  information  and communications  technology  (ICT)  systems,  store  data, or support sensitive \nprocesses.  Many organizations make use of MSPs to scale and support network environments and processes \nwithout expanding their internal staff or having to develop the capabilities internally.  \nRecommended  mitigation s for initial compromise attack  methods  include:  \n I\nmproving  the security  of vulnerable  devices  and hardening  appliances to vendor  best practices. For more \ninformation, see the joint Cybersecurity Information Sheet \nSelecting and Hardening Remote  Access VPN \nSolutions . \n\n9    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \n Ad opting of MFA across all customer services and products [CPG 2  .H]. Note: MSPs should also \nimplement  MFA on all accounts  that have  access to customer  environments  and should  treat  those \naccounts as privileged.  \n C onfiguring  reduced  privilege RMM tools  for common  uses,  like read -only  monitoring.  \n M\nanaging  internal  architecture  risks  and segregating internal  networks  [CP\nG 2 .F]. \n W hile zero trust is the ultimate goal, segregating customer data sets (and services, where applicable) \nfrom  each  other as well as from  internal  company  networks can limit the impact  of a single  vector  of \nattack  [\nCPG 2 .F]. \nDo not reuse  admin  credentials across  multiple  customers [CPG 2 .E, 2 .C]. \n Av oid  using  end-of-life (EOL)  software.  \nA\ndditionally, when negotiating the terms of a contract with customers, providers should give clear explanations  of the \nservices the customer  is purchasing, services the customer  is not purchasing, and all contingencies for incident \nresponse and recovery [CPG 1  .G, 1  .H]. \n \n \nRECOMMENDATIONS FOR DEVELOPERS OF PRODUCTS WITH \nREMOTE ACCESS CAPABILITIES         \nThe authors  recommend  providers ensure their products: \n In\nclude lower  privilege  versions and avoid  executive/administrative privileges.  For example,  develop read -\nonly monitoring capabilities where certain accounts can only view information from a system, but cannot \nimplement changes to a system.  \n M\nonitor  their  software  and terms  of service violations  by cyber  threat  actors engaging  in computer \nnetwork  intrusions;  in particular, free trial versions are often  abused  by cybercriminal  threat  actors.  \n Pr\novide  audits  and logs that are difficult  to delete and remove. \nAdditionally, the authoring agencies recommend developers:  \n I\nncorporate threat modeling into their development processes to identify potential vulnerabilities. During  \ndevelopment,  promote fuzzing  of command -line interface (CLI)  commands  and open  network interfaces to \ndetect vulnerabilities.  \n Ma\np practices  to the S\necure Software  Development  Framework  (SSDF) , wh ich  can assist  in aligning products \nwith sound  and secure fundamentals, and in turn, help reduce potential vulnerabilities as well as the \npossible impact of undetected exploitation.  \n Us e  advanced  monitoring  and incident  response capabilities,  which  help to operationalize  OT/ ICS threat \ndetection and response for cybersecurity teams lacking expertise/infrastructure or budget to deploy full on-prem OT -specific cyber threat monitoring and management programs.  \nFor mo\nre information  for developers and manufacturers  on building security  principles into their  products, see  the \njoint guidance  Shifting the Balance of  Cybersecurity Risk: Principles  and Approaches for  Security - by-D esign and -\nDefault . \n\n10    CISA  | NSA | FBI | MS-ISAC  | INCD   TLP:CLEAR  \n TLP:CLEAR   \n GUIDE TO SECURING REMOTE ACCESS SOFTWARE  \n \nDISCLAIMER  \nThe information in this report is being provided as is for informational purposes only. CISA, NSA, FBI, MS-ISAC,  \nand INCD do not  endorse  any commercial  product or service,  including  any subjects  of analysis. Any reference to \nspecific commercial entities or commercial products, processes, or services by service mark, trademark, \nmanufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoritism by CISA, NSA, FBI, MS -ISAC, and INCD.  \n \n \nACKNOWLEDGEMENTS  \nCNWR,  ConnectWise, Corporate  Information  Technologies,  Google,  Honeywell,  Huntress,  (ISC)  Inc., N-Able,  Tenable,  and \nVMware contributed to this guidance.  \n \n \nRESOURCES  \n CISAs Cross -Sector  Cybersecurity  Performance Goals  \n CISA  Strategic  Plan 2023 -2025  \n Protecting Against  Malicious  Use of Remote  Monitoring  and Management  Software  | CISA \n Joint  CSA Protecting Against  Cyber  Threats  to Managed  Service Providers  and their  Customers  \n CISA  Insights  Mitigations  and Hardening  Guidance  for MSPs  and Small - and Mid-sized  Businesses  \n Protecting  Against  Cyber  Threats  to Managed  Service Providers  and their  Customers  | CISA \n Joint Guidance Shifting the Balance of Cybersecurity Risk: Principles and Approaches for Security -by-\nDesign and -Default   \n People's Republic of China State-Sponsored Cyber Actor Living off the Land to Evade Detection  \n What  is RMM (connectwise.com)  \n What  Is Remote  Monitoring  and Management  (RMM)?  (intel  .com)  \n Remote  monitoring  and management  abuse  - Threat  Detection  Report (redcanary  .com)  \n \n \n \nREFERENCES  \n[1] https://www  .ninjaone  .com/blog/what -is-remote -access -software -guide -2023/  \n[2] Remote  access  tool or trojan?  How to detect  misbehaving  RATs  (redcanary  .com)  \n[3] https://level  .io/blog/how -to-secure- rmms  \n \n\n",
  "cves": [],
  "techniques": [
    "T1078",
    "T1036",
    "T1566",
    "T1563",
    "T1219",
    "T1133",
    "T1059",
    "T1021",
    "T1195",
    "T1588",
    "T1018",
    "T1210",
    "T1199"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "csiguide-to-securing-remote-access-software",
  "source": "nsa",
  "id": "82059573bb0796a87417e41632481fca58c5f4966949151be9211fca2463b815"
}