{
  "markdown": " \n \n 1 \nNATIONAL SECURITY AGENCY\n  \nCYBERSECURITY REPORT\n  \n \n \n \n \n \n \nWPA3 WILL ENHANCE WI -FI SECURITY   \n \n \n \n \n \n                                           \n  \n A TECH NICAL REPORT FROM \nTHE NETWORK DEVICE \nVULNERABILITY SOLUTI ONS \nSECTION  \nU/OO/173671 -18      PP -18-0470 \nJune 2018  \n \n\n \n \n2 U/OO/173671 -18          PP -18-0470          June 2018  \n \nNSA CYBERSECURITY  REPORT\n  \n DOCUMENT CHANGE HIST ORY \n \n     \n 25 May 2018  1 Original version   \n     \n     \n     \n     \n     \n     \n  \n \nDISCLAIMER OF WARREN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided as is and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not necessarily constitute or imply its endorsement, recommendation, or favoring by the United States \nGovernment. The views and opinions of authors expressed herein do not necessarily state or reflect those of the \nUnited States Government, and shall not be  used for advertising or product endorsement purposes.  \n \n  \n\n \n \n3 U/OO/173671 -18          PP -18-0470          June 2018  \n \nNSA CYBERSECURITY  REPORT\n  \nWPA3 WILL ENHANCE WI -FI SECUR ITY  \n \n \n \n \n \n \n \n \n \n \n \n \n \nCONTACT INFORMATION  \nClient Requirements and Inquiries or General Cybersecurity Inquiries  \nCYBERSECU RITY REQUIREMENTS CENTER  (CRC)  \n410-854-4200 \nCybersecurity_Requests@nsa.gov  \n \n \n \n  \n\n \n \n4 U/OO/173671 -18          PP -18-0470          June 2018  \n \nNSA CYBERSECURITY  REPORT\n  \nTable of Contents  \n \nWPA3 Will enhance wi -fi security  ................................ ................................ ................................ ...................  1 \nA TECHNICAL REPORT FROM The Network Device vulnerability solutions section  .............................  1 \nDOCUMENT CHANGE HISTORY  ................................ ................................ ................................ .................  2 \nDISCLAIMER OF WARRENTIES AND ENDORSEMENT  ................................ ................................ .............  2 \nWPA3 Will Enhance Wi -Fi Security  ................................ ................................ ................................ ................  3 \nContact information  ................................ ................................ ................................ ................................ ..... 3 \n1. INTRODUCTION  ................................ ................................ ................................ ................................ .... 5 \n2. WPA2 Enhanced features  ................................ ................................ ................................ .....................  5 \n3. New features introduced with wpa3  ................................ ................................ ................................ .... 6 \n4. CONCLUSION  ................................ ................................ ................................ ................................ ........  7 \n5. Appendix A  Historical Comparison of encryption and authentication types used in wi -fi ...........  8 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n5 U/OO/173671 -18          PP -18-0470          June 2018  \n \nNSA CYBERSECURITY  REPORT\n  \n1. INTRODUCTION  \n \nOn January 8th 2018, the Wi -Fi alliance announced new enhancements to Wi -Fi Protected Access II \n(WPA2) security specification and a new WPA3 security specification. Enhancements to WPA2 will \ninclude improvements in authentication, encryption, and configura tion requirements. WPA3 will build on \nthe WPA2 enhancements and will offer enhanced protection for Wi -Fi networks that use password -\nbased authentication, improved privacy on open networks, mitigations against denial -of-service attacks, \nand will deliver str onger cryptographic strengths that comply with Commercial National Security \nAlgorithm (CNSA) requirements. WPA3 will also introduce a mechanism to provision Internet of Things \n(IoT) devices without or a limited user interface into the trusted network.  WPA 2 enhancements will be \nimplemented before the end of 2018. WPA3 testing started in March 2018 and compliant products are \nexpected to start appearing in commercial devices later in 2018. Over the next few years it is expected \nthat WPA3 capable Access Points  will be backward compatible with WPA2 client devices until WPA2 is \nphased out. The combination of WPA2 Enhancements and the introduction of WPA3 will improve Wi -Fi \nsecurity.  \n2. WPA2 ENHANCED FEATUR ES \n \nThe WPA2 enhancements will introduce new requirements fo r protection from traffic -based Denial of \nService (DoS) attacks, vulnerabilities introduced by bad security implementations and interoperability \nproblems. The WPA2 enhancements include mandatory use of Protected Management Frames (PMF), \nmore stringent vali dation of vendor security implementations, and improved consistency in network \nsecurity configuration. These enhancements are important, as it will take a number of years for WPA3 \nto become commonplace.  \n \nIEEE 802.11w, the standard that describes PMF, was ratified in 2009 and has been broadly adopted in \nWi-Fi devices but will be mandatory in WPA2 enhanced. Management frames are used for initiating and \nterminating Wi -Fi connections. Without PMF, management f rames are transmitted unencrypted and \ntheir integrity is not verified. PMF ensures integrity of network management traffic. It provides  protection \nagainst  eavesdropping, replay and forging of management action frames. This protects against traffic -\nbased Do S attacks that use forged deauthentication/disassociation frames to kick clients from a \nnetwork and force them to authenticate again, a tactic which is used at the initial stage of some wireless \nattacks.  \n \n \n\n \n \n6 U/OO/173671 -18          PP -18-0470          June 2018  \n \nNSA CYBERSECURITY  REPORT\n  \nThe 2018 update to WPA2 will require enhanced validation of vendor security implementations to \nreduce the potential for vulnerabilities due to network misconfiguration. Many wireless vulnerabi lities \nare the result of poor implementation or misconfiguration, with misconfiguration being the most \ncommon cause. WPA2 enhancements will require additional tests on Wi -Fi certified devices to ensure \nimplementation of best practices and the products yiel d expected behaviors.   \n \nThe last WPA2 enhancement strives for better consistency in network security configuration by defining \na set of secure cipher suites. The cipher suites ensure that all security components are of similar \ncryptographic strength. This will prevent an attacker from exploiting a configuration weakness.  \n3. NEW FEATURES INTRODUC ED WITH WPA3  \n \nWPA3 will introduce several Wi -Fi security enhancements, including stronger cryptographic suites that \nalign with CNSA requirements. WPA3 will also allow for individualized user encryption on public (Open) \nnetworks, and defend against dictionary/brute force password attacks on networks that rely on \npassword based authentication. Along with WPA3, the Wi -Fi Alliance is also introducing a new on -\nboarding metho d intended to provision IoT  headless devices, devices that have a limited or no user \ninterface, in a simple and secure manner.  \n \nWi-Fi devices have utilized AES with 128 bit keys for data protection for some time. Refer to Table 1 in \nAppendix A for a hist orical comparison of wireless security standards. WPA3 will mandate 256 -bit \nencryption and use of CNSA approved cipher suites, including a set of compliant TLS cipher suites for \nEAP-TLS. Overall this would provide 192 -bit security for Wi -Fi networks. Due t o the number of available \nconfiguration options for WPA -Enterprise (e.g. key exchange, key strength, authentication and \nencryption), a clear set of requirements will improve the security of Wi -Fi deployments and ensure \nCNSA compliance.  \n \nWPA3 will introduce  Opportunistic Wireless Encryption (OWE), which will replace unencrypted Open \nnetworks. OWE will provide individualized data encryption to users connecting to public open networks \nto protect against eavesdropping. On Open networks, an attacker connected to  the network could read \nor even modify others traffic. HTTPS websites, to an extent, provide protection against eavesdropping \non an Open network.  OWE uses an unauthenticated Diffie -Hellman key exchange during association, \nresulting in a Pairwise Master K ey (PMK) used to derive the session keys. There is no provisioning \nrequired and the encryption process is entirely transparent to users. The users would see and join the \nWi-Fi network as they would an Open network. OWE is a big improvement over current ope n wireless \nnetworks.  \n\n \n \n7 U/OO/173671 -18          PP -18-0470          June 2018  \n \nNSA CYBERSECURITY  REPORT\n  \nIn WPA3, a more resilient password -based authentication mechanism will replace Pre -Shared Key \n(PSK) mode. The new authentication method, Simultaneous Authentication of Equals (SAE), will \nprotect against both active and passive brute force attacks that try to recover the password or the \nderived cryptographic keys even when weak passwords are chosen. WPA2 -PSK is susceptible to these \ntypes of attacks. SAE will also limit the number of guesses an attacker can make. Currently they can \nguess at the rate of 400,00 0 possible passwords per second.  The user experience will not change with \nSAE, as users will enter a password as they would with WPA2 -PSK, but will be afforded additional \nsecurity.  \n \nFinally, along with WPA3 the Wi -Fi Alliance will launch the Device Provi sioning Protocol (DPP). DPP \nwill work alongside WPA3 similarly to how WPS worked alongside WPA2. DPP will introduce a simple \nway to onboard headless IoT devices into the network, which will make provisioning of these devices \nmore manageable and user frie ndly. Two devices will be involved with this process, the configurator \nand the enrollee. The configurator is typically a smart phone or tablet that is already part of the trusted \nnetwork and can provision new devices. The enrollee will be authenticated and  provisioned into the \nnetwork through an initial bootstrapping process. The bootstrapping process is done through the \nfollowing methods: scanning a QR code, negotiation of a trusted public key using a passphrase/code, \nNFC, or Bluetooth. DPP will allow for mutual authentication.  \n4. CONCLUSION  \n \nWhile WPA3 is expected to emerge at the end of 2018, full adoption will take a few years. According to \nthe Wi -Fi Alliance, Wi -Fi Certified WPA3 capable devices will remain backward compatible with WPA2  \nfor some time . The security enhancements in WPA2 will improve overall Wi -Fi security by addressing \nsome of the immediate concerns regarding Wi -Fi security, resilience against DoS attacks, validation of \nWi-Fi security implementations and consistency in security configur ations. When WPA3 is adopted, the \nsecurity improvements will allow Wi -Fi deployments requiring high security to comply with CNSA \nrequirements as well as provide additional security to home and small business Wi -Fi users.  \n \n \n \n \n \n\n \n \n8 U/OO/173671 -18          PP -18-0470          June 2018  \n \nNSA CYBERSECURITY  REPORT\n  \n5. APPENDIX  A  HISTORICAL  COMPARISON OF ENCRYP TION AND \nAUTHENTICATION TYPES USED IN WI -FI \n \nStandard  WEP  WPA  WPA2  WPA3  \nRelease  1997  2003  2004  2018  \nEncryption  RC4  TKIP with \nRC4 AES-\nCCMP  AES-CCMP & \nAES-GCMP  \nKey Size(s)  64-bit and \n128 128-bit 128-bit 128 and 256 \nbit  \nCipher Type  Stream  Stream  Block  Block  \nAuthentication  Open \nSystem & \nShared \nKey Pre-\nShared \nKey (PSK) \n& 802.1x \nwith EAP \nvariant  Pre-\nShared \nKey (PSK) \n& 802.1x \nwith EAP \nvariant  Simultaneous \nAuthentication \nof Equals \n(SAE) & \n802.1x with \nEAP variant  \n \n \n \n \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "ctr-cybersecurity-technical-report-wpa3",
  "source": "nsa",
  "id": "a413ec9b763d233a6b4d36214f746a0f6d813ab294e8ac6fadd29a0f3d2b2881"
}