{
  "markdown": " \n \n \n \nNational Security Agency  \nCybersecurity  Technical Report  \n \n \n \n \n \nRecommendations for Configuring  \nAdobe Acrobat Reader DC in a  \nWindows Environment  \n \n \n \n \n \n \n \nJAN 2022  \n \nU/OO/104771 -22 \nPP-22-0042  \nVersion 2.0  \n \n \n \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  ii \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nNotices and history   \nDocument change history  \nDate  Version  Description  \nDecember  2015  1.0 Initial Release  \nJanuary 2022  2.0 Revised Version  \nDisclaimer of warranties and endorsement  \nThe information and opinions containe d in this document are provided \"as is\" and without any warranties \nor guarantees. Reference herein to any specific commercial products, process, or service by trade name, \ntrademark, manufacturer, or otherwise, does not necessarily constitute or imply its e ndorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for \nadvertising or product endorsement purposes.  \nTrademark recognition  \nAdobe Acrobat, Reader , and Adobe PDF are registered trademarks of Adobe Sys tems Incorporated.   \nMicrosoft, Windows,  Outlook,  Office, and SharePoint  are registered trademark s of Microsoft Corporation . \nPublication information  \nAuthor(s)   \nNational Security Agency  \nCybersecurity Directorate  \nEndpoint Security  \nContact information  \nClient Requirements / General Cybersecurity Inquiries:  \nCybersecurity Requirements Center, 410 -854-4200, Cybersecurity_Requests@nsa.gov  \n \nMedia inquiries / Press Desk:  \nMedia Relations, 443-634-0721, MediaRelations@nsa.gov   \n \nDefense Industrial Base Inquiries / Cybersecurity S ervices:  \nDIB Cybersecurity Program, DIB_Defense@cyber.nsa.gov   \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions . This  includ es its \nresponsibilities to identify and disseminate threats to National Security Systems, Department of Defense \ninformation systems, and the Defense Industrial Base, and to develop an d issue cybersecurity \nspecifications and mitigations. This information may be shared broadly to reach all appropriate \nstakeholders.   \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  iii \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nExecutive summary  \nMalicious cyber actors have a long and well -documented history of targeting users \n(including Department  of Defense and National Security Systems) using malicious \nPortable Document Files (PDFs) . However, modern security features for sandboxing \nand access control can help constrain what malicious PDFs can do, and can be rolled \nout en masse, limiting this common  access vector at scale.  \nThis configuration guide  provides recommendations  on configuring Adobe  Acrobat \nReader DC in a Windows environment. Administrators operating in a typical \nenvironment where Acrobat Reader is used solely for viewing PDF documents m ay use  \nthe Appendix: Configuring Settings for Adobes Acrobat Reader DC  as a quick guide to \nconfigur e the Adobe Customization Wizard  with the recommendations suited to their \nenvironment.  \nThe recommendations flagged in the Appendix as always are sufficient for most \nenvironments and are suitable for security compliance checklists. In some situations, \nhowever, users may utilize features  of Adobes Acrobat Reader requiring scripting or \ndata sharing. In these cases, administrators should carefully review this configuration \nguide  to select configuration options  that will have minimal impact on usability while \nproviding the most protection.  \nAll administrators should understand the implications of the new cloud features and \nreview Section 3.4: Document Cloud interaction  for guidelines on configuring them or \ndisabling them a s required for the environment.  \n  \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  iv \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nContents  \nExecutive summary  ................................ ................................ ................................ ...................... iii \n1. Introduction  ................................ ................................ ................................ ............................  1 \n2. Environment -agnostic settings  ................................ ................................ ...........................  2 \n2.1. The sandbox  ................................ ................................ ................................ ................................ ...................  2 \n2.1.1.  Protected Mode  ................................ ................................ ................................ ................................ .... 2 \n2.1.2.  Prote cted View  ................................ ................................ ................................ ................................ ..... 3 \n2.1.3.  AppContainer  ................................ ................................ ................................ ................................ ........ 4 \n2.2. Enhanced security and FeatureLockDown  ................................ ................................ ........................  4 \n2.3. Privileged locations  ................................ ................................ ................................ ................................ ...... 5 \n2.4. Attachments  ................................ ................................ ................................ ................................ ....................  6 \n3. Tailored settings  ................................ ................................ ................................ ....................  7 \n3.1. Internet access from a document via hyperlink  ................................ ................................ ................  8 \n3.2. JavaScript  ................................ ................................ ................................ ................................ ........................  8 \n3.3. Internet access from the Reader application ................................ ................................ ...................  10 \n3.4. Document Cloud interaction  ................................ ................................ ................................ ...................  11 \n3.5. Other settings  ................................ ................................ ................................ ................................ ...............  12 \n4. Adobes Customization Wizard and Group Policy  ................................ ..........................  12 \n5. Removing previous versions of Adobe Reader  ................................ ...............................  13 \n6. Conclusion  ................................ ................................ ................................ ...........................  13 \nWorks cited  ................................ ................................ ................................ ................................ .. 14 \nAppendix: Configuring Settings for Adobes Acrobat Reader DC  ................................ ....... 15 \n \nFigures  \nFigure 1: The Protected View yellow message bar  ................................ ................................ ..........................  3 \nTables  \nTable I: Configuring enhanced security, Protected Mode, Protected View, and AppContainer  ..... 5 \nTable II: Locking privileged locations  ................................ ................................ ................................ ......................  6 \nTable III: Disabling attachments  ................................ ................................ ................................ ...............................  6 \nTable IV: Adding attachment types to the allow list  ................................ ................................ ..........................  7 \nTable V: Restricting hyperlinks  ................................ ................................ ................................ ................................ .. 8 \nTable VI: Disabling JavaScript and enabling trusted locations  ................................ ................................ .... 9 \nTable VII: Disabling online service access  ................................ ................................ ................................ ......... 10 \nTable VIII: Disabling Internet access by the application  ................................ ................................ ...............  11 \nTable IX: Disabling Document Cloud services  ................................ ................................ ................................ .. 11 \nTable X: Other registry settings  ................................ ................................ ................................ ..............................  12 \n \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  1 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \n1. Introduction  \nThe greatest threat to users of Adobes  Acrobat Reader is opening a \nPDF file that contains malicious executable content  (hereafter referred \nto as malicious documents) . The risk of a user receiving such a \ndocument through email or web surfing is high. Phishing attacks \nfrequently include malici ous PDF attachments  or links to download \nmalicious PDFs .  \nAdobes Acrobat Reader DC ( herein Reader ) can run in a sandboxed process to help \nprotect the user from malicious documents. Acrobat Reader DC is the latest version and \nreplaces Acrobat Reader XI. The DC in the title stands for Document Cloud , which \nrefers to the cloud -based features introduced in A crobat Reader DC.  This configuration \nguide  presents  NSA-recommended configuration \nsettings for Reader that allow system administrators \nto minimize the risk of executable content and other \nmalicious activity  in a Windows environment.  \nReader  settings fall into two broad types : those that \nshould be used in all env ironments and those for \nenvironments with unique security re quirements.  \nSection 2 d escribe s the settings applicable to all \nenvironments , such as settings for sandboxing features like Protected Mode, Protected \nView, and AppContainer.   \nSection 3 describe s settings that should be tailored to the specific security needs of the \nenvironment .  \nSection 4  includes information for using Adobes Customization Wizard to configure the \nnecessary settings for uniform distribution of the software throughout an enterprise or \non a standalone system.  \nSection 5 includes information about patching and upgrading. When upgrading Reader, \nprevious versions need to be removed.  Administrators can \nconfigure Reader to \nminimize the risk of \nmalicious activity.  \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  2 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nThe Appendix: Configuring Settings for Adobes Acrobat Reader DC  lists all of the \nReader  security -related settings with recommendations for the envi ronments that should \nconfigure those settings.  Reader s digital signature capabilities , digital rights \nmanagement,  and other related security settings are beyond the scope of this \nconfiguration guide . \nSimply configuring Acrobats security settings is not enough to completely secure a \nsystem. As with all commercial products, the system administrator must also configure a \nsecure operating environment and stay current with all security -related patches and \nupdates  to that environment . \n2. Environment -agnostic settings  \nThe following  settings are applicable to all environments. Adjustments to these settings  \nshould have minimal impact to workflow and productivity yet provide some protections \nagainst maliciou s executable content.  \n2.1. The s andbox  \nBeginning with version  X, Acrobat Reader includes sandboxing technology to \nconstrain the access that JavaScript and other executable content ha s to a \nsystems resources. Reader currently includes three sandboxing capabilities: \nProtected Mode , Protected View , and AppContainer . \n2.1.1.  Protected Mode  \nProtected Mode was specifically developed for Windows environments and , when \nenabled, Reader opens the PDF document with the executable content (e.g., \nJavaScript) enabled, but within a sandbox that restricts the documents execution  and \nacces s through operating system security controls. For example, a process inside the \nsandbox cannot access processes outside the sandbox without going through a trusted \nbroker process. The sandbox restricts access to system resources , such as the file \nsystem an d the registry. The execution appears seamless to the user who can still take \nadvantage of the functionality of the executable content as long as the executable \ncontent behaves within  certain limits.  \nPrior to the existence of  the Protected Mode sandbox, th e typical security practice was \nto disable all JavaScript to prevent execution of malicious scripts. Protected Mode \ndiffers from disabling JavaScript because the document is opened in a sandboxed state  \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  3 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \ninstead . The constrained execution environment limits all actions, not just those within \nscripts, and can deny most malicious activity.  \n2.1.2.  Protected View  \nProtected View, available since Adobe Reader XI, is a more restrictive sandbox than \nProtected Mode and it is onl y available when P rotected Mode is enabled. When \nProtected View is enabled, Acrobat opens the PDF document in the Protected Mode \nsandbox , but with executable content and scripts disabled. The user can still view the \ndocument and will see a yellow message bar across the top with a warning that some \nfeatures of the document have been disabled, as shown here:  \n \nFigure 1: The Protected View yellow m essage b ar1 \nThe user has the option to enable those features after deciding whether to tr ust the \ndocument and whether those features are necessary.  Even if the user decides to trust \nthe document, the PDF will still be opened in the Protected Mode sandbox.  \nProtected View is essential to prevent users from inadvertently opening and executing \nmalicious active content. Allowing the user to view the document prior to enabling active \ncontent can prevent many phishing and other attacks. Once the user views the \n                                                \n1 Adobe product screenshot(s) reprinted with permission from Adobe.  \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  4 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \ndocument and enables the content, Reader  adds the document as a privileged location \n(see nex t section) for that user and bypasses protected view on subsequent openings of \nthat document. Note that disabling  TrustedFolders  will prevent users from trusting \ndocuments , which would prevent them from using  the Enable All Features button in \nprotected  view ( see section 2.3: Privileged Locations  for more information.  \n2.1.3.  AppContainer  \nAppContainer is an application -level sandbox provided by Microsoft Windows and, like \nProtected Mode  and P rotected View, it blocks application processes from reading and \nwriting to files outside of its boundaries. A ppContainer is supported on all distributions  \nand requires that P rotected Mode be enabled.  \n2.2. Enhanced security and FeatureLock Down \nThe e nhanced security setting enforces some essential security eleme nts \nthat help to protect users. According to Adobes documentation, enhanced \nsecurity  hardens applications against risky actions by doing the following \nfor any document not specifically trusted  [1]: \n Prevents access across DNS domains: externally requested content must adhere \nto a same -origin policy. Without a server -based cross -domain policy file, that \ncontent is blocked.  \n Prohibits script and data injection via a  Fast Data Finder ( FDF), XML Forms Data \nFormat ( XFDF ), and XML Data Package ( XDP) when  not returned as the result \nof a POST from the PDF. These data formats are commonly used when \nsubmitting forms.  \n Blocks stream access to XObjects  that can include external content like images \nand fonts.  \n Stops silent printing to a file or hardware printer . \nUnder  the HKEY_LOCAL_MACHINE ( HKLM ) hive, Reader includes a registry key \ncalled FeatureLockDown , which allows  administrators to configure certain security \nsettings. Values under FeatureLockDown  do not necessarily disable functionality. The \npurpose of FeatureLockDown  is to roll out security settings at scale and prevent users \nfrom changing settings through the Reader GUI. Some of the same settings are also \nunder HKEY_CURRENT_USER ( HKCU ), but config uring those under HKCU alone is \nnot recommended because HKCU is writeable by the user.  \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  5 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nEnhanced security and Protected Mode are turned on by default in Reader, but they are \nnot locked, meaning a user can disable them through the GUI. Protected View and \nAppContainer are not turned on by default and require Protected Mode to be enabled. \nAll four should be enabled and locked down to prevent the end -user from disabling \nthem.  This should have minimal impact to productivity and workflow, and if necessary, \nthe adm inistrator can set privileged locations for exceptions ( see section 2.3: Privileged \nLocations ). \nTable I: Configuring enhanced security, Protected Mode, Protected View, and AppContainer  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \nbEnhancedSecurityStandalone  REG_DWORD  Set to 1  \nbEnhancedSecurityInBrowser  REG_DWORD  Set to 1  \nbProtectedMode  REG_DWORD  Set to 1  \niProtectedView  REG_DWORD  Set to 2  \nbEnableProtectedModeAppContainer  REG_DWORD  Set to 1  \n \nHKCU \\Software \\Adobe \\Acrobat Reader \\DC\\TrustManager  \nbEnableAlwaysOutlookAttachmentProtectedView  REG_DWORD  Set to 0  \nThe setting bEnableAlwaysOutlookAttachmentProtectedView  from Table II: Configuring \nenhanced security, Protected Mode, Protected View, and AppContainer  only takes \neffect for attachments received from Microsoft Outlook in Office 2010 and later. \nPrevious versions of Outlook do not append origin infor mation to attachments.  \n2.3. Privileged locations  \nPrivileged locations allow the user to selectively trust files, folders, and sites \nto bypass some security restrictions such as enhanced security and Protected \nView. By default, the user can create privileged locations through the GUI \nusing the Preferences dialog ( Edit  Preferences  Security (Enhanced) ). Alternately, \na file is automatically added to the p rivileged files when the user clicks the Enable All \nFeatures button in the warning banner while in Prote cted View  in that file . The \nadministrator can disable the users ability to create privileged sites through the \nPreferences dialog by using the settings in Table IV: Loc king privileged locations .  \nDisabling the GUI options to create privileged hosts and enabling Protected Mode , \nProtected View , AppContainer , and enhanced security  as described in Table III: \nConfiguring enhanced security, Protected Mod e, Protected View, and AppContainer  \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  6 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nabove will result in the user needing to first view all documents with active content \ndisabled and to take explicit action to enable active content.  \nTable IV: Locking privileged locations  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \nbDisableTrustedSites  REG_DWORD  Set to 1  \nAdministrators can prevent a user from trusting files and folders with the \nbDisableTrustedFolders  registry key  (see Table IV). However, in doing so, they will \nprevent users from transitioning out of  Protected View , which will prevent embedded \nscripts from executing , reduc ing PDF usability.  \nThe settings in Table V: Locking privileged locations  prevent the user from directly \nadding sites as privileged locations through the GUI. This will have a minimal impact on \nworkflow since the user can still enable active content after opening a file (through t he \nyellow message bar), and Reader  will create a privileged location for only that file. If \nworkflow is impacted, the administrator can create privileged sites as needed for the \nuser ( refer to  the Acrobat Application Security Guide  [1]). The administrator can also \nadd trusted sites in Internet Explorer or Edge  as privileged locations, or can allow the \nuser to add trusted sites to preemptively trust documents.  To do this for either browser \nfollow these steps: (Open Control Panel   Internet Options   Security   Trusted Sites  \n Sites   <site to add> ) \n2.4. Attachments  \nIn addition to malicious scripts, PDF documents can have attachments, \nwhich may also contain malicious content and present a security risk. The \nadministrator can disable the users ability to access attachments with the \nsetting in Table VI: Disabling attachments Table . \nTable VII: Disabling attachments  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \niFileAttachmentPerms  REG_DWORD  Set to 0  \nThis setting locks out the users ability to configure the PDF File Attachment setting in \nthe Trust Manager ( Edit  Preferences  Trust Manager , checkbox under PDF File \nAttachments) and disables opening or saving file attachments. This setting overrides \nany attachment deny list  or allow li st. Many environments  do not have a requirement for \nPDF documents  to contain attachments . However, in environments where users need \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  7 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \ncollaborative document sharing capabilities  via Reader , this setting would interrupt \nworkflows . \nA less restrictive but manageable approach is to set iFileAttachmentPerms  to `0` and to \nallow only certain types of attachments. Reader  allows the administrator to deny /allow  \nspecific attachment types and to automatically deny  unlisted types.  When using a deny \nlist/allow list mechanism, the recommended approach is  to block everything and allow \nonly approved exceptions. To do this in Reader , disable unlisted attachment types with \niUnlistedAttachmentTypePerm  and then enable only those that are safe or needed with \ntBuiltInPermList . Table VIII: shows the necessary settings.  \nTable VIII: Adding attachment types  to the allow list  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \niFileAttachmentPerms  REG_DWORD  Set to 0  \n \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\ \ncDefaultLaunchAttachmentPerms  \niUnlistedAttachmentTypePerm  REG_DWORD  Set to 3  \ntBuiltInPermList  REG_SZ  Version:1| <extension>:<0 -3>|  \nFor example, t o allow .docx  files and block .exe files the administrator would set \ntBuiltInPermList  to the string Version:1|.docx:2|.exe:3| etc . The user will not be allowed \nto launch any .exe files and will be prompted for . docx  files and given a choice to allow \njust that file, enable that extension always, or disable that extension always. As long as \niUnlistedAttachmentTypePerm  is set to `3`, any attachment type not listed in \ntBuiltInPermList  will n ot launch.  \nReader  is installed with a default list of extensions that an administrator can customize \nin the registry or the Adobe Customization Wizard.  The default list blocks common \nexecutable content , such as .exe and .bat files.  \n3. Tailored settings  \nBecause the following settings can  impact workflow and productivity , adjustments to \nthem should be tailored to the specific security needs of the environment . \nAdministrators that need to configure these specialized settings in order to preemptively \ntrust or control  certain documents should consult the most recent Adobe  guidance for \nthose settings.  \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  8 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \n3.1. Internet access from a document via hyperlink  \nPDF documents can contain hyperlinks to files or web sites that could lead a \nuser to malicious content. By default,  Reader  cannot open hyperlinks in \ndocuments , but the user can change these settings through the GUI ( Edit  \nPreferences  Trust Manager , button labeled Change Settings in the Internet Access \nsection). The user can allow PDF files to access all web sites,  block all access to \nwebsites, or create a custom list of websites to allow or block. The administrator can \nprevent the user from changing setting s created by the administrator  by using the \nFeatureLockDown  key as in Table IX: Restric ting hyperlinks , and, if desired , can block \nall access to hyperlinks from within a document.  \nTable X: Restricting hyperlinks  \nHKCU \\Software \\Adobe \\Acrobat Reader \\DC\\TrustManager \\cDefaultLaunchURLPerms  \niURLPerms  REG_DWORD  Set to 1  \ntBuiltInPermList  REG_SZ  version:1|<site>:<1 -3>|...  \n(1 is always ask; 2 is always allow, \n3 is always block)  \n \nHKLM \\Software \\Policies \\Adobe \\Acrobat \nReader \\DC\\FeatureLockDown \\cDefaultLaunchURLPerms  \niUnknownURLPerms  REG_DWORD  Set to 3 (block all unlisted sites)  \nNSA recommends  to set iURLPerms  to `1` which will prevent the user from following \nhyperlinks within a PDF document. In some cases, when it is desirable to allow a known \nset of trusted URLs, the iURLPerms  key can be removed after iUnknownURLPerms  is \nset to `3` and tHostPerms  is set to a list of trusted URLs.  \n3.2. JavaScript  \nJavaScript extends the functionality of PDF documents , allowing for \ndecision -driven content that greatly enhances the user experience. \nJavaScript is commonly used in electronic forms for recipients to \ncomplete, sign, and return  documents electronically . Because JavaScript usage in \nPDFs is becoming more frequent, NSA recommend s that administrators not change the \ndefault setting for Reader  that allows  JavaScript. Protected Mode and Enhan ced \nsecurity , as previously described, will help mitigate some of the security concerns due to \nallowing JavaScript within PDFs.  \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  9 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nHistorically, JavaScript has been a frequent attack vector. Therefor e, some \nadministrators may opt for a more secure environment  at the cost of usability. For such \nenvironments where JavaScript must be disabled, the recommended configuration is to:  \n Set Protected Mode, Protected View, AppContainer, and Enhanced Security as \nTable XI: Configuring enhanced securi ty, Protected Mode, Protected View, and \nAppContainer  suggests , \n Lock the privileged location settings as suggested in Table XII: Locking privileged \nlocations , and \n Disable JavaScript and establish trusted locations for particular documents or \nlocations where JavaScript is required for usability as shown in Table XIII: \nDisabling JavaScript and enabling trusted locations . \nWith this configuration, the user will not be able to execute JavaScript in any PDF file \noutside of trusted locations and will not be able to change the setting through the \nReader  GUI. The administrator can add particular files, directories, drives, or hos ts as \ntrusted locations that will bypass the JavaScript restrictions. This approach gives the \nadministrator the ability to allow JavaScript functionality for particular files or locations , \nbut greatly restricts the users ability to exempt documents with J avaScript from the \nsecurity mechanisms.  \nTable XIV: Disabling JavaScript and enabling  trusted locations  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \nbDisableJavaScript  REG_DWORD  Set to 1  \n \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\<cTrustedFolders or \ncTrustedSites> \\cAlwaysTrustedForJavaScript  \n<tid> (such as t43 or t#)  REG_SZ  Valid path to a file, directory or host  \nIn an environment where the user needs access to many documents that contain \nJavaScript, the administrator may spend significant time updating the trusted locations. \nThere is always a tradeoff between risk and functionality, and sometimes the most \nsecure settings prevent necessary functionality.  \nAn administra tor has an even more granular level of control  with the ability to create \nallow lists and deny lists for particular JavaScript APIs. Generally, this requires \nsignificant administrative investment and is not a scalable  or manageable solution. It is \npractica l only for installations where there is a specific need for this level of granularity \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  10 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nbeyond the basic recommendations ( refer to  the Acrobat Application Security Guide for \nmore information on using  this feature).  \n3.3. Internet access from the Reader application  \nReader includes features to enable access to online services such as \nAdobe.com, Office 365, SharePoint, and webmail. Administrators in \nsome environments may need to disable the users ability to store or \naccess documents in external environments or to use external applications such as \nwebmail. Most of this capability can be blocked by using the settings in  Table XV: \nDisabling online service access . These settings should be tailored for individual \nenvironments since they will block useful features of Reader.  \nReader allows the user to configure a webmail or Outlook account to send an op en PDF \ndocument as an attachment. Outlook must be configured by the administrator on the \nlocal machine. If Outlook is not configured, the user cannot use it from within Reader. \nWebmail access would allow the user to bypass the need for Outlook and go to a \nwebmail solution . \nSome installations will need to block access to webmail. NSA recommend s that \nadministrators configure Reader to use Outlook and to block webmail functionality. \nDoing this will prevent users from inadvertently sending documents via non -official \nservers. If there is a requirement that users have access to the webmail feature in \nReader, administrators should ensure that users are trained to use only official or \naccredited webmail servers.  \nTable XVI: Disabling online ser vice access  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cSharePoint  \nbDisableSharePointFeatures  REG_DWORD  Set to 1  (also disables Office 365)  \n \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cCloud  \nbDisableADCFileStore  REG_DWORD  Set to 1  \n \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cWebmailProfiles  \nbDisableWebmail  REG_DWORD  Set to 1  \nCurrently, Reader requires the system administrator to apply update s; users cannot \nupdate Reader and do not need to see the update notifications. Disabling the automatic \nupdate feature for users will prevent Reader from prompting users but will not impact \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  11 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nupdates to the product by administrators. Administrators should always promptly deploy \nAcrobat updates via the enter prises normal software installation procedure.  \nTable XVII: Disabling Internet access by the application  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \nbUpdater  REG_DWORD  Set to 0 (disable prompting for updates)  \nbUsageMeasurement  REG_DWORD  Set to 0 (disable sending usage statistics)  \n3.4. Document Cloud interaction  \nThe Document Cloud is a document repository that can be used by \nReader to store files and data on Adobe -controlled servers. As with any \ncloud -based servi ce, it is important to consider the implications of \nstoring data outside of the local network. Federal data should not be stored in a \ncommercial cloud without authorization from the organization and accreditation through \nthe Federal Risk and Authorization Management Program (FedRAMP). Adobe has \nseveral products that are FedRAMP  Authorized, one being the Adobe Document Cloud  \n[1][2]. \nReader includes several features that use cloud storage . Some of which do so without \nexplicit user notification. Reader can be configured to prevent interaction with the \nDocument Cloud. Unless there is a specific need for cloud integration, Reader should \nbe configured to prevent each of these types of interaction  as shown in Table XVIII : \nDisabling Document Cloud services . If one or more cloud services remain enabled, \nReader users will have the ability to sign in to the document cloud , allowing the \ntransmission of unspecified data to Adobe.  \nTable XIX: Disabling Document Cloud services  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cServices  \nbUpdater  REG_DWORD  Set to 0  \nbToggleAdobeDocumentServices  REG_DWORD  Set to 1  \nbToggleAdobeSign  REG_DWORD  Set to 1  \nbTogglePrefSync  REG_DWORD  Set to 1  \nbToggleWebConnectors  REG_DWORD  Set to 1  \n \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cCloud  \nbAdobeSendPluginToggle  REG_DWORD  Set to 1  \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  12 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \n3.5. Other settings  \nReader  allows the user to change the default PDF handler, including changing \nit to a prior version that is still installed on the system that may not have \nprotected mode or protected view enabled. The administrator should disable \nthis feature, as shown in Table XX: Other registry settings , so that the user must use the \nversion with the correct security settings.  \nEven though Reader stopped supporting Flash within its product, a user could render \nthe content if a Flash Player is already in p lace on the system.  Since Flash and 3D \ncontent have previously been attack vectors, the administrator may want to disable \nthose features as well. Protected mode should mitigate most Flash and 3D content \nattacks, but if this type of content is not needed, i t should be disabled. The administrator \nshould decide based on the needs  of the particular environment.  \nReader  includes several links to subscription -required upsell tools by default. Upsell \ntools extend the functionality of Reader  by providing additional functionality like editing \nPDFs and embedding  rich media.  NSA has not research ed the security of these upsell \nfeatures  but recommends administrators disable them unless there is  a need for the \nfeatures within the organization.  In most cases, disabling the features  will have no \nimpact on workflow.  \nTable XXI: Other registry settings  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \nbDisablePDFHandlerSwitching  REG_DWORD  Set to 1  \nbEnableFlash  REG_DWORD  Set to 0  \nbEnable3D  REG_DWORD  Set to 0  \nbAcroSuppressUpsell  REG_DWORD  Set to 1  \n4. Adobes Customization Wizard and Group Policy  \nAdobe supplies a Customization Wizard to assist the administrator in \ndeploying Reader across the network. Using the Customization Wizard , the \nadministrator configures the application once, and installs Reader with the \nsame settings on every machine  [3].  \nMany of the registry settings recommended in this configuration guide  can be \nconfigured with various checkbox settings in the Customization Wizard , but not all. \nThose that are not directly configured through a specific checkbox in the Customization \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  13 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nWizard can still be configured with the Customization Wizard tool in the registry settings \narea. Appendix : Configuring Settings for Adobes Acrobat Reader DC  lists all of the \nsettings from tables 1 through 10 and whic h section  of the Customization Wizard \nincludes those keys. How to use the Customization Wizard to install Reader is beyond \nthe scope of this configuration guide . See the Adobe Customization Wizard DC for \nWindows document for more information, currently at https://www.adobe.com/devnet -\ndocs/acrobatetk/tools/Wizard/ . \nIf the administrator do es not want to use the Customization Wizard , a Group Policy can \nbe created to push all desired registry settings across the network. Establishing and \ndeploying a Group Policy is beyond the scope of this configuration guide . However, \nadditional help can be found in the Adobe Application Security Guide. General guidance \non deploying Group Policies can be found on Microsoft s support website.  \n5. Removing previous versions of Adobe Reader  \nWhen upgrading Reader , most users will no longer require or use previous \nversions. In these cases, the best practice is to remove any previous versions \nbefore installing Reader . Removing previous versions will prevent users from \nopen ing PDF documents with unmaintained software. Adobes Customization Wizard \nallows removal of previ ous versions via a checkbox titled Remove all versions of \nReader under the Installation Options.  \n6. Conclusion  \nPDFs are commonly exploited by malicious cyber actors. Many security features \ndiscussed in this configuration guide can be used to help prevent common attack \nvectors. Most typical environments can use  the Appendix: Configuring Settings for \nAdobe Acrobat Reader DC  as a quick guide to configure Adobe Customization Wizard \nsecurely. All administrators should understand the implications of Adobe Reader \nfeatures and how to lock  down the features for secure use of Reader by users of their \norganization.   \n\n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  14 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nWorks c ited \n[1]  Adobe, Inc., \"Acrobat Application Security Guide,\" 08 June 2021. [Online]. Available: \nhttps://www.adobe.com/devnet -docs/acrobatetk/tools/AppSec/index.html.  \n[2]  Adobe, Inc., \"Enterprise Toolkit for Acrobat Products,\" 2019. [Online]. Available: \nhttps://ww w.adobe.com/devnet -docs/acrobatetk.  \n[3]  Adobe, Inc., \"Acrobat DC Customization Wizard DC for Windows,\" 08 June 2021. [Online]. \nAvailable: https://www.adobe.com/devnet -docs/acrobatetk/tools/Wizard/.  \n \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  15 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nAppendix : Configuring Settings for Adobes Acrobat Reader DC  \nRegistry Key   Data Type  Recommended \nValue  Customization \nWizard  Applies  Default \nValue  STIG \nID \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown  \nbEnhancedSecurityStandalone  REG_DWORD  Set to 1  Security  Always  0 64929  \nbEnhancedSecurityInBrowser  REG_DWORD  Set to 1  Security  Always  0 64955  \nbProtectedMode  REG_DWORD  Set to 1  Registry  Always  1 64953  \niProtectedView  REG_DWORD  Set to 2  Registry  Always  0 64951  \nbEnableProtectedModeAppC\nontainer  REG_DWORD  Set to 1  Security  Always  0 N/A \nbDisableTrustedSites  REG_DWORD  Set to 1  Security  Always (admin may configure \ntrusted sites)  null [0]  65677  \niFileAttachmentPerms  REG_DWORD  Set to 1  File \nAttachments  Always (may relax to 0 if using \niUnlistedAttachmentTypePerm)  0 64923  \nbDisablePDFHandlerSwitchin\ng REG_DWORD  Set to 1  Registry  Always  null [0]  64919  \nbEnableFlash  REG_DWORD  Set to 0  Registry  Unless required to allow PDFs \nusing Flash  0 64925  \nbEnable3D  REG_DWORD  Set to 0  Registry  Unless required to allow PDFs \nusing 3D  0 N/A \nbUpdater  REG_DWORD  Set to 0   Online Services  \nand Features  Unless end -users manage their \nown updates  1 N/A \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\<cTrustedFolders> \\cAlwaysTrustedForJavaScript  \n<tid> (such as t43 or t#)  REG_SZ  Valid path to a \nfile or directory \nas appropriate  Security  When PDFs from specific \ndirectories should be trusted  Null N/A \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\<cTrustedSites> \\cAlwaysTrustedForJavaScript  \n<tid> (such as t43 or t#)  REG_SZ  Valid path to \nhost as \nappropriate  Security  When PDFs from specific hosts \nshould be trusted  Null N/A \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cDefaultLaunchAttachmentPerms  \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  16 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nRegistry Key   Data Type  Recommended \nValue  Customization \nWizard  Applies  Default \nValue  STIG \nID \niUnlistedAttachmentTypePer\nm REG_DWORD  Set to 3  File \nAttachments  When specific PDFs need to \nopen external apps  1 N/A \ntBuiltInPermList  REG_SZ  Default  File \nAttachments  When specific PDFs need to \nopen external apps  Default  N/A \nHKCU \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\TrustManager \\cDefaultLaunchURLPerms  \niURLPerms  REG_DWORD  Set to 1  Registry  Always  1 N/A \ntHostPerms  REG_SZ  version:1|<site>:\n<1-3>|   \n(1 is always ask; \n2 is always \nallow, 3 is \nalways block)  Registry  When specific PDFs need to be \nopen URLs without a prompt  Null N/A \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cDefaultLaunchURLPerms  \niUnknownURLPerms  REG_DWORD  Set to 3  Registry  Always  1 65667  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cSharePoint  \nbDisableSharePointFeatures  REG_DWORD  Set to 1  Registry  Unless SharePoint integration is \nrequired  Null \n[0] 65675  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cWebmailProfiles  \nbDisableWebmail  REG_DWORD  Set to 1  WebMail \nProfiles  Unless end -users send PDFs via \nWebmail (not Outlook)  Null \n[0] 64945  \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cServices  \nbUpdater  REG_DWORD  Set to 0  Online Services \nand Features  Unless end -user requires cloud \nstorage  1 65670  \nbToggleAdobeDocumentServ\nices REG_DWORD  Set to 1  Online Services \nand Features  Unless end -user requires cloud \nstorage  null [0]  64927  \nbToggleAdobeSign  REG_DWORD  Set to 1  Online Services \nand Features  Unless end -user requires cloud \nstorage  null [0]  64933  \nbTogglePrefSync  REG_DWORD  Set to 1  Online Services \nand Features  Unless end -user requires cloud \nstorage  null [0]  64935  \nbToggleWebConnectors  REG_DWORD  Set to 1  Online Services \nand Features  Unless end -user requires cloud \nstorage  null [0]  64931  \n\n \n \nU/OO/104771 -22| PP-22-0042  | JAN 2022 Ver. 2.0  17 \nNational Security Agency | Cybersecurity Technical Report  \nRecommendations for Configuring Adobe Acrobat Reader DC  \nRegistry Key   Data Type  Recommended \nValue  Customization \nWizard  Applies  Default \nValue  STIG \nID \nHKLM \\Software \\Policies \\Adobe \\Acrobat Reader \\DC\\FeatureLockDown \\cCloud  \nbAdobeSendPluginToggle  REG_DWORD  Set to 1  Online Services \nand Features  Unless end -user requires cloud \nstorage  1 64921  \nHKCU \\Software \\Adobe \\Acrobat Reader \\DC\\TrustManager  \nbEnableAlwaysOutlookAttac\nhmentProtectedView  REG_DWORD  Set to 0  Registry  Always  0 N/A \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "ctr_configuring_adobe_acrobat_reader_20220120",
  "source": "nsa",
  "id": "5accbadf3b3be8e4b89abbfbd111926295a28ae6466fffa06e1fea5ece3fc6d8"
}