{
  "markdown": "NATIONAL SECURITY AGENCY\nCYBERSECURITY REPORT\n PP-18-0844 NSA/CSS Technical Cyber Threat Framework v2 \nA REPORT FROM:  \nCYBER SECURITY OPERATIONS  \nTHE CYBERSECURITY PR ODUCTS AND SHARING D IVISION  \n29 Novem ber 2018  \n\n2 \nNSA CYBERSECURITY  REPORT\n PP-18-0844  NOVEMBER 2018  (U) DOCUMENT CHANGE HISTORY\nDATE  VERSION  DESCRIPTION  \n08 March  2018  V1 NTCTF_v1 release date  \n09 November 2018  V2 NTCTF_v2 release date  \n29 November 2018  V2 Minor revisions  \n(U) EXECUTIVE SUMMARY\n(U) The NSA/CSS Technical Cyber Threat Framework v 2 (NTCTF v2) was developed as a technical extension of the\nDirector of National Intelligence Cyber Threat Framework. Designed to standardize how NSA characterizes and \ncategorizes adversary activity by using a common technical lexicon that is operating system independent and closely \naligned with industry definitions. This common technical cyber lexicon supports sharing, product development, \noperational planning, and knowledge driven operations across the Intelligence Community. Public dissemination of the \ntechnical cyber lexicon allows for collaboration with whole- of-community. Use of the NTCTF facilitates organizing and \nexamining adversary activity to support knowledge management and enable analytic efforts.  \n(U) The Cyber Technical Report entitled \"NSA/CSS Technical Cyber Threat Framework v2 provides a baseline of\nstandard definitions to be used as reference for U.S. Government Collaboration with partners and stakeholders in \ndiscussing adversary activities throughout the adversary lifecycle.   \n(U) Notably, in NTCTF v2, the shared technical lexicon has been reduced by 20% with clearer definitions and over 1700\nkey phrases to help guide the analyst in characterizing adversarial cyber activity using the NTCTF actions.  This release \nhas been reviewed to capture recent trends, account for emerging technologies and insider threat, and include \noperational technology (OT) concepts to support threats to critical infrastructure.   \n\n3 \nNSA CYBERSECURITY  REPORT\n PP-18-0844  NOVEMBER 2018  (U) DISCLAIMER OF WARRANTIES AND ENDORSEMENT\n(U) The information and opinions contained in this document are provided as is and without any warranties or\nguarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, \nmanufacturer, or otherwise, does not necessarily constitute or imply its endorsement, recommendation, or favoring by \nthe United States Government. The views and opinions of authors expressed herein do not necessarily state or reflect \nthose of the United States Government, and shall not be used for advertising or product endorsement purposes.  \n(U) CONTACT INFORMATION\nClient Requirements and Inquiries or General Cybersecurity Inquiries\nCYBERSECURITY REQUIREMENTS CENTER (CRC)\n410-854-4200\nCybersecurity_Requests@nsa.gov \n\n\n \n4 \n  \nNSA CYBERSECURITY  REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \n \nTHIS PAGE INTENTIONALLY LEFT BLANK\n\nPP-18-0844          NOVEMBER 2018 5\n\n \n6 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 STAGE AND OBJECTIVE DEFINITIONS\n  \nADMINISTRATION  \n PREPARATION  \nAdversary activities that comprise \"day -to-day\" or standard operations that occur outside of \ntargeted operations. This stage provides  the necessary foundational resources and direction to \ndrive targeted operations. During this stage, the adversary derives their operational intent, plans \ncampaigns, performs research and analysis, and develops resources based on their strategy to \ngenerate  targeted tasking based on their intent.  Adversary activities to conduct research on target networks and/or entities of interest and set up \ninfrastructure and capabilities to be used during targeted operations. Actions taken by a threat actor \nto assess the  intended victim cyber threat environment and assess success/failure of threat \nactivities in meeting objectives.  \n> PLANNING  \n > RECONNAISSANCE  \nPlanning is an orderly, analytical process that consists of a logical set of activities to analyze a \nmission, sel ect the best course of action, and produce operational plans (based on JP 5 -0). The \nadversary plans their operations, typically derived from high level or national strategy. Based \nupon the resulting plans, the adversary identifies mission needs and require ments.  Reconnaissance is the act of obtaining and examining information about the activities and resources \nof a potential target, or capturing data and characteristics of a particular target system or network \n(derived from JP 1 -02, Reference e). An adversa ry conducts reconnaissance to strategize their \ntargeted operation with the goal of making the intrusion more efficient and to increase the probability \nof success. Typically reconnaissance is performed via passive or active means using cyber and \nnon-cyber m ethods.  \nPassive reconnaissance involves no interaction with the target directly. It includes cyber activities \nsuch as open source research to gather publicly available information and drawing on information \npreviously collected as well as non -cyber activi ties such as dumpster diving, and physical \nobservation.  \nActive reconnaissance involves attempts to interact with the target directly. Activities include port, \nnetwork and vulnerability scanning, and network enumeration techniques, such as banner grabbing \nand TCP fingerprinting. The desired result is a profile and enumeration of target access points, \nprotocols, and vulnerabilities to exploit.  \n> RESOURCE DEVELOPMENT  \nResource development activities aid with fulfilling the mission needs. Resource types inc lude: \ninfrastructure, software, data, people, and support to conduct operations. Resource development \nactions include the processes an adversary employs to develop, modify, test, and distribute the \nresources to support operations, such as capabilities and infrastructure. Resource development \nalso includes activities such as the training and education of people, or cultivating of alliances \nand partnerships.  \n> RESEARCH  \n > STAGING  \nResearch activities are adversary activities performed to identify gaps and id eate ways to fill \nthose gaps, through technical, mechanical, physical, financial, or other means. This set of \nactivities also aims to identify resources to be developed in order to meet the demands of \nstrategic and operational plans.  The goal of staging is  to position capabilities and infrastructure required to support the operation \n(derived from JP 3 -35, Reference f). This objective includes allocating and preparing supporting \ninfrastructure, such as command and control nodes, hop points, DNS infrastructur e, and necessary \naccounts (email, chat, etc.). During these activities, the adversary ensures tools, infrastructure and \ncommunication channels are identified and deliverable. This objective also includes coupling \nmalware with a delivery mechanism.  \nPre-positioning of threat actor capabilities to threat actor internally owned/controlled storage \nlocations, whether electronic media or physical hardware (i.e., removable media, bundled \nhardware/firmware/software corrupted through a cooperative supply chain), to s upport \nintended/subsequent cyber threat actions/activities.  \n\n \n7 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018    \nNTCTF V 2 STAGE AND OBJECTIVE DEFINITIONS\n  \nENGAGEMENT  \n PRESENCE  \nAdversary activities taken by a threat actor against a specific target/target set prior to gaining, \nbut with the intent to gain, a ccess to the victim's physical or virtual computer or information \nsystem(s), network(s), and/or data stores.  Actions taken by the threat actor once access to target/target set physical or virtual computer or \ninformation system has been achieved.  Adversary  activities to ensure ongoing and robust access to \nthe victim and potentially its connected environment  \n> DELIVERY\n  \n > EXECUTION\n  \nDeliver a malicious payload to the target via technical, cognitive, or physical means with the goal \nof exploiting target vulner abilities in technology, people, or processes. The malicious payload \ncan be as simple as an idea verbally communicated to the target to acquire information or as \ncomplex as custom coded malware, and can be delivered to a target in multiple ways. The most \ncommonly used remote methods include spear phishing, malicious websites and via remote \nexploits, but can also be delivered through social engineering or insider threats.  Unauthorized threat actor actions (automated or manual) that direct or execute actions or activities \nusing available target's computer(s), information system(s), and/or network(s). Actions taken by an \nadversary to run malicious or controlled code on a local or remote system.  \n> EXPLOITATION  \n > INTERNAL RECONNAISSANCE  \nUse network, system, phy sical and/or social vulnerabilities to establish unauthorized \naccess to a target. Adversary activities to leverage vulnerabilities in people, processes, \nor technology. Exploitation of people typically is achieved using social engineering \ntechniques. Social  engineering is defined as the use of influence and persuasion to \ndeceive people for the purpose of obtaining information or persuading the person to \nperform an action. Social engineering techniques are often employed when \nconstructing messages used in spe ar-phishing email/text message, social networking \nsites, and active reconnaissance communication.  Activities an adversary performs on the victim network that support traversing the network and \ncompromising additional hosts or connected networks. Activities  include internal network scanning, \ndirectory walks, active directory dumps, password dumps, and identification of target systems and \nusers.  \n \n \n> CREDENTIAL ACCESS  \n > PRIVILEGE ESCALATION  \nAdversarial activities to obtain, create, hijack, and leverage l egitimate credentials within \na target system or network. These activities include credential dumping, network \nsniffing with the intent of gaining credentials, keylogging on a target system, leveraging \nlegitimate password recovery techniques, hijacking acti ve authentication tokens, or \nmerely searching file systems for credentials in files.  Activities an adversary performs on the victim network to support obtaining administrative \nrights. Adversary uses information from external and/or internal reconnaissance,  social \nengineering, or other means to attempt to obtain administrative rights by using a variety of \ntools and tactics. Some examples include using password hash exploitation tools, leveraging \nlegitimate account credentials, and using open source or custom  exploits.  \n \n\n \n8 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018   \nNTCTF V 2 STAGE AND OBJECTIVE DEFINITIONS\n  \nPRESENCE  \n EFFECT  \n> LATERAL MOVEMENT  \n > MODIFY  \nAdversarial activities to propagate through the victim environment. An adversary may use \ninformation from internal reconnaissance to identify and compromi se additional networks, hosts, \nand connected networks. Within this objective, the adversary may attempt establishing new user \ncredentials to further propagate on the network. These activities that an adversary performs on \nthe victim network support travers ing the network to achieve objectives.  Activities to modify target systems, networks, resources, or information. These modifications could be \nchanging configuration files, removing data files, sending unauthorized email from a target account, or \ninstalling  additional malicious files.  \n> PERSISTENCE  \n > DENY  \n > DESTROY  \nActivities performed to maintain presence on the system, device, and/or network. Activities \ninclude creating legitimate credentials, installing rootkits, establishing remote access tools, etc. I t \nis important to note that once initial access is gained to a target, persistence may be established \nat any time and may consist of multiple techniques  Activities that result in the denial of target \nsystems, networks, or other resources, as \nwell as denyin g access to information. These \nactivities may be the result of Denial of \nService attacks, or by virtue of modifying or \ndestroying components of the target.  Activities to destroy target systems, networks, \nresources, or information. Attacks cause a wide rang e \nof consequences ranging from minor to significant \ndamage to the target.  \nEFFECT\n  \n ANALYSIS, EVALUATION, AND FEEDBACK\n  \nAdversary activities involved in the manipulation, disruption, denial, degradation, or destruction of \ncomputers, information or communicat ions systems, networks, physical or virtual infrastructure \ncontrolled by computers or information systems, or resident information. Outcomes of threat actor \nactions on a victim's physical or virtual computer or information system(s), network(s), and/or \ndata stores.  Activities to continually analyze, evaluate, and update the operation to best perform their mission at any \npoint in the target operation activities. This activity is a similar concept to the Observe Orient Decide Act \n(OODA) loop for the adversary . \n> MONITOR  \n COMMAND  AND CONTROL\n  \nActivities such as maintaining presence on a host, establishing a compromised host as a listening \npost, identifying health and status of the host, and waiting to perform additional operations.  Activities to direct and rece ive information from a victim. Activities include the transmission of location, \nhealth, or operational status of persistent access capabilities and the remote tasking of access \ncapabilities.  \n  \n\n \n9 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018   \nNTCTF V 2 STAGE AND OBJECTIVE DEFINITIONS\n  \n> EXFILTRATE  \n EVASIO N \nActivities to collect and transmit information from a target that enables operations, fulfills tasking \nrequirements or meets mission objectives. Observable activities include gathering files, internally \nstaging those files, obfuscating file types and fo rmats, compressing into archive files, and \ntransmitting files. Transmission could occur through standard protocols, remote access tools, or a \nvariety of other methods such as email, chat, cloud services, and more. The method used will \nvary based on the adv ersary, their collection requirements and urgency.  Activities to minimize the risk of being caught within a victim host and their environment. An adversary \nis likely to employ forms of evasion across the various stages of their standard and targeted \noperat ions. Evasion techniques can vary, based on the stage, particular Tactics, Techniques, and \nProcedures (TTP), and sophistication of the adversary. Some examples include saving malware with \nlegitimate file types, using encryption or covert channels for commu nications, or performing command \nand control using social networking sites.  \nNTCTF V 2 ACTION  DEFINITIONS  AND KEY PHRASES  \n  \nADMINISTER  \n> PLANNING  \nAnalyze operation  \nSteps taken by a threat actor (individual, team or government -sponsored \nagency), their spon sor, or leadership to establish the overall strategy for, \npolicy limitations of, and the requisite resources and capabilities needed \nto conduct the intended malicious cyber activity, along with the criteria \nfor evaluating the eventual success or failure of  the activity.  Issue operatio nal directive  \nSteps taken by an individual cyber threat actor, their sponsor, or \nleadership to decide to execute a planned cyber threat operation.  Receive approval to execute operations  \nThreat actors receive approval from their  leadership to \nexecute operations against identified targets.  \nDetermine strategy and goals  \nSteps taken by a threat actor, their sponsor, or leadership to determine \nthe portion(s) of national strategy and/or interests that will be supported \nby the intended  cyber activity, or to justify that activity. This includes \nthreat actor perception of programmatic or operational goals, \nenvironmental changes, or outcomes that contribute to the overall \nsuccess of the threat activity.  Produce operational plans  \nSteps take n to integrate known information on the target, \ncapabilities, and intended outcome into a plan for how to most \neffectively conduct intended cyber activity.  Select intended victims  \nThe initial step in the planning process that produces a list \nof intended vi ctim(s), and defines the intent for and desired \noutcome of the malicious cyber activity.  \n> RESEARCH  \nGather information  \nThreat actor actions taken to compile and analyze all available \ninformation on potential targets.  Identify capability gaps  \nThreat actor  actions to establish requirements for tools, including \nmalware, needed to develop capabilities and/or conduct \noperations.  Identify information gaps  \nThreat actor actions to determine the utility of available \ninformation related to a potential target and to  document \nintelligence gaps.  \n\n \n10 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018   \nNTCTF V 2 ACTION  DEFINITIONS\n  \n> RESOURCE DEVELOPMENT  \nAcquire operational infrastructure  \nSteps taken to acquire the facilities and infrastructure required to \nconduct the intended cyber activity during targeted operations.  Develop capabilities  \nSteps taken to define, develop, acquire, and test the \ntechnology, processes, and tools required to conduct \nthe intended cyber activity.  Seed supply chain  \nThreat actor action to place compromised software, hardware \nand/or firmware on par tner or organic supply chain.  \nBuild alliances and partnerships  \nSteps taken to establish relationships with individuals, groups or \ngovernments; to acquire or provide co -production and/or contract \ndevelopment of technology, processes and/or tools for use i n the \nintended cyber activity; and to provide support to compromise victim \nsupply chains.  Obtain financing  \nSteps taken to identify and employ viable sources of \nfinancial support required to support staff, infrastructure, \nand other expenses that occur whil e conducting cyber \nactivities.  Staff and train resources  \nSteps taken to select and train the people required to conduct \nintended activity in areas such as cyber activities, targeting, and \ndata analysis.  \nCreate botnet  \nActions taken to establish a virtual  network of target computer or \ninformation system resources for use in conducting threat actor \nactivities.    \nPREPARATION  \n> RECONNAISSANCE  \nConduct social engineering  \nPsychological manipulation of people by threat actor into performing \nactions or divulgi ng information.  Map accessible networks  \nThe sending of transmissions to the network's possible \nnodes, examining the responses they receive identify \nthe existence of nodes on the network. The results \npotentially provide insight to identify security systems  \nand policies on the network.  Select potential victims  \nActions taken by a threat actor to identify a \nspecific target or targets from a broader list \nof potential targets.  \nGather credentials  \nActivities to obtain credentials of unknowing users for the purp ose of \nfuture engagement.  Scan devices  \nActive or passive actions taken by the adversary in \norder to determine the software or firmware currently \nused by a target, versions of software or firmware, a \ntarget's patch status, and configuration (e.g., ports \nopen). Survey devices  \nThreat actor actions to collect intelligence derived from the \ncollection, processing, analysis, and exploitation of data and \ninformation pertaining to an identified target.  \n\n \n11 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018   \n \nNTCTF V 2 ACTION  DEFINITIONS  \n \n> RECONNAISSANCE  \nIdentify crosstalk  \nAny phenomenon by which a signal transmitted on one circuit or channel creates an \nunintended effect on another circuit or channel that is not physically connected.  Scrape websites  \nThe gathering of information about a potential target \nby searchi ng open source information such as public \nforums, conference announcements, bulletin boards, \nor distribution lists looking for victim information; \nincludes the use of automated tools to overcome \nprotection measures.  Use social media  \nThe gathering of infor mation about a potential target by \nsearching public social media sites.  \n> STAGING  \nAdd exploits to application data files  \nAltering the content of data files to exploit a weakness in the application that parses \nthat type of data file. The change causes th at application to perform unintended \nactions, usually code execution or revealing sensitive information.  Create midpoints  \nConfigure, acquire, compromise, or develop one or \nmore intermediate nodes between source and \ndestination for data exfilt ration and co mmand and \ncontrol.  Infect or seed website   \nA website that has been created or modified by a threat \nactor to include malicious code, which can subsequently \nbe used in phishing attacks, drive -by att acks and \nwatering hole attacks.  \nAllocate operational infra structure  \nThreat actor actions taken to put in place facilities and associated infrastructure \nneeded to support development of capabilities for and to support conduct of threat \nactivities.  Establish physical proximity  \nThreat actor actions taken to obtain  facilities and \ninfrastructure in close physical proximity to identified \ntarget's computer or information systems, networks, \nand/or  data stores.  Pre-position payload  \nPre-positioning of threat actor capabilities on threat \nactor internally owned/controlled storage locations.  \nENGAGEMENT  \n> DELIVERY  \nAccess via wireless  \nWireless access to network communications or a device connected to the network.  Infect via websites  \nAdversaries embed malicious code into a website \nthat a user visits that infects the compute r that \nconnects to it.  Traverse CDS or MLS  \nUsage of cross domain solutions (CDS) or multi -level \nsolutions (MLS) to maliciously transfer content, or allow \nadversarial movement from one network to another, \nwhether in a manual or automated manner (through \ntrusted services).  \n \n  \n\n \n12 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018   \nNTCTF V 2 ACTION  DEFINITIONS  \n \n> DELIVERY  \nAlter communications path  \nModify communications paths by altering cache entries or \nrouting tables using a variety of protocols to deliver a payload or \nredirect victims to fraudulent and malic ious web sites and \nsystems.  Inject database command  \nThe injection of malicious SQL commands into unchecked input \nfields, allowing data theft, modifications, or execution of malicious \ncommands.  Use chat services  \nEmploy a chat communications protocol allo wing the interchange \nof messages and/or files between devices (mobile, computers, \nIoT) to communicate with a target.  \nCompromise supply chain or trusted source  \nAdding malicious software, hardware, or configurations to items \nthat are trusted to be non -malicious while on their way to the \ntarget network.  Leverage device swapping  \nAny instance in which an information system, either unaccredited \nor accredited for a specific network, is moved from said network to \na secondary network without authorization. Wheth er the device \nswapping is accidental or purposeful, it is a cross domain violation.  Use compromised host  \nThe process of delivering malicious code from a previously \ncompromised victim host to a target within the victim's network to \nbe used to gain further access.  \nConnect removable media  \nThe deployment of malicious code via removable media. \nRemovable media can be programmed to auto -run upon \ninsertion of a device, causing malware to be automatically \nexecuted.  Send malicious email  \nEmbeds malicious attachmen ts or links within an email message, \nsent to a target. The user's computer can be compromised after \nopening or executing the attached file, upon clicking the link, or \nupon loading the email itself, and potentially providing access to a \nmalicious actor.  Use legitimate remote access  \nThe use of legitimate remote access capabilities without exploiting \na vulnerability usually involving the reuse of legitimate credentials \nthat were captured previously to gain access to internal network \nresources.  \nConnect rogue  network devices  \nThe insertion or use of existing rogue interfaces to authorized \nnetwork devices.  Transport via common network infrastructure  \nDeliver malicious content via previous adversary -compromised \nnetwork infrastructure that connects to or transpor ts the target \nnetwork.  Use physical network bridge  \nNetworking hardware that creates an aggregate network from \neither two or more communication networks, or two or more \nnetwork segments.  Bridging (OSI layer 2) is distinct from routing \n(OSI layer 3), which  allows multiple different networks to \ncommunicate independently while remaining separate.  \n   \n \n  \n\n \n13 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018   \n \nNTCTF V 2 ACTION  DEFINITIONS  \n \nENGAGEMENT  \n> EXPLOITATION  \nAbuse protocols  \nThreat actor use of standard target system or network protocols to \ngain unauthoriz ed access through unanticipated use of the protocol.  Exploit local application vulnerability  \nExploiting a software vulnerability in an application by having the \nexploit triggered locally on the host, often requiring some user \ninteraction to launch and usu ally leading to user level access on the \nhost.  This occurs when a programming or logical error is triggered \nthat causes the software to behave in an unintended and insecure \nway. Impersonate or spoof user  \nAdversary poses as an authorized user in order to gain access to target \ncomputer system.  \nAccess virtual memory  \nAbusing physical collocation of separate/isolated virtual spaces \n(e.g., virtual machines, containers, processes) to compromise the \nintegrity or confidentiality of targeted virtual resources.  Exploit OS vulnerability  \nExploiting a software vulnerability in a default operating system \nservice or kernel. This occurs when a programming or logical error \nis triggered that causes the OS to behave in an unintended and \ninsecure way.  Exploiting OS vulnera bilities often leads directly to \nprivileged access on the host.  Launch zero -day exploit  \nA zero -day (0 -day) exploit is a vulnerability in software that is not publicly \ndisclosed or is unknown to the vendor, which is then exploited by the \nthreat actor befor e the vendor becomes aware and/or fixes it.  \nConduct social engineering  \nPsychological manipulation of people by threat actor into performing \nactions or divulging information.  Exploit remote application vulnerability  \nExploiting a software vulnerability in  an application by having the \nexploit triggered remotely over the network, often without any user \ninteraction and usually leading to user level access on the host.  \nThis occurs when a programming error is triggered that causes the \nsoftware to behave in an unintended and insecure way.  Leverage exploit packs  \nThreat actor makes use of exploit packs (also called an exploit kit), a \ntoolkit that automates the exploitation of client side vulnerabilities, usually \ntargeting browsers and programs that a website can invoke through the \nbrowser.  \nDefeat encryption  \nExploitation of cryptographic algorithms or device implementations \nof cryptography, or using acquired cryptographic keys to gain \naccess to or manipulate the underlying unencrypted content.  Exploit weak access  controls  \nExploitation of weak, misconfigured, or missing access controls to \ngain access to a system or data.  Leverage trusted relationship  \nLeverage compromise of a connected peer network or other trusted \nrelationship with another network.  \nExploit firmw are vulnerability  \nExploiting a software vulnerability in firmware to lead to access to a \ndevice. This occurs when a programming or logical error is triggered \nthat causes the software to behave in an unintended and insecure \nway.  Hijack  \nHijacking is a typ e of network security attack in which the threat \nactor takes control of a communication between two entities.  Replay  \nThreat actors conduct a network attack against a target in which a valid \ndata transmission is maliciously or fraudulently repeated or dela yed. \n\n \n14 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 ACTION  DEFINITIONS  \n \nPRESENCE  \n> INSTALLATION & EXECUTION  \nCreate scheduled task  \nTask scheduling is used to execute programs on a scheduled \nbasis to persist adversary code or gain SYSTEM privileges. \nTask scheduling requires administrator privileges, but tasks may \nbe configured to run with SYSTEM privileges, representing an \nescalation of privilege  Replace existing binary  \nThreat actor actions taken to replace a legitimate or pre -existing \nbinary with a malicious executable in a commonly trus ted \nlocation, from a legitimate source, or named with a common \nname to bypass tools that trust executables by relying on file \nname or path.  \nRun commands in shell  \nInvoke individual commands from the command line to run \nexecutable code. This can be done loc ally or remotely - and \ninteractively. Commands that are executed run with current \npermission level of the command line.  Use OS APIs  \nAdversary tools directly use an operating system (OS) \napplication programming interface (API) to execute binaries.  \nUse remo te services  \nUse remote administrative services to perform execution \nremotely, or other running services that have implied trust or \nauthentication that can be leveraged by the adversary to \nmaneuver through the network. With valid credentials and the \nability to remotely access the features, remote services can be \nused to read or modify system configuration and data and/or \ncause code to execute.  Execute via service controller  \nExecute a binary via the service controller or other methods of \ninteracting with s ervices.  \nExecute via third -party software  \nAdversary uses pre -existing third -party applications to execute \ncode within the targeted environment.  Run commands in shell  \nInvoke individual commands from the command line to run \nexecutable code. This can be done locally or remotely - and \ninteractively. Commands that are executed run with current \npermission level of the command line.  \nRun fileless payload  \nRun fileless payload only in memory without an executable file \nor script on disk.  Use trusted application to execute untrusted code  \nAdversary indirectly executes code through a trusted application \nand avoids triggering security tools.  \nInject into running process  \nInjecting malicious code into an existing legitimate process. \nRunning code in the context of anot her process provides many \nbenefits such as access to the process's memory, permissions, \nand identity. Code injection masks the malicious activity from \ncasual inspection of the task list.  Write to disk  \nStore binary data on a disk or network share to be us ed in further \noperations.  \nLeverage authorized user  \nActions initiated by an authorized user that enable the \ninstallation and execution of code.  Use interpreted scripts  \nUtilizing a scripting language, adversaries use scripts to execute \ncode in a number of different ways, either with script files or \nscript commands fed directly to the script interpreter.   \n \n  \n\n \n15 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 ACTION  DEFINITIONS  \n \nPRESENCE  \n> INTERNAL RECONNAISSANCE  \nEnumerate accounts and permissions  \nAdversaries attempt to get a listing of all local  or domain \naccounts and their permissions, including reviewing logins or file \nmodification times to identify primary users. Adversaries get a \nlisting of all local groups and their permissions and members.  Enumerate OS and software  \nAn adversary attempts to get detailed information about the OS \nincluding version, patches, hotfixes, service packs, and \narchitecture. Adversaries attempt to get a listing of software or \ndrivers that are installed on the system and their configurations.  Map acce ssible networks  \nThe sending of transmissions to the network's possible nodes, \nexamining the responses they receive identify the existence of \nnodes on the network. The results potentially provide insight to \nidentify security systems and policies on the network.  \nEnumerate fil e system  \nAdversaries enumerate all files and directories in certain areas \nof a host or remote share or perform a targeted search for \nspecific files or directories; also known as a directory walk.  Enumerate processes  \nAdversaries attempt to get information a bout running processes. \nThis could also include enumerating loaded libraries that are part \nof the running processes, or registered services.  Scan connected devices  \nActive or passive actions taken by the adversary in order to \ndetermine the software or firmw are currently used by a target, \nversions of software or firmware, a target's patch status, and \nconfiguration.  \nEnum erate local network connections  \nAdversaries attempt to get a listing of all network connections.  Enumerate windows  \nAdversaries attempt to ge t a listing of all application windows, \nincluding invisible windows.  Sniff network  \nNetwork sniffing is when the network is monitored to capture \ncredentials.  An adversary may place a network interface into \npromiscuous mode, using a utility to capture traff ic in transit over \nthe network or use span ports to capture a larger amount of \ndata.  Enumerate local network settings  \nAdversaries acquire information about local networks, typically \nusing several utilities that describe local network settings.  \n> PRIVIL EGE ESCALATION  \nExploit application vulnerability  \nExploiting a software vulnerability in an application by having \nthe exploit triggered, often requiring some user interaction to \nlaunch that leads to user level access on the host. This occurs \nwhen a program ming error causes the software to behave in an \nunintended and insecure way.  Exploit OS vulnerability  \nExploiting a software vulnerability in an operating system service \nor kernel.  This occurs when a programming error is triggered \nthat causes the software t o behave in an unintended and \ninsecure way. Exploiting OS vulnerabilities often leads directly t o \nprivileged access on the host.  Use accessibility features  \nAn adversary can modify accessibility features that may be \nlaunched with a key combination before a user has logged in. An \nadversary can modify the way these programs are launched to \nget a command prompt or backdoor without logging in to the \nsystem.  \nExploit firmware vulnerability  \nExploiting a software vulnerability in firmware to lead to access \nto a dev ice. This occurs when a programming or logical error is \ntriggered that causes the software to behave in an unintended \nand insecure way.  Inject into running process  \nInjecting malicious code into an existing legitimate process.  Use legitimate credentials  \nUsing compromised credentials to leverage legitimate access \ncontrols placed on various resources on hosts and within the \nnetwork to grant an adversary increased privilege to specific \nsystems or access to restricted areas of the network.  \n\n \n16 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 ACTION  DEFIN ITIONS  \n \nPRESENCE  \n> CREDENTIAL ACCESS  \nAdd or modify credentials  \nAccount creation and manipulation may aid adversaries in \nmaintaining access to credentials and certain permission levels \nwithin an environment; an adversary must already have \nsufficient perm issions on the domain or systems. This action \nincludes creating credentials, modifying permissions, adding or \nchanging permission groups, or modifying account settings.  Dump credentials  \nCredential dumping is obtaining information from weaknesses in \noperati ng system or software that can be used to login to the \noperating system. Utilities do this in many different ways: \nextracting credential hashes for off -line cracking, extracting \nplaintext passwords, or finding Kerberos tickets.  Locate credentia ls \nAdversari es search for local file systems, remote file shares, \nnetwork traffic, and other systems on the network for files or \nactivity containing passwords.  \nLog keystrokes  \nUse of software/hardware that records keystrokes and keyboard \nevents.  \nConduct social engi neering  \nPsychological manipulation of people by threat actor into \nperforming actions or divulging information.  Hijack active credential  \nThe malicious use of authentication tokens either activated by a \nlegitimate user or while in use without the user's know ledge.  Crack passwords  \nAdversaries may use password cracking techniques to attempt \naccess to accounts when passwords are unknown or when \npassword hashes are obtained.  \n> LATERAL MOVEMENT  \nExploit peer connections  \nExploit connected, peer -to-peer, or mesh n etwork to maneuver \nand expand presence within a network. The network may be \nwithin a single organization or across organizations with trust \nrelationships and authentication agreements.  Replicate through removable media  \nAdversaries may move between hosts,  possibly those on \ndisconnected or air -gapped networks, by copying to removable \nmedia and taking advantage of autorun features, by modifying \nexecutable files stored on removable media, or by copying \nmalware and renaming it to look like a legitimate file to  trick \nusers into executing it on a separate system.  Use remote services  \nUse remote administrative services to perform execution \nremotely, or other running services that have implied trust or \nauthentication that can be leveraged by the adversary to \nmaneuv er through the network. With valid credentials and the \nability to remotely access the features, they can be used to read \nor modify data and/or cause code to execute.  \nLogon remotely  \nAn adversary may use valid credentials to login to a remote \nhost for manu al interaction, through a graphical user interface \n(GUI) or command line interface that is sent back to the initiator \nof the remote connection. They may then perform action as the \nlogged on user.  Taint shared content  \nContent stored on network drives or in  other shared locations \nmay be tainted by adding malicious programs, scripts, or exploit \ncode to valid content. Once a user opens the shared content, \nthe tainted content is executed. Adversaries may taint shared \ncontent to move laterally.  Write to remote f ile shares  \nWriting data to remote hosts via file shares or file hosting to \ncause a change that results in code execution either directly by \noverwriting files or configuration data or indirectly by preplacing \ncode that is executed via another mechanism.  \n  \n\n \n17 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 ACTION  DEFINITIONS  \n \nPass the hash  \nPass the hash (PtH) is a method of authenticating as a user \nwithout having access to the user's cleartext password. This \nmethod bypasses standard authentication steps that require \na cleartext password, moving d irectly into the portion of the \nauthentication that uses the password hash. Threat actors \nuse valid, captured password hashes for the account to \nauthenticate as the user.  Use application -deployment software  \nAdversaries may deploy new software to systems u sing \napplication deployment systems already employed by site \nadministrators. The permissions required for this action \nvaries by system; local credentials may be sufficient with \ndirect access to the deployment server. However the system \nmay require an admin istrative user account to log in, or to \nperform software deployment.  Write to shared webroot  \nAdversaries may add malicious content to a website through the open file \nshare and then browse to that content with a web browser to cause the \nserver to execute t he content. The malicious content will typically run \nunder the context and permissions of the web server process, often \nresulting in local system or administrative privileges depending on how \nthe web server is configured.  \nPass the ticket  \nPass the ticket (PtT) is a method of authenticating as a user without having access to the user's cleartext password. This method bypasses st andard authentication steps that require a cleartext \npassword, moving directly into the portion of the authentication that uses the  Kerberos ticket. Threat actors use valid Kerberos tickets for the account that are either captured using a Credential Access \ntechnique or generated by the attacker who has the right level of access to generate forged tickets through the golden ticket  attack. Kerberos tickets are used with PtH to authenticate as a user. Once \nauthenticated, PtT may be used to logon to remote or local systems.  \n> PERSISTENCE  \nCreate new service  \nCreate a new service started by the operating system by \ndirectly modifying the re gistry (or similar construct) or by \nusing tools which do so.  Leverage path -order execution  \nPath interception occurs when an executable is placed in a \nspecially crafted path so that it is executed instead of the \nintended target.  Modify service configuratio n  \nAlter subsequent load processes for service related executables and \nlibraries by modifying the services configuration information; not \nconfiguration of the service manager itself, but services run by it.  \nCreate scheduled task  \nTask scheduling is used to execute programs on a periodic \nbasis to persist adversary capabilities or gain elevated \nprivileges.  Modify BIOS  \nThe BIOS (Basic Input/Output System) or Unified Extensible \nFirmware Interface (UEFI), which underlies the functionality \nof a computer or oth er device, may be modified to perform or \nassist in malicious activity.  Replace service binary  \nIf the file system location of a service executable is modifiable by the \nuser, it may be replaced by another executable. An adversary may use \nthis capability to gain elevated privileges by putting their own \nexecutable in place of the service executable.  \nEdit boot record  \nThe master boot record (MBR) is the section of disk that is \nfirst loaded after completing hardware initialization by the \nBIOS and is the locatio n of the boot loader. If an adversary \nhas raw access to the boot drive, they may modify or \noverwrite this area diverting execution during startup from the \nnormal bootloader to adversary code. This could also be \nachieved by modifying the virtual boot record  (VBR) or \npartition table.  Modify configuration to facilitate launch  \nAn adversary causes a file to execute based on a \nconfiguration change.  Set to load at startup  \nAn adversary causes the system to automatically load and execute \ncode after the operating s ystem has started.  \n\n \n18 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 ACTION  DEFINITIONS    \nEdit file -type associations  \nWhen a file is opened, its file extension or header is checked \nto determine which program opens the file. In Windows, \nthese defaults are stored in the registry and can be edite d by \nprograms that have registry access. Applications can modify \nthe file handler for a given file extension to call an arbitrary \nprogram when a file with the given extension is opened.  Modify existing services  \nModify an existing service to run adversary s oftware by using \ntools that modify the registry or by directly modifying the \nregistry. Modifying existing services may break existing \nservices or may enable services that are disabled/not \ncommonly used.  Use library -search hijack  \nAdversaries take advantage  of the library search order and programs \nthat ambiguously specify libraries to gain privilege escalation.  \nEmploy logon scripts  \nLogon scripts are run whenever a specific user or users logon to a system. If adversaries can access these scripts, they can insert \nadditional code that allows them to maintain persistence or move laterally within an enclave because it is executed every tim e the \naffected user or users logon to a computer. Modifying logon scripts can effectively bypass workstation and enclave firew alls. Depending \non the access configuration of the logon scripts, either local credentials or a remote administrative account may be necessar y. Modify links  \nLinks redirect from one location to another location. The \nadversary may edit or create a link so th at data or \nexecution occurs in an alternate location than intended to \nmaintain persistence or escalate privileges.  \nEFFECT  \n> MONITOR  \nActivate recording  \nThreat actor actions to capture/record audio/video activity \nwithin the target's work space.  Enable ot her operations  \nMeasurable cyber threat activities that indicate, identify \nand/or establish a foundation for subsequent actions against \na target's data, computer(s) and/or information systems.  Maintain access  \nProcess of checking or maintaining accesses in to or on targeted networks \nand hosts. Access can be tracked through the use of automated beacons, \nor interactive means to provide situational awareness.  \nCollect passively  \nThreat actor actions taken to collect information on the target \nusing methods which  require no active effort on behalf of the \nactor and for which the target has limited awareness.  Log keystrokes  \nUse of software/hardware that records keystrokes and \nkeyboard events.  Take screen capture  \nThreat actor actions taken to capture target screen shots during target \noperations.  \n> EXFILTRATE  \nCollect crosstalk  \nUse of any phenomenon by which a signal transmitted on \none circuit or channel creates an unintended effect on \nanother circuit or channel that is not physically connected to \ngather informatio n. Position data  \nData, gathered from one or more sources, is placed in a \nspecified location for exfiltration at a later time. This \ntechnique may be used to aggregate files in preparation for \nexfiltration.  Send over other network medium  \nExfiltration occur s over a completely different network medium than the \ncommand and control channel. If the command and control network is a \nwired Internet connection, the exfiltration may occur, for example, over a \nWiFi connection, cellular data connection, or Bluetooth. A dversaries may \nbroadcast and connect to their own wireless network specifically for data \nexfiltration.  \n\n \n19 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 ACTION  DEFINITIONS   \nCollect from local system  \nData is collected from local sources on a host that is accessible \nfrom the current system.  \nCollect from network resources  \nData is collected from a network resource that is accessible from \nthe current system.  Run collection script  \nData is identified and/or gathered through the use of automated \nprocessing or scripting. This may include automated searc hing of \nfiles matching criteria or entire directory structures.  Throttle data  \nData is arranged into defined chunks instead of whole files, or \npacket sizes are limited. This approach may be used to avoid \noperational limitations dealing with logical or physi cal transfer \nconstraints related to transmission protocols.  \nCompress data  \nData is compressed prior to exfiltration to minimize the amount of \ndata sent over the network or to make the contents of the data \nless obvious. This compression is done separately f rom the \nexfiltration channel. The compression may be performed using a \ncustom program or algorithm, or a more common compression \nlibrary or program.  Send over C2 channel  \nData exfiltration is performed over the adversary command and \ncontrol channel. Data is  transferred through the channel using the \nsame protocol as command and control communications.  Transfer via physical means  \nExfiltration occurs via a physical medium. This medium can be \nan entire device being lost, stolen, or removed; a component \npart, or even a non -digital medium such as printed papers. The \nphysical media may be used as the final exfiltration point or as a \nhop between disconnected devices.  \nDisclose data or information  \nRelease data/information to let unauthorized people read \ndata/informati on to which they are not authorized access to deny \nintegrity.  Send over non -C2 channel  \nData exfiltration is performed over the same network as the \nadversary command and control channel, or other directly \nconnected networks, but data is not routed through t he existing \nadversary command and control channel. An alternate data \nconnection would be made to transfer the data.  Traverse CDS or MLS  \nUsage of CDS or MLS to maliciously transfer content, or allow \nadversarial movement from one network to another.  This \ntechnique focuses on zero -day unknown or design vulnerabilities \nin the trusted device or its component parts or software that a \nsystem administrator cannot be expected to prevent.  \n> MODIFY  \nAlter data  \nThe modification of data within information systems. Dat a that is \nmodified is not deleted, but changed to influence decisions or \ncause confusion.  Change ma chine -to-machine communications  \nActions taken to alter communications between processes \noperating on separate target computer(s), network(s) and/or \ninformati on system(s).  Deface websites  \nActions to change the visual appearance of a website or webpage.  \nAlter process outcomes  \nActions taken to alter process outcomes of target's internal target \ncomputer(s), network(s), and/or information system(s).  \nCause physica l effects  Chang e run -state of system processes  \nActions taken to alter the state (e.g. running, suspended, \nstopped) of processes operating on the target's computer(s), \nnetwork(s), and/or information system(s), to achieve desired \noutcomes.  Defeat encryption  \nExploitation of weak or misconfigured cryptographic algorithms, \nmodifications of configurations, or using acquired cryptographic keys to \ngain access to or  manipulate the underlying unencrypted content.  \n\n \n20 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Causing a physical effect to occur, such as a piece of equipment \nmalfunctioning or turning off power.  \n \nNTCTF V 2 ACTION  DEFINITIONS   \n> DENY  \nCorrupt files or applications  \nModification of data by an adversary to render the files or applications \nunusable.  \nEncrypt data to render unusable  \nThe encrypting of data  by an adversary to render the data unusable.  Degrade  \nActions taken to decrease capabilities to some degree \nand/or for a period of time the target's computer, \ninformation system, or network.  Disrupt or denial of service  \nNormal system activities directed a t the victim's environment in a \nmagnitude that overwhelms the normal operation of the victim's \ncomputer(s), network(s), and/or information system(s), thus \nseverely limiting or precluding normal access. This includes the use \nof multiple systems to cause a D istributed Denial of Service \n(DDOS).  \n> DESTROY  \nBrick disk or OS (full delete)  \nDeletion of critical components of an operating system rendering it unusable by the target/victim.  \nCorrupt disk or OS (partial delete)  \nDeletion of some components of an opera ting system rendering it unusable by the target/victim. The \nsystem may have some recoverable information.  Delete data  \nDeletion of data from a hard drive, or computer system, without damaging the operating system \nor hardware.  \nDestroy hardware  \nPermanently,  completely and irreparably damage a target's physical computer or information \nsystem(s), network(s), and/or data stores.  \nANALYSIS, EVALUATION, AND FEEDBACK  \nAbandon infrastructure  \nActions taken to cease use of infrastructure previously allocated for \ntargeted operations.  Conduct effects assessments  \nRecurring actions taken to assess the success of cyber \nthreat activities/operations in meeting intended \nobjectives.  Assessments may occur multiple times during \nongoing activities/operations and serves as the starting \npoint for validating/resetting objectives and courses of \nactions.  Refine potential victims  \nActions taken (electronically or physically) to ensure presence and \nvalidity of intended target data/information, and/or identify \nadditional potential targ ets (data, computers, and/or information \nsystems), and that intended tools/processes will achieve intended \noutcome/result.  \n \n  \n\n \n21 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018   \nNTCTF V 2 ACTION  DEFINITIONS   \nC2 \nBeacon to midpoints  \nTransmission of location, health, or other operational status of \npersiste nt access capabilities to a designated location and/or \nthreat actor.  Establish peer network  \nEstablish a proxied, peer -to-peer or mesh network to manage \nC2 communications. The network may be within a single \norganization or across organizations with trust r elationships.  Use peer connections  \nUse a proxied, peer -to-peer or mesh network to manage C2 \ncommunications to reduce the number of simultaneous \noutbound network connections and to provide resiliency upon \nconnection loss.  \nSend commands  \nAdversary actions to issue commands to installed malware or \nimplants on compromised hosts.  Use botnet  \nSend command and control communications to or via a \npreviously created botnet.  Use remote shell  \nA threat actor uses an application, script, or shell to create \nunauthorize d access.  \nRelay communications  \nAdversary actions to transmit malicious data/code through \nnetworks from host to host, or manipulating routing \ninfrastructure.  Use chained protocols  \nUse of various protocols in concert to communicate with a \nsystem under the ir control in a target network to enable the C2 \nto eventually get to the C2 server over multiple hops. This is \noften used when certain protocols are allowed inside the \nnetwork for some connections and then other protocols are \nallowed from certain compromis ed devices to leave the network.  Use removable media  \nUse removable media to spread commands from computer to \ncomputer, including on potentially disconnected networks.  \nEVASION  \nAccess raw disk  \nPrograms with direct drive access may read and write files \ndirectly from the drive by analyzing file system data structures. \nThis enables covert storage and avoids operating system \nvisibility.  Employ rootkit  \nRootkits are programs that hide the existence of malware by \nintercepting and modifying OS API calls that sup ply system \ninformation. Rootkit functionality may reside at the user level, \nkernel level in the OS, or lower, to include a hypervisor, MBR, or \nthe BIOS. Adversaries use rootkits to hide the presence of \nprograms, files, connections, services, and/or drivers . Obfuscate data  \nMake data more difficult to analyze by selectively replacing or \notherwise concealing its contents; includes executables and \nnetwork traffic.  \nAvoid data -size limits  \nData being exfiltrated is sent in defined chunks instead of whole \nfiles or packet sizes are limited. This approach may be used to \navoid triggering network threshold alerts.  Encode data  \nThe process of converting data into another format.  Remove logged data  \nThe deletion or modification of generated log/event files on a \nhost sy stem. This may compromise the integrity of the security \nsolution causing security events to go unreported or impeding \nincident response.  \n\n \n22 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  \nNTCTF V 2 ACTION  DEFINITIONS   \nBlock indicators on host  \nBlocking indicators of host activity from leaving the host \nmachine. In the case of network based reporting of indicators, \nan adversary may block traffic associated with reporting to \nprevent central station analysis. This may be accomplished by \nmany means such as stopping a local process to creating a \nhost-based firew all rule to block traffic to a specific server.  Encrypt data  \nData is encrypted to hide the target information, increasing \ninspection difficulty. This action is performed on the data at rest or \nin transit. Adversaries encrypt data to protect or conceal the  \nspecific activities.  Remove toolkit  \nMalware, tools, or other non -native files dropped or created on a \nsystem by an adversary may leave traces behind as to what \nwas done within a network and how. Adversaries may remove \nthese files over the course of an in trusion to keep their footprint \nlow or remove them at the end as part of the post -intrusion \ncleanup process. There are tools available from the host \noperation system to perform cleanup, but adversaries may \nchoose to use other tools as well.  \nDegrade secur ity products  \nDisable, disrupt, or otherwise evade security tools to avoid \ndetection. This can take the form of killing processes, deleting \nregistry keys so that tools do not start at run time, or other \nmethods to prevent the intended operation.   Impersona te legitimate file  \nPlacing a file in a commonly trusted location (such as \nC:\\Windows \\System32) or naming a file with a common name \n(such as \"explorer.exe\" or \"svchost.exe\") to leverage tools that \ntrust executables by relying on file name or path. This als o may \nbe done to deceive defenders and system administrators into \nthinking a file is benign by name association to something that is \nknown to be legitimate.  Sign malicious content  \nSigning malicious code using stolen, self -generated, or \ncompromised private  keys, since signed content is either \nrequired by the operating system or often trusted by default.  \nDelay activity  \nThe use of sleep timers, user interaction, computationally \nintensive algorithms, and other means to delay malicious \nbehavior execution in o rder to evade detection by timed \nbehavioral detection technologies.  \nEmploy anti -forensics measures  \nThreat actor actions to destroy or obfuscate data artifacts \n(beyond logs and files) that would indicate their presence on \ntarget computer(s), information sy stem(s), and/or network(s), \nand thereby render target -initiated forensic analysis difficult or \nimpossible.  Manipulate trusted process  \nMalicious software may inject into a trusted process to gain \nelevated privileges without prompting a user.  \n \nMimic legitim ate traffic  \nActions to avoid detection by blending in with existing traffic. This \ncould include using standard protocols and ports, similar volume, \nsame time of day, source and destinations, and types of traffic \nthat occur internally within an enclave. C2  commands and results \nare embedded within the traffic between the client and server.  Store files in unconventional location  \nData or executables may be stored in file system metadata, \nslack space, registry, outside logical partition, or some other \nunconven tional location instead of directly in files to evade file \nmonitoring tools. These actions leverage standard disk \nread/write operations (different from raw access).  \n \nTailor behavior to environment  \nDetecting the environment where code or scripts are execut ed \nand adjusting execution behaviors to avoid detection.  \nEmploy anti -reverse -engineering measures  \nUse a variety of activities to evade reverse engineering efforts.  Modify malware to avoid detection  \nIf malware is detected and quarantined, an adversary ma y be able \nto determine why the malware was detected, modify the malware, \nand send an updated version that is no longer detected by \nsecurity tools.  Use signed content  \nThe use of signed content or code for malicious purposes, \nincluding computed hash collisi ons, legitimate signed software \nfor malicious purposes, since signed content is either required \nor trusted by default.  \n\n \n23 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018    \nAppendix A.  Key Phrases by NTCTF Action  \n(U) This table contains a mapping of commonly used phrases to NTCTF Actions.  \nStage  Objecti ve Action  Key Phrase s \nAdministration  Planning  Analyze operation  success criteria  \nAdministration  Planning  Analyze operation  information needs  \nAdministration  Planning  Analyze operation  mission needs  \nAdministration  Planning  Analyze operation  policy  \nAdmin istration  Planning  Analyze operation  measures of performance  \nAdministration  Planning  Analyze operation  leadership  \nAdministration  Planning  Determine strategy and goals  intentions  \nAdministration  Planning  Determine strategy and goals  strategy  \nAdministrati on Planning  Determine strategy and goals  goals  \nAdministration  Planning  Determine strategy and goals  interests  \nAdministration  Planning  Determine strategy and goals  communications between organizational leaders  \nAdministration  Planning  Determine strategy a nd goals  perception  \nAdministration  Planning  Determine strategy and goals  environmental changes  \nAdministration  Planning  Determine strategy and goals  desired outcomes  \nAdministration  Planning  Determine strategy and goals  operational goals  \nAdministration  Planning  Determine strategy and goals  evaluation  \nAdministration  Planning  Issue operational directive  send tasking  \nAdministration  Planning  Issue operational directive  commands  \nAdministration  Planning  Issue operational directive  execute operation  \nAdminist ration  Planning  Issue operational directive  leadership decision  \nAdministration  Planning  Produce operational plans  schedule of operations  \nAdministration  Planning  Produce operational plans  planning  \nAdministration  Planning  Produce operational plans  documen ts \nAdministration  Planning  Produce operational plans  expected outcomes  \nAdministration  Planning  Receive approval to execute operations  leadership approval  \nAdministration  Planning  Receive approval to execute operations  approval  \nAdministration  Planning  Receive approval to execute operations  authorization  \nAdministration  Planning  Receive approval to execute operations  orders  \nAdministration  Planning  Select intended victims  victim group  \nAdministration  Planning  Select intended victims  victim organization  \nAdministration  Planning  Select intended victims  strategic target list  \nAdministration  Planning  Select intended victims  intent for operation  \nAdministration  Resource Development  Acquire operational infrastructure  cloud hosting  \nAdministration  Resource Develop ment  Acquire operational infrastructure  facilities  \nAdministration  Resource Development  Acquire operational infrastructure  purchase infrastructure  \nAdministration  Resource Development  Acquire operational infrastructure  virtual private server  \nAdministratio n Resource Development  Acquire operational infrastructure  register domains  \nAdministration  Resource Development  Acquire operational infrastructure  rent physical space  \nAdministration  Resource Development  Acquire operational infrastructure  set up accounts  \nAdministration  Resource Development  Acquire operational infrastructure  network connection  \nAdministration  Resource Development  Acquire operational infrastructure  lease botnet  \nAdministration  Resource Development  Build alliances and partnerships  contract de velopment  \nAdministration  Resource Development  Build alliances and partnerships  commercial vendors   \n \n\n \n24 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Administration  Resource Development  Build alliances and partnerships  contracts  \nAdministration  Resource Development  Build alliances and partnerships  supply chain  \nAdministration  Resource Development  Build alliances and partnerships  co-production  \nAdministration  Resource Development  Build alliances and partnerships  relationships  \nAdministration  Resource Development  Create botnet  botnet  \nAdministration  Resource  Development  Create botnet  virtual network  \nAdministration  Resource Development  Create botnet  bot \nAdministration  Resource Development  Create botnet  controller  \nAdministration  Resource Development  Develop capabilities  framework  \nAdministration  Resource Dev elopment  Develop capabilities  tools  \nAdministration  Resource Development  Develop capabilities  toolkits  \nAdministration  Resource Development  Develop capabilities  create repo  \nAdministration  Resource Development  Develop capabilities  custom code  \nAdministrati on Resource Development  Develop capabilities  0-day exploits  \nAdministration  Resource Development  Develop capabilities  exploits  \nAdministration  Resource Development  Develop capabilities  modules  \nAdministration  Resource Development  Develop capabilities  impla nts \nAdministration  Resource Development  Develop capabilities  testing  \nAdministration  Resource Development  Develop capabilities  test malware  \nAdministration  Resource Development  Develop capabilities  malware testing  \nAdministration  Resource Development  Obta in financing  contracts  \nAdministration  Resource Development  Obtain financing  income  \nAdministration  Resource Development  Obtain financing  cryptocurrency  \nAdministration  Resource Development  Obtain financing  funding  \nAdministration  Resource Development  Obta in financing  expenses  \nAdministration  Resource Development  Obtain financing  cryptomining  \nAdministration  Resource Development  Obtain financing  cryptojacking  \nAdministration  Resource Development  Obtain financing  virtual money  \nAdministration  Resource Develo pment  Obtain financing  digital currency  \nAdministration  Resource Development  Seed supply chain  supply chain compromise  \nAdministration  Resource Development  Seed supply chain  compromised partner  \nAdministration  Resource Development  Seed supply chain  softwar e \nAdministration  Resource Development  Seed supply chain  firmware  \nAdministration  Resource Development  Seed supply chain  hardware  \nAdministration  Resource Development  Staff and train resources  resume  \nAdministration  Resource Development  Staff and train res ources  recruit  \nAdministration  Resource Development  Staff and train resources  train \nAdministration  Resource Development  Staff and train resources  terminate  \nAdministration  Research  Gather information  vulnerabilities  \nAdministration  Research  Gather informa tion breached credentials  \nAdministration  Research  Gather information  publicly available  \nAdministration  Research  Gather information  websites  \nAdministration  Research  Identify capability gaps  target infrastructure  \nAdministration  Research  Identify capabili ty gaps  requirements  \nAdministration  Research  Identify capability gaps  missing capability  \nAdministration  Research  Identify capability gaps  malware analysis  \nAdministration  Research  Identify information gaps  review data  \nAdministration  Research  Identify in formation gaps  missing target data  \nAdministration  Research  Identify information gaps  collected information  \nPreparation  Reconnaissance  Conduct social engineering  social engineering  \nPreparation  Reconnaissance  Conduct social engineering  manipulate people  \n\n \n25 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Preparation  Reconnaissance  Conduct social engineering  solicit  \nPreparation  Reconnaissance  Conduct social engineering  ask questions  \nPreparation  Reconnaissance  Conduct social engineering  gather responses  \nPreparation  Reconnaissance  Conduct social engineerin g vishing  \nPreparation  Reconnaissance  Conduct social engineering  elicitation  \nPreparation  Reconnaissance  Gather credentials  obtain credentials  \nPreparation  Reconnaissance  Gather credentials  site masquerading  \nPreparation  Reconnaissance  Gather credentials  typo squatting  \nPreparation  Reconnaissance  Gather credentials  typosquatting  \nPreparation  Reconnaissance  Gather credentials  page scraping  \nPreparation  Reconnaissance  Gather credentials  domain squatting  \nPreparation  Reconnaissance  Gather credentials  cybersqua tting \nPreparation  Reconnaissance  Gather credentials  password list  \nPreparation  Reconnaissance  Gather credentials  compromised credentials  \nPreparation  Reconnaissance  Gather credentials  common passwords  \nPreparation  Reconnaissance  Gather credentials  usernam es and passwords  \nPreparation  Reconnaissance  Gather credentials  rainbow table  \nPreparation  Reconnaissance  Gather credentials  email credentials  \nPreparation  Reconnaissance  Gather credentials  domain credentials  \nPreparation  Reconnaissance  Gather credentials  account harvesting  \nPreparation  Reconnaissance  Identify crosstalk  crosstalk  \nPreparation  Reconnaissance  Identify crosstalk  electromagnetic interference  \nPreparation  Reconnaissance  Identify crosstalk  twisted pair  \nPreparation  Reconnaissance  Identify crossta lk emanations  \nPreparation  Reconnaissance  Identify crosstalk  audio signals  \nPreparation  Reconnaissance  Identify crosstalk  video signals  \nPreparation  Reconnaissance  Map accessible networks  network mapping  \nPreparation  Reconnaissance  Map accessible networks  subnet  \nPreparation  Reconnaissance  Map accessible networks  evaluating route statements  \nPreparation  Reconnaissance  Map accessible networks  ping \nPreparation  Reconnaissance  Map accessible networks  ping sweep  \nPreparation  Reconnaissance  Map accessible networ ks active devices  \nPreparation  Reconnaissance  Map accessible networks  nmap  \nPreparation  Reconnaissance  Map accessible networks  icmp  \nPreparation  Reconnaissance  Map accessible networks  traceroute  \nPreparation  Reconnaissance  Scan devices  active scan  \nPrepara tion Reconnaissance  Scan devices  port scan  \nPreparation  Reconnaissance  Scan devices  TCP fingerprinting  \nPreparation  Reconnaissance  Scan devices  banner grabbing  \nPreparation  Reconnaissance  Scan devices  vulnerability scan  \nPreparation  Reconnaissance  Scan dev ices passive scan  \nPreparation  Reconnaissance  Scan devices  scanning  \nPreparation  Reconnaissance  Scan devices  OS fingerprinting  \nPreparation  Reconnaissance  Scan devices  open ports  \nPreparation  Reconnaissance  Scan devices  address scan  \nPreparation  Reconnaiss ance  Scrape websites  web scraper  \nPreparation  Reconnaissance  Scrape websites  web forum  \nPreparation  Reconnaissance  Scrape websites  google dorking  \nPreparation  Reconnaissance  Scrape websites  bulk retrieval  \nPreparation  Reconnaissance  Scrape websites  robot.t xt \nPreparation  Reconnaissance  Scrape websites  conference website  \n\n \n26 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Preparation  Reconnaissance  Scrape websites  bulletin board  \nPreparation  Reconnaissance  Scrape websites  web search  \nPreparation  Reconnaissance  Scrape websites  search engine  \nPreparation  Recon naissance  Scrape websites  web crawler  \nPreparation  Reconnaissance  Scrape websites  scraping  \nPreparation  Reconnaissance  Scrape websites  web scraping  \nPreparation  Reconnaissance  Scrape websites  spambot  \nPreparation  Reconnaissance  Select potential victims  target list  \nPreparation  Reconnaissance  Select potential victims  targeted user  \nPreparation  Reconnaissance  Select potential victims  targeted network  \nPreparation  Reconnaissance  Select potential victims  vulnerable host  \nPreparation  Reconnaissance  Survey device s analyze targets  \nPreparation  Reconnaissance  Survey devices  cross check information  \nPreparation  Reconnaissance  Survey devices  search CVE  \nPreparation  Reconnaissance  Survey devices  whois  \nPreparation  Reconnaissance  Survey devices  dig \nPreparation  Reconnai ssance  Survey devices  finger  \nPreparation  Reconnaissance  Survey devices  identify crypto  \nPreparation  Reconnaissance  Survey devices  fuzzing  \nPreparation  Reconnaissance  Use social media  handle  \nPreparation  Reconnaissance  Use social media  develop profile  \nPreparation  Reconnaissance  Use social media  friend request  \nPreparation  Reconnaissance  Use social media  private message  \nPreparation  Reconnaissance  Use social media  post \nPreparation  Reconnaissance  Use social media  download data  \nPreparation  Reconnaissance  Use social media  contact list  \nPreparation  Reconnaissance  Use social media  profile  \nPreparation  Reconnaissance  Use social media  likes \nPreparation  Reconnaissance  Use social media  connections  \nPreparation  Reconnaissance  Use social media  groups  \nPreparation  Reconnaissance  Use social media  followers  \nPreparation  Reconnaissance  Use social media  tweet  \nPreparation  Reconnaissance  Use social media  feed \nPreparation  Staging  Add exploits to application data files  application vulnerability  \nPreparation  Staging  Add expl oits to application data files  exploit  \nPreparation  Staging  Add exploits to application data files  CVE \nPreparation  Staging  Add exploits to application data files  macro  \nPreparation  Staging  Add exploits to application data files  VBS \nPreparation  Staging  Add exploits to application data files  embed  \nPreparation  Staging  Add exploits to application data files  steganography  \nPreparation  Staging  Add exploits to application data files  alter content  \nPreparation  Staging  Add exploits to application data files  javas cript \nPreparation  Staging  Add exploits to application data files  font \nPreparation  Staging  Add exploits to application data files  container  \nPreparation  Staging  Add exploits to application data files  decoy  \nPreparation  Staging  Allocate operational infrast ructure  manage domains  \nPreparation  Staging  Allocate operational infrastructure  resolve to IP address  \nPreparation  Staging  Allocate operational infrastructure  resolve to null IP address  \nPreparation  Staging  Allocate operational infrastructure  configure hos ted infrastructure  \nPreparation  Staging  Allocate operational infrastructure  update dynamic -DNS  \nPreparation  Staging  Allocate operational infrastructure  anonymizing infrastructure  \n\n \n27 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Preparation  Staging  Allocate operational infrastructure  domain shadowing  \nPreparation  Staging  Allocate operational infrastructure  create subdomain  \nPreparation  Staging  Create midpoints  log into hosting accounts  \nPreparation  Staging  Create midpoints  hop point  \nPreparation  Staging  Create midpoints  virtual private server  \nPreparation  Staging  Create midpoints  VPS \nPreparation  Staging  Create midpoints  jump box  \nPreparation  Staging  Create midpoints  relay  \nPreparation  Staging  Create midpoints  deploy software on hosted device  \nPreparation  Staging  Create midpoints  update software  \nPreparati on Staging  Establish physical proximity  local infrastructure  \nPreparation  Staging  Establish physical proximity  insider threat  \nPreparation  Staging  Establish physical proximity  minimize latency  \nPreparation  Staging  Establish physical proximity  enable wirele ss access  \nPreparation  Staging  Establish physical proximity  improve OPSEC  \nPreparation  Staging  Establish physical proximity  physical office  \nPreparation  Staging  Establish physical proximity  data center location  \nPreparation  Staging  Infect or seed website  phishing  \nPreparation  Staging  Infect or seed website  web shell  \nPreparation  Staging  Infect or seed website  webshell  \nPreparation  Staging  Infect or seed website  modify existing website  \nPreparation  Staging  Infect or seed website  malvertising  \nPreparation  Staging Infect or seed website  watering hole  \nPreparation  Staging  Infect or seed website  drive -by download  \nPreparation  Staging  Infect or seed website  fuzzing  \nPreparation  Staging  Pre-position payload  pre-positioning  \nPreparation  Staging  Pre-position payload  cloud document hosting services  \nPreparation  Staging  Pre-position payload  accessible data storage  \nEngagement  Delivery  Access via wireless  wifi \nEngagement  Delivery  Access via wireless  WPA  \nEngagement  Delivery  Access via wireless  WEP  \nEngagement  Deliver y Access via wireless  access point  \nEngagement  Delivery  Access via wireless  AP \nEngagement  Delivery  Access via wireless  mircowave  \nEngagement  Delivery  Access via wireless  bluetooth  \nEngagement  Delivery  Access via wireless  wireless card  \nEngagement  Delivery Access via wireless  cellular  \nEngagement  Delivery  Access via wireless  IR \nEngagement  Delivery  Access via wireless  inductive coupling  \nEngagement  Delivery  Access via wireless  RF \nEngagement  Delivery  Access via wireless  airdrop  \nEngagement  Deliver y Access via wireless  BLE \nEngagement  Delivery  Access via wireless  bluejacking  \nEngagement  Delivery  Access via wireless  bluesnarfing  \nEngagement  Delivery  Alter communications path  change route  \nEngagement  Delivery  Alter communications path  cache poisoni ng \nEngagement  Delivery  Alter communications path  DNS poisoning  \nEngagement  Delivery  Alter communications path  route poisoning  \nEngagement  Delivery  Alter communications path  route injection  \nEngagement  Delivery  Alter communications path  ARP poisoning  \nEnga gement  Delivery  Alter communications path  race condition  \n\n \n28 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Engagement  Delivery  Alter communications path  man-in-the-middle  \nEngagement  Delivery  Alter communications path  man-on-the-side \nEngagement  Delivery  Alter communications path  poison cache  \nEngagement  Delivery  Alter communications path  false URL  \nEngagement  Delivery  Alter communications path  cached URL  \nEngagement  Delivery  Compromise supply chain or trusted source  trusted vendor list  \nEngagement  Delivery  Compromise supply chain or trusted source  suppli er \nEngagement  Delivery  Compromise supply chain or trusted source  install malicious software  \nEngagement  Delivery  Compromise supply chain or trusted source  modify firmware  \nEngagement  Delivery  Compromise supply chain or trusted source  modify hardware  \nEnga gement  Delivery  Compromise supply chain or trusted source  install malicious hardware  \nEngagement  Delivery  Compromise supply chain or trusted source  redirect shipment  \nEngagement  Delivery  Compromise supply chain or trusted source  supply chain compromise  \nEngagement  Delivery  Connect removable media  insert removable media  \nEngagement  Delivery  Connect removable media  USB \nEngagement  Delivery  Connect removable media  flash drive  \nEngagement  Delivery  Connect removable media  CD \nEngagement  Delivery  Connect removabl e media  external hard drive  \nEngagement  Delivery  Connect removable media  auto-run \nEngagement  Delivery  Connect removable media  .ini \nEngagement  Delivery  Connect removable media  replication through removable media  \nEngagement  Delivery  Connect rogue network devices  create access point  \nEngagement  Delivery  Connect rogue network devices  rogue access point  \nEngagement  Delivery  Connect rogue network devices  extra network interface card  \nEngagement  Delivery  Connect rogue network devices  NIC \nEngagement  Delivery  Connect rogue network devices  embedded infrared  \nEngagement  Delivery  Connect rogue network devices  bluetooth  \nEngagement  Delivery  Connect rogue network devices  wifi \nEngagement  Delivery  Connect rogue network devices  cellular modem  \nEngagement  Delivery  Connec t rogue network devices  hot spot  \nEngagement  Delivery  Connect rogue network devices  hardware additions  \nEngagement  Delivery  Infect via websites  watering hole  \nEngagement  Delivery  Infect via websites  advertisement  \nEngagement  Delivery  Infect via websites  malvertising  \nEngagement  Delivery  Infect via websites  embedded  \nEngagement  Delivery  Infect via websites  iframe  \nEngagement  Delivery  Infect via websites  legitimate website  \nEngagement  Delivery  Infect via websites  compromised website  \nEngagement  Delivery  Infec t via websites  spoofed website  \nEngagement  Delivery  Infect via websites  whitelisted  \nEngagement  Delivery  Infect via websites  download  \nEngagement  Delivery  Infect via websites  cross site scripting  \nEngagement  Delivery  Infect via websites  cross -site scriptin g \nEngagement  Delivery  Infect via websites  XSS \nEngagement  Delivery  Infect via websites  drive -by compromise  \nEngagement  Delivery  Infect via websites  spearphishing link  \nEngagement  Delivery  Infect via websites  spearphishing via service  \nEngagement  Delivery  Infect via websites  adware  \nEngagement  Delivery  Infect via websites  cookie  \nEngagement  Delivery  Infect via websites  scareware  \nEngagement  Delivery  Inject database command  SQL injection  \n\n \n29 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Engagement  Delivery  Inject database command  web interface  \nEngagement  Delivery  Inject database command  fuzzing  \nEngagement  Delivery  Inject database command  error handling  \nEngagement  Delivery  Inject database command  form handling  \nEngagement  Delivery  Inject database command  URL parameters  \nEngagement  Delivery  Inject database  command  encoding  \nEngagement  Delivery  Inject database command  web server error messages  \nEngagement  Delivery  Inject database command  exploit public -facing application  \nEngagement  Delivery  Leverage device swapping  unauthorized device  \nEngagement  Delivery  Leverage device swapping  insider threat  \nEngagement  Delivery  Leverage device swapping  cross -domain movement  \nEngagement  Delivery  Leverage device swapping  close access  \nEngagement  Delivery  Leverage device swapping  security domain  \nEngagement  Delivery  Leverag e device swapping  charge mobile device  \nEngagement  Delivery  Leverage device swapping  swap RAM  \nEngagement  Delivery  Leverage device swapping  hardware additions  \nEngagement  Delivery  Send malicious email  spear -phishing  \nEngagement  Delivery  Send malicious emai l whaling  \nEngagement  Delivery  Send malicious email  phishing  \nEngagement  Delivery  Send malicious email  spam  \nEngagement  Delivery  Send malicious email  malicious attachment  \nEngagement  Delivery  Send malicious email  malicious link  \nEngagement  Delivery  Send ma licious email  URL \nEngagement  Delivery  Send malicious email  embedded code  \nEngagement  Delivery  Send malicious email  embedded HTML iFrame  \nEngagement  Delivery  Send malicious email  iFrame  \nEngagement  Delivery  Send malicious email  spearphishing attachment  \nEngagement  Delivery  Send malicious email  spearphishing link  \nEngagement  Delivery  Send malicious email  spearphishing via service  \nEngagement  Delivery  Transport via common network infrastructure  compromised network  \nEngagement  Delivery  Transport via common net work infrastructure  trusted network relationship  \nEngagement  Delivery  Transport via common network infrastructure  connected network  \nEngagement  Delivery  Transport via common network infrastructure  subnet  \nEngagement  Delivery  Transport via common network in frastructure  provider network  \nEngagement  Delivery  Transport via common network infrastructure  trusted relationship  \nEngagement  Delivery  Traverse CDS or MLS  automated transport services  \nEngagement  Delivery  Traverse CDS or MLS  cross domain solution  \nEngage ment  Delivery  Traverse CDS or MLS  multi -level solution  \nEngagement  Delivery  Traverse CDS or MLS  network guard  \nEngagement  Delivery  Traverse CDS or MLS  trusted services  \nEngagement  Delivery  Traverse CDS or MLS  misconfigured CDS  \nEngagement  Delivery  Traverse  CDS or MLS  misconfigured MLS  \nEngagement  Delivery  Traverse CDS or MLS  low-to-high \nEngagement  Delivery  Traverse CDS or MLS  pathway  \nEngagement  Delivery  Traverse CDS or MLS  insider threat  \nEngagement  Delivery  Traverse CDS or MLS  compromise trusted services  \nEngagement  Delivery  Traverse CDS or MLS  dual-homed  \nEngagement  Delivery  Traverse CDS or MLS  trusted relationship  \nEngagement  Delivery  Use chat services  send message  \nEngagement  Delivery  Use chat services  sms \nEngagement  Delivery  Use chat services  messagi ng \n\n \n30 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Engagement  Delivery  Use chat services  mms  \nEngagement  Delivery  Use chat services  chatroom  \nEngagement  Delivery  Use chat services  chat session  \nEngagement  Delivery  Use chat services  spearphishing via service  \nEngagement  Delivery  Use compromised host  previously compromised victim  \nEngagement  Delivery  Use compromised host  toolkit  \nEngagement  Delivery  Use compromised host  download tool  \nEngagement  Delivery  Use compromised host  download toolkit  \nEngagement  Delivery  Use compromised host  second stage malware  \nEngagement  Delivery  Use compromised host  victim host  \nEngagement  Delivery  Use compromised host  trojan  \nEngagement  Delivery  Use compromised host  remote shell  \nEngagement  Delivery  Use compromised host  insider threat  \nEngagement  Delivery  Use compromised host  trusted relationship  \nEngagement  Delivery  Use compromised host  backdoor  \nEngagement  Delivery  Use compromised host  implant  \nEngagement  Delivery  Use compromised host  spyware  \nEngagement  Delivery  Use legitimate remote access  remote access to host  \nEngagement  Delivery  Use legitimate remote access  legitimate credentials  \nEngagement  Delivery  Use legitimate remote access  VPN \nEngagement  Delivery  Use legitimate remote access  RDP  \nEngagement  Delivery  Use legitimate remote access  ssh \nEngagement  Delivery  Use legitima te remote access  telnet  \nEngagement  Delivery  Use legitimate remote access  ftp \nEngagement  Delivery  Use legitimate remote access  WMI \nEngagement  Delivery  Use legitimate remote access  webmail  \nEngagement  Delivery  Use legitimate remote access  insider threat  \nEngagement  Delivery  Use legitimate remote access  valid accounts  \nEngagement  Delivery  Use physical network bridge  bridging  \nEngagement  Delivery  Use physical network bridge  cabling  \nEngagement  Delivery  Use physical network bridge  switch  \nEngagement  Delivery  Use physical network bridge  hub \nEngagement  Delivery  Use physical network bridge  connect networks  \nEngagement  Delivery  Use physical network bridge  bridge networks  \nEngagement  Delivery  Use physical network bridge  subnet  \nEngagement  Delivery  Use physical net work bridge  network segment  \nEngagement  Delivery  Use physical network bridge  hardware additions  \nEngagement  Exploitation  Abuse protocols  unanticipated use  \nEngagement  Exploitation  Abuse protocols  protocol abuse  \nEngagement  Exploitation  Abuse protocols  RFC compliance  \nEngagement  Exploitation  Abuse protocols  legacy field  \nEngagement  Exploitation  Abuse protocols  legacy protocol  \nEngagement  Exploitation  Abuse protocols  undocumented field  \nEngagement  Exploitation  Abuse protocols  undocumented command  \nEngagement  Exploitation  Abuse protocols  slack space  \nEngagement  Exploitation  Abuse protocols  unexpected protocol  \nEngagement  Exploitation  Abuse protocols  port protocol mismatch  \nEngagement  Exploitation  Access virtual memory  abuse physical location of virtual spaces  \nEngagement  Exploitation  Access virtual memory  collocation  \nEngagement  Exploitation  Access virtual memory  virtual spaces  \nEngagement  Exploitation  Access virtual memory  virtual machines  \n\n \n31 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Engagement  Exploitation  Access virtual memory  VM \nEngagement  Exploitati on Access virtual memory  container  \nEngagement  Exploitation  Access virtual memory  hypervisor  \nEngagement  Exploitation  Access virtual memory  memory cache of isolated virtual machines  \nEngagement  Exploitation  Access virtual memory  race condition  \nEngagement  Exploitation  Access virtual memory  return memory contents  \nEngagement  Exploitation  Access virtual memory  Heartbleed  \nEngagement  Exploitation  Access virtual memory  malicious payload in virtual memory  \nEngagement  Exploitation  Access virtual memory  virtual ma chine escape  \nEngagement  Exploitation  Access virtual memory  VM escape  \nEngagement  Exploitation  Conduct social engineering  social engineering  \nEngagement  Exploitation  Conduct social engineering  manipulate people  \nEngagement  Exploitation  Conduct social engin eering  entice a user to view  \nEngagement  Exploitation  Conduct social engineering  entice a user to click  \nEngagement  Exploitation  Conduct social engineering  click bait  \nEngagement  Exploitation  Conduct social engineering  post QR code  \nEngagement  Exploitation  Conduct social engineering  themes  \nEngagement  Exploitation  Conduct social engineering  craft legitimate email  \nEngagement  Exploitation  Conduct social engineering  enticing email  \nEngagement  Exploitation  Conduct social engineering  decoy  \nEngagement  Exploitat ion Conduct social engineering  USB drop  \nEngagement  Exploitation  Conduct social engineering  human -enabled technical operation  \nEngagement  Exploitation  Defeat encryption  improperly implemented crypto  \nEngagement  Exploitation  Defeat encryption  exploit crytog raphic algorithms  \nEngagement  Exploitation  Defeat encryption  exploit device implementation of cryptography  \nEngagement  Exploitation  Defeat encryption  misconfigured crypto  \nEngagement  Exploitation  Defeat encryption  generate keys  \nEngagement  Exploitation  Defeat encryption  brute force  \nEngagement  Exploitation  Defeat encryption  crack encryption  \nEngagement  Exploitation  Defeat encryption  obtain key material  \nEngagement  Exploitation  Defeat encryption  dictionary attack  \nEngagement  Exploitation  Exploit firmware vul nerability  firmware  \nEngagement  Exploitation  Exploit firmware vulnerability  embedded devices  \nEngagement  Exploitation  Exploit firmware vulnerability  CVE \nEngagement  Exploitation  Exploit firmware vulnerability  phlashing  \nEngagement  Exploitation  Exploit loca l application vulnerability  open malicious file  \nEngagement  Exploitation  Exploit local application vulnerability  software  \nEngagement  Exploitation  Exploit local application vulnerability  application  \nEngagement  Exploitation  Exploit local application vulner ability  buffer overflow  \nEngagement  Exploitation  Exploit local application vulnerability  user interaction  \nEngagement  Exploitation  Exploit local application vulnerability  insider threat  \nEngagement  Exploitation  Exploit local application vulnerability  CVE \nEngagement  Exploitation  Exploit local application vulnerability  exploitation for client execution  \nEngagement  Exploitation  Exploit OS vulnerability  operating system  \nEngagement  Exploitation  Exploit OS vulnerability  os vulnerability  \nEngagement  Exploitation  Exploit OS vulnerability  CVE \nEngagement  Exploitation  Exploit OS vulnerability  protocol implementation  \nEngagement  Exploitation  Exploit OS vulnerability  exploitation for client execution  \nEngagement  Exploitation  Exploit OS vulnerability  LSASS driver  \nEnga gement  Exploitation  Exploit OS vulnerability  space after filename  \nEngagement  Exploitation  Exploit remote application vulnerability  webmail  \n\n \n32 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Engagement  Exploitation  Exploit remote application vulnerability  web application  \nEngagement  Exploitation  Exploit r emote application vulnerability  software  \nEngagement  Exploitation  Exploit remote application vulnerability  application  \nEngagement  Exploitation  Exploit remote application vulnerability  network traffic  \nEngagement  Exploitation  Exploit remote application vul nerability  CVE \nEngagement  Exploitation  Exploit remote application vulnerability  exploit public -facing application  \nEngagement  Exploitation  Exploit remote application vulnerability  exploitation for client execution  \nEngagement  Exploitation  Exploit weak acc ess controls  password spraying  \nEngagement  Exploitation  Exploit weak access controls  anonymous FTP  \nEngagement  Exploitation  Exploit weak access controls  anonymous telnet login  \nEngagement  Exploitation  Exploit weak access controls  misconfigured router ACL  \nEngagement  Exploitation  Exploit weak access controls  default password  \nEngagement  Exploitation  Exploit weak access controls  missing access control  \nEngagement  Exploitation  Exploit weak access controls  brute force  \nEngagement  Exploitation  Hijack  control com munication  \nEngagement  Exploitation  Hijack  man-in-the-middle  \nEngagement  Exploitation  Hijack  BGP hijacking  \nEngagement  Exploitation  Hijack  redirect route  \nEngagement  Exploitation  Hijack  session hijacking  \nEngagement  Exploitation  Hijack  route  \nEngagement  Exploitation  Hijack  connection hijacking  \nEngagement  Exploitation  Impersonate or spoof user  request user account  \nEngagement  Exploitation  Impersonate or spoof user  ssh masquerade  \nEngagement  Exploitation  Impersonate or spoof user  telnet masquerade  \nEngagemen t Exploitation  Impersonate or spoof user  password reset  \nEngagement  Exploitation  Impersonate or spoof user  domain spoofing  \nEngagement  Exploitation  Impersonate or spoof user  email spoofing  \nEngagement  Exploitation  Impersonate or spoof user  fake profile  \nEngagement  Exploitation  Impersonate or spoof user  valid accounts  \nEngagement  Exploitation  Impersonate or spoof user  operational account  \nEngagement  Exploitation  Impersonate or spoof user  impersonating  \nEngagement  Exploitation  Impersonate or spoof user  DNS sp oofing  \nEngagement  Exploitation  Impersonate or spoof user  piggybacking  \nEngagement  Exploitation  Impersonate or spoof user  mimicking  \nEngagement  Exploitation  Launch zero -day exploit  0-day exploit  \nEngagement  Exploitation  Launch zero -day exploit  undisclosed vulnerability  \nEngagement  Exploitation  Launch zero -day exploit  zero day  \nEngagement  Exploitation  Launch zero -day exploit  zero-day \nEngagement  Exploitation  Launch zero -day exploit  undocumented vulnerability  \nEngagement  Exploitation  Launch zero -day exploit  exploit public -facing application  \nEngagement  Exploitation  Leverage exploit packs  exploit packs  \nEngagement  Exploitation  Leverage exploit packs  exploit kit  \nEngagement  Exploitation  Leverage exploit packs  exploit public -facing application  \nEngagement  Exploit ation  Leverage trusted relationship  trusted network relationship  \nEngagement  Exploitation  Leverage trusted relationship  peer network  \nEngagement  Exploitation  Leverage trusted relationship  compromised network  \nEngagement  Exploitation  Leverage trusted relati onship  trusted relationship  \nEngagement  Exploitation  Leverage trusted relationship  trusted domain  \nEngagement  Exploitation  Leverage trusted relationship  trusted host  \nEngagement  Exploitation  Replay  retransmit traffic  \nEngagement  Exploitation  Replay  send tr affic again  \n\n \n33 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Engagement  Exploitation  Replay  valid data transmission  \nEngagement  Exploitation  Replay  repeat traffic  \nEngagement  Exploitation  Replay  delayed transmission  \nPresence  Execution  Create scheduled task  execute programs  \nPresence  Execution  Create sc heduled task  schedule  \nPresence  Execution  Create scheduled task  at \nPresence  Execution  Create scheduled task  schtasks  \nPresence  Execution  Create scheduled task  cron \nPresence  Execution  Create scheduled task  cronjob  \nPresence  Execution  Create scheduled task  local job scheduling  \nPresence  Execution  Create scheduled task  scheduled task  \nPresence  Execution  Execute via service controller  service controller  \nPresence  Execution  Execute via service controller  execute binary  \nPresence  Execution  Execute via service c ontroller  service control module  \nPresence  Execution  Execute via service controller  daemons  \nPresence  Execution  Execute via service controller  inetd  \nPresence  Execution  Execute via service controller  xinetd  \nPresence  Execution  Execute via service controlle r service control manager  \nPresence  Execution  Execute via service controller  sc \nPresence  Execution  Execute via service controller  regsvr32  \nPresence  Execution  Execute via service controller  service execution  \nPresence  Execution  Execute via service control ler regsvcs/regasm  \nPresence  Execution  Execute via third -party software  pre-existing third -party applications  \nPresence  Execution  Execute via third -party software  unauthorized updates  \nPresence  Execution  Execute via third -party software  peer-to-peer networ k administration tools  \nPresence  Execution  Execute via third -party software  graphical user interface  \nPresence  Execution  Execute via third -party software  installutil  \nPresence  Execution  Execute via third -party software  third-party software  \nPresence  Execut ion Execute via third -party software  trusted developer utilities  \nPresence  Execution  Inject into running process  process injection  \nPresence  Execution  Inject into running process  code injection  \nPresence  Execution  Inject into running process  context of ano ther process  \nPresence  Execution  Inject into running process  process memory  \nPresence  Execution  Inject into running process  process permissions  \nPresence  Execution  Inject into running process  DLL sideloading  \nPresence  Execution  Inject into running process  DLL side -loading  \nPresence  Execution  Inject into running process  tasklist  \nPresence  Execution  Inject into running process  loader  \nPresence  Execution  Inject into running process  DLL injection  \nPresence  Execution  Inject into running process  process hollowing  \nPresence  Execution  Inject into running process  execution through module load  \nPresence  Execution  Leverage authorized user  user interaction  \nPresence  Execution  Leverage authorized user  open file  \nPresence  Execution  Leverage authorized user  click link  \nPresence  Execution  Leverage authorized user  enable macros  \nPresence  Execution  Leverage authorized user  change security settings  \nPresence  Execution  Leverage authorized user  insider threat  \nPresence  Execution  Leverage authorized user  user execution  \nPresence  Execution  Leverage authorized user  human -enabled technical operation  \nPresence  Execution  Replace existing binary  appear legitimate  \nPresence  Execution  Replace existing binary  commonly trusted location  \n\n \n34 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Execution  Replace existing binary  legitimate s ource  \nPresence  Execution  Replace existing binary  common name  \nPresence  Execution  Replace existing binary  legitimate file name  \nPresence  Execution  Replace existing binary  common path  \nPresence  Execution  Replace existing binary  local patch updating mechanis m \nPresence  Execution  Replace existing binary  benign by name  \nPresence  Execution  Replace existing binary  replace legitimate binary  \nPresence  Execution  Replace existing binary  signed binary proxy execution  \nPresence  Execution  Run commands in shell  commands  \nPresence  Execution  Run commands in shell  command line  \nPresence  Execution  Run commands in shell  remote shell  \nPresence  Execution  Run commands in shell  interactive  \nPresence  Execution  Run commands in shell  cmd.exe  \nPresence  Execution  Run commands in shell  RDP  \nPresence  Execution  Run commands in shell  reverse shell  \nPresence  Execution  Run commands in shell  bash  \nPresence  Execution  Run commands in shell  powershell command line  \nPresence  Execution  Run commands in shell  python shell  \nPresence  Execution  Run comm ands in shell  web shell  \nPresence  Execution  Run commands in shell  webshell  \nPresence  Execution  Run commands in shell  command -line interface  \nPresence  Execution  Run fileless payload  in memory code  \nPresence  Execution  Run fileless payload  resident in memory  \nPresence  Execution  Run fileless payload  memory resident  \nPresence  Execution  Run fileless payload  no file  \nPresence  Execution  Use interpreted scripts  scripting language  \nPresence  Execution  Use interpreted scripts  scripts  \nPresence  Execution  Use interpreted  scripts  script file  \nPresence  Execution  Use interpreted scripts  script commands  \nPresence  Execution  Use interpreted scripts  script interpreter  \nPresence  Execution  Use interpreted scripts  powershell  \nPresence  Execution  Use interpreted scripts  vbscript  \nPresence  Execution  Use interpreted scripts  javascript  \nPresence  Execution  Use interpreted scripts  .net \nPresence  Execution  Use interpreted scripts  java \nPresence  Execution  Use interpreted scripts  sequenced commands  \nPresence  Execution  Use interpreted scripts  perl \nPresence  Execution  Use interpreted scripts  python  \nPresence  Execution  Use interpreted scripts  JIT compiled languages  \nPresence  Execution  Use interpreted scripts  bash script  \nPresence  Execution  Use interpreted scripts  shell script  \nPresence  Execution  Use interpreted scripts  WMI script  \nPresence  Execution  Use interpreted scripts  applescript  \nPresence  Execution  Use interpreted scripts  scripting  \nPresence  Execution  Use OS APIs  operating system  \nPresence  Execution  Use OS APIs  application programming interf aces  \nPresence  Execution  Use OS APIs  CreateProcess  \nPresence  Execution  Use OS APIs  copy into expected location to run  \nPresence  Execution  Use OS APIs  OS functions  \nPresence  Execution  Use OS APIs  control panel items  \nPresence  Execution  Use OS APIs  execution  through API  \n\n \n35 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Execution  Use OS APIs  mshta  \nPresence  Execution  Use remote services  remote administrative services  \nPresence  Execution  Use remote services  remote access  \nPresence  Execution  Use remote services  windows management instrumentation  \nPresence  Execution  Use remote services  WMI \nPresence  Execution  Use remote services  windows remote management  \nPresence  Execution  Use remote services  WinRM  \nPresence  Execution  Use remote services  RPC  \nPresence  Execution  Use remote services  remote desktop servic es \nPresence  Execution  Use remote services  mstsc  \nPresence  Execution  Use remote services  windows terminal services  \nPresence  Execution  Use remote services  mmc  \nPresence  Execution  Use remote services  Microsoft Management Console  \nPresence  Execution  Use remo te services  implied trust  \nPresence  Execution  Use remote services  valid credentials  \nPresence  Execution  Use trusted application to execute untrusted code  trusted application  \nPresence  Execution  Use trusted application to execute untrusted code  Rundll32  \nPresence  Execution  Use trusted application to execute untrusted code  arbitrary DLL  \nPresence  Execution  Use trusted application to execute untrusted code  ignored by security tools  \nPresence  Execution  Use trusted application to execute untrusted code  evade det ection  \nPresence  Execution  Use trusted application to execute untrusted code  bypass process monitoring  \nPresence  Execution  Use trusted application to execute untrusted code  insmod  \nPresence  Execution  Use trusted application to execute untrusted code  inject  code into the kernel  \nPresence  Execution  Write to disk  disk \nPresence  Execution  Write to disk  network share  \nPresence  Execution  Write to disk  dropped files  \nPresence  Execution  Write to disk  configuration file  \nPresence  Execution  Write to disk  log file  \nPresence  Execution  Write to disk  save file  \nPresence  Execution  Write to disk  file created  \nPresence  Execution  Write to disk  copy  \nPresence  Execution  Write to disk  application shimming  \nPresence  Execution  Write to disk  edit registry  \nPresence  Execution  Write to disk  add registry key  \nPresence  Execution  Write to disk  modify registry  \nPresence  Execution  Write to disk  upload  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  domain account  \nPresence  Internal Reconnaissance  Enumerate accounts and  permissions  account list  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  permissions  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  review logins  \nPresence  Internal Reconnaissance  Enumerate accounts and permissio ns identify primary users  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  local groups  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  group permission  \nPresence  Internal Reconnaissance  Enumerate accounts and permi ssions  group members  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  local account  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  net user  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  quser  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  dsquery  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  whoami  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  dir /a ntuser.dat  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  net localgroup  \n\n \n36 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Internal Reconnaissance  Enumerate accounts and permissions  account discovery  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  permission groups discovery  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  password policy discovery  \nPresence  Internal Reconnaissance  Enumerate accounts and permissions  system owner/user discovery  \nPresence  Internal Reconnaissance  Enumerate file system  enumerate f iles \nPresence  Internal Reconnaissance  Enumerate file system  directory walk  \nPresence  Internal Reconnaissance  Enumerate file system  search files  \nPresence  Internal Reconnaissance  Enumerate file system  search directories  \nPresence  Internal Reconnaissance  Enumerate file system  dir \nPresence  Internal Reconnaissance  Enumerate file system  ls \nPresence  Internal Reconnaissance  Enumerate file system  findstr  \nPresence  Internal Reconnaissance  Enumerate file system  SMB  \nPresence  Internal Reconnaissance  Enumerate file system  NFS \nPresence  Internal Reconnaissance  Enumerate file system  CIFS  \nPresence  Internal Reconnaissance  Enumerate file system  file and directory discovery  \nPresence  Internal Reconnaissance  Enumerate file system  network share discovery  \nPresence  Internal Reconnaissance  Enumerate local network connections  list network connections  \nPresence  Internal Reconnaissance  Enumerate local network connections  netstat  \nPresence  Internal Reconnaissance  Enumerate local network connections  net user  \nPresence  Internal Reco nnaissance  Enumerate local network connections  net session  \nPresence  Internal Reconnaissance  Enumerate local network connections  net view  \nPresence  Internal Reconnaissance  Enumerate local network connections  arp \nPresence  Internal Reconnaissance  Enumerate local network connections  route  \nPresence  Internal Reconnaissance  Enumerate local network connections  nbtstat  \nPresence  Internal Reconnaissance  Enumerate local network connections  lsof \nPresence  Internal Reconnaissance  Enumerate local network connections  ss \nPresence  Internal Reconnaissance  Enumerate local network connections  system network connections discovery  \nPresence  Internal Reconnaissance  Enumerate local network settings  network settings  \nPresence  Internal Reconnaissance  Enumerate local network setti ngs local network  \nPresence  Internal Reconnaissance  Enumerate local network settings  ipconfig  \nPresence  Internal Reconnaissance  Enumerate local network settings  ip  \nPresence  Internal Reconnaissance  Enumerate local network settings  ifconfig  \nPresence  Internal Reconnaissance  Enumerate local network settings  configuration files  \nPresence  Internal Reconnaissance  Enumerate local network settings  subnet  \nPresence  Internal Reconnaissance  Enumerate local network settings  network diagram  \nPresence  Internal Reconnai ssance  Enumerate local network settings  system network configuration discovery  \nPresence  Internal Reconnaissance  Enumerate OS and software  OS details  \nPresence  Internal Reconnaissance  Enumerate OS and software  version  \nPresence  Internal Reconnaissance  Enum erate OS and software  patch  \nPresence  Internal Reconnaissance  Enumerate OS and software  hotfixes  \nPresence  Internal Reconnaissance  Enumerate OS and software  service packs  \nPresence  Internal Reconnaissance  Enumerate OS and software  architecture  \nPresence  Internal Reconnaissance  Enumerate OS and software  software list  \nPresence  Internal Reconnaissance  Enumerate OS and software  drivers  \nPresence  Internal Reconnaissance  Enumerate OS and software  configuration  \nPresence  Internal Reconnaissance  Enumerate OS and s oftware  version  \nPresence  Internal Reconnaissance  Enumerate OS and software  uname  \nPresence  Internal Reconnaissance  Enumerate OS and software  systeminfo  \nPresence  Internal Reconnaissance  Enumerate OS and software  netsh  \nPresence  Internal Reconnaissance  Enumerate OS and software  reg query  \nPresence  Internal Reconnaissance  Enumerate OS and software  dir \n\n \n37 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Internal Reconnaissance  Enumerate OS and software  tasklist  \nPresence  Internal Reconnaissance  Enumerate OS and software  adware  \nPresence  Internal Reco nnaissance  Enumerate OS and software  detect security software  \nPresence  Internal Reconnaissance  Enumerate OS and software  antivirus  \nPresence  Internal Reconnaissance  Enumerate OS and software  browser bookmark discovery  \nPresence  Internal Reconnaissance  Enumerate OS and software  query registry  \nPresence  Internal Reconnaissance  Enumerate OS and software  regquery  \nPresence  Internal Reconnaissance  Enumerate OS and software  security software discovery  \nPresence  Internal Reconnaissance  Enumerate OS and software  system information discovery  \nPresence  Internal Reconnaissance  Enumerate OS and software  system time discovery  \nPresence  Internal Reconnaissance  Enumerate processes  process list  \nPresence  Internal Reconnaissance  Enumerate processes  top \nPresence  Internal Re connaissance  Enumerate processes  running processes  \nPresence  Internal Reconnaissance  Enumerate processes  lodaded libraries  \nPresence  Internal Reconnaissance  Enumerate processes  mutex  \nPresence  Internal Reconnaissance  Enumerate processes  registered services  \nPresence  Internal Reconnaissance  Enumerate processes  tasklist  \nPresence  Internal Reconnaissance  Enumerate processes  ps \nPresence  Internal Reconnaissance  Enumerate processes  tasklist /svc  \nPresence  Internal Reconnaissance  Enumerate processes  sc \nPresence  Internal Reconnaissance  Enumerate processes  net start  \nPresence  Internal Reconnaissance  Enumerate processes  init \nPresence  Internal Reconnaissance  Enumerate processes  services  \nPresence  Internal Reconnaissance  Enumerate processes  search registry  \nPresence  Internal Reconnaissance  Enumerate processes  process discovery  \nPresence  Internal Reconnaissance  Enumerate processes  system service discovery  \nPresence  Internal Reconnaissance  Enumerate windows  application window  \nPresence  Internal Reconnaissance  Enumerate windows  invisible window  \nPresence  Internal Reconnaissance  Enumerate windows  pixel \nPresence  Internal Reconnaissance  Enumerate windows  application window discovery  \nPresence  Internal Reconnaissance  Map accessible networks  network mapping  \nPresence  Internal  Reconnaissance  Map accessible networks  ping \nPresence  Internal Reconnaissance  Map accessible networks  ping sweep  \nPresence  Internal Reconnaissance  Map accessible networks  active devices  \nPresence  Internal Reconnaissance  Map accessible networks  nmap  \nPrese nce Internal Reconnaissance  Map accessible networks  icmp  \nPresence  Internal Reconnaissance  Map accessible networks  traceroute  \nPresence  Internal Reconnaissance  Map accessible networks  local network  \nPresence  Internal Reconnaissance  Scan connected devices  local network  \nPresence  Internal Reconnaissance  Scan connected devices  active scan  \nPresence  Internal Reconnaissance  Scan connected devices  port scan  \nPresence  Internal Reconnaissance  Scan connected devices  TCP fingerprinting  \nPresence  Internal Reconnaissan ce Scan connected devices  banner grabbing  \nPresence  Internal Reconnaissance  Scan connected devices  vulnerability scan  \nPresence  Internal Reconnaissance  Scan connected devices  passive scan  \nPresence  Internal Reconnaissance  Scan connected devices  scanning  \nPresence  Internal Reconnaissance  Scan connected devices  OS fingerprinting  \nPresence  Internal Reconnaissance  Scan connected devices  open ports  \nPresence  Internal Reconnaissance  Scan connected devices  address scan  \nPresence  Internal Reconnaissance  Scan connec ted devices  private network  \nPresence  Internal Reconnaissance  Scan connected devices  network service scanning  \n\n \n38 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Internal Reconnaissance  Scan connected devices  peripheral device discovery  \nPresence  Internal Reconnaissance  Scan connected devices  remo te system discovery  \nPresence  Internal Reconnaissance  Sniff network  network interface  \nPresence  Internal Reconnaissance  Sniff network  monitor network  \nPresence  Internal Reconnaissance  Sniff network  analyze traffic  \nPresence  Internal Reconnaissance  Sniff ne twork  packet analysis  \nPresence  Internal Reconnaissance  Sniff network  promiscuous mode  \nPresence  Internal Reconnaissance  Sniff network  packet capture  \nPresence  Internal Reconnaissance  Sniff network  span port  \nPresence  Internal Reconnaissance  Sniff network  network sniffing  \nPresence  Internal Reconnaissance  Sniff network  sniffer  \nPresence  Internal Reconnaissance  Sniff network  PCAP  \nPresence  Internal Reconnaissance  Sniff network  tcpdump  \nPresence  Privilege Escalation  Exploit application vulnerability  open mali cious file  \nPresence  Privilege Escalation  Exploit application vulnerability  software  \nPresence  Privilege Escalation  Exploit application vulnerability  application  \nPresence  Privilege Escalation  Exploit application vulnerability  buffer overflow  \nPresence  Privilege Escalation  Exploit application vulnerability  user interaction  \nPresence  Privilege Escalation  Exploit application vulnerability  insider threat  \nPresence  Privilege Escalation  Exploit application vulnerability  CVE \nPresence  Privilege Escalation  Exploit  application vulnerability  webmail  \nPresence  Privilege Escalation  Exploit application vulnerability  web application  \nPresence  Privilege Escalation  Exploit application vulnerability  network traffic  \nPresence  Privilege Escalation  Exploit application vulnerab ility XSS \nPresence  Privilege Escalation  Exploit application vulnerability  CSRF  \nPresence  Privilege Escalation  Exploit application vulnerability  code execution  \nPresence  Privilege Escalation  Exploit application vulnerability  command execution  \nPresence  Privilege Escalation  Exploit application vulnerability  escalate current process  \nPresence  Privilege Escalation  Exploit application vulnerability  higher privilege  \nPresence  Privilege Escalation  Exploit application vulnerability  bypass security mechanism  \nPrese nce Privilege Escalation  Exploit application vulnerability  AppCert DLLs  \nPresence  Privilege Escalation  Exploit application vulnerability  AppInit DLLs  \nPresence  Privilege Escalation  Exploit application vulnerability  exploitation for privilege escalation  \nPresence  Privilege Escalation  Exploit application vulnerability  web shell  \nPresence  Privilege Escalation  Exploit application vulnerability  webshell  \nPresence  Privilege Escalation  Exploit firmware vulnerability  firmware  \nPresence  Privilege Escalation  Exploit firmware vulnerability  embedded device  \nPresence  Privilege Escalation  Exploit firmware vulnerability  embedded software  \nPresence  Privilege Escalation  Exploit firmware vulnerability  IoT device  \nPresence  Privilege Escalation  Exploit firmware vulnerability  CVE \nPresence  Privilege Escalation  Exploit firmware vulnerability  exploitation for privilege escalation  \nPresence  Privilege Escalation  Exploit OS vulnerability  application shimming  \nPresence  Privilege Escalation  Exploit OS vulnerability  operating system  \nPresence  Privilege Escalation  Exploit OS vulnerability  os vulnerability  \nPresence  Privilege Escalation  Exploit OS vulnerability  CVE \nPresence  Privilege Escalation  Exploit OS vulnerability  protocol implementation  \nPresence  Privilege Escalation  Exploit OS vulne rability  code execution  \nPresence  Privilege Escalation  Exploit OS vulnerability  command execution  \nPresence  Privilege Escalation  Exploit OS vulnerability  escalate current process  \nPresence  Privilege Escalation  Exploit OS vulnerability  higher privilege  \nPresence  Privilege Escalation  Exploit OS vulnerability  bypass security mechanism  \n\n \n39 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Privilege Escalation  Exploit OS vulnerability  domain user permissions  \nPresence  Privilege Escalation  Exploit OS vulnerability  exploitation for privilege escalation  \nPresence  Privilege Escalation  Exploit OS vulnerability  extra window memory injection  \nPresence  Privilege Escalation  Exploit OS vulnerability  file system permissions weakness  \nPresence  Privilege Escalation  Exploit OS vulnerability  launch daemon  \nPresence  Privilege Escalation  Exploit OS vulnerability  local port monitor  \nPresence  Privilege Escalation  Exploit OS vulnerability  new service  \nPresence  Privilege Escalation  Exploit OS vulnerability  path interception  \nPresence  Privilege Escalation  Exploit OS vulnerabilit y plist modification  \nPresence  Privilege Escalation  Exploit OS vulnerability  port monitors  \nPresence  Privilege Escalation  Exploit OS vulnerability  service registry permissions weakness  \nPresence  Privilege Escalation  Exploit OS vulnerability  setuid and setg id \nPresence  Privilege Escalation  Exploit OS vulnerability  SID-History injection  \nPresence  Privilege Escalation  Exploit OS vulnerability  startup items  \nPresence  Privilege Escalation  Exploit OS vulnerability  sudo caching  \nPresence  Privilege Escalation  Injec t into running process  escalate privilege  \nPresence  Privilege Escalation  Inject into running process  rundlll32  \nPresence  Privilege Escalation  Inject into running process  process injection  \nPresence  Privilege Escalation  Inject into running process  code inje ction \nPresence  Privilege Escalation  Inject into running process  context of another process  \nPresence  Privilege Escalation  Inject into running process  process memory  \nPresence  Privilege Escalation  Inject into running process  process permissions  \nPresence  Privilege Escalation  Inject into running process  DLL sideloading  \nPresence  Privilege Escalation  Inject into running process  tasklist  \nPresence  Privilege Escalation  Inject into running process  loader  \nPresence  Privilege Escalation  Inject into running process  DLL injection  \nPresence  Privilege Escalation  Inject into running process  process hollowing  \nPresence  Privilege Escalation  Inject into running process  DLL search order hijacking  \nPresence  Privilege Escalation  Inject into running process  dylib hijacking  \nPresence  Privilege Escalation  Inject into running process  hooking  \nPresence  Privilege Escalation  Inject into running process  image file execution options injection  \nPresence  Privilege Escalation  Use accessibility features  hot keys  \nPresence  Privilege Escalat ion Use accessibility features  key combination  \nPresence  Privilege Escalation  Use accessibility features  launch accessibility programs  \nPresence  Privilege Escalation  Use accessibility features  command prompt  \nPresence  Privilege Escalation  Use accessibility  features  backdoor  \nPresence  Privilege Escalation  Use accessibility features  shift key  \nPresence  Privilege Escalation  Use accessibility features  on screen keyboard  \nPresence  Privilege Escalation  Use accessibility features  mouse  \nPresence  Privilege Escalati on Use accessibility features  accessibility features  \nPresence  Privilege Escalation  Use legitimate credentials  legitimate access control  \nPresence  Privilege Escalation  Use legitimate credentials  compromised credentials  \nPresence  Privilege Escalation  Use le gitimate credentials  Run as  \nPresence  Privilege Escalation  Use legitimate credentials  Psexec  \nPresence  Privilege Escalation  Use legitimate credentials  switch user  \nPresence  Privilege Escalation  Use legitimate credentials  higher privilege  \nPresence  Privileg e Escalation  Use legitimate credentials  access restricted area  \nPresence  Privilege Escalation  Use legitimate credentials  access token manipulation  \nPresence  Privilege Escalation  Use legitimate credentials  bypass user access control  \nPresence  Privilege Esca lation  Use legitimate credentials  sudo  \nPresence  Privilege Escalation  Use legitimate credentials  su root  \n\n \n40 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Privilege Escalation  Use legitimate credentials  su -  \nPresence  Privilege Escalation  Use legitimate credentials  valid accounts  \nPresence  Privilege Escalation  Use legitimate credentials  authentication package  \nPresence  Credential Access  Add or modify credentials  change credentials  \nPresence  Credential Access  Add or modify credentials  create account  \nPresence  Credential Access  Add or modify crede ntials  modify account  \nPresence  Credential Access  Add or modify credentials  modify permission  \nPresence  Credential Access  Add or modify credentials  add permission group  \nPresence  Credential Access  Add or modify credentials  change permission group  \nPresence  Credential Access  Add or modify credentials  domain permission  \nPresence  Credential Access  Add or modify credentials  account manipulation  \nPresence  Credential Access  Add or modify credentials  LLMNR/NBT -NS poisoning  \nPresence  Credential Access  Add or modify  credentials  exploitation for privilege escalation  \nPresence  Credential Access  Conduct social engineering  social engineering  \nPresence  Credential Access  Conduct social engineering  manipulate people  \nPresence  Credential Access  Conduct social engineering  entice a user to view  \nPresence  Credential Access  Conduct social engineering  UAC prompt  \nPresence  Credential Access  Conduct social engineering  credential pharming  \nPresence  Credential Access  Conduct social engineering  pharming  \nPresence  Credential Access  Cond uct social engineering  direct to credential pharming site  \nPresence  Credential Access  Conduct social engineering  credentials from user  \nPresence  Credential Access  Conduct social engineering  enabled by user  \nPresence  Credential Access  Conduct social enginee ring forced authentication  \nPresence  Credential Access  Conduct social engineering  input prompt  \nPresence  Credential Access  Crack passwords  password cracking  \nPresence  Credential Access  Crack passwords  password recovery  \nPresence  Credential Access  Crack pas swords  rainbow table  \nPresence  Credential Access  Crack passwords  password spraying  \nPresence  Credential Access  Crack passwords  guess password  \nPresence  Credential Access  Crack passwords  compute hash  \nPresence  Credential Access  Crack passwords  brute force  \nPresence  Credential Access  Crack passwords  guess successful logins  \nPresence  Credential Access  Crack passwords  hash table  \nPresence  Credential Access  Crack passwords  known password  \nPresence  Credential Access  Crack passwords  possible password  \nPresence  Credential Access  Crack passwords  common passwords  \nPresence  Credential Access  Crack passwords  crack hash  \nPresence  Credential Access  Crack passwords  kerberoasting  \nPresence  Credential Access  Crack passwords  cracking  \nPresence  Credential Access  Crack password s dictionary attack  \nPresence  Credential Access  Dump credentials  credential dumping  \nPresence  Credential Access  Dump credentials  extract credential hash  \nPresence  Credential Access  Dump credentials  extract plaintext password  \nPresence  Credential Access  Dum p credentials  find kerberos ticket  \nPresence  Credential Access  Dump credentials  memory dump  \nPresence  Credential Access  Dump credentials  password dumping  \nPresence  Credential Access  Dump credentials  extract passwords  \nPresence  Credential Access  Dump creden tials LSASS  \nPresence  Credential Access  Dump credentials  local security authority subsystem service  \nPresence  Credential Access  Dump credentials  access virtual memory  \nPresence  Credential Access  Dump credentials  password filter DLL  \n\n \n41 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Credential Acc ess Dump credentials  replication through removable media  \nPresence  Credential Access  Dump credentials  credential harvesting  \nPresence  Credential Access  Hijack active credential  malicious use of authenticated credentials  \nPresence  Credential Access  Hijack a ctive credential  authentication token  \nPresence  Credential Access  Hijack active credential  hardware authentication token  \nPresence  Credential Access  Hijack active credential  in use by legitimate user  \nPresence  Credential Access  Hijack active credential  without user knowledge  \nPresence  Credential Access  Hijack active credential  hijack authenticated session  \nPresence  Credential Access  Hijack active credential  two-factor authentication interception  \nPresence  Credential Access  Locate credentials  search for cred entials  \nPresence  Credential Access  Locate credentials  find credentials  \nPresence  Credential Access  Locate credentials  password file  \nPresence  Credential Access  Locate credentials  passwd  \nPresence  Credential Access  Locate credentials  shadow  \nPresence  Crede ntial Access  Locate credentials  log with plaintext password  \nPresence  Credential Access  Locate credentials  shared credential store  \nPresence  Credential Access  Locate credentials  configuration files containing passwords  \nPresence  Credential Access  Locate cr edentials  source code with password  \nPresence  Credential Access  Locate credentials  extract from backup  \nPresence  Credential Access  Locate credentials  extract from saved virtual machine  \nPresence  Credential Access  Locate credentials  bash history  \nPresence  Credential Access  Locate credentials  credentials in file  \nPresence  Credential Access  Locate credentials  credentials in registry  \nPresence  Credential Access  Locate credentials  keychain  \nPresence  Credential Access  Locate credentials  private keys  \nPresence  Credential Access  Locate credentials  securityd memory  \nPresence  Credential Access  Log keystrokes  keylogger  \nPresence  Credential Access  Log keystrokes  record keystrokes  \nPresence  Credential Access  Log keystrokes  record keyboard events  \nPresence  Credential Acce ss Log keystrokes  keylogging  \nPresence  Credential Access  Log keystrokes  save keystrokes  \nPresence  Credential Access  Log keystrokes  input capture  \nPresence  Lateral Movement  Exploit peer connections  authentication agreement  \nPresence  Lateral Movement  Exploit  peer connections  mesh network  \nPresence  Lateral Movement  Exploit peer connections  peer-to-peer \nPresence  Lateral Movement  Exploit peer connections  domain trust relationships  \nPresence  Lateral Movement  Exploit peer connections  connected hosts  \nPresence  Lateral Movement  Exploit peer connections  maneuver  \nPresence  Lateral Movement  Exploit peer connections  expand within network  \nPresence  Lateral Movement  Logon remotely  logon  \nPresence  Lateral Movement  Logon remotely  interactive logon  \nPresence  Lateral Movement  Logon remotely  valid credentials  \nPresence  Lateral Movement  Logon remotely  remote host  \nPresence  Lateral Movement  Logon remotely  manual interaction  \nPresence  Lateral Movement  Logon remotely  successfully logged on  \nPresence  Lateral Movement  Logon remotely  logoff  \nPresence  Lateral Movement  Logon remotely  graphical user interface  \nPresence  Lateral Movement  Logon remotely  GUI \nPresence  Lateral Movement  Logon remotely  VPN \nPresence  Lateral Movement  Logon remotely  RDP  \nPresence  Lateral Movement  Logon remotely  remote desktop protocol  \n\n \n42 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Lateral Movement  Logon remotely  command line interface  \nPresence  Lateral Movement  Logon remotely  CLI \nPresence  Lateral Movement  Logon remotely  VNC  \nPresence  Lateral Movement  Logon remotely  telnet  \nPresence  Lateral Movement  Logon remotely  ssh \nPresence  Lateral Movement  Logon remotely  remote desktop services  \nPresence  Lateral Movement  Logon remotely  windows terminal services  \nPresence  Lateral Movement  Logon remotely  applescript  \nPresence  Lateral Movement  Logon remotely  exploita tion for privilege escalation  \nPresence  Lateral Movement  Pass the hash  pass the hash  \nPresence  Lateral Movement  Pass the hash  pass -the-hash  \nPresence  Lateral Movement  Pass the hash  PtH \nPresence  Lateral Movement  Pass the hash  bypass authentication  \nPresenc e Lateral Movement  Pass the hash  valid password hash  \nPresence  Lateral Movement  Pass the hash  no cleartext password  \nPresence  Lateral Movement  Pass the hash  captured hash  \nPresence  Lateral Movement  Pass the ticket  pass the ticket  \nPresence  Lateral Movement  Pass the ticket  pass -the-ticket  \nPresence  Lateral Movement  Pass the ticket  PtT \nPresence  Lateral Movement  Pass the ticket  bypass authentication  \nPresence  Lateral Movement  Pass the ticket  valid Kerberos ticket  \nPresence  Lateral Movement  Pass the ticket  no cleartext password  \nPresence  Lateral Movement  Pass the ticket  generate ticket  \nPresence  Lateral Movement  Pass the ticket  captured ticket  \nPresence  Lateral Movement  Pass the ticket  golden ticket  \nPresence  Lateral Movement  Replicate through removable media  insider threat  \nPresence  Lateral Movement  Replicate through removable media  air-gapped network  \nPresence  Lateral Movement  Replicate through removable media  disconnected network  \nPresence  Lateral Movement  Replicate through removable media  copy to removable m edia \nPresence  Lateral Movement  Replicate through removable media  autorun  \nPresence  Lateral Movement  Replicate through removable media  .ini \nPresence  Lateral Movement  Replicate through removable media  modify executables on removable media  \nPresence  Lateral  Movement  Replicate through removable media  copy malware from removable media  \nPresence  Lateral Movement  Replicate through removable media  USB drop  \nPresence  Lateral Movement  Replicate through removable media  close access  \nPresence  Lateral Movement  Replica te through removable media  replication through removable media  \nPresence  Lateral Movement  Taint shared content  shared network drive  \nPresence  Lateral Movement  Taint shared content  shared file  \nPresence  Lateral Movement  Taint shared content  add malicious pr ograms  \nPresence  Lateral Movement  Taint shared content  embedded scripts  \nPresence  Lateral Movement  Taint shared content  add exploit to file  \nPresence  Lateral Movement  Taint shared content  peer-to-peer \nPresence  Lateral Movement  Taint shared content  taint s hared content  \nPresence  Lateral Movement  Use application -deployment software  application deployment software  \nPresence  Lateral Movement  Use application -deployment software  application deployment system  \nPresence  Lateral Movement  Use application -deployment software  deployment server  \nPresence  Lateral Movement  Use application -deployment software  system administrator action  \nPresence  Lateral Movement  Use application -deployment software  malicious update  \nPresence  Lateral Movement  Use application -deployment soft ware  malicious patch  \nPresence  Lateral Movement  Use application -deployment software  HBSS  \nPresence  Lateral Movement  Use application -deployment software  admin tool  \n\n \n43 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Lateral Movement  Use application -deployment software  administration tool  \nPresence  Lateral Movement  Use remote services  remote execution  \nPresence  Lateral Movement  Use remote services  legitimate credentials  \nPresence  Lateral Movement  Use remote services  remote administrative services  \nPresence  Lateral Movement  Use remote services  remote access  \nPresence  Lateral Movement  Use remote services  windows management instrumentation  \nPresence  Lateral Movement  Use remote services  WMI \nPresence  Lateral Movement  Use remote services  wmic  \nPresence  Lateral Movement  Use remote services  windows remote ma nagement  \nPresence  Lateral Movement  Use remote services  WinRM  \nPresence  Lateral Movement  Use remote services  RPC  \nPresence  Lateral Movement  Use remote services  netbios  \nPresence  Lateral Movement  Use remote services  remote desktop services  \nPresence  Lateral  Movement  Use remote services  mstsc  \nPresence  Lateral Movement  Use remote services  windows terminal services  \nPresence  Lateral Movement  Use remote services  mmc  \nPresence  Lateral Movement  Use remote services  Microsoft Management Console  \nPresence  Lateral Mo vement  Use remote services  powershell  \nPresence  Lateral Movement  Use remote services  implied trust  \nPresence  Lateral Movement  Use remote services  valid credentials  \nPresence  Lateral Movement  Use remote services  remote services  \nPresence  Lateral Movement  Use remote services  exploitation of remote services  \nPresence  Lateral Movement  Write to remote file shares  writing data to remote hosts via file shares  \nPresence  Lateral Movement  Write to remote file shares  remote file copy  \nPresence  Lateral Movement  Write t o remote file shares  file hosting  \nPresence  Lateral Movement  Write to remote file shares  code execution  \nPresence  Lateral Movement  Write to remote file shares  overwrite files  \nPresence  Lateral Movement  Write to remote file shares  change configuration  \nPresence  Lateral Movement  Write to remote file shares  embed code  \nPresence  Lateral Movement  Write to remote file shares  hidden network shares  \nPresence  Lateral Movement  Write to remote file shares  admin shares  \nPresence  Lateral Movement  Write to remote file sh ares windows admin shares  \nPresence  Lateral Movement  Write to remote file shares  C$ \nPresence  Lateral Movement  Write to remote file shares  ADMIN$  \nPresence  Lateral Movement  Write to remote file shares  IPC$  \nPresence  Lateral Movement  Write to remote file sh ares logon script  \nPresence  Lateral Movement  Write to remote file shares  SMB  \nPresence  Lateral Movement  Write to remote file shares  CIFS  \nPresence  Lateral Movement  Write to remote file shares  NFS \nPresence  Lateral Movement  Write to remote file shares  FTP \nPresence  Lateral Movement  Write to remote file shares  TFTP  \nPresence  Lateral Movement  Write to remote file shares  move  \nPresence  Lateral Movement  Write to remote file shares  copy  \nPresence  Lateral Movement  Write to remote file shares  net.exe  \nPresence  Lateral Movement  Write to remote file shares  net use  \nPresence  Lateral Movement  Write to remote file shares  net time  \nPresence  Lateral Movement  Write to remote file shares  ssh \nPresence  Lateral Movement  Write to remote file shares  mount  \nPresence  Lateral Movem ent Write to remote file shares  psexec  \nPresence  Lateral Movement  Write to remote file shares  distributed component object model  \nPresence  Lateral Movement  Write to shared webroot  shared webroot  \n\n \n44 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Lateral Movement  Write to shared webroot  malicious content on website  \nPresence  Lateral Movement  Write to shared webroot  web shell  \nPresence  Lateral Movement  Write to shared webroot  webshell  \nPresence  Lateral Movement  Write to shared webroot  open file share  \nPresence  Lateral Movement  Write to shared webroo t browse to content with a web browser  \nPresence  Lateral Movement  Write to shared webroot  execute content in browser  \nPresence  Lateral Movement  Write to shared webroot  web server process  \nPresence  Lateral Movement  Write to shared webroot  web server configu ration  \nPresence  Lateral Movement  Write to shared webroot  transfer file  \nPresence  Lateral Movement  Write to shared webroot  run as current privilege  \nPresence  Persistence  Create new service  create service  \nPresence  Persistence  Create new service  start new s ervice  \nPresence  Persistence  Create new service  modify registry  \nPresence  Persistence  Create new service  system permission  \nPresence  Persistence  Create new service  root permission  \nPresence  Persistence  Create new service  service -level privileges  \nPresence  Persistence  Create scheduled task  execute programs  \nPresence  Persistence  Create scheduled task  schedule  \nPresence  Persistence  Create scheduled task  at \nPresence  Persistence  Create scheduled task  schtasks  \nPresence  Persistence  Create scheduled task  cron \nPresence  Persistence  Create scheduled task  cronjob  \nPresence  Persistence  Edit boot record  master boot record  \nPresence  Persistence  Edit boot record  MBR  \nPresence  Persistence  Edit boot record  boot loader  \nPresence  Persistence  Edit boot record  raw access to th e boot drive  \nPresence  Persistence  Edit boot record  overwrite MBR  \nPresence  Persistence  Edit boot record  modify MBR  \nPresence  Persistence  Edit boot record  bootkit  \nPresence  Persistence  Edit boot record  virtual boot record  \nPresence  Persistence  Edit boot re cord VBR \nPresence  Persistence  Edit boot record  partition table  \nPresence  Persistence  Edit file -type associations  open file in application  \nPresence  Persistence  Edit file -type associations  file extension  \nPresence  Persistence  Edit file -type associations  registry entry  \nPresence  Persistence  Edit file -type associations  file handler  \nPresence  Persistence  Edit file -type associations  set new program  \nPresence  Persistence  Edit file -type associations  change default file association  \nPresence  Persistence  Employ log on scripts  logon script  \nPresence  Persistence  Employ logon scripts  modify logon script  \nPresence  Persistence  Employ logon scripts  configure logon  \nPresence  Persistence  Employ logon scripts  logon event  \nPresence  Persistence  Leverage path -order execution  unquoted path  \nPresence  Persistence  Leverage path -order execution  path interception  \nPresence  Persistence  Leverage path -order execution  specially crafted path to execute  \nPresence  Persistence  Leverage path -order execution  misconfiguration of path environment variable  \nPresence  Persistence  Leverage path -order execution  path environment variable  \nPresence  Persistence  Leverage path -order execution  search order hijacking  \nPresence  Persistence  Leverage path -order execution  DLL search order hijacking  \nPresence  Persi stence  Leverage path -order execution  dylib hijacking  \nPresence  Persistence  Leverage path -order execution  full program paths  \n\n \n45 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Persistence  Leverage path -order execution  unspecified program path  \nPresence  Persistence  Modify BIOS  BIOS  \nPresence  Persis tence  Modify BIOS  basic input output system  \nPresence  Persistence  Modify BIOS  unified extensible firmware interface  \nPresence  Persistence  Modify BIOS  UEFI  \nPresence  Persistence  Modify BIOS  redirect to a different partition  \nPresence  Persistence  Modify BIOS  replace BIOS  \nPresence  Persistence  Modify BIOS  replace UEFI  \nPresence  Persistence  Modify BIOS  insert code into the boot process  \nPresence  Persistence  Modify BIOS  bootkit  \nPresence  Persistence  Modify configuration to facilitate launch  change configuration  \nPresence  Persistence  Modify configuration to facilitate launch  change initialization script  \nPresence  Persistence  Modify configuration to facilitate launch  change default shell  \nPresence  Persistence  Modify configuration to facilitate launch  edit environme nt variables  \nPresence  Persistence  Modify configuration to facilitate launch  browser extenstions  \nPresence  Persistence  Modify configuration to facilitate launch  accessibility features  \nPresence  Persistence  Modify existing services  existing service  \nPresenc e Persistence  Modify existing services  modify the registry  \nPresence  Persistence  Modify existing services  sc \nPresence  Persistence  Modify existing services  regedit  \nPresence  Persistence  Modify existing services  run malicious binary  \nPresence  Persistence  Modify existing services  application shimming  \nPresence  Persistence  Modify existing services  change service  \nPresence  Persistence  Modify links  redirect link  \nPresence  Persistence  Modify links  link modification  \nPresence  Persistence  Modify links  edit link  \nPresence  Persistence  Modify links  create link  \nPresence  Persistence  Modify links  hard link  \nPresence  Persistence  Modify links  soft link  \nPresence  Persistence  Modify links  shortcut  \nPresence  Persistence  Modify links  symbolic link  \nPresence  Persistence  Modify links execute program when shortcut is clicked  \nPresence  Persistence  Modify links  redirect to a different application  \nPresence  Persistence  Modify service configuration  alter load process  \nPresence  Persistence  Modify service configuration  service -related e xecutables  \nPresence  Persistence  Modify service configuration  service -related libraries  \nPresence  Persistence  Modify service configuration  /etc \nPresence  Persistence  Modify service configuration  /opt \nPresence  Persistence  Modify service configuration  servi ces run by the service manager  \nPresence  Persistence  Replace service binary  replace service executable  \nPresence  Persistence  Replace service binary  overwrite service executable  \nPresence  Persistence  Replace service binary  modifiable service executable  \nPresence  Persistence  Replace service binary  gain elevated privileges  \nPresence  Persistence  Replace service binary  non-standard service binary storage location  \nPresence  Persistence  Set to load at startup  automatically load and execute code  \nPresence  Persisten ce Set to load at startup  autorun  \nPresence  Persistence  Set to load at startup  AddMonitor  \nPresence  Persistence  Set to load at startup  registry run keys  \nPresence  Persistence  Set to load at startup  WMI event subscriptions  \nPresence  Persistence  Set to load at startup  WinLogon Helper DLL  \nPresence  Persistence  Set to load at startup  AppInit  \n\n \n46 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Presence  Persistence  Set to load at startup  AppInit DLLs  \nPresence  Persistence  Set to load at startup  AppCert DLLs  \nPresence  Persistence  Set to load at startup  DLLs  \nPrese nce Persistence  Set to load at startup  modify default shell  \nPresence  Persistence  Set to load at startup  rc script  \nPresence  Persistence  Set to load at startup  LDPRELOAD  \nPresence  Persistence  Set to load at startup  bashrc  \nPresence  Persistence  Use library -search hijack  library search order  \nPresence  Persistence  Use library -search hijack  gain elevated privileges  \nPresence  Persistence  Use library -search hijack  ambiguously specify libraries  \nPresence  Persistence  Use library -search hijack  DLL \nPresence  Persiste nce Use library -search hijack  DLL pre -loading  \nPresence  Persistence  Use library -search hijack  modify how a program loads DLLs  \nPresence  Persistence  Use library -search hijack  .manifest  \nPresence  Persistence  Use library -search hijack  .local  \nPresence  Persist ence  Use library -search hijack  side-loading  \nPresence  Persistence  Use library -search hijack  DLL sideloading  \nPresence  Persistence  Use library -search hijack  path hijacking  \nEffect  Monitor  Activate recording  record target environment  \nEffect  Monitor  Activate  recording  capture audio  \nEffect  Monitor  Activate recording  audio capture  \nEffect  Monitor  Activate recording  capture video  \nEffect  Monitor  Activate recording  screen capture  \nEffect  Monitor  Activate recording  video capture  \nEffect  Monitor  Activate recording  hot mic  \nEffect  Monitor  Activate recording  hot camera  \nEffect  Monitor  Activate recording  record ambiant noise  \nEffect  Monitor  Collect passively  monitor email  \nEffect  Monitor  Collect passively  collect target information  \nEffect  Monitor  Collect passively  monitor documents  \nEffect  Monitor  Collect passively  monitor chat channels  \nEffect  Monitor  Collect passively  packet sniffing  \nEffect  Monitor  Collect passively  cleartext sniffing  \nEffect  Monitor  Collect passively  shoulder surfing  \nEffect  Monitor  Collect passiv ely automated collection  \nEffect  Monitor  Enable other operations  use as future infrastructure  \nEffect  Monitor  Enable other operations  maintain botnet  \nEffect  Monitor  Enable other operations  check operational status  \nEffect  Monitor  Enable other operations  create foothold  \nEffect  Monitor  Log keystrokes  keylogger  \nEffect  Monitor  Log keystrokes  record keystrokes  \nEffect  Monitor  Log keystrokes  record keyboard events  \nEffect  Monitor  Log keystrokes  keylogging  \nEffect  Monitor  Log keystrokes  save keystrokes  \nEffect  Monitor  Log keystrokes  input capture  \nEffect  Monitor  Maintain access  monitor access  \nEffect  Monitor  Maintain access  track access  \nEffect  Monitor  Maintain access  check access  \nEffect  Monitor  Maintain access  check health and status of tools  \nEffect  Monitor  Maintain access  check implants  \nEffect  Monitor  Take screen capture  screen grab  \n\n \n47 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Effect  Monitor  Take screen capture  screenshot  \nEffect  Monitor  Take screen capture  screen capture  \nEffect  Monitor  Take screen capture  snip \nEffect  Monitor  Take screen capture  print screen  \nEffect  Exfiltrate  Collect crosstalk  crosstalk  \nEffect  Exfiltrate  Collect crosstalk  electromagnetic interference  \nEffect  Exfiltrate  Collect crosstalk  twisted pair  \nEffect  Exfiltrate  Collect crosstalk  emanations  \nEffect  Exfiltrate  Collect crosstal k audio signals  \nEffect  Exfiltrate  Collect crosstalk  video signals  \nEffect  Exfiltrate  Collect crosstalk  emanation  \nEffect  Exfiltrate  Collect crosstalk  emanate  \nEffect  Exfiltrate  Collect from local system  local host file system  \nEffect  Exfiltrate  Collect fr om local system  local processes  \nEffect  Exfiltrate  Collect from local system  system configuration  \nEffect  Exfiltrate  Collect from local system  copy data  \nEffect  Exfiltrate  Collect from local system  copy file  \nEffect  Exfiltrate  Collect from local system  clone drive  \nEffect  Exfiltrate  Collect from local system  clipboard data  \nEffect  Exfiltrate  Collect from local system  clone system configuration  \nEffect  Exfiltrate  Collect from local system  data from local system  \nEffect  Exfiltrate  Collect from local system  data from removable media  \nEffect  Exfiltrate  Collect from local system  end-point collection  \nEffect  Exfiltrate  Collect from network resources  copy from shared drive  \nEffect  Exfiltrate  Collect from network resources  data from network shared drive  \nEffect  Exfiltrate  Collect from network resources  data from information repositories  \nEffect  Exfiltrate  Collect from network resources  clone shared drive  \nEffect  Exfiltrate  Collect from network resources  copy from file server  \nEffect  Exfiltrate  Collect from network re sources  clone file server  \nEffect  Exfiltrate  Collect from network resources  copy from mail server  \nEffect  Exfiltrate  Collect from network resources  clone mail server  \nEffect  Exfiltrate  Collect from network resources  email collection  \nEffect  Exfiltrate  Collect from network resources  copy from web server  \nEffect  Exfiltrate  Collect from network resources  clone web server  \nEffect  Exfiltrate  Collect from network resources  man in the browser  \nEffect  Exfiltrate  Collect from network resources  copy from virtual mach ine \nEffect  Exfiltrate  Collect from network resources  clone virtual machine  \nEffect  Exfiltrate  Collect from network resources  exfil over network resources  \nEffect  Exfiltrate  Collect from network resources  hosted resource  \nEffect  Exfiltrate  Collect from net work resources  web-based email  \nEffect  Exfiltrate  Collect from network resources  cloud storage  \nEffect  Exfiltrate  Collect from network resources  hosted storage  \nEffect  Exfiltrate  Compress data  data compression  \nEffect  Exfiltrate  Compress data  compressed da ta \nEffect  Exfiltrate  Compress data  data compressed  \nEffect  Exfiltrate  Compress data  deflate  \nEffect  Exfiltrate  Compress data  archive file  \nEffect  Exfiltrate  Compress data  makecab  \nEffect  Exfiltrate  Compress data  7zip \nEffect  Exfiltrate  Compress data  gzip \nEffect  Exfiltrate  Compress data  rar \n\n \n48 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Effect  Exfiltrate  Compress data  zip \nEffect  Exfiltrate  Compress data  zlib \nEffect  Exfiltrate  Compress data  compression algorithm  \nEffect  Exfiltrate  Compress data  encode data  \nEffect  Exfiltrate  Compress data  encoded  \nEffect Exfiltrate  Disclose data or information  Release information to unauthorized user  \nEffect  Exfiltrate  Disclose data or information  release to a public website  \nEffect  Exfiltrate  Disclose data or information  change permissions to allow broad access  \nEffect Exfiltrate  Disclose data or information  send to unauthorized user  \nEffect  Exfiltrate  Disclose data or information  shoulder surfing  \nEffect  Exfiltrate  Disclose data or information  data breach  \nEffect  Exfiltrate  Position data  gather files  \nEffect  Exfiltr ate Position data  store files to be exfiltrated  \nEffect  Exfiltrate  Position data  create directory  \nEffect  Exfiltrate  Position data  aggregate files  \nEffect  Exfiltrate  Position data  add files to archive  \nEffect  Exfiltrate  Position data  move files  \nEffect  Exfiltrate  Position data  staged data  \nEffect  Exfiltrate  Position data  data staged  \nEffect  Exfiltrate  Run collection script  automated search  \nEffect  Exfiltrate  Run collection script  automated processing  \nEffect  Exfiltrate  Run collection script  scripted collect ion \nEffect  Exfiltrate  Run collection script  scripted search  \nEffect  Exfiltrate  Run collection script  automated exfiltration  \nEffect  Exfiltrate  Run collection script  scripted exfiltration  \nEffect  Exfiltrate  Send over C2 channel  data exfiltration  \nEffect  Exfiltrate  Send over C2 channel  use existing connection  \nEffect  Exfiltrate  Send over C2 channel  use C2 protocol  \nEffect  Exfiltrate  Send over C2 channel  use C2 channel  \nEffect  Exfiltrate  Send over C2 channel  exfiltration over command and control channel  \nEffect Exfiltrate  Send over non -C2 channel  alternate data connection  \nEffect  Exfiltrate  Send over non -C2 channel  use different session  \nEffect  Exfiltrate  Send over non -C2 channel  use different connection  \nEffect  Exfiltrate  Send over non -C2 channel  use non -C2 p rotocol  \nEffect  Exfiltrate  Send over non -C2 channel  data exfiltration  \nEffect  Exfiltrate  Send over non -C2 channel  exfiltration over alternative protocol  \nEffect  Exfiltrate  Send over other network medium  alternate network connection  \nEffect  Exfiltrate  Send over other network medium  use different network medium  \nEffect  Exfiltrate  Send over other network medium  data exfiltration  \nEffect  Exfiltrate  Send over other network medium  backup network connection  \nEffect  Exfiltrate  Send over other network medium  exfiltr ation over other network medium  \nEffect  Exfiltrate  Throttle data  arrange data into smaller size  \nEffect  Exfiltrate  Throttle data  low and slow  \nEffect  Exfiltrate  Throttle data  limit transfer speed  \nEffect  Exfiltrate  Throttle data  slowing transfer  \nEffect  Exfiltrate  Throttle data  small packet size  \nEffect  Exfiltrate  Throttle data  avoid size limits  \nEffect  Exfiltrate  Throttle data  chunks of data  \nEffect  Exfiltrate  Throttle data  bandwidth monitoring  \nEffect  Exfiltrate  Throttle data  noise floor  \nEffect  Exfiltrat e Throttle data  packet flow  \n\n \n49 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Effect  Exfiltrate  Throttle data  physical transfer constraints  \nEffect  Exfiltrate  Throttle data  chunked files  \nEffect  Exfiltrate  Throttle data  evade detection of exfiltration  \nEffect  Exfiltrate  Throttle data  data transfer size l imits \nEffect  Exfiltrate  Transfer via physical means  physical media  \nEffect  Exfiltrate  Transfer via physical means  lost device  \nEffect  Exfiltrate  Transfer via physical means  stolen device  \nEffect  Exfiltrate  Transfer via physical means  removed device  \nEffec t Exfiltrate  Transfer via physical means  hard copy  \nEffect  Exfiltrate  Transfer via physical means  printed papers  \nEffect  Exfiltrate  Transfer via physical means  external hard drive  \nEffect  Exfiltrate  Transfer via physical means  USB \nEffect  Exfiltrate  Transf er via physical means  USB drive  \nEffect  Exfiltrate  Transfer via physical means  flash drive  \nEffect  Exfiltrate  Transfer via physical means  cellular phone  \nEffect  Exfiltrate  Transfer via physical means  MP3 player  \nEffect  Exfiltrate  Transfer via physical mean s sneakernet  \nEffect  Exfiltrate  Transfer via physical means  send information to a remote printer  \nEffect  Exfiltrate  Transfer via physical means  exfiltration over physical medium  \nEffect  Exfiltrate  Traverse CDS or MLS  automated transport services  \nEffect  Exfiltrate  Traverse CDS or MLS  cross domain solution  \nEffect  Exfiltrate  Traverse CDS or MLS  multi -level solution  \nEffect  Exfiltrate  Traverse CDS or MLS  network guard  \nEffect  Exfiltrate  Traverse CDS or MLS  trusted services  \nEffect  Exfiltrate  Traverse CDS or M LS misconfigured CDS  \nEffect  Exfiltrate  Traverse CDS or MLS  misconfigured MLS  \nEffect  Exfiltrate  Traverse CDS or MLS  high-to-low \nEffect  Exfiltrate  Traverse CDS or MLS  pathway  \nEffect  Exfiltrate  Traverse CDS or MLS  insider threat  \nEffect  Exfiltrate  Travers e CDS or MLS  compromise trusted services  \nEffect  Modify  Alter data  change data  \nEffect  Modify  Alter data  modify access control  \nEffect  Modify  Alter data  modify privilege  \nEffect  Modify  Alter data  change data in databases  \nEffect  Modify  Alter data  change da ta in files  \nEffect  Modify  Alter data  modify status shown in dashboards  \nEffect  Modify  Alter data  alteration  \nEffect  Modify  Alter process outcomes  change process  \nEffect  Modify  Alter process outcomes  hijack process  \nEffect  Modify  Alter process outcomes  filter process input  \nEffect  Modify  Alter process outcomes  filter process output  \nEffect  Modify  Alter process outcomes  modify process input  \nEffect  Modify  Alter process outcomes  modify process output  \nEffect  Modify  Cause physical effects  physical change  \nEffect Modify  Cause physical effects  equipment malfunction  \nEffect  Modify  Cause physical effects  power loss  \nEffect  Modify  Change machine -to-machine communications  alter communications processes  \nEffect  Modify  Change machine -to-machine communications  route poi soning  \nEffect  Modify  Change machine -to-machine communications  protocol downgrade  \nEffect  Modify  Change machine -to-machine communications  filter traffic  \nEffect  Modify  Change machine -to-machine communications  dropping router traffic  \n\n \n50 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Effect  Modify  Change r un-state of system processes  alter process state  \nEffect  Modify  Change run -state of system processes  change access controls  \nEffect  Modify  Change run -state of system processes  change privileges  \nEffect  Modify  Change run -state of system processes  restart pr ocess  \nEffect  Modify  Change run -state of system processes  halt process  \nEffect  Modify  Change run -state of system processes  SIGKILL  \nEffect  Modify  Change run -state of system processes  taskkill  \nEffect  Modify  Change run -state of system processes  running proc ess \nEffect  Modify  Change run -state of system processes  suspended process  \nEffect  Modify  Change run -state of system processes  stop process  \nEffect  Modify  Deface websites  change visual appearance  \nEffect  Modify  Deface websites  add content to webpage  \nEffect  Modify  Deface websites  modify function of website  \nEffect  Modify  Defeat encryption  exploit weak cryptographic implementation  \nEffect  Modify  Defeat encryption  exploit misconfigured crypto  \nEffect  Modify  Defeat encryption  modify encryption configuration  \nEffect Modify  Defeat encryption  use aquired cryptographic key  \nEffect  Modify  Defeat encryption  crypto  \nEffect  Modify  Defeat encryption  manipulate unencrypted content  \nEffect  Modify  Defeat encryption  downgrade SSL version  \nEffect  Modify  Defeat encryption  force misconfiguration of encryption scheme  \nEffect  Modify  Defeat encryption  dictionary attack  \nEffect  Modify  Defeat encryption  rainbow attack  \nEffect  Modify  Defeat encryption  plain -text attack  \nEffect  Modify  Defeat encryption  decrypt  \nEffect  Modify  Defeat enc ryption  decryption  \nEffect  Modify  Defeat encryption  side channel attack  \nEffect  Deny  Corrupt files or applications  render files or applications unusable  \nEffect  Deny  Corrupt files or applications  munge file headers  \nEffect  Deny  Corrupt files or application s delete portions of application files  \nEffect  Deny  Corrupt files or applications  flip bits of data files to make them unusable  \nEffect  Deny  Corrupt files or applications  bit flip  \nEffect  Deny  Degrade  decrease throughput  \nEffect  Deny  Degrade  increase laten cy \nEffect  Deny  Degrade  decrease capability for a period of time  \nEffect  Deny  Degrade  decrease capability to some degree  \nEffect  Deny  Degrade  degrade communications  \nEffect  Deny  Disrupt or denial of service  dos \nEffect  Deny  Disrupt or denial of service  service disruption  \nEffect  Deny  Disrupt or denial of service  SYN flood  \nEffect  Deny  Disrupt or denial of service  flooding  \nEffect  Deny  Disrupt or denial of service  disable network services on a host  \nEffect  Deny  Disrupt or denial of service  overwhelming volum e of connection requests  \nEffect  Deny  Disrupt or denial of service  smurf attack  \nEffect  Deny  Disrupt or denial of service  reflection attack  \nEffect  Deny  Disrupt or denial of service  ddos  \nEffect  Deny  Disrupt or denial of service  amplification attack  \nEffec t Deny  Disrupt or denial of service  multiple systems overwhelm a targeted victim  \nEffect  Deny  Disrupt or denial of service  flooding  \nEffect  Deny  Disrupt or denial of service  use botnet to overwhelm victim  \nEffect  Deny  Disrupt or denial of service  coordina ted denial of service  \n\n \n51 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Effect  Deny  Encrypt data to render unusable  encrypt file system  \nEffect  Deny  Encrypt data to render unusable  ransomware  \nEffect  Deny  Encrypt data to render unusable  unknown key  \nEffect  Deny  Encrypt data to render unusable  bulk encryp t \nEffect  Destroy  Brick disk or OS (full delete)  delete critical components of OS  \nEffect  Destroy  Brick disk or OS (full delete)  overwrite OS  \nEffect  Destroy  Brick disk or OS (full delete)  delete OS  \nEffect  Destroy  Brick disk or OS (full delete)  delete BIO S \nEffect  Destroy  Brick disk or OS (full delete)  bricking  \nEffect  Destroy  Corrupt disk or OS (partial delete)  disk corruption  \nEffect  Destroy  Corrupt disk or OS (partial delete)  delete some components of OS  \nEffect  Destroy  Corrupt disk or OS (partial delet e) overwrite some components of OS  \nEffect  Destroy  Corrupt disk or OS (partial delete)  partially recoverable  \nEffect  Destroy  Corrupt disk or OS (partial delete)  partially delete  \nEffect  Destroy  Delete data  data deletion  \nEffect  Destroy  Delete data  wipe har d drive  \nEffect  Destroy  Delete data  delete hard drive  \nEffect  Destroy  Delete data  data clearing  \nEffect  Destroy  Delete data  data-deletion attack  \nEffect  Destroy  Delete data  data erasure  \nEffect  Destroy  Delete data  data wiping  \nEffect  Destroy  Delete data  wipe data  \nEffect  Destroy  Delete data  data loss  \nEffect  Destroy  Delete data  erasure  \nEffect  Destroy  Destroy hardware  destruction  \nEffect  Destroy  Destroy hardware  damage hardware  \nEffect  Destroy  Destroy hardware  corrupt firmware  \nEffect  Destroy  Destroy hardwa re overwrite firmware  \nEffect  Destroy  Destroy hardware  wipe firmware  \nEffect  Destroy  Destroy hardware  wipe system  \nEffect  Destroy  Destroy hardware  permanent loss  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  unused infrastructure  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  unallocate infrastructure  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  assign domains to null IP address  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  not renew leased  domain  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  not renew leased infrastructure  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  public exposure  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  anonymity c oncern  \nAEF Analysis, Evaluation, and Feedback  Abandon infrastructure  burn infrastructure  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  assess operations  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  update infra structure  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  change course of action  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  validate capabilities  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessme nts reset objectives  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  trend analysis  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  analyze trends  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  review outcomes  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  measure success  \nAEF Analysis, Evaluation, and Feedback  Conduct effects assessments  damage assessment  \nAEF Analysis, Evaluation, and Feedback  Refine potential victims  update  target list  \nAEF Analysis, Evaluation, and Feedback  Refine potential victims  validate targets  \n\n \n52 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  AEF Analysis, Evaluation, and Feedback  Refine potential victims  start new operations  \nAEF Analysis, Evaluation, and Feedback  Refine potential victims  learn from  previous operations  \nAEF Analysis, Evaluation, and Feedback  Refine potential victims  shift targets  \nAEF Analysis, Evaluation, and Feedback  Refine potential victims  identify new targets  \nAEF Analysis, Evaluation, and Feedback  Refine potential victims  remov e target  \nC2 Command and Control  Beacon to midpoints  beaconing  \nC2 Command and Control  Beacon to midpoints  periodic packet  \nC2 Command and Control  Beacon to midpoints  send packet to mid -point  \nC2 Command and Control  Beacon to midpoints  send message to C2 i nfrastructure  \nC2 Command and Control  Beacon to midpoints  send to C2  \nC2 Command and Control  Beacon to midpoints  communicate with controller  \nC2 Command and Control  Beacon to midpoints  send packet on demand  \nC2 Command and Control  Beacon to midpoints  beaco ns to  \nC2 Command and Control  Beacon to midpoints  beaconed  \nC2 Command and Control  Beacon to midpoints  callback  \nC2 Command and Control  Beacon to midpoints  call back  \nC2 Command and Control  Beacon to midpoints  calls back  \nC2 Command and Control  Beacon to m idpoints  keep alive beaconing  \nC2 Command and Control  Beacon to midpoints  beacon out  \nC2 Command and Control  Beacon to midpoints  beacon payload  \nC2 Command and Control  Beacon to midpoints  keep -alive beacon  \nC2 Command and Control  Establish peer network  create proxy network  \nC2 Command and Control  Establish peer network  peer-to-peer \nC2 Command and Control  Establish peer network  peer to peer  \nC2 Command and Control  Establish peer network  mesh network  \nC2 Command and Control  Establish peer network  entry node  \nC2 Command and Control  Establish peer network  exit node  \nC2 Command and Control  Establish peer network  .onion  \nC2 Command and Control  Establish peer network  trusted network relationship  \nC2 Command and Control  Relay communications  transmit through network  \nC2 Command and Control  Relay communications  connection proxy  \nC2 Command and Control  Relay communications  proxy  \nC2 Command and Control  Relay communications  port redirect  \nC2 Command and Control  Relay communications  stunnel  \nC2 Command and Control  Relay communications  netcat  \nC2 Command and Control  Relay communications  custom code  \nC2 Command and Control  Relay communications  SSH tunneling  \nC2 Command and Control  Relay communications  tunneling  \nC2 Command and Control  Relay communications  tunnel  \nC2 Command  and Control  Relay communications  VPN \nC2 Command and Control  Relay communications  GRE tunnel  \nC2 Command and Control  Relay communications  PPTP  \nC2 Command and Control  Relay communications  L2TP  \nC2 Command and Control  Relay communications  modify route  \nC2 Command and Control  Send commands  issue command  \nC2 Command and Control  Send commands  controller to implant  \nC2 Command and Control  Send commands  controller send command  \nC2 Command and Control  Send commands  remote access tool  \nC2 Command and Control  Send commands  RAT \nC2 Command and Control  Send commands  send packet  \nC2 Command and Control  Send commands  execute command  \n\n \n53 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  C2 Command and Control  Use botnet  send commands to botnet  \nC2 Command and Control  Use botnet  bot herder  \nC2 Command and Control  Use botnet  IP addresses used by the botnet  \nC2 Command and Control  Use botnet  botnet command and control  \nC2 Command and Control  Use botnet  botnet C2  \nC2 Command and Control  Use chained protocols  protocol chaining  \nC2 Command and Control  Use chained protocols  multi -hop proxy  \nC2 Command and Control  Use chained protocols  mulitple protocols  \nC2 Command and Control  Use chained protocols  protocol encapsulation  \nC2 Command and Control  Use peer connections  use proxy network  \nC2 Command and Control  Use peer connections  send  to peer  \nC2 Command and Control  Use peer connections  peer-to-peer \nC2 Command and Control  Use peer connections  peer to peer  \nC2 Command and Control  Use peer connections  connect to peer  \nC2 Command and Control  Use peer connections  multi -hop proxy  \nC2 Comma nd and Control  Use remote shell  powershell  \nC2 Command and Control  Use remote shell  cmd.exe  \nC2 Command and Control  Use remote shell  bash  \nC2 Command and Control  Use remote shell  tcsh \nC2 Command and Control  Use remote shell  ksh \nC2 Command and Control  Use remote shell  csh \nC2 Command and Control  Use remote shell  sh \nC2 Command and Control  Use remote shell  /dev/tcp  \nC2 Command and Control  Use remote shell  reverse shell  \nC2 Command and Control  Use remote shell  remote access tools  \nC2 Command and Control  Use remote shell  network socket  \nC2 Command and Control  Use removable media  spread commands  \nC2 Command and Control  Use removable media  communication through removable media  \nC2 Command and Control  Use removable media  Use USB to perform commands  \nC2 Command an d Control  Use removable media  run commands from USB  \nC2 Command and Control  Use removable media  autorun  \nEvasion  Evasion  Access raw disk  direct drive access  \nEvasion  Evasion  Access raw disk  read and write files directly  \nEvasion  Evasion  Access raw disk  covert storage on disk  \nEvasion  Evasion  Avoid data -size limits  chunks of data  \nEvasion  Evasion  Avoid data -size limits  process data on host  \nEvasion  Evasion  Avoid data -size limits  low and slow  \nEvasion  Evasion  Avoid data -size limits  avoid size limits  \nEvasion  Evasion  Avoid data -size limits  compress file size  \nEvasion  Evasion  Avoid data -size limits  chunked  \nEvasion  Evasion  Avoid data -size limits  dechunked  \nEvasion  Evasion  Avoid data -size limits  split \nEvasion  Evasion  Block indicators on host  indicators of host a ctivity leaving the host  \nEvasion  Evasion  Block indicators on host  indicator blocking  \nEvasion  Evasion  Block indicators on host  indicator removal on tools  \nEvasion  Evasion  Block indicators on host  indicator removal on host  \nEvasion  Evasion  Block indicators  on host  block traffic associated with reporting  \nEvasion  Evasion  Block indicators on host  stop local process  \nEvasion  Evasion  Block indicators on host  create host -based firewall rule  \nEvasion  Evasion  Block indicators on host  block traffic to server  \nEvasi on Evasion  Block indicators on host  prevent GUI window creation  \n\n \n54 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Evasion  Evasion  Block indicators on host  block pop -up \nEvasion  Evasion  Block indicators on host  disable pop -up \nEvasion  Evasion  Degrade security products  disable security product  \nEvasion  Evasion Degrade security products  disabling security tools  \nEvasion  Evasion  Degrade security products  disrupt security product  \nEvasion  Evasion  Degrade security products  avoid detection  \nEvasion  Evasion  Degrade security products  enable security product  \nEvasi on Evasion  Degrade security products  disable logging  \nEvasion  Evasion  Degrade security products  enable logging  \nEvasion  Evasion  Degrade security products  alter signature store  \nEvasion  Evasion  Degrade security products  alter signature hashes  \nEvasion  Evasi on Degrade security products  alter signature repository  \nEvasion  Evasion  Degrade security products  delete registry key for security tools  \nEvasion  Evasion  Degrade security products  stop security product  \nEvasion  Evasion  Degrade security products  start secu rity product  \nEvasion  Evasion  Delay activity  time delay  \nEvasion  Evasion  Delay activity  sleep timers  \nEvasion  Evasion  Delay activity  wait for user  \nEvasion  Evasion  Delay activity  wait for user activity  \nEvasion  Evasion  Delay activity  delay execution  \nEvasi on Evasion  Delay activity  random execution  \nEvasion  Evasion  Employ anti -forensics measures  make forensic analysis difficult  \nEvasion  Evasion  Employ anti -forensics measures  set timestamps to match system files  \nEvasion  Evasion  Employ anti -forensics measures  alter timestamp  \nEvasion  Evasion  Employ anti -forensics measures  modify timestamp  \nEvasion  Evasion  Employ anti -forensics measures  clean cache  \nEvasion  Evasion  Employ anti -forensics measures  clean registry  \nEvasion  Evasion  Employ anti -forensics measures  destroy log  \nEvasion  Evasion  Employ anti -forensics measures  clear log  \nEvasion  Evasion  Employ anti -forensics measures  alter log  \nEvasion  Evasion  Employ anti -forensics measures  timestomp  \nEvasion  Evasion  Employ anti -forensics measures  hidden files and director ies \nEvasion  Evasion  Employ anti -forensics measures  file deletion  \nEvasion  Evasion  Employ anti -forensics measures  network share connection removal  \nEvasion  Evasion  Employ anti -reverse -engineering measures  evade reverse engineering  \nEvasion  Evasion  Employ a nti-reverse -engineering measures  API imports  \nEvasion  Evasion  Employ anti -reverse -engineering measures  dynamic API import resolution  \nEvasion  Evasion  Employ anti -reverse -engineering measures  overlapping instructions  \nEvasion  Evasion  Employ anti -reverse -engineering measures  stack manipulation  \nEvasion  Evasion  Employ anti -reverse -engineering measures  get tick count  \nEvasion  Evasion  Employ anti -reverse -engineering measures  script obfuscation  \nEvasion  Evasion  Employ anti -reverse -engineering measures  anti-stack backtracing  \nEvasion  Evasion  Employ anti -reverse -engineering measures  string munging  \nEvasion  Evasion  Employ anti -reverse -engineering measures  trampoline  \nEvasion  Evasion  Employ anti -reverse -engineering measures  avoid installation  \nEvasion  Evasion  Employ a nti-reverse -engineering measures  check for debuggers  \nEvasion  Evasion  Employ anti -reverse -engineering measures  software packing  \nEvasion  Evasion  Employ anti -reverse -engineering measures  code signing  \nEvasion  Evasion  Employ anti -reverse -engineering measures  obscure code execution flow  \nEvasion  Evasion  Employ anti -reverse -engineering measures  exception handling  \nEvasion  Evasion  Employ rootkit  install rootkit  \n\n \n55 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Evasion  Evasion  Employ rootkit  rootkit  \nEvasion  Evasion  Employ rootkit  modify OS API calls  \nEvasion  Evasion  Employ rootkit  hooking API  \nEvasion  Evasion  Employ rootkit  intercept API  \nEvasion  Evasion  Employ rootkit  SSDT  \nEvasion  Evasion  Employ rootkit  kernel module  \nEvasion  Evasion  Employ rootkit  kernel driver  \nEvasion  Evasion  Employ rootkit  stealth  \nEvasio n Evasion  Employ rootkit  subvert kernel  \nEvasion  Evasion  Employ rootkit  non-modular code  \nEvasion  Evasion  Employ rootkit  user level  \nEvasion  Evasion  Employ rootkit  kernel level  \nEvasion  Evasion  Employ rootkit  hypervisor rootkit  \nEvasion  Evasion  Employ root kit hide existence of malware  \nEvasion  Evasion  Encode data  converting data  \nEvasion  Evasion  Encode data  encoding  \nEvasion  Evasion  Encode data  encoded data  \nEvasion  Evasion  Encode data  data encoding  \nEvasion  Evasion  Encode data  compiled data  \nEvasion  Evasio n Encode data  compressed data  \nEvasion  Evasion  Encode data  convert file  \nEvasion  Evasion  Encode data  file conversion  \nEvasion  Evasion  Encode data  data conversion  \nEvasion  Evasion  Encode data  base64  \nEvasion  Evasion  Encode data  encapsulate  \nEvasion  Evasion  Encode data  encapsulation  \nEvasion  Evasion  Encode data  uuencode  \nEvasion  Evasion  Encode data  uudecode  \nEvasion  Evasion  Encrypt data  algorithm  \nEvasion  Evasion  Encrypt data  encrypted data  \nEvasion  Evasion  Encrypt data  data encrypted  \nEvasion  Evasion  Encrypt  data data at rest  \nEvasion  Evasion  Encrypt data  data in transit  \nEvasion  Evasion  Encrypt data  RC4 \nEvasion  Evasion  Encrypt data  PGP  \nEvasion  Evasion  Encrypt data  decoder  \nEvasion  Evasion  Encrypt data  private key  \nEvasion  Evasion  Encrypt data  public key  \nEvasion  Evasion  Encrypt data  digital signature  \nEvasion  Evasion  Encrypt data  PKI \nEvasion  Evasion  Encrypt data  encryption scheme  \nEvasion  Evasion  Encrypt data  encrypted protocol  \nEvasion  Evasion  Encrypt data  HTTPS  \nEvasion  Evasion  Encrypt data  SFTP  \nEvasion  Evasion  Encrypt data  encryption  \nEvasion  Evasion  Impersonate legitimate file  save file in a commonly trusted location  \nEvasion  Evasion  Impersonate legitimate file  process doppleganging  \nEvasion  Evasion  Impersonate legitimate file  commonly trusted location  \nEvasion  Evasion  Impersonate legitimate file  use common name  \nEvasion  Evasion  Impersonate legitimate file  benign name  \nEvasion  Evasion  Manipulate trusted process  inject into a trusted process  \n\n \n56 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Evasion  Evasion  Manipulate trusted process  bypass user account  control  \nEvasion  Evasion  Manipulate trusted process  component object model hijacking  \nEvasion  Evasion  Mimic legitimate traffic  mimic legitimate  \nEvasion  Evasion  Mimic legitimate traffic  blend in with existing traffic  \nEvasion  Evasion  Mimic legitimate traf fic standard protocols  \nEvasion  Evasion  Mimic legitimate traffic  standard ports  \nEvasion  Evasion  Mimic legitimate traffic  similar volume  \nEvasion  Evasion  Mimic legitimate traffic  mimic frequency  \nEvasion  Evasion  Mimic legitimate traffic  source and destinat ion \nEvasion  Evasion  Modify malware to avoid detection  change malware  \nEvasion  Evasion  Modify malware to avoid detection  update malware  \nEvasion  Evasion  Modify malware to avoid detection  binary padding  \nEvasion  Evasion  Modify malware to avoid detection  increase executable size  \nEvasion  Evasion  Modify malware to avoid detection  change MD5  \nEvasion  Evasion  Modify malware to avoid detection  modify file hash  \nEvasion  Evasion  Modify malware to avoid detection  recompile  \nEvasion  Evasion  Modify malware to avoid de tection  software packing  \nEvasion  Evasion  Obfuscate data  replace contents  \nEvasion  Evasion  Obfuscate data  overlapping instructions  \nEvasion  Evasion  Obfuscate data  conceal contents  \nEvasion  Evasion  Obfuscate data  dynamic obfuscation  \nEvasion  Evasion  Obfusca te data  data obfuscation  \nEvasion  Evasion  Obfuscate data  obfuscated files or information  \nEvasion  Evasion  Obfuscate data  deobfuscate/decode files or information  \nEvasion  Evasion  Obfuscate data  steganography  \nEvasion  Evasion  Remove logged data  modify log  \nEvasion  Evasion  Remove logged data  alter log  \nEvasion  Evasion  Remove logged data  replace log  \nEvasion  Evasion  Remove logged data  delete log  \nEvasion  Evasion  Remove logged data  file deletion  \nEvasion  Evasion  Remove logged data  destroy log  \nEvasion  Evasion  Remove logged data  clear log  \nEvasion  Evasion  Remove toolkit  remove tools  \nEvasion  Evasion  Remove toolkit  delete tools  \nEvasion  Evasion  Remove toolkit  file deletion  \nEvasion  Evasion  Remove toolkit  DEL \nEvasion  Evasion  Remove toolkit  sysinternals sdelete  \nEvasion Evasion  Remove toolkit  file deletion tool  \nEvasion  Evasion  Remove toolkit  clean -up \nEvasion  Evasion  Remove toolkit  cleanup  \nEvasion  Evasion  Remove toolkit  cover tracks  \nEvasion  Evasion  Sign malicious content  X.509  \nEvasion  Evasion  Sign malicious conte nt code signing  \nEvasion  Evasion  Sign malicious content  stolen certificate  \nEvasion  Evasion  Sign malicious content  self-generated key  \nEvasion  Evasion  Sign malicious content  compromised certificate  \nEvasion  Evasion  Sign malicious content  forged certificate  \nEvasion  Evasion  Sign malicious content  self-signed  \nEvasion  Evasion  Store files in unconventional location  file system metadata  \nEvasion  Evasion  Store files in unconventional location  extended attributes in NTFS  \nEvasion  Evasion  Store files in unconventi onal location  NTFS file attributes  \n\n \n57 \n  \nNSA CYBERSECURITY REPORT\n  \n                        PP-18-0844          NOVEMBER 2018  Evasion  Evasion  Store files in unconventional location  slack space  \nEvasion  Evasion  Store files in unconventional location  registry  \nEvasion  Evasion  Store files in unconventional location  blob \nEvasion  Evasion  Store file s in unconventional location  registry key  \nEvasion  Evasion  Store files in unconventional location  files in registry  \nEvasion  Evasion  Store files in unconventional location  outside logical partition  \nEvasion  Evasion  Store files in unconventional location  alternate data streams  \nEvasion  Evasion  Store files in unconventional location  temp  \nEvasion  Evasion  Tailor behavior to environment  detect environment  \nEvasion  Evasion  Tailor behavior to environment  detect sandbox  \nEvasion  Evasion  Tailor behavior to environm ent detect VM  \nEvasion  Evasion  Tailor behavior to environment  adjust behavior  \nEvasion  Evasion  Use signed content  X.509  \nEvasion  Evasion  Use signed content  legitimate signed software  \nEvasion  Evasion  Use signed content  vulnerable drivers  \nEvasion  Evasion  Use signed content  signed content for malicious  \n \n \n\n    \n58 \n                          PP-18-0844          NOVEMBER 2018  \nNSA CYBERSECURITY REPORT\n  \n \n \n \nAppendix B.  References and License Information  \nMITRE  \nPortions of the NSA/CSS Technical Cyber Threat Framework were derived from the MITRE ATT&CK \nthreat model framework and MITRE ATT&CK Matrix (https://attack.mitre.org). Copyright 2016, The MITRE \nCorporation. ATT&CK and ATT&CK Matrix are trademarks of The MITRE Corporation.  \nLICENSE  \nThe MITRE Corporation (MITRE) hereby grants you a non -exclusive, royalty -free license to use Adversarial \nTactics,  Techniques, and Common Knowledge (ATT&CK) for research, development, and commercial \npurposes. Any copy you make for such purposes is authorized provided that you reproduce MITRE's copyright \ndesignation and this license in any such copy.   \nOffice of the Di rector of National Intelligence (ODNI)   \nThe ODNI Cyber Threat Framework (CTF) was developed by the US Government to enable consistent \ncategorization and characterization of cyber threat events, and to identify trends or changes in the activities of \ncyber a dversaries. This framework can be found at \nhttps://www.dni.gov/files/ODNI/documents/features/A_Common_Cyber_Threat_Framework_Overview.pdf.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "ctr_nsa-css-technical-cyber-threat-framework_v2",
  "source": "nsa",
  "id": "3e5ff1b83902a5523fd10cba1f90767ae62c2931b3632cd3237f4b4f89c8845e"
}