{
  "markdown": " \n            \n               \n          \n           \n    \n   \n \n \n \n \n  \n  \n \n   \n TLP:CLEAR \nCybersecurity Best Practices for \nSmart Cities \nPublication: April 19, 2023 \nUnited States Cybersecurity and Infrastructure Security Agency \nUnited States National Security Agency \nUnited States Federal Bureau of Investigation United Kingdom National Cyber Security Centre Australian Cyber Security Centre \nCanadian Centre for Cyber Security New Zealand National Cyber Security Centre \nThis document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information \ncarries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright rules, TLP:CLEAR information may be distributed without \nrestriction. For more information on the Traffic Light Protocol, see cisa.gov/tlp/. \nTLP:CLEAR \n\n \n          \n     \n    \n    \n      \n   \n \n  \n   \n  \n    \n    \n   \n     \n \n  \n  \n  \n   \n \n \n  \n  \n    \n  \n    \n \n    \n    \n  \n   \n TLP:CLEAR \nSummary \nThis guidance is the result of a collaborative effort from the United States Cybersecurity and \nInfrastructure Security Agency (CISA), the United States National Security Agency (NSA), the \nUnited States Federal Bureau of Investigation (FBI), the United Kingdom National Cyber \nSecurity Centre (NCSC-UK), the Australian Cyber Security Centre (ACSC), the Canadian Centre \nfor Cyber Security (CCCS), and the New Zealand National Cyber Security Centre (NCSC-NZ). \nThese cybersecurity authorities herein referred to as authoring organizations are aware \nthat communities may seek cost -savings and quality -of-life improvements through the digital \ntransformation of infrastructure to create smart cities. In this context, the term smart cities \nrefers to communities that : \n Integrate information and communication s technologies (ICT), community -wide data, \nand intelligent solutions to digitally transform infrastructure and optimize governance \nin response to citizens needs. \n Connect the operational technology (OT) managing physical infrastructure with \nnetwork s and applications that collect and analyze data using ICT components such \nas internet of things (IoT) devices, cloud computing, artificial intelligence (AI), and 5G. \nNote: Terms that also refer to communities with this type of integration include connected \nplaces, connected communities, and smart places. The communities adopting smart city technologies in their infrastructure vary in size and include university campuse s, military \ninstallations, towns, and cities. \nIntegrating public services into a connected environment can increase the efficiency and resilience of the infrastructure that supports day-to -day life in our communities. However, \ncommunities considering becoming smart cities should thoroughly assess and mitigate the cybersecurity risk that comes with this integration. Smart cities are attractive targets for malicious cyber actors because of : \n The data being collected, transmitted, stored, and processed, which can include \nsignificant amounts of sensitive information from governments, businesses, and \nprivate citizens. \n The complex artificial intelligence -powered software systems, which may have \nvulnerabilities , that smart cities sometimes use to integrate this da ta. \nThe intrinsic value of the large data sets and potential vulnerabilities in digital systems mean s \nthere is a risk of exploitation for espionage and for financial or political gain by malicious \nthreat actors, including nation -states, cybercriminals, ha cktivists, insider threats, and \nterrorists. \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 2 \n\n \n          \n   \n  \n   \n  \n \n \n  \n   \n  \n \n \n  TLP:CLEAR \nNo technology solution is completely secure. As communities implement smart city \ntechnologies, this guidance provides recommendations to balance efficiency and innovation \nwith cybersecurity, privacy protections, and national security. Organizations should implement \nthese best practices in alignment with their specific cybersecurity requirements to ensure the \nsafe and secure operation of infrastructure systems, protection of citizens private data, and security of sensitive government and business data. \nThe authoring organizations recommend reviewing this guidance in conjunction with NCSC-\nUKs Connected Places Cyber Security Principles, ACSCs An Intr oduction to Securing Smart \nPlaces , CCCSs Security Considerations for Critical Infrastructure , CISAs Cross-Sector \nCybersecurity Performance Goals, Shifting the Balance of Cybersecurity Risk: Principles and Approaches for Security-by -Design and -Default , and Protecting Against Cyber Threats to \nManaged Service Providers and their Customers. \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 3 \n\n \n          \n \n \n  \n \n  \n    \n  \n \n \n  \n  \n \n \n  \n   \n    \n    \n   \n \n \n \n  \n \n \n  \n \n  \n   \n  \n \n \n \n  TLP:CLEAR \nRisk to Smart Cities \nSmart cities may create safer, more efficient, more resilient communities through \ntechnological innovation and data- driven decision -making; however, this opportunity also \nintroduces potential vulnerabilities that, if exploited, could impact national security, economic security, public health and safety, and critical infrastructure operations. Cyber threat activity \nagainst OT systems is increasing globally, and the interconnection between OT systems and smart city infrastructure increases the attack surface and heightens the potential consequences of compromise. \nSmart cities are an attractive target for criminals and cyber threat actors to exploit vulnerable \nsystems to steal critical infrastructure data and proprietary information, conduct ransomware \noperations, or launch destructive cyberattacks. Successful cyberattacks against smart cities \ncould lead to disruption of infrastructure services, significant financial losses, exposure of \ncitizens private data, erosion of citizens trust in the smart systems themselves, and physical impacts to infrastructure that could cause physical harm or loss of life. Communities implementing smart city technologies should account for these associated risks as part of \ntheir overall risk management approach. The authoring organizations recommend the \nfollowing resources for guidance on cyber risk management: \n An introduction to the cyber threat environment (CCCS) \n Control Sy stem Defense: Know the Opponent (CISA, NSA) \n Cyber threat bulletin: Cyber threat to operational technology (CCCS) \n Cyber Assessment Framework (NCSC-UK) \nExpanded and Interconnected Attack Surface \nIntegrating a greater number of previously separate infrastructure systems into a single network environment expands the digital a ttack surface for each interconnected organization. \nThis expanded attack surface increase s the opportunity for threat actors to exploit a \nvulnerability for initial access, move laterally across networks, and cause cascading, cross-sector disruptions of inf rastructure operations, or otherwise threaten confidentiality, integrity, \nand availability of organizational data, systems, and networks. For example, malicious actors accessing a local government IoT sensor network might be able to obtain lateral access into \nemergency alert systems if the systems are interconnected. \nAdditionally, as a result of smart cities integrating more systems and increasing connectivity \nbetween subnetworks, network administrators and security personnel may lose visibility into \ncollective system risks. This potential loss of visibility includes components owned and \noperated by vendors providing their infrastructure as a service to support integration. It is \ncritical that system owners maintain awareness and control of the evolving network topology \nas well as the individuals/vendor s responsible for the overall system and each segment. \nAmbiguity regarding roles and responsibilities could degrade the systems cybersecurity \nposture and incident response capabilities. Communities implementing smart city technology \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 4 \n\n \n          \n     \n  \n  \n \n    \n   \n   \n   \n \n  \n \n \n  \n  \n \n  \n \n \n    \n  \n \n   \n \n  \n       \n \n \n \n \n \n   \n \n   \n   TLP:CLEAR \nshould assess and manage these risks associated with complex interconnected systems. \nRisks From the ICT Supply Chain and Vendors \nCommunities building smart infrastructure systems often rely on vendors to procure and \nintegrate hardware and software that link infrastructure operations via data connections. \nVulnerabilities in ICT supply chainseither intentionally developed by cyber threat actors for \nmalicious purposes or unintentionally created via poor security practices can enable : \n Theft of data and intellectual property, \n Loss of confidence in the integrity of a smart city system, or \n A system or network failure through a disruption of availability in operational \ntechnology. \nICT vendors providing smart city technology should take a holistic approach to security by adhering to secure -by-design and secure -by-default development practices. Software products \ndeveloped in accordance with these practices decrease the burden on resou rce-constrained \nlocal jurisdictions and increase the cybersecurity baseline across smart city networks. See the \nfollowing resource for guidance on secure-by -design and secure -by-default development \npractices: \n Shifting the Balance of Cybersecurity Risk: Principles and Approaches for Security -by-\nDesign and -Default (CISA, NSA, FBI, ACSC, NCSC-UK, CCCS, BSI, NCSC-NL, CERT NZ , \nNCSC-NZ ) \nThe risk from a single smart city vendor could be much higher than in other ICT supply chains \nor infrastructure operations, given the increased interdependencies between technologies and \nbasic or vital services. Organizations should consider risks from each vendor carefully to avoid \nexposing citizens, businesses, and communities to both potentially unreliable hardware and \nsoftware and deliberate exploitation of supply chain vulnerabilities as an attack vector. This includes scrutinizing vendors from nation -states associated with cyberattacks, or those \nsubject to national legislation requiring them to hand over data to foreign intelligence services. \nIllicit access gained through a vulnerable ICT supply chain could allow the degradation or disruption of infrastructure operations and the compromise or theft of sensitive data from utility operations, emergency service communications, or visual surveillance technologies. Smart city IT vendors may also have access to vast amounts of sensitive data from multiple communities to support the integ ration of infrastructure services including sensitive \ngovernment information and personally identifiable information (PII) which would be an \nattractive target for malicious actors. The aggregation of sensitive data may provide malicious actors with information that could expose vulnerabilities in critical infrastructure and put citizens at risk. See the following resources for guidance on mitigating supply chain risks: \n Information and Communications Technology Supply Chain Risk Management (CISA) \n Supply chain security guidance (NCSC-UK) \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 5 \n\n \n            \n    \n  \n \n  \n  \n \n  \n  \n  \n  \n  \n \n   \n    \n    \n  \n \n  \n  \n     \n  \n  \n    \n     \n  \n   \n    \n    \n      \n  \n   \n      \n \n     TLP:CLEAR \n Identifying Cyber Supply Chain Risks (ACSC) \n Cyber supply chain: An approach to assessing risk (CCCS) \nAutomation of Infrastructure Operations \nSmart cities can achieve efficiencies by automating operations, such as wastewater treatment \nor traffic management . Automation reduces the requirement for direct human control of those \nsystems. Automation can also allow for better consistency , reliability, and speed for \nstandardized operations. However, automa tion can also introduce new vulnerabilities because \nit increases the number of remote entry points into the network (e.g., IoT sensors and remote access points) . The volume of data and complexity of automated operations including \nreliance on third-party ve ndors to monitor and manage operations can reduce visibility into \nsystem operations and potentially hinder real -time incident response. \nAutomation for infrastructure operations in smart city environments may require the use of sensors and actuators that increase the number of endpoints and network connections that are vulnerable to compromise. The integration of AI and complex digital systems could \nintroduce new unmitigated attack vectors and additional vulnerable network components. \nReliance on an AI system or other complex systems may decrease overall transparency into \nthe operations of networked devices as these systems make and execute operational \ndecisions based on algorithms instead of human judgment . \nRecommendations \nSecure Planning and Design \nThe authoring organizations strongly recommend communities include strategic foresight and proactive cybersecurity risk management processes in their plans and designs for integrating smart city technologies into their infrastructure systems. New technolog y should be deliberately \nand carefully integrated into legacy infrastructure designs. Communities should ensure any smart or connected features they are planning to include in new infrastructure are secure by \ndesign and incorporate secure connectivity with any remaining legacy systems. Additionally, \ncommunities should be aware that legacy infrastructure may require a redesign to securely \ndeploy smart city systems. Security planning should focus on creating resilience through defense in depth and account f or both physical and cyber risk as well as the converged cyber-\nphysical environment that IoT and industrial IoT (IIoT) systems introduce. See the following \nconsolidated, baseline practices that organizations of all sizes can implement to reduce the \nlikelihood and impact of known IT and OT risks. \n Cross-Sector Cybersecurity Performance Goals (CISA) \nSee the following additional resources for guidance on accounting for risks in t he cyber, \nphysical, and converged environments: \n Improving ICS Cybersecurity with Defense -in-Depth Strategies (CISA) \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 6 \n\n \n            \n   \n  \n  \n   \n \n   \n \n  \n \n \n \n  \n \n   \n   \n   \n \n  \n   \n  \n \n   \n  \n  \n \n   \n  \n   \n   \n   \n   TLP:CLEAR \n Cybersecurity and Physical Security Convergence (CISA) \n Consequence-Driven Cyber-Informed Engineering (INL) \nApply the principle of least privilege . \nThe organizations responsible for implementing smart city technology should apply the \nprinciple of least privilege throughout their network environments. As defined by the U.S. National Institute of Standards and Technology (NIST), the principle of least privilege is, The principle that a security architecture should be designed so that each entity is granted the \nminimum system resources and authorizations that the entity needs to perform its function. \nAdministrators should review default and existing configurations along with hardening guidance from vendors to ensure that hardware and software is only permissioned to access other systems and data that it needs to perform its functions. Administrators should also \nimmediately update privileges upon changes in administrative roles or the addition of new \nusers or administrators from newly integrated systems. They should use a tiered model with different levels of administrative access based on job requirements. Administrators should limit access to accounts with full privileges across an enterprise to dedicated, hardened privileged access workstations (PAWs). Administrators should also use time -based or just -in-\ntime privileges and identify high -risk devices, services, and users to minimize their access. For \ndetailed guidance, see : \n Defend Privileges and Accounts (NSA) \n Restricting Administrative Privileges (ACSC) \n Managing and controlling administrative privileges (CCCS ) \nEnforce multifactor authentication . \nThe organizations responsible for implementing smart city technology should secure remote access applications and enforce multifactor authentication ( MFA) on local and remote \naccounts and devices where possible to harden the infrastructure that enables access to networks and systems. Organizations should explicitly require MFA where users perform privileged actions or access important (sensitive or high -availability) data repositories. Russian \nstate -sponsored APT actors have recently demonstrated the ability to exploit default MFA \nprotocols. O rganizations responsible for implementing smart cities should review configuration \npolicies to protect against fail open and re -enrollment scenarios. See the following resource \nfor guidance on implementing MF A: \n #More Than a Password (CISA) \n Russian State -Sponsored Cyber Actors Gain Network Access by Exploiting Default \nMultifactor Authentication Protocols and PrintNightmare Vulnerability (FBI, CISA) \n Transition to Multi-Factor Authentication (NSA) \n MFA for online services (NCSC-UK) \n Implementing MFA (ACSC) \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 7 \n\n \n               \n \n  \n \n  \n  \n  \n  \n   \n   \n   \n    \n   \n   \n     \n \n    \n \n     \n    \n  \n    \n  \n      \n     \n  \n   \n    \n   \n   \n   \n  \n \n  \n  TLP:CLEAR \n Zero trust architecture design principles - Authenticate and authorize (NCSC-UK) \nImplement zero trust architecture . \nImplementing zero trust network design principles will create a more secure network \nenvironment that requires authentication and authorization for each new connection with a layered, defense-in -depth approach to security. Zero trust also allows for greater visibility into \nnetwork activity, trend identification through analytics, issue resolution through automation \nand orchestration, and more efficient network security governance. See the following \nresources for guidance on implementing zero trust: \n Zero trust architecture design principles (NCSC-UK) \n Zero Trust Maturity Model (CISA) \n Embracing a Zero Trust Security Model (NSA) \n A zero trust approach to security architecture (CCCS) \n Zero Trust security model (CCCS) \nNote: Both zero trust architecture and MFA should be applied wherever operationally feasible \nin balance with requirements for endpoint trust relationships. Some OT networks may require \ntrust -by-default architectures, but organizations should isolate such networks and ensure all \ninterconnections with that network are secure d using zero trust and related principles. \nManage changes to internal architecture risks . \nThe organizations responsible for implementing smart city technology should understand their environment and carefully manage communications between subnetworks, including newly interconnected subnetworks linking infrastructure systems. Network administrators should \nmaintain awareness of their evolving network architecture and the personnel accountable for the \nsecurity of the integrated whole and each individual segment. Administrators should identify, group, and isolate critical business systems and apply the appropriate n etwork security controls \nand monitoring systems to reduce the impact of a compromise across the community. See the \nfollowing resource s for detailed guidance: \n CISA Vul nerability Scanning (CISA) \n Vulnerability Scanning Tools and Services (NCSC-UK) \n Security architecture anti-patterns (NCSC-UK) \n Preventing Lateral Movement (NCSC-UK) \n Segment Networks and Deploy Application -aware Defenses (NSA) \nSecurely manage smart city assets . \nSecure smart city assets against theft and unauthorized physical changes. Consider \nimplementing physical and logical security controls to protect sensors and monitors against \nmanipulation, theft, vandalism, and environmental threats. \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 8 \n\n \n          \n  \n   \n   \n   \n \n  \n   \n    \n   \n \n  \n  \n  \n \n \n  \n   \n   \n   \n \n \n  \n \n   \n  \n \n \n TLP:CLEAR \nImprove security of vulnerable devices . \nSee the following resources for guidance on protecting devices by securing remote access: \n Selecting and Hardening Remote Access VPN Solutions (CISA, NSA) \n Using Virtual Private Networks (ACSC) \n Virtual private networks (CCCS) \nProtect internet- facing services . \nSee the following resources for guidance on protecting internet -facing services: \n Protecting internet -facing services on public service CNI (NCSC- UK) \n Strategies for protecting web application systems against credential stuffing attacks (CCCS) \n Isolate web -facing applications (CCCS) \nPatch systems and applications in a timely manner . \nWhere possible, enable automatic patching processes for all software and hardw are devices \nthat include authenticity and integrity validation. Leverage threat intelligence to identify active \nthreats and ensure exposed systems and infrastructure are protected. Secure software assets \nthrough an asset management program that includes a product lifecycle process. This process \nshould include planning replacements for components and software nearing or past end-of -\nlife, as patches may cease to be developed by manufacturers or developers. See the following resources for guidance on protecting systems and networks via asset management: \n Known Exploited Vulnerabilities Catalog (CISA) \n Asset management for cyber security (NCSC-UK) \nReview the legal, security, and privacy risks associated with deploymen ts. \nImplement processes that continuously evaluate and manage the legal and privacy risks associated with deployed solutions. \nProactive Supply Chain Risk Management \nAll organizations responsible for implementing smart city technology should proactively \nmanage ICT supply chain risk for any new technology, including hardware or software that \nsupports the implementation of smart city systems or service providers supporting \nimplementation and operations. Organizations should use only trusted ICT vendors and \ncomponents. The ICT supply chain risk management process should include participation from all levels of the organization and have full support from program leaders implementing smart \ncity systems. Procurement officials from communities implementing smart city systems should also communicate minimum security requirements to vendors and articulate actions t hey will \ntake in response to breaches of those requirements. Smart city technology supply chains should be transparent to the citizens whose data the systems will collect and process. \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ \nTLP:CLEAR 9 \n\n \n           \n  \n \n   \n    \n    \n    \n \n  \n    \n  \n  \n \n   \n    \n  \n  \n  \n \n \n    \n   \n   \n \n   \n   \n  \n  \n   \n \n \n  \n  \n   TLP:CLEAR \nFor detailed supply chain security guidance , see: \n Russian State -Sponsored and Criminal Cyber Threats to Critical Infrastructure (CISA, \nACSC, NCSC-NZ, NCSC -UK, CCCS) \n Supply chain security guidance (NCSC-UK) \n ICT Supply Chain Library (CISA) \n Cyber-Physical Security Con siderations for the Electricity Sub-Sector (CISA) \n Cyber Supply Cha in Risk Management (ACSC) \nSoftware Supply Chain \nThe organizations responsible for implementing smart city technology should set security \nrequirements or controls for software suppliers and ensure that potential vendors use a software development lifecycle that incorporates secure development practices, maintains an \nactive vulnerability identification and disclosure process, and enables patch management. \nProduct vendors should also assume some of the risk associated with their products and \ndevelop smart city technology in adherence to secure-by -design and secure -by-default \nprinciples and active maintenance for the products they provide. Vendors adhering to these \nprinciples give the organizations responsible for procuring and implementing smart city \ntechnology more confidence in the products they introduce into their networks. \nFor detailed guidance , see: \n Shifting the Balance of Cybersecurity Risk: Principles and Approaches for Security -by-\nDesign and -Default (CISA, NSA, FBI, ACSC, NCSC-UK, CCCS, BSI, NCSC-NL, CERT NZ , \nNCSC-NZ ) \n Software Bill of Materials (CISA) \n Supply Chain Cyber Security: In Safe Hands (NCSC-NZ) \n Securing the Software Supply Chain: Recommended Practices Guide for Customers \n(ODNI, NSA, CISA, CSCC, DIBSCC, ITSCC) \n Coordinated Vulnerability Disclosure Process (CISA) \n Protecting your organization from software supply chain threats (CCCS) \nHardware and IoT Device Supply C hain \nOrganizations responsible for implementing smart city technology should determine whether \nthe IoT devices and hardware that will enable smart functionality will require support from \nthird-party or external services. These organizations should perform due-diligence research on how parts are sourced and assembled to create products. They should also determine how the \ndevices store and share data and how the devices secure data at rest , in transit, and in use . \nOrganizations should maintain a risk register that identifies both their own and their vendors \nreliance on cloud computing support, externally sourced components, and similar \ndependencies. For detailed guidance , see: \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ 10 \nTLP:CLEAR \n\n \n             \n   \n   \n    \n  \n  \n \n  \n \n \n  \n  \n \n \n   \n  \n    \n  \n \n \n \n  \n \n \n   \n  \n  \n \n \n   \n \n   TLP:CLEAR \n Cyber supply chain: An approach to assessing risk (CCCS) \n Cybersecurity for IOT Program (NIST) \n Defending Against Software Supply Chain Attacks (CISA, NIST) \nManaged Service Providers and Cloud Service Providers \nOrganizations should set clear security requirements for managed service providers and other \nvendors supporting smart city technology implementation and operations. Organizations \nshould account for the risks of contracting with third-party vendors in their overall risk management planning and ensure organizational security standards are included in \ncontractual agreements with external parties. Similarly, organizations should carefully review \ncloud service agreements , including data security provisions and responsibility sharing \nmodels. For detailed guidance , see: \n Shifting the Balance of Cybersecurity Risk: Principles and Approaches for Security -by-\nDesign and -Default (CISA, NSA, FBI, ACSC, NCSC-UK, CCCS, BSI, NCSC-NL, C ERT NZ , \nNCSC-NZ ) \n Protecting Against Cyber Threats to Managed Service Providers and their Customers \n(NCSC-UK, CCCS, NCSC-NZ, CISA, NSA, FBI) \n Six steps toward more secure cloud computing (FTC) \n Choosing the best cyber security solution for your organization (CCCS) \nOperational Resilience \nThe organizations responsible for implementing smart city technology should develop, assess, \nand maintain contingencies for manual operations of all critical infrastructure functions and \ntrain staff accordingly. Those contingencies should include plans for disconnecting \ninfrastructure systems from one another or from the public internet to operate autonomously. In the event of a compr omise, organizations should be prepared to isolate affected systems \nand operate other infrastructure with as little disruption as possible . \nBackup systems and data. \nThe organizations responsible for implementing smart city technology should create, maintain, and test backups, both for IT system records and for manual operational capabilities for the physical systems integrated in a smart city network. These organizations should identify how and where data will be collected, processed, stored, and transmitted and ensure each node in that data lifecycle is protected. System administrators should store IT backups separately and isolate them to inhibit the spread of ransomware many ransomware variants attempt to find \nand encrypt/delete accessible backups. Isolating backups enables restoration of systems/data to their previous state in the case of a ransomware attack. \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ 11 \nTLP:CLEAR \n\n \n           \n  \n   \n    \n  \n \n \n   \n \n   \n    \n  \n  \n  \n  \n \n \n  \n    \n   \n   \n   \n   \n    \n    \n \n     \n  TLP:CLEAR \nThe organizations responsible for implementing smart city technology should have plans in \nplace and training for staff so operations managers can disconnect normally connected infrastructure systems and operate manually in an offline mode to maintain basic service \nlevels. For detailed guidance , see: \n Offline backups in an online world (NCSC-UK) \nConduct workforce training. \nThough implementation of smart city technology may include extensive automation, \nemployees responsible for managing infrastructure operations should be prepared to isolate compromised IT systems from OT and manually operate core functions if necessary. \nOrganizations should train new and existing employees on integrated, automated operations \nas well as isolated, manual backup procedures, including processes for restoring service after a res tart. Organizations should update training regularly to account for new technologies and \ncomponents. For detailed guidance , see: \n ICS Training Available Through CISA (CISA) \nDevelop and exercise incident response and recovery plans. \nIncident response and recovery plans should include roles and responsibilities for all stakeholders including executive leaders, technical leads, and procurement officers from inside and outside the smart city implementation team. The organizations responsible for \nimplementing smart city technology should maintain up-to -date and accessible hard copies of \nthese plans for responders should the network be inaccessible (e.g., due to a ransomware \nattack). Organizations should exercise their plans annually and coordinate with continuity managers to ensure continuity of operations. For detailed guidance see: \n Incident Response Plan Basics (CISA) \n Effective steps to cyber exercise creation (NCSC -UK) \n Incident Management: Be Resilient, Be Prepared (NCSC-NZ ) \n Preparing for and Responding to Cyber Security Incidents (ACSC) \n Developing your incident response plan (CCCS) \n Developing your IT recovery plan (CCCS) \nPurpose \nThis guidance was developed by U.S., U.K., Australian, Canadian, and New Zealand \ncybersecurity authorities to further their respective cybersecurity missions, including their responsibilities to develop and issue cybersecurity specifications and mitigations. \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ 12 \nTLP:CLEAR \n\n \n          \n  \n \n \n   \n \n \n \n   \n   \n  \n \n \n \n    \n   \n    \n   \n  \n  TLP:CLEAR \nAcknowledgements \nMicrosoft, IBM, and Nozomi Networks contributed to this guidance. \nDisclaimer \nThe information in this report is provided as is for informational purposes only. CISA, NSA, \nFBI, NCSC-UK, ACSC, CCCS, and NCSC-NZ do not endorse any commercial product or service, \nincluding any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise does not constitute or \nimply endorsement, recommendation, or favoring. \nContact Information \nU.S. organizations: report incidents and anomalous activity to CISA 24/7 Operations Center at \nreport@cisa.gov or (888) 282-0870 and/or to the FBI via your local FBI field office , the FBIs \n24/7 CyWatch at (855) 292-3937, or CyWatch@fbi.g ov. When available, please include the \nfollowing information regarding the incident: date, time, and location of the incident; type of \nactivity; number of people affected; type of equipment used for the activity; the name of the \nsubmitting company or organization; and a designated point of contact. United Kingdom \norganizations: report a significant cyber security incident at ncsc.gov.uk/report-an -incident \n(monitored 24 hours) or, for urgent assistance, call 03000 200 973. Australian organizations: \nvisit cyber.gov.au or call 1300 292 371 (1300 CYBER 1) to report cybersecurity incidents and \nto access alerts and advisories. Canadian organizations: report incidents by emailing CCCS at \ncontact@cyber.gc.ca . New Zealand organizations: report cyber security incident s to \nincidents@ncsc.govt.nz or call 04 498 7654. \nCISA | NSA | FBI | NCSC -UK | ACSC | CCCS | NCSC -NZ 13 \nTLP:CLEAR \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "cybersecurity-best-practices-for-smart-cities_508c",
  "source": "nsa",
  "id": "916b1a65ecf19befbd2f9bd48225caceefa82b98b80e92c9783e78c245d2c80e"
}