{
  "markdown": "  \nU/OO/122630 -18 | PP-18-0120  | MARCH 2018  \nNational Security Agency  | Cybersecurity Information  \nNSAs Top Ten Cybersecurity Mitigation Strategies  \nNSAs Top Ten Cybersecurity Mitigation Strategies counter a broad range of exploitation techniques used by Advanced \nPersistent Threat (APT) actors. These mitigations  set priorities for enterprise organizations to minimize mission impact. \nThe mitigations also build upon the NIST Cyber security Framework functions to manage cybersecurity risk and promote a \ndefense -in-depth security posture. The mitigation strategies are ranked by effectiveness against known APT tactics. \nAdditional strategies and best practices will be required to mitigat e the occurrence of new tactics.  \nThe related NIST cybersecurity functions are keyed as   Identify,  Protect,  Detect,  Respond, and  Recover.  \n1. Update and Upgrade Software Immediately  \nApply all available software updates, automate the process to the extent possible, and use an update service provided \ndirectly from the vendor. Automation is necessary because threat actors study patches and create exploits, often soon \nafter a patch is released. These N -day exploits can be a s damaging as a zero day. Vendor updates must also be \nauthentic; updates are typically signed and delivered over protected links to assure the integrity of the content. Without \nrapid and thorough patch application, threat actors can operate inside a defend ers patch cycle.  \n2. Defend Privileges and Accounts  \nAssign privileges based on risk exposure and as required to maintain operations. Use a Privileged Access Management \n(PAM) solution to automate credential management and fine -grained access control. Another way to manage privilege is \nthrough tiered administrative access in which each higher tier provides additional access, but is limited to fewer personnel.  \nCreate procedures to securely reset credentials (e. g., passwords, tokens, tickets). Privileged accounts and services must \nbe controlled because threat actors continue to target administrator credentials to access high -value assets, and to move \nlaterally through the network.  \n3. Enforce Signed Software Execution Policies  \nUse a modern operating system that enforces signed software execution policies for scripts, executables, device drivers, \nand system firmware. Maintain a list of trusted certificates to prevent and dete ct the use and injection of illegitimate \nexecutables. Execution policies, when used in conjunction with a secure boot capability, can assure system integrity. \nApplication Whitelisting should be used with signed software execution policies to provide greate r control. Allowing \nunsigned software enables threat actors to gain a foothold and establish persistence through embedded malicious code.  \n4. Exercise a System Recovery Plan  \nCreate, review, and exercise a system recovery plan to ensure the restoration of data as part of a comprehensive disaster \nrecovery strategy. The plan must protect critical data, configurations, and logs to ensure continuity of operations due to \nunexpected events. For additional protection, backups should be en crypted, stored offsite, offline when possible, and \nsupport complete recovery and reconstitution of systems and devices. Perform periodic testing and evaluate the backup \nplan. Update the plan as necessary to accommodate the ever -changing network environmen t. A recovery plan is a \nnecessary mitigation for natural disasters as well as malicious threats including ransomware.  \n5. Actively Manage Systems and Configurations  \nTake inventory of network devices and software. Remove unwanted, unneeded or unexpected hard ware and software \nfrom the network. Starting from a known baseline reduces the attack surface and establishes control of the operational \nenvironment. Thereafter, actively manage devices, applications, operating systems, and security configurations. Active \nenterprise management ensures that systems can adapt to dynamic threat environments while scaling and streamlining \nadministrative operations.   Identify,  Protect  \n Identify,  Protect  \n Protect,   Detect  \n Identify,  Respond,  Recover  \n Identify,  Protect  \n\n \n \n U/OO/122630 -18 | PP-18-0120  | MARCH 2018  2 \nNSA | NSAs Top Ten Cybersecurity Mitigation Strategies  \n6. Continuously Hunt for Network Intrusions  \nTake proactive steps to detect, contain, and remove any malicious presence within the network. Enterprise organizations \nshould assume that a compromise has taken place and use dedicated teams to continuously seek out, contain, and \nremove threat actors within th e network. Passive detection mechanisms, such as logs, Security Information and Event \nManagement (SIEM) products, Endpoint Detection and Response (EDR) solutions, and other data analytic capabilities are \ninvaluable tools to find malicious or anomalous beha viors. Active pursuits should also include hunt operations and \npenetration testing using well documented incident response procedures to address any discovered breaches in security. \nEstablishing proactive steps will transition the organization beyond basic  detection methods, enabling real -time threat \ndetection and remediation using a continuous monitoring and mitigation strategy.  \n7. Leverage Modern Hardware Security Features  \nUse hardware security features like Unified Extensible Firmware Interface (UEFI) Se cure Boot, Trusted Platform Module \n(TPM), and hardware virtualization. Schedule older devices for a hardware refresh. Modern hardware features increase \nthe integrity of the boot process, provide system attestation, and support features for high -risk applic ation containment. \nUsing a modern operating system on outdated hardware results in a reduced ability to protect the system, critical data, \nand user credentials from threat actors.  \n8. Segment Networks and Deploy Application -Aware Defenses  \nSegment critical networks and services. Deploy application -aware network defenses to block improperly formed traffic and \nrestrict content, according to policy and legal authorizations. Traditional intrusion detection based on known -bad \nsignatures is quickly decreasing in effectiveness due to encryption and obfuscation techniques. Threat actors hide \nmalicious actions and remove data over common protocols, making the need for sophisticated, application -aware \ndefensive mechanis ms critical for modern network defenses.  \n9. Integrate Threat Reputation Services  \nLeverage multi -sourced threat reputation services for files, DNS, URLs, IPs, and email addresses. Reputation services \nassist in the detection and prev ention of malicious events and allow for rapid global responses to threats, a reduction of \nexposure from known threats, and provide access to a much larger threat analysis and tipping capability than an \norganization can provide on its own. Emerging threats , whether targeted or global campaigns, occur faster than most \norganizations can handle, resulting in poor coverage of new threats. Multi -source reputation and information sharing \nservices can provide a more timely and effective security posture against dy namic threat actors.  \n10. Transition to Multi -Factor Authentication  \nPrioritize protection for accounts with elevated privileges, remote access, and/or used on high value assets. Physical \ntoken -based authentication systems should be used to supplement knowle dge-based factors such as passwords and \nPINs. Organizations should migrate away from single factor authentication, such as password -based systems, which are \nsubject to poor user choices and susceptible to credential theft, forgery, and reuse across multipl e systems.  \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, trademark,  manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov    Detect,  Respond,  Recover  \n Identify,  Protect  \n Protect,   Detect  \n Protect,   Detect  \n Identify,  Protect  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "ddd-190716-666-071",
  "source": "nsa",
  "id": "c409f55a604667bc54e678bb1fd570537ddec8de8ba3875308e028a7e9cc1078"
}