{
  "markdown": " \n \nU/OO/ 181857 -19          PP -19-1039          AUGUST 2019  1 DEFEND PRIVILEGES AN D ACCOUNTS  \nKEYS TO THE KINGDOM  \nA typical enterprise network contains many high value items, or assets. These assets could be information corporate \nknowledge or intellectual property. They could be capabilities the ability to control equipment or processes, to transfer \nfunds , or to approve actions. Malicious actors steal this information for profit, threaten the destruction of the information for \nextortion (i.e. r ansomware), and abuse capabilities to misuse, destroy, or degrade service. Often,  they do this  by \nexploiting poorly defended privileges and accounts.  Stolen account credentials  and the use of legitimate privileges allow \nan adversary to avoid using malware,  which can leave  telltale artifacts.  \nPrivileges are rights granted to an individual, program, or process, sometimes expressed as an action that a user is \npermitted to perform on an asset  [1]. They are sometimes as simple as the ability to read or modify a file, to access a \ndatabase, or to log on to a corporate server. An account is a set of privileges given to an authenticated entity, usually a \nuser. For example, a user might be given an administrative account on a device with privileges to log on, install new \nprograms, and access the file system. While administrative privileges are typically unavailable to most users, both \nadministrative and non- administrative accounts must  be safeguarded.  \nThreats of credential misuse come from actors outside the organizati on as well as inside. The Verizon 2018 Data Breach \nInvestigation Report named stolen credentials, phishing, and privilege abuse as three of the top five action varieties \nobserved in breaches  that year [2]. By identifying and ranking assets , controlling the accounts that allow access to t hose \nassets , strongly authenticating the users of those accounts, and monitoring how those accounts are used, an enterprise \nimproves its ability to protect its most valuable assets.  \nTHE LIFECYCLE  \nAccount and privilege defense is a continual proces s. System owners \nconstantly review accounts and the ir associated risks. Thoroughly  \ndocument ing each phase of the lifecycle identify, protect, and monitor \nprovides a reference for consistency, continuity, an d understanding. \nAdherence to organizational  policies ensure that the documentation and \npractices comply with legal standards and obligations.  \nIdentify assets, users, and a ccounts  \nDiscovering  the organizations high value assets and ranking them based \non their associated risks to operations identifies the areas where \ndefenses  need to be prioritized. Typically the highest value assets are \ncorrelated with the greatest risk to mission success or business continuity.  \nThe next step is to identify all the privile ges and accounts associated with each asset  and to rank t hese privileges and \naccounts based on the risk or exposure the privileges and accounts pose to the asset. When identifying accounts and \nprivileges an organization considers the following questions  [3]: \n What tasks require privileges over this asset?  \n How many accounts need privileges over the asset to complete each task and for how long?  \n Are there currently privileges or accounts for this asset that are not associated with a task? \n Do privileges and accounts for this asset inadvertently give the user privileges and accounts for other assets?  \n Which of these privileges and accounts have administrative capabilities?\n\n\n \n \n \n2 U/OO/ 181857 -19          PP -19-1039          AUGUST 2019  \n Traditionally, administrative accounts have been the biggest targets, because these accounts typically  \nhave access to all the assets in the network , but user accounts may also have access to high value assets. For \ninstance, executive user accounts may have access to valuable data.  \nProtect  accounts  \nThe mechanisms of access control, leas t privilege, and authentication, when implemented together , integrate to \nprotect accounts.  \nAccess Control is the process of managing and enforcing \nthe privileges that are assigned to accounts. Providing \nfunct ional separation of assets can ease the establishment \nand maintenance of access controls. Segregation of a \nnetwork through physical or logical means separates \nfunctions that have minimal or no interaction.1 When done \ncorrectly , network segmentation can hinder certain types of \nlateral movement and limit the potential damage from an \nattack or breach.  For systems employing directories for \naccess control, this may require separating user groups  and \nadministration of those user groups,  in addition to controlling \nthe flow of network traffic.  \nLeast privilege  is the restriction of privileges to only those \naccounts that require them to perform their duties , while \nlimiting accounts to only those privileges that are truly necessary . Doing this  reduces the exposure of those \nprivileges to a small er, more easily manageable  set of accounts.  Local administrative acc ounts and accounts for \nsoftware program management and installation  are particularly powerful, but have small scopes of control and \nshould be restricted as much as possible.  \nHaving separate accounts for routine and sensitive activities  further reduces  privilege exposure. Privileged \naccounts should not be used to perform general tasks such as accessing emails and browsing the Internet.2 \nEmail and Internet browsing activities are inherently dangerous because they involve processing untrusted \ninformation that is potentially malicious. If accounts with high value privileges are used to perform these activities, \na compromise can lead to immediate attacker control of those privileges.  For these reasons, administrative and \nnon-administrative privileges should be as signed to separate accounts for each user and asset.  Additionally, on \nservers, disable or remove browsing and email capability altogether if not necessary for the server applications to \nfunction.  \nThe principle of least privilege is particularly important w hen operating a Microsoft Active Directory 3 (AD) \ndomain, given the constant use of Pass -the-Hash (PtH) attacks by sophisticated actors and novices alike.  \nA tiered privilege architecture combined with strict access controls , such as Microsofts Enhanced Security \nAdministrative Environment  (ESAE), implements the principle of least privilege across the AD infrastructure [4]. \nThe ESAE reference architecture contains tiers of privileges. Each account is assigned to a tier based on the \nprivileges and assets associated with the account. The highest level tier (Tier -0 in ESAE) contains the accounts \nthat administer the access control system itself. Below that, there is a tier for administering enterprise services, \nand then for administering individual workstations and devices. Privilege restrictions and access controls are \nimposed at the tier level and restrict an accounts privileges and access from the other administrative tiers. These \nlayers of administrative access reduce the risk of privilege escalation by preve nting the most critical credentials \nfrom being used or left on less  critical systems. Tier based systems can be easier to manage than individual \naccounts.  \n                                                \n1 For more information on network segregation, please refer to Segregate Networks Using Application Aware Defenses,  an NSA Cybersecurity Top 10 Mitigation document.  \n2 For more information, please refer to Enforcing No Internet or E -mail Access from Privileged Accounts , MIT -003FS -2014.  \n3 Active Directory is a registered trademark of Microsoft Corporation.  \n\n\n \n \n \n3 U/OO/ 181857 -19          PP -19-1039          AUGUST 2019  \n  \nFigure 2: ESAE architecture  \n1.) Each privileged account is assigned to a Tier. 2.) The accounts have only those privileges that are required to manage the assigned assets. 3.) \nAdmins must log in to privileged accounts via a dedicated privileged access workstation (PAW) that is dedicated to their own Tier. Admins cannot \nlog in on PAWs dedicated to oth er Tiers. 4.) Accounts can only manage assets assigned to their Tier. 5.) Accounts for the Production Forest are \nmanaged by admins in the Administration Forest.  \nAuthentication  is the mechanism that ensures that only authorized users can access accounts.  Strong \nauthentication methods , like multi- factor authentication (MFA),  assist in  defending privileges.4 Using  MFA hinders \nattacker s by requiring them to defeat multiple independent authentication mechanisms . In many cases, MFA \nsystems can be incorporated int o existing public key infrastructure or certificate based structures. MFA systems \nthat rely on encryption must be properly configured to avoid known vulnerabilities. This includes  migrating to the \nnewest cryptographic algorithms and remov ing outdated secur ity artifacts such as expired certificates from \ncertificates stores.  \nMany attacks will circumvent strong authentication mechanism s by leveraging a weak credential recovery process  \n(e.g. when a user forgets their password) . Authenticat ing in-person or us ing a secure out -of-band method for \nauthenticating users  assures a strong credential recovery process.   \nMany other attacks will attempt to bypass strong authentication mechanisms by reusing single- factor \nauthentication assertions ( such as Pass the Ticket) or leveraging automated accounts that cannot use multi -factor \nauthentication (such as service accounts) . Single -factor authentication assertions are used behind- the-scenes by \nmany services to enable single- sign-on capabilities so users do not  need to authe nticate over and over . Instead, \nthe user  only perform s the MFA once and then an assertion that states that MF A has  been used is passed to \naccess many services. When an attacker gains access to this single- factor assertion, or, even worse, the master \nkey th at signs these assertions, then the attacker no longer needs to satisfy the difficult MFA requirements  [5]. \nLimiting the lifetime of these assertions,  periodically re -validating their associated MFA , and protecting assertion \nsigning keys enable an enterpri se to realize the full security benefits of strong authentication mechanisms.  \nAnother way to enhance authentication security is with the implementation of a Privilege Access Management \n(PAM) solution. These solutions provide a centralized management interf ace for authentication and access \ncontrol throughout the network. This provides simplified device management and granular least privilege \nimplementation and can often support MFA for otherwise incompatible platforms . In many cases, access controls \nand management functions can be automated. Most PAM solutions also provide a means to monitor and audit the \n                                                \n4 For guidance on strong authentication, please refer to Transition to Multi -factor Authentication, part of the NSA Cybersecurity  Top 10 Mitigations packet.  \n\n\n \n \n \n4 U/OO/ 181857 -19          PP -19-1039          AUGUST 2019  \n use of accounts and privileges.  \nMonitor  for anomalies  \nAdversaries may succeed in penetrating the network despite all these efforts. T he final stage in the defending \nprivileges and accounts lifecycle is to continually monitor for anomalous behavior and changes in the risk \nposture.5 Internal and independent auditing measures will help  to maintain a consistent perspective of accounts \nand privileges.  Certain security products and operating system features will monitor where and how accounts and \ncredentials are used and even create fake account credential tokens (honey -tokens) that, when stolen and used, \nwill raise alarms. Develop, maintain, and exercise a plan f or responding to anoma lies, including plans for how to \nrecover from the most critical account compromises (e.g. golden ticket resets , mass  MFA token replacement s), \nwhich require careful planning [6].6 \nARE THOSE PRIVILEGES STILL NEEDED?  \nThe account and privilege defense lifecycle is a continual process designed to adapt to the evolving needs of an \norganization. Changes in operations, personnel , or devices necessitate changes in accounts and privileges. \nRegular reviews and monitoring help to protect high value assets by limiting  exploitation and insider threat.  \nStrengthening the defense of privileges and accounts is an essential aspect of a defense- in-depth strategy to  \nimprove the overall security and resiliency of a network.  \nREFERENCES \n[1]  Committee on National Sec urity Systems (CNSS) Glossary. CNSSI , 4009- 2015, 2015 April 6.  \n[2]  2018 D ata Breach Investigation Report.  11th edition, Verizon, 2018.  \n[3]  Managing and Controlling Administrative Privileges Explained.  ITSB -94, Communications Security Establishment / Centre de la scurit \ndes tlcommunications, 2015 June.  \n[4]  Active Directory Administrative Tier Model. Microsoft, 2019 June 4. https://docs.microsoft.com/en -us/windows -server/identity/securing-\nprivileged- access/securing -privileged- access -reference- material   \n[5] Pass the Ticket. MITRE, 2018. https://attack.mitre.org/techniques/T1097/   \n[6]  AD Forest Recovery  Resetting the krbtgt password. Microsoft, 2018 August 8. https://docs.microsoft.com/en -us/windows -\nserver/identity/ad- ds/manage/ad- forest -recovery -resetting- the-krbtgt -password  \nRELATED NSA CYBERSECURITY GUIDANCE  \n Privileged Access Management,  NSA, 2017 April 25. [Online] Available: https://apps.nsa.gov/iaarchive /library/ia -guidance/security -\ntips/privileged- access -management.cfm  \n Least Privilege,  NSA,  2017 April 10. [Online] Available:  https://apps.nsa.gov/iaarchive /library/ia -guidance/security -tips/least -privilege.cfm  \n Hardening Authentication , NSA, 2016 November 3.  [Online] Available: https://apps.nsa.gov/iaarchive  /library/ia -guidance/security -\ntips/hardening- authentication- update.cfm  \n Hard ening Authentication , NSA, 2016 July 21. [Video] Available: https://www.youtube.com/watch?v=fXpKl3Jam -w  \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  Reference herein to \nany specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its \nendorsement, recommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product \nendorsement purposes.  \nCONTACT INFORMATION  \nClient Requirements and General Cybersecurity Inquiries  \nCybersecurity Requirement s Center (CRC),  410-854-4200, email: Cybersecurity_Requests@nsa.gov  \n                                                \n5 For more information on threat hunting, please refer to Continuously Hunt for Network Intrusions , part of the NSA Cybersecurity Top 10 Mitigations packet.  \n6 For more information on system recovery, please refer to Exercise a S ystem Recovery Plan, also part of the NSA Cybersecurity Top 10 Mitigations packet.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "defend privileges and accounts - copy",
  "source": "nsa",
  "id": "b8e8a8119a9b25af61db1bd979468350e238ece8aa448ac21bbaf6384ef6e683"
}