{
  "markdown": " \n  \nAs of May 1, 2024  \n cisa.gov  \n central@cisa.dhs.gov  \n @CISAgov  @CISACyber  \n @cisagov  \nTLP:CLEAR  \n      \n \n \n  \n  \n \nOverview\nThe Cybersecurity and Infrastructure Security Agency (CISA), Federal \nBureau of Investigation ( FBI), National Security Agency (NSA), \nEnvironmental Protection Agency (EPA),  Department of Energy (DOE), \nUnited States Department of Agriculture (USDA), Food  and Drug \nAdministration (FDA),  Multi -State Information Sharing and Analysis Center \n(MS-ISAC ), Canadian  Centre for Cyber Security  (CCCS) , and United \nKingdoms National Cyber Security Centre (NCSC -UK)herea fter referred \nto as \"the authoring organization s\"are disseminating this fact sheet  to \nhighlight and safeguard against the continued malicious cyber activity \nconducted by pro-Russia hacktivists  against operational technology (OT) \ndevices  in North America and Europe . \nThe authoring organization s are aware of pro -Russia hacktivist s targeting \nand compromising small -scale OT system s in North American  and European Water and Wastewater  Systems (WWS), \nDams, Energy, and Food and Agriculture Sectors. These hacktivists  seek to compromise  modular , internet -exposed  \nindustrial control systems (ICS)  through their software  components , such as  human machine interfaces (HMIs) , by \nexploiting virtual network computing (VNC) remote access software and default passwords.  \nThe authoring organization s are releasing this fact sheet  to share information and mitigations  associated with this \nmalicious acti vity, which ha s been observed since 2022  and as recently as April 2024 . The authoring organizations  \nencourage OT operators in critical infrastructure sectors including WWS, Dams, Energy, and Food and Agriculture to \napply the recommendations listed in the Mitigations section of this fact sheet  to defend against this activity . \nOverview of Threat Actor Activity  \nPro-Russia hacktivist activity against these  sectors appears  mostly  limited to unsophisticated techniques  that manipulat e \nICS equipment to creat e nuisance effects . However, investigations  have identified that these actors are capable of  \ntechniques that pose physical threats against insecure and misconfigured  OT environments . Pro-Russia hacktivists have \nbeen observed gaining remote access via a combination of exploiting publicly exposed internet -facing connections and \noutdated VNC software, as well as using the HMIs factory default passwords and weak passwords without multifactor \nauthentication.  \nHistorically,  these hacktivists have been known to exaggerate their capabilities and impacts to targets . Since 2022, they \nhave claim ed on social media to have conducted cyber operations such as distributed denial of service, data leaks, and DEFENDING OT OPERAT IONS  \nAGAINST ONGOING PRO -RUSSIA \nHACKTIVIST ACTIVITY  \nActions to take today:  \n Immediately change all default \npasswords of OT devices (including \nPLCs and HMIs), and use strong, \nunique passwords.  \n Limit exposure of OT systems to \nthe internet.  \n Implement multifactor \nauthentication for all access to the \nOT network.  \n\n\n \n \n2 \nAs of May 1, 2024  \n cisa.gov  \n central@cisa.dhs.gov  \n @CISAgov  @CISACyber  \n @cisagov  \nDEFENDING OT OPERAT IONS  AGAINST ONGOING PRO -RUSSIA \nHACKTIVIST ACTIVITY  \n \ndata wiping against a variet y of North American  and international organizations. Based on victim incident reporting, this \nactivity  has caused limited disruption to operations.  \n2024 Year -to-Date Activity  \nIn early 2024, the authoring organizations  observed pro-Russia hacktivists  targeting  vulnerable industrial control systems  \nin North America and Europe . CISA and the FBI have responded to several U.S. -based WWS victims who experienced \nlimited physical disruptions from an unauthorized user remotely manipulating HMIs. Specifically, pro-Russia hacktivists  \nmanipulated HMIs , caus ing water  pumps and blower equipment to exceed their normal operating parameters. In each \ncase,  the hacktivists  maxed out set points, altered other settings, turned off alarm mechanisms, and changed \nadministrati ve passwords to lock out the WWS operators. Some victims  experience d minor tank overflow event s; however,  \nmost victims reverted to manual controls in the immediate aftermath and  quickly restored operations.  \nRemote Access to HMIs  \nThe authoring organizations  have observed pro-Russia hacktivists  using a variety of techniques to gain remote access to \nHMIs and  make changes to the  underlying OT . These techniques include :  \n Using the VNC Protocol to access HMIs and make changes to the underlying OT. VNC is used for remote access to \ngraphical user interfaces, including HMIs that control OT systems.  \n Leveraging the VNC Remote Frame Buffer Protocol to log into HMIs to control OT systems .  \n Leverag ing VNC over Port 5900 to access HMIs by using default credentials and weak passwords  on accounts \nnot protected by  multifactor authentication.  \nNote:  Several HMIs compromised by these hacktivists were unsupported legacy , foreign -manufactured devices rebranded \nas U.S. devices . \nMITIGATIONS  \nThe autho ring organizations  recommend critical infrastructure organizations implement the  following  mitigations t o \ndefend against  this activity. These mitigations align with the Cross -Sector Cybersecurity Performance Goals (CPGs) \ndeveloped by CISA and the National Institute of Standards and Technology (NIST). The CPGs provide a minimum set of \npractices and protections that CISA and NIST r ecommend all organizations implement. CISA and NIST based the CPGs on \nexisting cybersecurity frameworks and guidance to protect against the most common and impactful threats, tactics, \ntechniques, and procedures. Visit CISAs Cross -Sector Cybersecurity Performance Goals  for more information on the \nCPGs, including additional recommended baseline protections.  \nNetwork Defenders  \nPro-Russia hacktivists  have exploited cybersecurity weaknesses, including poor password sec urity and exposure to the \ninternet. To safeguard against this threat, the authoring organizations  urge organizations to:  \nHarden HMI  Remote Acces s \n Disconnect all HMIs, such as the touchscreens used to monitor or make changes to the system, or \nprogrammable l ogic controllers (PLCs), from the public -facing internet.  If remote access is necessary,  implement \na firewall and/or virtual private network (VPN) with a strong password and multifactor authentication to control \ndevice access [ CPG 2.W ] [CPG 2.X ]. \n Implement multifactor authentication for all access to the OT network.  For additional information, see CISAs \nMore than a Password  [CPG 2.H ]. \n Immediately change all default and weak  passwords on HMIs and use a strong, unique password.  Ensure the \nfactory default password is not in use. Open the remote settings panel to confir m the old password is no longer \nshown [ CPG 2.A ] [CPG 2.B ]. \n\n \n \n3 \nAs of May 1, 2024  \n cisa.gov  \n central@cisa.dhs.gov  \n @CISAgov  @CISACyber  \n @cisagov  \nDEFENDING OT OPERAT IONS  AGAINST ONGOING PRO -RUSSIA \nHACKTIVIST ACTIVITY  \n \n Keep  VNC updated with the latest version available  and ensure all systems and software are up to date with \npatches and necessary securi ty updates.  \n Establish an allowlist  that permits only authorized device IP addresses.  The allowlist can be re fined to specific \ntimes of the day to further obstruct maliciou s threat actor activity ; organizations are encouraged to establish \nalerting for monitoring access attempts.  \no Note: An allowlist is not a complete  security solution  by itself but  may increase the level of effort \nnecessary for a threat actor to compromise a device.  \n Log remote logins to HMIs,  taking note of any failed attempts and unusual times [ CPG 2.T ]. \nStrengthen Security Posture  \n Integrate cybersecurity considerations into the  conception, design, development, and operation of  OT systems. \nFor additional information, see the DOE Office of Cybersecurity, Energy Security, and Emergency Response \n(CESER) s publication on  Cyber -Informed  Engineering . \n Practice and maintain the ability to operate systems manually [CPG 5.A ]. \n Create backups  of the engineering logic, configurations, and firmware of HMIs to enable fast recovery. Familiarize \nyour organization with factory resets and backup deployment [ CPG 2.R ].  \n Check the integrity of PLC ladder logic or other PLC programming languages  and diagrams  and check for any \nunauthorized modifications  to ensure correct operat ion. Adversaries  may try to maintain persistence or stealthily \noperat e the device in an unsafe way by changing the configurations and ladder logic.  \n Update and safeguard  network diagrams  to reflect both the IT and OT networks [ CPG 2.P ]. Operators should \napply the principles of least privilege and need to know for individuals access to  network diagrams. Maintain \nawareness of internal and external solicitation efforts (both malicious and benign) to obtain network \narchitecture s and restrict mapping to trusted personnel. Consider using encryption, authentication, and \nauthorization techniques to secure network diagram files and implement access control and audit logs to monitor \nand restrict who can view  or modify  your network diagrams.  \n Be aware  of cyber/physical -enabled threats . Adversaries may attempt to obtain  network credentials by various \nphysical means, including official visits, tradeshow and conference conversations, and through social media \nplatform s. \n Take  inventory and determine the end -of-life status of all HMIs  [CPG 1.A ]. Replace end-of-life HMIs as soon as \nfeasible.  \n Implement software and hardware limits  to the manipulation of physical processes, limiting the impact of a \nsuccessful compromise.  This can be completed through using  operational interlocks, cyber -physical safety \nsystems, and cyber -informed engineering.  \nLimit Adversarial Use of Common Vulnerabilities  \n Reduce risk exposure. U.S. organizations can utilize a range of CISA services at no cost, including scanning and \ntesting , to help organizations reduce exposure to threats by mitigating attack vectors. CISA Cyber Hygiene  \nservices can help provide additional review of internet -accessible assets and provide regular reports on steps to \ntake to mitigate vulnerabi lities. Email vulnerability@cisa.dhs.gov  with the subject line, Requesting Cyber Hygiene \nServices , to get started.  UK organizations  can use  NCSCs free Early Warning  service.  \n Assess your security posture.  CISAs regional Cybersecurity Advisors provide CPG assessments to help \norganization s understand their current security posture. Rea ch out to your regional CISA office  to schedule an \nassessment.   \n\n \n \n4 \nAs of May 1, 2024  \n cisa.gov  \n central@cisa.dhs.gov  \n @CISAgov  @CISACyber  \n @cisagov  \nDEFENDING OT OPERAT IONS  AGAINST ONGOING PRO -RUSSIA \nHACKTIVIST ACTIVITY  \n \nOT Device Manufacturers  \nAlthough critical infrastructure organizations can take steps to mitigate risks, it is ultimately the responsibility of the OT \ndevice manufacturer to build products that are secure by design and default. The authoring organizations  urge device  \nmanufacturers to take ownership of the security outcomes of their customers in line with the joint guide Shifting the \nBalance of Cybersecurity Risk: Principles and Approaches for Secure by Desi gn Software  and CISAs Secure by Design and \nDefault  webpage . \n Eliminate default and require  strong passwords.  The use of default credentials is a top weakness that threat \nactors exploit to gain access to s ystems. Manufacturers can eliminate this problem at scale through any of the \napproaches recommended in  CISA s Secure by Design Alert  on this topic.  \n Mandate multifactor authentication for privileged users.  Changes to engineering logic or configurations are \nsafety -impacting events in critical infrastructure. Any changes should require multifactor authentication.  \n Include logging at no additional charge.  Change and access control logs allow operators to track safety -impacting \nevents in their critical infrastructure. These logs should be free and use open standard logging formats.  \n Publish Software Bills of Materials (SBOM).  Vulnerabilities in underlying software libraries can affect  wide  \nswathes of devices. With out an SBOM, it is near ly impossible for a critical infrastructure system owner to \nmeasure and mitigate the impact a vulnerability has on their existing systems.  \nAdditionally, see CISAs Secure by Design Alert  on how software manufacturers can shield web management interfaces \nfrom malicious cyber activity. By using secure by design tactics, software manufacturers can make their product lines \nsecure out of the box without requiring customers to spend additional resources making configuration changes, \npurchasing tiered security software and l ogs, monitoring, and making routine updates.  \nRESOURCES  \nEntities requiring additional support for implementing any of the mitigations in this advisory should contact their \nregional  CISA Cybersecurity Advisor  and/or EPA for assistance . Five key resources organization s should reference include:  \n NSA, CISA: Recommend ed Immediate Actions to Reduce Exposure Across all OT and Control Systems  \n CISA, EPA: Water and Wastewater Systems Sector Toolkit  \n CISA, EPA, FBI: Top Cyber Actions for Securing Water Systems  \n Food and Agriculture Information Sha ring & Analysis Center (Food and Ag -ISAC): Cybersecurity Guide for Small \nand Medium Enterprises  \n DOE, National Association of Regulatory Utility Commissioners (NARUC): Cybersecurity Baselines for Electric \nDistribution Systems and Distributed Energy Resources  \nAdditional resources referenced throughout  this fact sheet  include:  \n EPA: Cybersecurity for the Water Sector  \n CISA: Cross -Sector Cybersecurity Performance Goa ls \n CISA: More than a Password  \n DOE: Cyber -Informed Engineering  \n CISA: Cyber Hygiene Services  \n CISA: Shifting the Balance of Cybersecurity Risk - Principles and Approaches for Secure by Design Software  \n CISA: Secure by Design and Default  \n CISA: Secure by De sign Alert - How Manufacturers Can Protect Customers by Eliminating Default Passwords  \n CISA: Secure by Design Alert - How Software Manufacturers Can Shield Web Management Interfaces from \nMalicious Cyber Activity  \n\n \n \n5 \nAs of May 1, 2024  \n cisa.gov  \n central@cisa.dhs.gov  \n @CISAgov  @CISACyber  \n @cisagov  \nDEFENDING OT OPERAT IONS  AGAINST ONGOING PRO -RUSSIA \nHACKTIVIST ACTIVITY  \n \nREPORTING  \nU.S. organizations are encourage d to report suspicious or criminal acti vity related to information in this fact sheet  to: \n CISA via CISAs 24/7 Operations Center ( report@cisa.gov  or 888 -282-0870)  or your local FBI field office . When \navailable, please include the following information regarding the incident: date, time, and location of the \nincident; type of activity; number of people affected; type of equipment used for the activity; the name of the \nsubmitting company or organiza tion; and a designated point of contact.  \n For NSA cybersecurity guidance inquiries, contact CybersecurityReports@nsa.gov . \n Water and Wastewater Systems Sector organizations  should  contact the EPA Water Infr astructure and Cyber \nResilience Division at watercyberta@epa.gov  to voluntarily provide situational awareness.  \n State, local, tribal, and territorial governments should report incidents to the MS -ISAC ( SOC@cisecurity.org  or \n866-787-4722).  \n The Water Information Sharing & Analysis Center  (WaterISAC ) encourages members to share information by \nemailing analyst@waterisac.org , calling 866 -H2O-ISAC, or using the online incident reporting form . \n Entities required to report incidents to DOE -CESER  should follow established reporting requirements, as \nappropriate. For other energy sector inquiries, contact  EnergySRMA@hq.doe.gov . DOE also encourages energy \nentities to  report information to their relevant energy ISACs:  \no Downstream Natural Gas (DNG -ISAC) : analyst@dngisac.com  \no Electricity (E-ISAC):  operations@eisac.com  \no Oil & Natural Gas ( ONG -ISAC):  soc@ongisac.org  \nACKNOWLEDGEMENTS  \nThe DNG -ISAC  and Water ISAC contributed to this fact sheet . \nDISCLAIMER  \nThe information in this report is being provided as is for informational purposes only. The authoring organizations  do not \nendorse any commercial entity, product, company, or service, including any entities, products, or services linked within \nthis document. Any reference to specific commercial entities, products, processes, or services by service mark, \ntrademark, manu facturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring by the \nauthoring organizations . \nVERSION HISTORY  \nMay 1 , 2024 : Initial version.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "defending-ot-operations-against-ongoing-pro-russia-hacktivist-activity",
  "source": "nsa",
  "id": "066abd81442f6707d8bf59dfdea46966f4663f38b0e39faab399cba0071c1a6e"
}