{
  "markdown": " \n1 \n 18  \n\n\n \n2 \n Disclaimer \nDisclaimer of Endorsement  \nThis document was written for general informational purposes only. References to any speci ic \ncommercial product, process, or service by trade name, trademark, manufacturer, or otherwise do \nnot constitute or imply an endorsement, recommendation, or favoring by the United States \nGovernment. This document is intended to apply to a variety of factual circumstances and industry \nstakeholders, and the information provided herein is advisory in nature. The guidance in this \ndocument is provided as is. Once published, the information within may not constitute the most \nup-to-date guidance or technical information. Accordingly, the document does not, and is not \nintended to, constitute compliance or legal advice. Readers should confer with their respective \nadvisors and subject matter experts to obtain advice based on their circumstances. In no event shall \nthe United States Government be liable for any damages arising in any way out of the use of or \nreliance on this guidance. \nPURPOSE  \nThe National Security Agency (NSA) and the Cybersecurity and Infrastructure Security Agency \n(CISA) developed this document in furtherance of their respective cybersecurity missions, including \ntheir responsibility to develop and issue cybersecurity recommendations and mitigation strategies. \nThis information may be shared broadly to reach all appropriate stakeholders. \nCONTACT  \nClient Requirements / Inquiries:  Enduring Security Framework nsaesf@cyber.nsa.gov  \nMedia Inquiries / Press Desk:   \n NSA Media Relations, 443-634-0721, MediaRelations@nsa.gov  \n CISA Media Relations, 703-235-2010, CISAMedia@cisa.dhs.gov \n \n \n \n \n \n \n \n  \n\n \n3 \n Table of Contents  \nIntroduction ................................................................................................................................................................................ 4  \nEstablish the United States as a Venue of Choice for Hosting Standards Meetings ....................................... 7  \nRecommendations to U.S. Government  ................................................................................................. 8  \nRecommendations to Private Sector Stakeholders  ............................................................................... 8  \nEngage Early in Emerging Technology Standards-Related Activities ................................................................. 8  \nStandards Process  ................................................................................................................................... 9  \nBeneits of Early Engagement ............................................................................................................... 10  \nPre-Standardization Activities  .............................................................................................................. 10  \nRecommendations for Individual Participants  ................................................................................... 11  \nRecommendations for Private Sector Stakeholders  ........................................................................... 11  \nRecommendations for Academia  ......................................................................................................... 12  \nRecommendations for U.S. Government  .............................................................................................. 12  \nDevelop a more Standards-Savvy U.S. Workforce..................................................................................................... 13  \nRecommendations for Individual Participants  ................................................................................... 13  \nRecommendations to Private Sector Stakeholders  ............................................................................. 14  \nRecommendations for SDOs  ................................................................................................................. 15  \nRecommendations for the U.S. Government  ........................................................................................ 15  \nRecommendations to Academia  ........................................................................................................... 16  \nEngage Academia to Grow the Next Generation of Standards Experts ........................................................... 17  \nRecommendations to the U.S. Government  ......................................................................................... 18  \nRecommendations to Private-Sector Stakeholders  ............................................................................ 18  \nRecommendations to Standards Organizations  .................................................................................. 18  \nConclusion ................................................................................................................................................................................ 19  \nAppendix A: Timing Considerations in Standardization ....................................................................................... 21  \nInternet Protocol  ................................................................................................................................... 21  \nThe ATIS NEXT G Alliance  ..................................................................................................................... 21  \nEngaging Too Early  ................................................................................................................................ 22  \n \n  \n\n \n4 \n Enduring Security Framework \nRecommendations for Increasing U.S. \nParticipation and Leadership in \nStandards  Development  \nJune 2024 \nIntroduction \nStandards development is a priority for technological security among the United States, \nlike-minded nations, foreign adversaries, and competitors. Standards promote \ninteroperability across vendor offerings and set boundaries on features that can be offered. \nFor this reason, U.S. participation in standards development is critical to maintaining the \nU.S.s robust position in the marketplace. While standards development is primarily an \neconomics-driven activity, national security equities are also relected in the standards \ndevelopment process. Decisions on the strength of authentication, privacy, and the ability to \nshare threat information impact not only personal security but also the ability of nations to \narchitect defensible networks. \n \nOpen, transparent, rules-based standards processesprocesses that represent multiple \nstakeholder s and do not give undue in luence to a limited number of voicesare necessary \nto ensure that globally relevant standards meet U.S. national security requirements. The \nneed for standards that support U.S. national security is re lected in the U.S. National \nSecurity Telecommunications Advisory Committee (NSTAC) Letter to the President on \nStandards,1 which provides key indings and recommendations to enhance U.S. \ncompetitiveness in international communications technology standards. In this letter, the \nNSTAC states: \nAs cyberattacks have grown more frequent and serious and as geopolitical and \neconomic competition has increased concerns with security, resiliency, \ninteroperability, and other critical information and communications technology \n(ICT) issues have caused governments, industry, and users to focus more intently on \nhow those standards are developed and whether products and services are \ncompliant with robust standards. In addition, there is concern that one actor \n(nation or company) may unduly in luence the standardization system, which \nwould represent a threat to national security. Against this backdrop, some \n \n1 NSTAC Letter to the President on Standards (cisa.gov)  \n\n \n5 \n governments are asserting new standards strategies to promote their domestic \nagendas within the global standardization system.  \nInternational standards development will impact security and privacy across the \ntechnology landscape for coming generations. Given the impact that the decisions made \nwithin Standards Development Organizations (SDOs) have on emerging technologies, it is \ncritical that standards and standards-related policies are open, transparent, and consensus-\ndriven. Failing to [work with all nations committed to an open and transparent standards \nsystem] will risk the United Statesand the worldsinnovation, security, and \nprosperity.2 \n \nThe U.S. has long enjoyed robust standards of participation, leadership, and inluence from \nindustry, government, and academia. However, the standards landscape is changing. It is \ncritical that interest in standards be strengthened in the U.S. public and private sectors. The \nBiden administration recently released the May 2023 United States Governments National \nStandards Strategy for Critical and Emerging Technology (USGNSSCET) augmenting steps \nalready taken to strengthen the U.S.s participation and position within standards \norganizations, including the CHIPS and Science Act of 20223; proposed increases to the FY \n2024 budget for emerging technologies like quantum computing and arti icial intelligence; \nand proposed federal spending increases aimed at research and development in support of \nstandards. As the strategy states, [s]tandards for [critical and emerging technologies]\nadvanced technologies that are signi icant for U.S. competitiveness and national security \ncarry strategic signi icance. Rebuilding U.S. and allied leadership in standards underpins \nstrategic national and economic security decision-making.4 \n \nIn the U.S., standards development is an industry-led endeavor. While this offers dynamic, \nmarket-focused participation, it makes the U.S.s standing in standards highly dependent on \nprivate enterprises investing the time and money required for robust engagement. This is a \nlong-term investment. Before the standardization work begins, there is often a period of \nresearch to develop new technology. As a result, standards can take years to reach \ncompletion, and return on investment (ROI), in the form of standards-compliant products \nreaching the marketplace, may not be realized fully until the standard is completed and \nimplemented. The eventual pay-off (leadership in the marketplace, creation of intellectual \nproperty that can be licensed, or opening new markets and value-added services) can be \nlucrative. However, not every company will make that calculation. \n \nDecisions made in standards bodies impact national security. Choices made in writing a \nstandard will directly determine the security provided by products implementing that \n \n2US-Gov-National-Standards-Strategy-2023.pdf (whitehouse.gov)  \n3govinfo.gov/content/pkg/PLAW-117publ167/html/PLAW-117publ167.htm  \n4 US-Gov-National-Standards-Strategy-2023.pdf (whitehouse.gov)   \n\n \n6 \n standard. Indirectly, a nations companies success in including features and intellectual \nproperty in standards can signi icantly in luence their inancial success (contributing to the \nnations economic security) and availability of domestic suppliers for critical networks. \nNational security is often affected by standards and private industrys decision to \nparticipate. Industry investment in the standards development process and impactful U.S. \ngovernment and industry involvement are crucial to protecting national security. \n \nThis paper, authored by government, industry, and academic participants in the Enduring \nSecurity Framework, provides recommendations to help achieve increased participation \nand leadership in SDOs.5 It may be useful to implementors of the U.S. Government National \nStandards Strategy, standards development organizations, and industry and academic \nrepresentatives seeking to strengthen their participation in standards. \n \nBecause the authors of this paper were primarily based in the U.S., the recommendations \nfor governments listed here are directed to the U.S. government. However, standards are \nnecessarily collaborative efforts, and the U.S. cannot and should not act alone in the \nstandards development space without coordinating with other democratic nations. It is the \nopinion of the authors that these recommendations are also applicable to like-minded, \ndemocratic nations that wish to increase their participation in standards development \norganizations for the sake of their own economic and national security. \n \nThe following sections delve into four recommendations derived from the NSTAC letter, \ndesigned to increase U.S. and like-minded nations presence and participation in the global \nstandards landscape:  \n \n Establish the U.S. as a venue of choice for standards development meetings. \n Engage early in emerging technology standards. \n Develop a more standards-savvy workforce. \n Engage academia to grow the next generation of standards development experts. \n \nBy responding to these proposals, the U.S. can take decisive strides toward shaping the \nfuture of emerging technologies, bolstering security and resilience, and fostering a skilled \nworkforce to navigate the complex challenges of the digital era. To foster U.S. leadership in \nSDOs, this paper also underscores the signi icance of inclusive, participatory, and rules-\nbased standards development processes. By embracing multiple stakeholders the U.S. can \npromote standards that improve national security and serve as catalysts for innovation and \nprogress on the international stage. \n \n5 For the purpose of this document the National Institute of Standards and Technology (NIST) de inition of \nSDO is used. SDOs include professional societies, industry and trade associations and membership \norganizations that develop standards within their area of expertise . \n\n \n7 \n Establish the United States as a Venue of Choice for Hosting \nStandards Meetings \nThe United States has long maintained a positive reputation as a reliable partner in \ninternational standards development. Global SDOs have planned their meeting cycles to \ninclude meetings in the U.S. However, in the past several years, organizers have held fewer \nstandards meetings in the U.S. Some SDOs have avoided meeting in the U.S. at the strategic \nurging of members, claiming logistical challenges, which put U.S. participants at a \ndisadvantage. Addressing the barriers to hosting standards meetings in the U.S. would \nencourage more SDOs to meet in the U.S. and buoy the community of U.S. participants. \n \nIn-person participation in standards meetings builds rapport among participants, allowing \nthem the opportunity to network and access invaluable hallway discussions. Participants \nphysically present at meetings can better represent their work, facilitating acceptance of \ntheir contributions. If achieving a leadership position in the SDO is a goal, in-person \nparticipation is critical. Members of the SDO are more likely to support a candidate they \nknow well. Including U.S.-hosted meetings in the cycle of meetings for developing critical \nand emerging technology (CET) standards reduces the cost of participation for U.S. \nparticipants, allowing greater opportunities for more U.S.-based professionals to attend \nmeetings in-person and gain critical standards experience. \n \nThe ease of travel for accessing U.S.-hosted SDO meetings has been challenging in recent \nyears. SDO meetings should take place somewhere with a wide availability of lights, as they \ndraw participants from all over the world. The U.S. has several international airports in \nvarious regions that can accommodate large SDO meetings, with transportation and \naccommodations in these cities to accommodate the various price points of SDO meeting \nattendees. These factors guide which U.S. cities are the most appropriate for hosting SDO \nmeetings. \n \nWhen hosting SDO meetings in the U.S., it is important to consider easily accessible \nfacilities. The facilities for international standards meetings need to be able to \naccommodate large groups of people and support remote/virtual participation. This \nrequires reliable internet access, power access for attendees, and access to break-out rooms \nfor smaller working groups within the SDO to meet. In addition, it is important to consider \nthe need for translation services and disability accommodations. \n \nWhile global SDOs seek to meet in diverse locations to spread the dif iculty and cost of \ntravel among active participants, more meetings in the U.S. would be bene icial. To bolster \nU.S.-hosted meetings, there needs to be a focus on ways to incentivize U.S. industry and \nother stakeholders to fund meetings and make standards attractive to those who can \ncontribute. \n\n \n8 \n  \nRecommendations to U.S. Government  \nTo support increased U.S. hosting of SDO meetings, the U.S. government should position \nstandards development activitiesand meetings in the U.S.as critical to national and \neconomic security. It should consider allocating appropriated and approved resources to \nsupport hosting meetings in the U.S.  \n \nIt is also essential for the U.S. government to establish and maintain a stable, predictable \nregulatory and policy environment that welcomes foreign participants in standards-related \nmeetings. This means that the U.S. government should identify visa challenges that may \nexist around standards meetings e.g., restrictions or lags relating to speci ic employers, \nindustry sectors, or technical backgrounds. Recognizing the importance of maintaining \nadjudicator independence in making visa decisions, the U.S. government must work to \nreduce excessive visa backlogs and provide additional guidance for standards meeting \nattendees to establish that standards meeting organizers know how to ensure successful \nvisa applications, as well as areas that trigger application denials. This guidance could help \nU.S. groups identify potential issues ahead of hosting. \n \nRecommendations to Private Sector Stakeholders  \nPrivate sector stakeholders can help facilitate U.S.-hosted standards meetings by offering \nthe use of their own facilities for SDO meetings or providing other in-kind support. Private \nsector stakeholders can also sponsor special events at SDO meetings, such as social tours, \nlunches, or breakfasts, in order to provide networking opportunities that industry, \nacademic, and individual participants might ind valuable to the furtherance of their work . \nStakeholders in the private sector, particularly local businesses, can often cost share with \nother businesses to provide funding for facilities. Additionally, private sector stakeholders \ncan directly support hosting standards meetings in the U.S. by providing funding support. \nMost SDOs offer sponsorships that allow private companies to donate money or resources \nto support SDO meetings. \n \nStandards developers should recognize and enhance collaboration and information \nexchange opportunities at SDO meetings. These opportunities could offer additional \nfunding mechanisms such as sponsorships and/or holding external workshops for \ninterested parties not engaged in committee work. Local universities may be interested in \npartnering with SDOs for meetings, providing additional facilities and resources in \nexchange for the opportunity to engage students in standards. \nEngage Early in Emerging Technology Standards-Related Activities \nEarly engagement in emerging technology standards development is critical to maintaining \nand, in some cases, reclaiming the U.S.s competitive edge and leadership in standards. \n\n \n9 \n Standards development is an integral part of the technology development life cycle, which \nmeans that to compete in a global market, U.S. companies need to not only engage in the \ndevelopment of new technologies, but also engage early with SDOs working to standardize \nthese technologies. To ensure that U.S. participation in standards development does not \ncome too late in the process, U.S. companies must closely monitor efforts in SDOs related to \nthe technologies they are developing and consider launching such efforts proactively. \n \nStandards Process  \nThe life cycle for standardizing CETs or speciic applications of CETs  begins with pre-\nstandardization activities that occur before standardization starts. These include research \nand development (R&D) activities that feed technical contributions to standards. Pre-\nstandardization guidance, such as National Institute of Standards and Technology (NIST) \nspecial publications, informs these technical contributions to SDOs. A pre-standardization \nfocus on research can drive early engagement in standards bodies. \n \nIt is important to not standardize too early in the development of a new technology. Doing \nso can limit innovation and create a drag on development and adoption. In fact, the \nstandards process can be weaponizedpurposely leveraged to slow down development.  \nStandards participants themselves must decide when the time is best to bring new \ntechnologies to SDOs to the beneit of a technologys interoperability, security, or adoption. \n \nStandardization priorities and needs are identi ied by industry, government, and academia \nin their participation in SDOs, resulting in a plan to engage one or more SDOs. This plan \ncould be to form a group to further explore the topic or to begin drafting standards \nimmediately. The processes for introducing new work items or study itemsand the \nspeciic phases for standards development will vary for each SDO and will determine \ntimelines, drafting, and standards publication. \n \nAs industry adoption of a particular standard is voluntary, standards will have varying \nlevels of use. The U.S. government encourages the adoption of private-sector standards \nthrough the National Technology Transfer and Advancement Act of 1995 (NTTAA)6. The \nNTTAA requires federal agencies and departments to use voluntary consensus standards in \nlieu of government-unique standards to the extent that they are practicable and consistent \nwith applicable laws. The NTTAA also states that federal agencies should consult with the \nprivate sector and voluntary consensus standards bodies and participate in developing \nstandards when it is in the public interest and aligns with missions, authorities, priorities, \nand budget resources. \n \n \n6 National Technology Transfer and Advancement Act of 1995 | NIST  \n\n \n10 \n Publishing and adopting a standard is not the end of the standards life cycle. A continually \nchanging technical landscape necessitates updating and occasionally retiring existing \nstandards. Part of ongoing research and development within standards organizations is \nreviewing existing standards to ensure they stand the test of time and updating them when \nneeded to coincide with changing technical requirements. This sometimes means \npublishing revisions to standards or writing new ones that supersede old ones. \n \nBeneits of Early Engagement  \nEarly engagement in the standardization of CETs can provide many bene its for the U.S. \ngovernment and industry. Being involved in early standardization efforts can give U.S. \ncompanies a competitive edge in emerging markets as well as advance U.S. leadership. Early \ntechnical standardization presents an opportunity for regulatory harmonization, in which \ninternational and various national regulating authorities develop shared guidelines and \ncompatible regulations. The bene it of this harmonization is that it can provide global \naccess to new technologies that are secure and effective. Early engagement also promotes \ncompetition in emerging technology development.7 Early standardization efforts also help \nto reduce trade barriers, furthering access to new technologies. \n \nFinding the right time for standardization is important. There are many examples of early \nstandardization that allow for the rapid proliferation of a technology (e.g., the Internet \nProtocol). While there are also examples of dead ends in standardization (e.g., early \nattempts to create incompatible stacks for wireless devices), those attempts usually sort \nthemselves out by not seeing widespread adoption and dont cause long-term harm (see \nAppendix A). Today, there are pre-standardization efforts to set the direction for important \ntechnologies such as 6G; waiting for these technologies to arrive before engaging would be \ndangerous for companies that wish to compete for market share and stakeholders that have \nrequirements for those technologies. \n \nPre-Standardization Activities  \nThere are a variety of pre-standardization activities that contribute to emerging technology \nstandards. De facto standardization often comes from early research in new technologies. \nThese early standards are commonly adopted by industry and their customers. Informal \nindustry speci ications are the earliest standards engagement for many technologies. For \nexample, the Ethereum community has adopted a series of standards that help maintain \ninteroperability across Ethereum implementations.8 Open-source software is another tool \nthat developers utilize to develop technically sound standards. Hackathons held at regular \nInternet Engineering Task Force (IETF) meetings bring together software and standards \n \n7 https://standardsboostbusiness.org/companies.aspx  \n8 Ethereum Development Standards | ethereum.org  \n\n \n11 \n developers, providing a mechanism for developing and testing implementations of network \nprotocols.9  \n \nPre-standardization also includes the research and strategic planning forums that partner \nwith SDOs for early standards engagements. The Internet Research Task Force (IRTF)10 \nfocuses on long-term research related to the Internet, promoting research that leads to \nstandardization efforts in IETF. For federally-funded research, the Networking and \nInformation Technology Research and Development (NITRD) Program11 is a formal \nprogram composed of 25 member agencies that invest billions of dollars in research and \ndevelopment programs for advanced information technologies in computing, networking, \nand software capabilities needed by the Federal Government and the Nation. \n \nRecommendations for Individual Participants  \nAt an individual level, the irst step to participating in the standardization of CETs is to be \ninvolved in related research and development activities. Generally, the individual would \nalready be part of the technical community and could begin considering which aspects of \nthe technology would bene it from standardization. They could take the time to understand \nthe technology and its place in the greater ecosystem to prepare for its transition to \nimplementation and standardization. They could engage in open-source communities that \ntypically drive the development of new critical and emerging technologies. \n \nAnother thing an individual can do is become involved in study groups and communities of \ninterest related to their technology. Such groups , especially those af iliated with SDOs, \nrepresent a irst step toward understanding the problems that an eventual standard must \naddress. They also serve to form a consensus on the direction that the technology and \nstandardization should takea valuable opportunity for thought leadership on the subject. \n \nRecommendations for Private Sector Stakeholders  \nThe private sector has a vital role in moving CETs toward standardization. They can apply \nresources beyond the ability of an individual and can set direction for the development of a \ntechnology that anticipates eventual work to create standards. One aspect of this \nrecommendation is to recognize standardization as part of the development of any \ntechnology. In this way, as the technology progresses through R&D, experts are considering \nwhich aspects should be standardized and what the appropriate SDO should be. Making \nstandardization part of the technology life cycle also helps ensure that once the research \nmatures, the transfer of the technology to an SDO will follow naturally. \n \n \n9 https://www.ietf.org/how/runningcode/hackathons//   \n10 Internet Research Task Force (irtf.org)  \n11 The Networking and Information Technology Research and Development (NITRD) Program - The \nNetworking and Information Technology Research and Development (NITRD) Program  \n\n \n12 \n Another thing that the private sector can do is ensure that security is considered from the \nearliest phases of development. Securing a technology often becomes more complex as \nfeatures become locked in; making security a priority while there is still lexibility allows \nthe technology to be used more safely and allows the eventual standards creators to make \nbetter choices. \n \nRecommendations for Academia  \nAcademia has an important role standardizing CETs as they, along with industry, perform \nthe fundamental research that underpins emerging technologies. One thing academia can \ndo is consider the technologies identi ied in the U SGNSSCET (and other consensus \ndocuments) as suggested priorities for research. This prioritization will help ensure that \nthe research underpins standardization in these essential technologies. Academia can also \nexpand course offerings and other programs related to CETs, building the pipeline of future \nparticipants in standards activities for these technologies. In some cases, creating \nspecialized certi ications in some technical areas could help focus attention on areas where \nexpertise is needed. \n \nFinally, academia can partner with industry and government to gain support for research \nand coordinate priorities. Programs such as NSAs National Centers of Academic Excellence \n(NCAE)12 offer support for research and curricula related to cybersecurity , beneitting \nacademic institutions that achieve certi ication to employ for a standards savvy-workforce. \nMaking knowledge of standards a part of this type of certiication is an important step \ntoward making standards a national priority. \n \nRecommendations for U.S. Government  \nWhile standards and industry research decisions are led by the private sector, the U.S. \ngovernment has important roles to perform. The U.S. government can express future \nrequirements that they identify, particularly in the area of national security, so that \nacademia and industry can consider them as they plot a course for research. The U.S. \ngovernment can also work to focus funding of private sector research on important \nproblems. The U.S. government could evaluate whether agreements such as Cooperative \nResearch and Development Agreements (CRADAs) and research grants have, or can be \nnegotiated to include suf icient license rights to transition research results to standards. \nPrograms such as NITRD can consider the need for standardization in their prioritization. \nAt a more general level, the U.S. government can encourage the adoption of emerging \ntechnologies in their programs. The U.S. government can deine use cases for emerging \ntechnologies early enough to promote timely adoption. \n \n12 National Centers of Academic Excellence (nsa.gov)  \n\n \n13 \n Develop a more Standards-Savvy U.S. Workforce \nThe U.S. government and industry must have a standards-savvy workforce to maintain \nstrong U.S. participation in international standards. Standards savviness is understanding \nhow to engage with SDOs as part of a broader industry in luence strategy. Within standards \nengagement, there are a variety of roles that are important for strengthening U.S. in luence. \nTechnical experts are needed to ensure that standards meet technical requirements and are \nsecure and effective. Experts in standards processes can engage in SDOs to ensure that \nrobust standards development processes are followed. Engagement teams and sponsors \nare necessary to research state-of-the-art and emerging global technologies, plan standards \nengagements, and allocate resources to standards meeting attendance. Individuals and \norganizations each play a vital role in creating a more standards-savvy workforce. \n \nRecommendations for Individual Participants  \nThe most immediate role of the individual in standards development is to be aware of \nrelevant SDOs and standards in designated subject areas. This means being familiar with \nSDO proceedings, such as the frequency of SDO meetings and the processes for standards \ndevelopment within speci ic SDOs. In addition, individuals can maintain awareness of \nparticular standards by monitoring, observing, and tracking standards drafts being \ndeveloped at any given time. Individuals only need to be aware of some standards in a given \ntechnical area. However, understanding trends in standards and standards related to your \nspeciic work can go a long way.  \n \nThe next level of involvement for an individual is understanding the activities and scope of \nrelevant SDOs in relation to their own organizations objectives. Organizations generally \nhave clear goals for product development and technical objectives that research and \ndevelopment teams are working towards. Individuals working on these teams should \ncoordinate their product and technical objectives with the standards objectives being \nworked on by their organization in relevant SDOs, and with policy and regulatory \nconsiderations. \n \nIndividuals who have built an awareness of SDO activities and objectives can further their \nstandards savviness by engaging directly in SDO activities. Engagement could mean \nparticipating directly in SDO meetings or engaging in SDO mailing list conversations. \nSomeone with technical expertise can contribute to standards development by commenting \non drafts or writing and editing draft standards. Many individuals seek external technical \nengagement opportunities, including technical presentations, research publications, and \ncollaborations, or participation in open-source development. Ultimately, individuals can \ntake on leadership roles within SDOs. Leadership within SDOs include a range of positions \nwith varying levels of authority and responsibility. Anything from taking on a lead-editor \n\n \n14 \n role to running for an elected administrative position within an SDO can increase an \nindividuals in luence in standards development.  \n \nRecommendations to Private Sector Stakeholders  \nIndustry leads U.S. engagement in standards organizations. Effective participation in \nstandards development requires leadership commitment and resources, both staff and \nbudget. Employers can provide internal training opportunities, including mentor programs \nfor new and junior employees. \n \nHaving a workforce involved in standards bene its the U.S. as a whole and the individual \norganization. Private sector stakeholders should develop policies that enable and \nencourage standards development as a part of their technology development. \nOrganizations should identify priority subject matter areas and relevant SDOs. Acting on \nthese priorities facilitates organizational presence in standards that beneits their projects \nand products. Mentoring younger or newer SDO participants can help guide new minds to \nstandards development, building an even stronger workforce for the future. Investing in \nmentoring requires endorsement from leadership. A standards-savvy workforce helps \nensure leaders are aware of standards. \n \nPrivate sector stakeholders set goals for technology development, and standards should be \nconsidered a part of the development life cycle. Internal objectives should account for \nstandards considerations, seeking opportunities to drive the development of related \nstandards. Organizational policy should encourage engagement with standards. \nParticipating in writing standards can directly increase economic competitiveness.  \nOrganizations can direct the impact of standards participation toward speci ic technical \ngoals by connecting internal objectives with the scope of relevant SDOs. \n \nManaging employee engagement in SDOs is essential at the organizational level by setting \nspeciic expectations for planning, reporting, and participation. Empowering employees to \nparticipate in standards can be more effective with consistent organizational support. \nOrganizations should budget resources for travel and the time spent engaging with SDOs. In \naddition, organizations should consider SDO sponsorships, or sponsoring events at SDO \nmeetings, such as lunches or socials. These investments can provide the organization with \ninluence in the SDO and create additional awareness of the organization with meeting \nattendees. Designating engagement team leads and executive sponsors within the \norganization increases participation and helps to focus participation where it has the most \nimpact. \n \nOrganizations can also support SDO leadership opportunities for their employees. SDO \nleadership can give an organization a competitive edge within the standards community \nand in the marketplace. It can also be seen as a workforce development objective. \n\n \n15 \n Leadership within an SDO can prepare employees for more senior leadership positions by \nproviding networking and recruitment opportunities. Practically, leadership in SDOs allow \nan organization's products and research to reach a broad audience of subject matter \nexperts. \n \nCompanies can increase their workforces standards-savviness by ensuring that standards \nand other external technical engagements are a visible, company-wide effort. Various \neducational opportunities exist to provide standards knowledge to the workforce (see \nEngage Academia below). In addition to these resources, employers can provide internal \ntraining for employees to help develop standards savviness within their organizations. \nSDOs also offer training and information for individuals to self-train. \n \nStandards engagement is only valuable to employees if it is worthwhile and pro itable to \nengage throughout their careers. Increased participation occurs at varying career stages, \nfrom early-career interns to experienced executives. The organization is responsible for \nensuring that employees who participate in standards are given the resources necessary to \nmaintain engagement while growing their careers. \n \nSupporting leadership and participation in SDOs is key to developing a standards-savvy \norganization. Organizations can ensure that their workforce is made up of well-informed, \nstandards-savvy employees by prioritizing standards and professional development in \nstandards development. Mentorship programs create a workforce that is both technically \nsavvy and engaged in standards at all levels. Standards mentorship programs or other \neducation and training opportunities for junior employees can bridge the gap between \nhigh-level executives and developers working directly on developing technical products. \n \nRecommendations for SDOs  \nSDOs play an essential role in developing a standards-savvy workforce. Most SDOs offer \norientation for new members at their meetings. This training could be offered as a form of \noutreach, at trade shows, or on a one-off basis to companies developing products in \ntechnologies relevant to the SDO. Attending an SDO meeting for the irst time can be \nintimidating, especially when participants try to jump aboard already underway projects. \nSome SDOs offer technical talks, presenting background on a given technology and its \nstandards. These talks can be impactful if provided to a broader audience, perhaps in a \nsession adjacent to the SDO meeting but open to interested parties who are not registered \nfor the meeting. \n \nRecommendations for the U.S. Government  \nIn addition to implementing the recommendations for private sector stakeholders, the U.S. \ngovernment is uniquely positioned to support industry and academia standards efforts. The \nU.S. government has the authority to allocate appropriated funding and grants to encourage \n\n \n16 \n research and development for speciic technologies . The USGNSSCET is an example of the \nU.S. government offering priorities and stating goals for inancial support.  \n \nRecommendations to Academia  \nThe USGNSSCET id entiies academia as a critical partner ne cessary to train the next \ngeneration of standards professionals. The strategy states that academia should renew a \ncommitment to teaching and highlighting the value, development, and use of standards and \nstandardization in a range of career ields. Academic institutions should  invest in students \nand educators who are interested in emerging and developing technologies and \nstandardization of these technologies. \n \nAcademic engagement in standards development makes students aware of the role of \nstandards in CETs. Engagement with industry and government through intern or summer \nhire programs can get students directly involved in standards development work. These \nengagements improve the students knowledge of standards and bring a new perspective to \nstandards developers. Partnering with research groups can improve the U.S.s \ncompetitiveness in developing new emerging technologies and standards to support them. \n \nEstablishing a student ambassador program can encourage and mentor new students to the \nstandards community. In this type of program, an upper-level student can be sponsored as \nan ambassador to a speci ic SDO. The student ambassador reports to the program \ncoordinator and, optionally, a faculty member at the students academic institution. The \nprogram funds the students membership and travel, allowing students to attend SDO \nmeetings and engage in the standards process irsthand. Mentors within the SDO guide the \nstudents throughout the entire process. \n \nAt the programs end, students have an opportunity to offer a seminar presenting their \nexperience and thoughts on standards. Additionally, the ambassador program could host an \nannual summit, allowing student ambassadors to meet each other and network with other \nstudents with standards experience, and other standards professionals in the workforce. \nThis type of direct engagement in standards provides irsthand experience and immersion \nwithin the standards process. \n \nColleges and universities can also host SDO meetings on their campuses. Academic \ncampuses often have the space and facilities necessary to host SDO meetings, are accessible, \nand offer the technical capabilities for virtual participation. Universities and colleges \nhosting SDO meetings increase the U.S. hosting capacity for international standards \ndevelopment bodies. Academic institutions can work with SDOs to allow students to \nparticipate in standards meetings for free during events held on their campuses. \nParticipation will enable students to engage in standards when the cost of attending \n\n \n17 \n meetings might otherwise deter participation. Other activities, such as hackathons, can be \nco-located to engage students in the technical work done by SDOs. \n \nHosting an SDO can spotlight an institutions research, highlighting advanced labs and \ntechnical work in emerging technologies. Because of the variety of participants attending \nSDO meetings, hosting a meeting can bring networks of possible partners to an academic \ninstitute. This exposure provides excellent networking opportunities for students, faculty, \nand researchers. \n \nEngage Academia to Grow the Next Generation of Standards Experts \nThe U.S. government and American National Standards Institute (ANSI) standards \nstrategies both support maintaining robust participation in standards and developing a \nwell-educated, technically advanced workforce in standards development. To ensure that \ntodays students become tomorrows standards experts, it is critical that the U.S. \ngovernment and industry build strong partnerships with academic institutions . The irst \nstep in getting young, emerging professionals and studentsour future standardization \nleadersinvolved in standards development activities is educating them about the \nimportance of standardization.13 Engaging academic institutions, particularly by exposing \nstudents to the work being done in SDOs, allows the standards community to center \nstandards engagement for the future workforce. \n \nUnfortunately, s ome colleges and universities do not see the bene its of standards \nengagement for students. Such institutions perceive standards development to have little or \nno impact on a students ability to ind a job after graduation. A lack of industry interest in \nstandards supports this position. If the companies that hire entry-level workers do not \nsupport standards engagement at every level, students will not see the bene it of standards \nexperience.   \n \nA lack of support within academic institutions and inadequate messaging from industry \nand government can hinder student engagement in standards. If colleges and universities \ndo not agree on the bene its of standards work for students, then they will not support \nstudents engaging in standards bodies. Without clear academic support, students are not \nlikely to engage in standards development. Therefore, academic engagement must include \nforming strong relationships with both students and institutions. Establishing outreach to \ncolleges, universities, and technical and trade schools should be a joint effort between the \ngovernment, industry, and SDOs. Government, industry, and academia need to develop \nmessaging to explain the standardization process and highlight the importance of \nstandards for CET engagement. \n \n \n13 Education & Standardization (ansi.org)  \n\n \n18 \n Recommendations to the U.S. Government  \nThe U.S. government must designate standards as a priority for national and economic \nsecurity for the United States. The U.S. Government National Standards Strategy addresses \nstrategies to raise awareness and increase participation in SDOs. The strategy discusses \npromoting engagement between academic institutions, private sector stakeholders, and the \nU.S. government. \n \nThe U.S. government can leverage relationships with academic institutions to engage \nstudents in standards development activities. Cooperative Research and Development \nAgreements (CRADAs) between Federal labs and academic institutes can be leveraged for \nstandards development activities and research. NSAs NCAE program designates lead \nacademic institutions in cyber defense, research, and operations. Schools that obtain one of \nthese designations can compete for DoD grants. This type of relationship with schools can \nbe used to develop standards engagement efforts. \n \nRecommendations to Private-Sector Stakeholders  \nPrivate-sector stakeholders can encourage academic engagement in standards \ndevelopment to make students aware of the role of standards in CETs. Private sector \nstakeholders can contribute to student outreach by speaking at meetings where academics \nin STEM ields gather . U.S. government and industry can work with these organizations to \ncreate talking points extolling the bene its of working in standards for individual students, \nfaculty, institutions, and the development of technologies. \n \nRecommendations to Standards Organizations  \nSome SDOs offer education and training opportunities for students and the workforce, \nincluding ANSIs Standards Education and Training program. SDOs and organizations \ninvolved in standards work put a lot of effort into planning how to train individuals to work \nwithin their frameworks. NIST14 offers standards training for U.S. government agencies to \nunderstand standards development processes and be prepared to participate effectively. \nThe Society for Standards Professionals15 offers certi ication recognizing experts in the ield \nof standards who have demonstrated a high degree of professional competence in different \nareas of standards, consensus standard development, and standards developing \norganization management. Programs like these can be used as a template for creating \nengagement and training plans for academic engagements. \n \nEngagement plans should include details on which institutes or organizations to engage, \nhow to communicate with these groups, and speci ic strategies for encouraging standards \ndevelopment engagement. In addition, it is important to identify resources, including \n \n14 Standards educa on | NIST  \n15 SES - The Society for Standardiza on Professionals (ses -standards.org)  \n\n \n19 \n funding for academic engagement in standards forums. One factor for low academic \nparticipation in standards is funding, so it is important to plan to leverage grants and \nexisting funding from the industry to increase academic engagement. Many SDOs also allow \nstudents to have special memberships at a lower cost, an important consideration when \nidentifying engagement opportunities during the planning phase. Publications can be a \nvaluable tool for explaining the importance of standards to students. Posters and brochures \nexplaining the importance of standards can be provided to academic institutions to aid in \nraising awareness and recruiting students who are interested in technical ields. Publishing \nstudents work that comes from engagement with academia can also be an incentive for \nstudents to engage in standards. If their work in standards forums is published and \nhighlighted by the organizations they are partnering with, academic institutions may begin \nto see the bene it of these relationships. In addition, some SDOs support student -led \npublications, such as technical magazines, that showcase student research and standards \nengagement. \n \nConclusion \nAs technology continues to develop at an increasingly rapid pace, standards have become \never more critical to both U.S. national security and economic prosperity. Strengthening U.S. \nparticipation in standards is critical to protecting the security of the American people, \nexpanding economic opportunity, and defending democratic values. Critical and emerging \ntechnologies are especially important to the U.S. position in standards. The U.S. government \nand industry must be aware of the threat landscape associated with an increasing level of \npoliticization of standards and related standards processes. \n \nStandards development in this technical landscape is a complex, transnational issue that \nrequires strong leadership to promote democratic values globally. These recommendations \nposition the U.S. to provide this kind of leadership. Promoting democratic values in \nstandards is a global effort; these recommendations should be used by the U.S. and like-\nminded democratic nations to promote open, transparent standards to secure future \ntechnologies. A strong academic standards curriculum, a well-educated, standards-savvy \nworkforce, and an improved landscape for domestically hosted standards meetings can \nhelp to build the positions of the U.S. and like-minded nations in international standards \ndevelopment bodies. \n \nThe U.S. government and private-sector stakeholders must ensure that robust standards \nparticipation is maintained long term. Investment in human resources and funding requires \ncommitment from the U.S. government, industry, and standards organizations to ensure \nthat the U.S. and like-minded nations maintain leadership in standards development and \nthat democratic values are preserved within global standards development organizations. \nStandards are a collaborative effort, and it is necessary for the U.S. government, industry, \n\n \n20 \n academia, and all individuals who support secure, democratic standards to work together \nto progress standards for the technologies of the future. \n \n \n \n  \n\n \n21 \n Appendix A: Timing Considerations in Standardization \nInternet Protocol  \nA classic example of the bene its of early engagement in standards is the Internet Protocol \n(IP). Developed in the 1970s as part of ARPANET, the U.S. Department of Defenses \ncomputer networking project, IP became standardized in September 1981 and has since \nbecome the basis of digital communications worldwide. \n \nThe early engagement of the ARPANET researchers and other technical experts in \nstandardizing the fourth version of the protocolc odiied in RFC 79116, Internet Protocol, \nand now known as IPv4was arguably a key to its widespread deployment. Indeed, a \ndecision to wait until a better protocol was available may well have slowed the growth of \nthe Internet as local experiments continued rather than a rapid convergence on an \ninteroperable speci ication. \n \nOne of the outcomes of the proliferation of IPv4 was that its limited address sizeonly 32 \nbits, enough for around 4 billion devicesbecame the standard too, eventually leading to \nthe exhaustion of the address space. Vint Cerf, who led the team that developed the \nprotocol, is quoted17 as saying although a 128-bit address space (the same as todays \nalternative, IPv6) would have been better, it wouldn't have seemed realistic back then, \nparticularly given the limited computer power of the day. He decided on a 32-bit address, \ntrading between a successful ex periment and inde inite enhancements.  \n \nThe ATIS NEXT G Alliance  \nA new generation of mobile wireless communications is developed on approximately a 10-\nyear cycle. Early engagement in the next iteration of this cycle, starting with the \ndevelopment of the International Telecommunication Union (ITU) 6G Vision and Draft \nFramework, can maximize the bene its of standards engagement and align with what North \nAmerica envisions for the future network. The Alliance for Telecommunications Industry \nSolutions (ATIS) launched the Next G Alliance18 as an initiative to advance North American \nwireless technology leadership through private-sector-led efforts, with deliberate, \ncollaborative steps and an aligned commitment between government, industry, and \nacademia to ensure that the United States maintains a competitive technology position in \n5G networks today and 6G networks in the future before they are standardized. \n \n \n16 Postel, J., \"Internet Protocol\", STD 5, RFC 791, DOI 10.17487/RFC0791, September 1981, rfc791 (rfc-\neditor.org)  \n17 Noyes, K., Vint Cerf's dream do-over: 2 ways he'd make the internet different, InfoWorld, September 23, \n2016, https://www.infoworld.com/article/3123539/vint-cerfs-dream-do-over-2-ways-hed-make-the-\ninternet-different.html  \n18 Next G Alliance  \n\n \n22 \n While 5G and 5G Advanced networks are still being standardized, the ATIS Next G Alliance \ndeveloped a Roadmap to 6G, which presents a 6G vision for North America and is working \nto establish national priorities that will in luence government -applied research funding and \npromote incentivized government actions for 6G and beyond, giving the United States a \nsolid footing in future technologies before they are standardized. This kind of early \nengagement shows that pre-standardization efforts can facilitate alignment and are an \nimportant aspect of developing new technologies. \n \nEngaging Too Early  \nThough early standards engagement is important, there are some risks in engaging too \nearly. If standardization efforts begin before the market is ready, technical standards may \nnot be effective. This can result in standards that are not adopted, or if they are adopted, do \nnot have enough investment to keep them up to date and secure. Rohit  Khare published a \nnote19 in 2000 arguing that standardization of new wireless web protocols in the form of \nWAP, which were incompatible with their established wired counterparts, would ultimately \nprove counterproductive. The W* effect, as Khare characterized the WAP standards, was \npredicated on the assumption that handheld wireless devices intrinsically require \noptimized transport, applications, and content due to unavoidable technology limitations.   \n \nAs anticipated by Khare, in the long term, wireless devices were able to support the same \nweb protocols as the wired Internet and this support was instrumental in creating the \nmodern smartphone experience. The WAP standards, which had been widely supported by \nthe wireless industry, were a dead-end. The mobile web differs from the non-mobile web \ntoday, of course, but the differences are mostly a matter of device capabilities and user \ninterfaces rather than separate protocol stacks. When it may be too soon to standardize a \nnew technology, there are still ways to engage with SDOs in pre-standardization. Many \nSDOs form study groups for emerging technologies dedicated to the research and \ndevelopment of early prototypes and security features.  \n \n19 Khare, Rohit, and 4K Associates. \"W* effect considered harmful.\" Mobile Networking with WAP: The \nUltimate Guide to the Ef icient Use of Wireless Application Protocol (2000): 361 -391, \nhttps://link.springer.com/chapter/10.1007/978-3-322-86790-2_27  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "esf_isg_paper",
  "source": "nsa",
  "id": "f92d253a38b45ac185756fb22a6fd883539a87e1791aa3382c7f73af3dde416b"
}