{
  "markdown": "This document is marked TLP:CLEAR. Recipients may share this information without restriction. Information is subject to stand ard \ncopyright rules. For more information on the Tr affic Light Protocol, see  https://www.cisa.gov/tlp .\nAs of March 2024  TLP:CLEAR  \ncisa.gov  \n central@cisa.dhs.gov  \n @cisagov  @CISAgov  @CISACyber  \nPRC STATE -SPONSORED CYBER \nACTIVITY: ACTIONS FOR CRITICAL \nINFRASTRUCTURE LEADERS  \nTLP:CLEAR  \nSUMMARY  \nThis fact sheet provides an overview for executive leaders on the urgent risk posed by Peoples Republic of China (PRC) \nstate -sponsored cyber actors known as Volt Typhoon. CISA along with the National Security Agency (NSA), the Federal \nBureau of Investig ation (FBI), and other U.S. government and international partners1released a major advisory  on Feb . \n7, 2024, in which the U.S. authoring agencies warn ed cybersecurity defenders that Volt Typhoon has been pre -positioning \nthemselves on U.S. critical infrastructure organizations networks  to enable disruption or destruction of critical services  in \nthe event of increased geopolitical tensions and/or military conflict with the United States and its allies.  This is a critical \nbusiness risk for every organization in the United States and allied countries.2  \nThe advisory provides detailed information related to the groups activity and describes how the group has successfully \ncompromised  U.S. organizations, especially in the Communications, Energy, Transportation Systems, and Water and \nWastewater Systems Sectors.3 The authoring organizations urge critical infrastructure owners and operators to review the \nadvisory for defensive actions ag ainst this threat and its potential impacts to national security.  \nCISA and partners4 are releasing this fact sheet to provide leaders of critical infrastructure entities  with guidance to help \nprioritize the protection of critical infrastructure and funct ions. The authoring agencies urge leaders to recognize cyber \nrisk as a core business risk . This recognition is both  necessary for good governance and fundamental to national security.  \n1 U.S. Department of Energy (DOE), U.S. Environmental Protection Agency (EPA), U.S. Transportation Security Administration (TSA ), Australian \nSignals Directorates (ASDs) Australian Cyber Security Centre (ACSC),  Canadian Communications Security Establishments (CSEs) Canadian \nCentre for Cyber Security (CCCS), United Kingdom National Cyber Security Centre (NCSC -UK), and New Zealand National Cyber Security \nCentre (NCSC -NZ) \n2 CCCS assesses that Canada would likely be affected as well, due to cross -border integration. ASDs ACSC and NCSC -NZ assess Australian \nand New Zealand critical infrastructure, respectively, could be vulnerable to similar activity from PRC state -sponsored actors.  \n3 See Critical Infrastructure Sectors | CISA  for descriptions of critical infrastructure sectors.  \n4 NSA, FBI, DOE, EPA, TSA , U.S. D epartment of the Treasury, ASDs ACSC, CCCS, NCSC -UK, and NCSC -NZ \n\n\n \n Commercial Routing Assistance  Place Title Here  \nPRC State -Sponsored Cyber Activity: Actions for Critical Infrastructure \nLeaders  TLP:CLEAR  \n@CISAgov  @CISACyber  As of March 2024  TLP:CLEAR  \ncisa.gov  \n central@cisa.dhs.gov  \n @cisagov  ACTIONS FOR LEADERS  \nMake Informed and Proactive Resourcing Decisions  \nEmpower cybersecurity teams to make informed resourcing decisions to better detect and defend against Volt Typhoon \nand other malicious cyber activity. As a first step, organizations should use intelligence -informed prioritization tools, such \nas the Cybersecurity Performance Goals  (CPGs)  or derived guidance from an SRMA . The CPGs help leaders make strategic \ninvestments in a limited num ber of essential actions with high -impact security outcomes. Second, empower and resource  \ncybersecurity teams so they can:  \n Effectively apply detection and hardening best \npractices  contained in Identi fying and Mitigating \nLiving off the Land Techniques  and PRC State -\nSponsored Actors Compromise and Maintain \nPersistent Access to U.S. Criti cal Infrastructure . Volt \nTyphoon does  not rely on malware to maintain \naccess to networks and conduct their activity. \nRather, they use built -in functions of a system . This \ntechnique, known as living off the land, enables  \nthem to easily evade detection . To protect against \nliving off the land , organizations need a  \ncomprehensive and multifaceted approach, as describ ed in t hese joint products.   \n Receive continuous cybersecurity training and skill development  that is relevant to the threat environment. \nContinuous training ensures that staff have the capabilities needed to defend their unique environments  and \nmaintain good cyber hygiene . \n Develop  comprehensive information security plans and conduct regular table top exercises . \no Leaders should ensure personnel from all business sections, including executive leadership, are \ninvolved in development of the plan, sign off on it, and are aware of their roles and responsibilities. \nEnsuring comprehensive and tested plans a re in place and approved enables cybersecurity teams to \nmake appropriate risk -informed decisions.  \no Refresh and test plans on an appropriate basis, and test OT systems and manual mode.  \nFor smaller organizations without their own in -house cybersecurity teams,  leaders should obtain managed security \nservices that can carry out this guidance to maintain sufficient cybersecurity posture.  \nSecure Your Supply Chain  \nEnsure effective risk management policies are in place to minimize the likelihood of damage resulting f rom a \ncompromise.  \n Establish strong vendor risk management  processes to evaluate and monitor third -party risks, ensuring that \nsuppliers and partners adhere to strict security standards and any foreign ownership, control, or influence (FOCI) \nare clearly iden tified and managed, including consideration of, for example, the U.S. Department of Commerce \nEntities List and Unverified List.  \n Ensure those responsible for procurement:  \no Exercise due diligence  when selecting software, devices, cloud service providers (CSP s), and managed \nservice providers (MSPs).  \n Use guidance including the secure by design principles  to help inform vendor selection  to \nreduce the availability of attack pathways threat actors can leverage. Follow best practices for \nsupply chain risk management and only source from reputable vendors.  \n Ensure that the vendor has a patching plan  in place th at supports your organization and that \nyou can also support.  Key best practices for your cybersecurity teams \nincludes ensuring logging, including for access and \nsecurity, is turned on for app lications and systems \nand logs are stored in a central system . Robust \nlogging is necessary for detecting and mitigating \nliving off the land. Ask your IT teams which logs \nthey maintain as certain logs reveal commands \n(referenced in the CSA) used by Volt Typhoon \nactors. If your IT teams do not have the relevant \nlogs, ask which resources they may need to \neffectively detect compromise.  \n\n \n Commercial Routing Assistance  Place Title Here  \nPRC State -Sponsored Cyber Activity: Actions for Critical Infrastructure \nLeaders  TLP:CLEAR  \n@CISAgov  @CISACyber  As of March 2024  TLP:CLEAR  \ncisa.gov  \n central@cisa.dhs.gov  \n @cisagov  o Identify and limit usage of any products  that break the principle of least privilege, do not clearly \nenumerate needed access, or require disabling antivirus tools.  \no Select vendors  that enable inte roperability as a best practice for resilience and to avoid vendor lock -in. \nAs a leader, advocate for vendors to deliver secure and resilient systems and support staff efforts to integrate Secure by \nDesign principles into procurement/vendor contracting pro cesses, including mechanisms for ensuring compliance and \npatching.  Additionally, direct software development teams to integrate the Secure Software Development Framework \n(SSDF) throughout your existing practices. Visit our webpage  for more on Secure by Design . \nDrive a Cybersecurity Culture  \nEnsure performance management outcomes are aligned to the cyber goals  of the organization by:  \n Encouraging collaboration between IT, OT, cloud, cybersecurity, supply chain, and business units  to align security \nmeasures with business objectives and risk management strategies.  \n Championing organizational cybersecurity risk assessments and audits  to identify vulnerabilities and gaps in the \nsecurity posture.  \n Engaging with external cybersecurity experts and advisors for independent assessments  and guidance tailored to \nyour organization and performing GAP analysis on findings.  \n Increasing awareness of social engineering tactics  and facilitating a culture which encourages incident \nreporting.5 \nINCIDENT RESPONSE  \nIf your organization is impacted by an incident or suspected incident:  \n Implement your cyber incident response plan. See the joint cybersecurity advisory by CISA and the cybersecurity \nauthor ities of Australia, Canada, New Zealand, and the United Kingdom on Technical Approaches to Uncovering \nand Remediating Malicious Activity  for incident response best practices.  \n Review and update your cyber incident response plans on a regular basis.  \n Report incidents or anomalous activity immediately to an authoring agency (see the Contact Information section).  \n Consider entering into a proact ive retainer agreement with a reputable  third -party cybersecurity organization to \nprovide subject matter expertise and incident response services.  \nCONTACT INFORMATION  \nU.S. Organizations  \n CISAs 24/7 Operations Center at  Report@cisa.gov  or (888) 282 -0870 or your  local FBI field office . When \navailable, pleas e include the following information regarding the incident: date, time, and location of the incident; \ntype of activity; number of people affected; type of equipment used for the activity; the name of the submitting \ncompany or organization; and a designated  point of contact.  CISA provides timely situational awareness and \nenables coordination with Sector Risk Management Agencie s such as EPA, TSA, and Treasury.  \n For NSA client requirements or general cybersecurity inquiries,  contact  Cybersecurity_Requests@nsa.gov . \n Entities subject to regulatory requirements should follow established reporting requirements, as appropriate.  \nAustralian Organizations  \nVisit cyber.gov.au  or call 1300 292 371 (1300 CYBER 1) to report cybers ecurity incidents and access alerts and \nadvisories.  \n \n5 Avoiding Social Engineering and Phishing Attacks | CISA ; Social engineering  ITSAP.00.166 - Canadian Centre for Cyber Security ; \nhttps://www.cyber.gc.ca/ en/guidance/how -protect -your-organization -insider -threats -itsap10003 -0 \n\nCommercial Routing Assistance  Place Title Here\nPRC State -Sponsored Cyber Activity: Actions for Critical Infrastructure \nLeaders  TLP:CLEAR  \n@CISAgov  @CISACyber  As of March 2024  TLP:CLEAR  \ncisa.gov  \n central@cisa.dhs.gov  \n @cisagov  Canadian Organizations  \nReport incidents by emailing CCCS at  contact@cyber.gc.ca . \nNew Zealand Organizations  \nReport cyber security incidents to  incidents@ncsc.govt.nz  or call 04 498 7654.  \nUnited Kingdom Organizations  \nReport a significant cyber security incident:  ncsc.gov.uk/report -an-incident  (monitored 24 hours) or, for urgent assistance , \ncall 03000 200 973.  \nRESOURCES  \nRefer  to CISAs Logging Made Easy  page for free centralized log management solutions.\nRefer to CISAs Cyber Essentials  for additional recommendations on managing cybersecurity risks.\nSee CCCSs Cyber Hygiene publication  for best practices for your organization.\nSee Questions Every CEO Should Ask About Cyber Risks  for additional best practices to help companies\nunderstand their risks and prepare for cyber threats.\nSee CISA Director Jen Easterlys opening statement on Volt Typhoon  before the House Select Committee on\nStrategic Competition Between the United States and the Chinese  Communist Party.\nSee CISAs Recommended Cybersecurity Best Practices for Industrial Control Systems  for more guidance specific\nto organizations supporting U.S. critical infrastructure.\nSee CISAs Cyber Resilience Review webpage  for more information on CISAs no -cost, non -technical assessment\nto help organizations evaluate their operational resilience and cybersecurity practices.\nSee CISAs Fact Sheet Rising Ransomware Threats to Operational Technology Assets  for more information on\nreducing the vulnerability to severe business degradation if affected by malic ious cyber activity. Although tailored\nto ransomware, the Fact Sheet has applicable guidance for other cyber threats.\nSee EPA Cybersecurity for the Water Sector | US EPA  for free cybersecurity assessments, training, funding and\nadditional resources tailored to support drinking water and wastewater entities.\nACKNOWLEDGEMENTS \nCisco Talos, NTT Corporation, Google, Mandiant, and Sophos contributed to this fact sheet. \nDISCLAIMER \nThe information in this report is being provid ed as is for informat ional purpos es only. The authoring agencies do not \nendorse any commercial entity, product, company, or servic e, including any entities, products, or servic es linked within \nthis document. Any reference to specific commercial entities, products, processes, or servic es by service mark, \ntrademark, manufacturer, or otherwis e, does not constitute or imply endorsement, recommendat ion, or favoring by the \nauthoring agencies. \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "fact-sheet-for-leaders-prc-state-sponsored-cyber-activity",
  "source": "nsa",
  "id": "504f33e997679a2cd35bd9ba7fe6417560ae644326782f7aad4030f0204b5c6e"
}