{
  "markdown": " \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  1 \nNATIONAL SECURITY AGENCY\n  \nCYBERSECURITY REPORT\n  \nHARDENING SIEM SOLUT IONS  \n \nA TECHNICAL REPORT FROM \nNETWORK INFRAS TRUCTURE \nSECURITY  \nDate of Report    29 October 2019  \n\n \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  \n2 \nNSA CYBERSECURITY  REPORT\n  \nDOCUMENT CHANGE HISTORY  \nDATE  VERSION  DESCRIPTION  \n10/08/19  1.0  \n   \n   \n   \n   \nDISCLAIMER OF WARRANTIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided as is and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufac turer, or \notherwise, does not necessarily constitute or imply its endorsement, recommendation, or favoring by the United States \nGovernment. The views and opinions of authors expressed herein do not necessarily state or reflect those of the \nUnited States Go vernment, and shall not be used for advertising o r product endorsement purposes.  \nADDITIONAL DISCLAIMER  \nFor more specific or step -by-step instructions on how to implement these security methods, please seek documentation \nor consultation with the SIEM provider. Not all security measures may be relevant or available for certain vendors. \nWhen purchasing a SIEM solution, keep security features in mind. The recommendations included in this paper are not \nan exhaustive list.  \nCONTACT INFORMATION  \nFor general cy bersecurity inquiries and reporting, contact the NSA Cybersecurity Requirements Center, 410 -854-4200, \nCybersecurity_Requests@nsa.gov .  \n \nFor media inquiries, contact Press Desk: 443 -634-0721 Email: MediaRelations@nsa.gov  \n  \n\n \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  \n3 \nNSA CYBERSECURITY  REPORT\n  \nContents  \nHardening SIEM Solutions  ................................ ................................ ................................ ................................ ................................ ........ 1 \nWhat are SIEM so lutions?  ................................ ................................ ................................ ................................ ................................ .... 4 \nRisk ................................ ................................ ................................ ................................ ................................ ................................ ................  4 \nSecuring the SIEM  ................................ ................................ ................................ ................................ ................................ ...................  4 \nSecure the Physical Hardware  ................................ ................................ ................................ ................................ .......................  4 \nSecure the Operating System  ................................ ................................ ................................ ................................ ........................  4 \nSecure  the Downloaded Package and Installation  ................................ ................................ ................................ ................  5 \nSecure the Instance  ................................ ................................ ................................ ................................ ................................ ............  5 \nProtecting Data at Rest  ................................ ................................ ................................ ................................ ................................ ..... 7 \nAuditing and Compliance  ................................ ................................ ................................ ................................ ................................ ...... 7 \nConclusion  ................................ ................................ ................................ ................................ ................................ ................................ .. 8 \nReferences  ................................ ................................ ................................ ................................ ................................ ................................ . 8 \n \n\n \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  \n4 \nNSA CYBERSECURITY  REPORT\n  \nWHAT ARE SIEM SOLUTI ONS?  \nSecurity Information and Event Management (SIEM) solutions make investigating large amounts of data easier and faster \nfor administrators. SIEM solutions collect logs and traffic from across the enterprise and format the data to allow for \nefficient searching and correlation. Additionally, SIEMs can provide alerting, basic incident response (IR), dashboards, \nand reporting, and integrations for  data enrichment. Without a SIEM solution, analysts would have to log in  to multiple \ndevices to manually search and correlate hundreds of logs and events. But SIEM solutions oversee an organizations \nmost critical network and host data, and a compromised S IEM allows a threat actor to monitor defenders in order to stay \nin. As a critical nerve -center of the network, a SIEM must be properly secured.  \nRISK  \nAlthough SIEMs are great for log aggregation and correlation, threat detection, and incident response, they  can also pose \na security risk if not properly hardened. A 2018 report from Carbon Black reported that 72% of IR professionals saw log \ndestruction such as deletion of antivirus and security logs during attacks [1]. While a SIEM can help mitigate log \ndestru ction by exporting logs from their original lo cations, if poorly secured it can be an attractive target for an attacker \nlooking to delete critical logs to cover their tracks.  \nIf an attacker gains access to an organizations SIEM solution or collects unenc rypted traffic from it, then the \norganizations critical network information is exposed. This critical network information can be IP addresses and domain \nnames of critical assets, usernames, operating systems (OS), services running, etc. Many SIEMs integra te with \nvulnerability scanners to import and correlate device vulnerability data with event data. The attacker will know what \nattacks are most likely to work because the SIEM has told them what assets the organization has , the location of each \nasset , and w hat vulnerabilities it may have . Additionally, they may cover their tracks by deleting certain logs or events. \nThey will also be privy to any actions in the SIEM indicative of incident response actions such as evictions, allowing them \nto take evasive actio n. Advanced attackers are very difficult to prevent, detect, and evict. Each security measure taken \ncan be circumvented in one way or another, therefore, one security measure is not enough to protect against an attacker. \nSecuring an organizations SI EM so lution is important to protect the organization and its assets.  \nSECURING THE SIEM  \nAn attacker may try to gain physical or remote access to an organizations SIEM solution. Possible goals include stealing \ninformation about the organization to plan an attac k and preventing administrators from detecting the attack. SIEM \nadministrators must take security measures to protect the SIEM hardware, software, and data from any angle of attack.  \nSecure the Physical Hardware  \nIf an attacker gains access to an organizati ons SIEM appliance, they may be able to connect removable media such as a \nUSB device to exfiltrate data or install malware such as a keystroke logger. While unlikely, they may even try to destroy \nevidence by physically stealing, or damaging the hardware, thus preventing security personnel from using the SIEM to \nsee the attackers actions. Ensure the hardware is in a locked server rack in a locked room. Limit room and rack access to \nonly authorized personnel.  \nSecure the Operating System  \nVulnerabilities in t he OS running a SIEM product could provide attackers a way into the SIEM. Ensure the host -based \nfirewall is on and blocking unnecessary ports. Limit Internet access into the SIEM appliance. If 3rd party integration (such \nas cloud reputation lookup or other  services) is required, then closely constrain connections from the SIEM to known \nservices. Remove unnecessary programs and turn off unnecessary services. Utilize patch management to ensure the OS \nand software are getting regular security updates. Run anti -malware software on the OS. Enforce applicable OS security \npolicies. Furthermore, ensure accounts on the OS are secure (see password account suggestions in the Secure the \nInstance  section). Take a baseline of the OS to identify unauthorized changes and ma intain a configuration back up.1 \n                                                \n1 These suggestions above are not an exhaustive list. Consult the Center for Internet Security (CIS) Benchmarks at https://learn.cisecurity.org/benchmarks  for more specific \nand thorough operating syste m configuration guidance.  \n \n\n \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  \n5 \nNSA CYBERSECURITY  REPORT\n  \nSecure the Downloaded Package and Installation  \nWhen downloading SIEM software from the Internet, ensure that the software has not been tampered. One way to check \nthe integrity of the package is to see if the package is digi tally signed and verify the signature is valid. Another way is to \ncompare the hash value of the download to the hash value from the vendor using a secure algorithm such as SHA -512. If \nthe SIEM utilizes third party packages, the packages should be signed by  the third party and the SIEM solution should \nverify the authenticity of the signatures.  \nInstall the software in a directory that is protected. For example, the Windows Program Files directory is protected by \nfile/folder permissions and User Account Contr ol (UAC).  \nConfigure the enterprise Network Access Controls (NAC) to only allow policy -compliant workstations to connect to the \nSIEM. NACs implement control policies and user access controls to protect the network.  \nSecure the Instance  \nThe SIEM solution its elf may contain vulnerabilities either in the software or in the way it was configured. This includes \nauthentication settings, software and its features, and connections and communications.  \nAuthentication  \nUtilize multi -factor authentication (MFA). MFA prov ides extra security by adding protection in layers. NSA generally \nrecommends utilizing the combination of token -based and knowledge -based authentication (e.g. PKI smart card and \nPIN).2 A SIEM is a critical and relatively easy location to implement MFA, sin ce relatively few users have access to SIEMs \n(compared to the general population). Always change default passwords or remove these accounts entirely. Attempting to \nlog in with default credentials is one of the first things an attacker will try. Enforce pol icies to ensure multi -factor \nauthentication is mandatory for all accounts. Avoid shared accounts wherever possible. When one account is used by \nmultiple people, it makes it difficult to hold people accountable for configuration changes. Additionally, share d accounts \nare more likely to be compromised. If passwords alone must be used then enforce strict requirements on length, \ncomplexity, reuse, expiration, and lockout.  \nPractice the principle of least privilege. Restrict access rights to the minimum accesses the user or account needs to do \nthe job. Implement access controls to restrict user access to sensitive data and critical administrative functions. Most \nSIEMs offer a variety of account roles that allow for customizing those accounts at a granular level. I n larger \norganizations, most analysts looking at logs only need read access to data and perhaps to take certain actions. Even for \nsmall jack -of-all-trades teams, separate accounts can be used for administering the features of the SIEM.  \nMany SIEM solutio ns integrate with external directories such as Lightweight Directory Access Protocol (LDAP). When \nusing LDAP, configure LDAP over TLS (LDAPS), which encrypts LDAP communications. Many SIEM solutions support \nSingle -Sign-On (SSO) with Kerberos or New Technol ogy LAN Manager ( NTLM ) and Active Directory. One downside of \nusing this SSO approach is the risk of hashed passwords or Kerberos tickets being stolen and replayed in pass -the-hash \nor pass -the-ticket attacks.  \nRun software on an unprivileged service acc ount instead of a root or administrator account, if possible. Secure service \naccounts by locking down settings. Service accounts are more powerful than user accounts and therefore should be used \nby as few processes as possible. For more guidance with servi ce accounts, see Securing Windows Service Accounts \npublished by the SANS Institute [2].  \nSoftware and Configurations  \nTo ensure the SIEM software is secure, immediately update the software (including both the SIEM and the OS and \napplications on it) wheneve r security updates are available. Check the vendors website regularly for vulnerability \nannouncements such as the release of new Common Vulnerabilities and Exposures (CVE) or sign up for vulnerability \nannouncement newsletters or data feeds. The CVE list b y MITRE provides an email newsletter and social media data  \n                                                \n2 For more information, please refer to Transition to Multi -Factor Authentication an NSA C ybersecurity Top 10 Mitigation.  \n\n \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  \n6 \nNSA CYBERSECURITY  REPORT\n  \n \nfeeds for vulnerability announcements [3]. The National Vulnerability Database by National Institute of Standards and \nTechnology (NIST) provides many data feed options to receive vulnerability ann ouncements including Rich Site Summary \n(RSS), JavaScript Object Notation ( JSON ), and Extensible Markup Language ( XML) [4]. \nDisable unnecessary features or components as these could pose security risks. Check with the SIEM vendor to see if \nsecurity add -ons are available.  \nAn attacker may try to change the configurations on the SIEM solution to evade detection. Ensure change management is \nin place to identify unauthorized changes. Ways to accomplish this include: using a configuration management tool to \nprovide version contr ol, integrating SIEM configuration changes into an existing change management framework, or \nconfiguring the SIEM to monitor its own configuration files (if possible). Ensure high -risk changes trigger alerts which are \nsent to authorized administrators using  a channel like email or phone call.  \nConnections and Communications  \nAn attacker may try to intercept traffic not only for authentication information but also for information about the \norganizations network and assets. Such information can be used to specu late what vulnerabilities an organization might \nhave. Using this information, an attacker can choose an exploit that is likely to succeed. Several \ncommunication s/connections to protect include:  \n Users and administrators accessing the SIEM web interface over  the internet  \n Administrators accessing the SIEM host remotely  \n Logs and events getting forwarded over the network to the SIEM solution  \n Integrations with third party services  \nBrowsers.  When connecting to the web interface over the internal network, use the l atest version of a supported internet \nbrowser. Block JavaScript and Flash, if possible. If JavaScript or Flash is necessary, use the latest version.  \nEncryption and Certificates.  Use TLS encryption to protect authentication and log traffic. Access the sit e using HTTPS, \nwhich requires the SIEM web interface to be configured with TLS. Ensure that TLS 1.2 or better is used to prevent \nvulnerabilities associated with weaker TLS versions.  \nDo not use default certificates, either for the web -based interface on the  server, or for securing communications with \nagents, log servers, databases, and other components integrated with the SIEM. Use certificates signed by a trusted \nCertificate Authority (CA). If purchasing certificates from a CA is not possible, then replace default certificates with \ncertificates signed by the organizations root CA. To further strengthen, use common name checking. The browsers of \ndedicated management workstations connecting to the SIEM web interface must be configured to trust the CA that sig ned \nthe SIEMs certificate. By trusting the CA, the browsers will trust the SIEMs certificate.  \nTLS also provides encryption which can help prevent an attacker from viewing potentially sensitive data, such as SIEM \nadministrator credentials, traversing the network. If an attacker compromises the SIEMs private key, the attacker could \ndecrypt traffic from the SIEM solution. Protect the private key by utilizing privilege and permission restrictions on the \nfolders where the private key sits. Certain products al so support variants of on -disk encryption on the folders where the \nprivate key sits.  \nIf it is suspected that a SIEM solutions private key(s) is compromised, revoke the SIEM certificate and generate a new \ncertificate and corresponding private key. This dep ends on the certificate being revocable (including being tied to a \ncertificate authority) beforehand.  \nAvoid sending logs in plaintext, especially security critical logs and bulk log forwarding where the impact of exposure is \nparticularly high. Avoid using native syslog which sends data in plaintext.  \n\n \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  \n7 \nNSA CYBERSECURITY  REPORT\n  \nSome products may have a Federal Information Processing Standard (FIPS) mode that ensures the product complies with \nUS Government standards for cryptographic software. This setting prevents the product from usin g known weak \nencryption.  \nRemote Access . Remote access introduces an additional opportunity for attackers to get into the network. If possible, \nblock remote access to the SIEM server and services. If utilizing remote access, ensure that a secure protocol us ing TLS \nor SSH is used. This will encrypt the traffic, verify to the client that the SIEM is who it claims to be, and protect the dat a \nfrom prying eyes. Limit shell/command line access to SIEM servers and services to allow only authorized users access. \nSet an appropriate timeout for remote sessions and preferably do not allow more than one concurrent connection using \nthe same account. If allowing remote access, the systems allowed to connect should preferably only be owned and \nmanaged by the organization, r ather than unsecured and unmanaged personally -owned systems. One possible practice is \nto provide organization -owned equipment such as laptops where users do not have administrative rights, only authorized \nsoftware is allowed to be installed, and soft or ha rd PKI credentials are used to connect in via encrypted VPNs.  \nThird Party Integrations. SIEM solutions often integrate with third party products (e.g. threat reputation services, app \nproviders, analytic providers, providers of other parts in a stack, etc.) . Only integrate with trusted third parties. To request \nthird party services, the SIEM may make outbound connections to the third party Internet servers. Make sure these \nconnections occur over secure channels such as TLS and flow through the security devic es protecting the enterprise \nnetwork. Be wary of sending data from the SIEM solution to third parties, particularly non -anonymized data.  \nNetwork Segregation. Segregate network traffic on a separate VLAN from management traffic and protect all the traffic \nwith a network firewall. On the firewall, follow a deny -by-default policy. Make a list of ports necessary for the SIEM \nsolution to work properly and open only those ports. Connections may include a port for accessing the web interface, a \nport to listen for incoming data, and a port for management. Use network Access Control Lists (ACL) to limit the IP \naddresses that can access various parts of the organizations networks.  \nOther Settings.  The SIEM solution may offer its own additional security settings such a s IP whitelisting, IP blacklisting, \nweb session timeout, and the maximum size of data accepted. Utilize such features if available.  Consider implementing \ndenial of service  countermeasures such as rules blocking IPs which open large numbers of partial conne ctions.  \nProtecting Data at Rest  \nBack up data and configurations regularly and test them periodically. Backups should be kept on a separate network or at \nleast a separate server. Backups kept on the same server or network as the log data are susceptible to the same risks as \nthe log data. Off -line off -site backups are the most secure. Both original data and backup data should be protected by file \nsystem Access Control Lists (ACL) (not to be confused with network ACLs). File system ACLs restrict access to obje cts \n(e.g. files, folders, etc.) which prevents unauthorized actors from accessing the log data on the disk.  \nEnable on -disk encryption for servers holding logs. This will protect the data if it is physically stolen out of a data center. If \nnecessary, utiliz e Data Integrity features which compute hash values on every slice of data and separately store those \nhashes for verification of the datas integrity.  \nTurn on alerts for risky commands such as deleting or exporting data. An attacker may try to clear logs t o cover their \ntracks. Logs should not be deleted outside of the age -off schedule. If an administrator receives an alert that local logs \nhave been deleted before the defined age -off, it should be considered a high priority security concern.  \nLogs and other d ata forwarded to the SIEM solution may contain sensitive data. Utilize the SIEM solutions masking \nfeature to protect data such as credit card information or social security numbers. Make sure there are no plain text \npasswords visible. Information gained s uch as usernames and passwords can be used by an attacker to traverse the \nnetwork.  \nAUDITING AND COMPLIA NCE \nRegularly perform audits to keep track of activity in a system. Perform a periodic review of: SIEM access and audit logs; \nSIEM server audit and secur ity logs; SIEM users and roles. Follow vendor security guidance on how to implement their \nproduct in a secure way.  \n\n \nU/OO/205245 -19          PP-19-1316          OCTOBER 2019  \n8 \nNSA CYBERSECURITY  REPORT\n  \nSome laws and policies may determine how long certain types of data, such as Personally Identifiable Information (PII) \ncan be retained. Determine if any laws and policies apply to the logs and data the organization collects and set data age -\noff to an appropriate amount of time on the data source and any servers/devices containing this data. In the case of a \ncompromise, this limits the amou nt of data an attacker gains access to. Know what information the organization keeps, \nretain only what is necessary, protect what is kept, and properly dispose of what the organization doesnt need [5].  \nCONCLUSION  \nSIEM solutions can help analysts detect th reats but, if not secured properly, can introduce vulnerabilities. Security \nprofessionals need to plan security measures not only for their SIEM software but also for the hardware, OS running the \nsoftware, and data collected. An attackers work is made mor e difficult if an organization properly secures its SIEM \nsolution.  \nREFERENCES  \n[1] Global Incident Response Threat Report, Carbon Black, November 2018. [Online] Available: https://www.carbonblack.com/global -incident -\nresponse -threat -report/november -2018/   \n[2] G. Rice, Securing Windows Service Accounts, SANS Institute, 03 March 20 05. [Online] Available: https://cyber -\ndefense.sans.org/resources/papers/gsec/securing -windows -service -accounts -107116  \n[3] CVE Data Updates and RS S Feeds, CVE, MITRE Corporation. [Online] Available: https://cve.mitre.org/cve/data_updates.html  \n[4] NVD Data Feeds, National Vulnerability Database, National Institute of Standards and Technol ogy. [Online] Available: https://nvd.nist.gov/vuln/data -\nfeeds  \n[5] Protecting Personal Information: A Guide for Business, Federal Trade Commission, October 2016. [Online] Available: https://www.ftc.gov/tips -\nadvice/business -center/guidance/protecting -personal -information -guide -business  \nWindows and Active Directory are registered trademar ks of Microsoft Corporation.  \nJavaScript is a registered trademark of Oracle America, Inc.  \nFlash is a registered trademark of Adobe Systems, Inc.  \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "hardening siem solutions_20191008-nsagov",
  "source": "nsa",
  "id": "6bf3906865e25b5f0c3338cb8ebc960117de83ad428c81f071bf586f465846e1"
}