{
  "markdown": "Identity and Access Management  Educational Aid Talking Points  \n \nPurpose: This educational aid is intended to be used to get the conversation started with \nyour board of directors or overseers to make the case of the importance of identity and \naccess management (IAM) and explain the risks associated with not adopting a robust IAM  \nprogram. This educational aid is not intended to solve all IAM problems but rather to quickly explain the importance of IAM to executives who do not have many cycles to spend on this \ntopic.  \nThe role of cybersecurity within organizations has dramatically changed over the last decade. What \nwas once a responsibility of the IT department has become a foundation of a business that \ninterconnects multiple local data centers, remote cloud applications, supply chain, remote customers, and all connections between them.  At the same time, attackers are becoming more \nsophisticated and threats more severe.  \n An alarming 84% of organizations surveyed by Identity Defined Security Alliance experienced identity related breaches in the past year. a ccording to the ir 2022 Trend s in \nSecuring Digital Identities report .  \n Cyber incidents are on the rise, costing billions of dollars and compromising critical and sensitive data and resources.  \n In todays world, all online systems are targets. Nation states target critical infrastructure or other critical information systems to conduct espionage activities, steal intellectual property, or prepare for later destructive cyberattacks while criminal organizations conduct wide -ranging campaigns seeking to compromise systems to profit by stealing data or simply \nransoming system access.  \nCybersecurity incidents are costing organizations billions of dollars by compromising data and \nsystems, resulting in pr ivacy breaches and loss of critical data.  \n In 2021, Colonial Pipeline, a major Southeast oil pipeline system suffered a major \nransomware attack resulting in disruption to the oil/gas distribution system causing long \nlines at the gas station and panic by consumers. When people think of the Colonial Pipeline attack, they often think of the attackers exploiting the company for money but they dont often realize the root of how the attack happened was a result of a leaked password, an \ninactive VPN account, and a lack of multifactor authentication  all of which can be summed \nup as poor identity and access management.  \nWhat are the risks associated with not adopting a robust IAM program?  There is significant risk in \nhaving a poor identity and access management p rogram. Those risks include:  \n Potential fines being levied;  \n The financial cost of having to pay ransom with no guarantees that you wont suffer \na ransomware attack again;  \n The financial cost of remediation;  \n Reputational damage;  \n Uncertainty if cybers insurance will cover the loss.  \n\nIn the case of Colonial Pipeline they had to pay $5 million in ransom in order to regain control of its \nsystem.  On top of that they suffered detrimental damage to their brand as fear of a gas shortage caused panic -buying and  long lines at gas stations in many states leading to real shortages in \ncertain areas. Additional cyber insurance coverage may not necessarily cover attacks especially if \ncompanies fail to establish basic hygiene controls.  \nWhat is IAM and how does it help ? \n IAM is a framework of business processes, policies, and technologies that facilitate the \nmanagement of digital identities. It ensures that users only gain access to data when they have the appropriate credentials. The benefits of IAM is not only related to  deterrence of \nattacks. IAM also improves user experience, boost efficiency, increase flexibility, and lowers \noperating costs.  \nWhat are the steps to take to ensure business resilience?  \n The first step should be enforcing basic password controls by requiring regular password \nresets and longer, complex passwords as well as hardening any system that allows \nemployees or customers to reset passwords online.  \n But password controls alone are not enough. Using multi- factor authentication combining \nsomething you kn ow (password), with something you have (an RSA token) and/or \nsomething you are (like a thumbprint) makes it harder for bad actors to get into your network. It is also important to : \n Harden the physical network environment in order to ensure assets are protected from \ninterruption or data loss.  \no Limiting a users access to only those that are necessary for completing the job.  \no Ensuring that users do not have more privileges than necessary.  \n For example, an I T system administrator may need root or admin \naccess to complete some of their necessary tasks, but may improve security by logging in without those elevated privileges when theyre no t \nactively  needed.   \no Logging and monitoring usage is a good practice , particularly with highly \nprivileged (high risk) accounts to guard against misuse.  \nWhen it comes to sensitive data, it is critical for organizations to discover where data is located, \nprotect the data, and control who has access to the data.  \n \n \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "iam_educational_aid_talking_points_508c",
  "source": "nsa",
  "id": "bd7bd3b9a9a99eee070020e0819924e41760d7913764b29980373611ef0b4754"
}