{
  "markdown": " \n \n \n \nPP-18-0696          18 September 2018  \n IDENTITY THEFT THREA T AND MITIGATIONS1 \nIntroduction to Identity Theft  \nIdentity theft is a crime that involves using another persons personal information to take malicious actions, such as \nconducting fraud or stealing funds. The information provided in this document is designed  to help individuals protect \nthemselves against identity theft and mitigate the risk.  \nThe frequency of identity theft has increased dramatically. Criminals can use a multitude of methods to obtain Personally \nIdentifiable Information (PII), which can be le veraged to carry out malicious actions. Personal protection from these actors \nmust be dealt with on all fronts, as a layered approach. As set forth throughout this paper, there are numerous steps that \none can and should take to defend against identity (ID)  theft in general and the prevalence of targeting by sophisticated \nand not -so-sophisticated hackers. However, none of the steps, either alone or in the aggregate, can absolutely preclude \nbecoming a victim of identity theft or prevent PII from being stolen.  The information provided throughout this document is \ndesigned to help protect against this possibility and to mitigate the risks that could happen. If, despite best efforts to \ndefend against ID theft, a determined attacker is successful in conducting ID t heft, basic guidance is provided to assist in \naddressing the situation.  \nThe Threat  \nThe threat is real as evidenced in some of the key findings from the U.S. Department of Justice, Victims of Identity Theft \n(Revised 2017) report  (Source: https://www.bjs .gov/content/pub/pdf/vit14.pdf ):  \n 17.6 million American or 7% of 16 years or older were victims  \n 86% experienced misuse of an existing credit card or bank account.  \n 7% experienced multiple types of identity theft  \n 14% of identity theft victims experie nced an out of pocket loss. 49%  of those suffered losses less than $ 100 \nand 14% lost $1,000 or more.  \n \nThe threat actors goals may include (but arent limited to) character degradation, altering financial status, and/or creatin g \nlegal problems. The classes or type s of threat actors could include hacktivist (hackers for a social/political cause), \ndisgruntled employees, cyber criminals, and nation -state actors. Todays online connectivity fosters a proliferation of \nlocations where PII may be retained and (readily) av ailable. Personalized email based phishing attacks are becoming \nmore sophisticated. All of the aforementioned factors result in a heightened cyber risk environment and requires greater \nvigilance on the part of individuals to protect private information. PI I can facilitate successful ID theft to include obtaining \nSocial Security Number (SSN), age, salary, and phones numbers. This information is critical for successful identity theft. \nAny, and all, public, personal data can be useful to perform ID theft and a id in crafting believable spear -phishing emails \nthat can appear to be sent from trusted sources. Through phishing, an attacker can gain remote control of a device \n(desktop, laptop, cellphone, tablet, etc.) or can gain access to stored data to authenticated  websites; all of which can \nfurther facilitate ID theft.  \nTypical Techniques  \nWhaling, a common ID theft technique, is the targeting of high ranking corporate executives (the big fish ) via malicious \nemails, links, or attachments. The goal is to compromise networks, devices, and/or to collect personal/organizational \ninformation. Unbeknownst to the victim, the threat actor performs targeted research on exposed personal information in  \n                                                \n1 The information contained in this document was developed in the course of NSAs cybersecurity mission including its responsib ilities to identify and disseminate information on threats to \nnational security systems and Department of Defense information technologies, develop and issue security implementation specifications for cybersecurity -enabled products, and to \nassist Executive departments and agencies with operational security programs.  The information may be shared broadly to reach  all appropriate stakeholders.  \n\n \n \n \n2 . \n PP-18-0696          18 September 2018  \n order to craft deceptive emails. The emails often contain attachments/links and information designed to deceive. These \nappear to originate from a known person, have a professional look and feel, and are difficult to identify as malicious. The \nID thieves target will often open the bogus emails and then click -on the socially engi neered malicious attachments/links. \nWhile the skill level required for successful ID theft is minimal, data/PII manipulation or assumption of target ID, requires  \nincreased sophistication. ID theft includes, but is not limited to, fabricating criminal liabi lity, ruining an individuals \nreputation or credit, and blackmailing the target, which could result in legal action, job loss, or arrest. ID theft may achi eve \nthese goals through the following means:  \n Take Advantage of System Access: Place material on a ha rd drive that is indicative of serious illegal activity \n(e.g. maliciously edited photographs, espionage, insider trading, incriminating emails)  \n Alter or Access Financial Information: Collect sensitive financial information, access, modify, or create \naccounts (e.g. credit accounts, investment sites), steal funds  \n Recover Credentials (e.g. user names, passwords, challenge question answers)  \n Establish Persistent Presence on Network or Dev ice: Gather long -term information on network and device \nrelated data. This may be aggregated with data from other information technology systems used.  \nWhere Can Personal Information be Found?  \nPersonal information can be found online; individuals actively  publish data about themselves to include information from \nsignature blocks, social networking sites, organizational sites (e.g. professional, alumni, and clubs), resumes, biographies,  \nor interviews. Personal information can be thought of as identity DNA. It can be used to uniquely mark a person for \ntracking and be leveraged to gain footholds in the personal lives of friends, family members, and co -workers.  \nPersonal Information Related to PII  \nAggregation of identifiers/credentials could \nconstitute PII  \nCore Identifiers  Access \nCredentials  Physical  \nFull \nName/Previous \nNames  Passwords/PINs  Gender  \nAddress  Account \nNumbers  Hair Color  \nDate of Birth  Email Addresses  Height  \nDrivers License \nNumber  Mothers Maiden \nName  Weight  \nInsurance Card \nNumber  Biometric \nInformation*  Eye Color  \nTelephone \nNumber  Medical \nInformation  Race  \nPersonal, Educational, Criminal, Family \nInformation (that can readily be found in public \nrecords)  \n\n \n \n \n3 . \n PP-18-0696          18 September 2018  \n Most people understand the need to protect their SSN and Personal Identification Numbers (PIN); however, there are \nother identifiers that could help a thief access PII. The table above lists a few of those less thought about identifiers. \nHaving this additi onal information enables threat actors to build a better personal profile that may be used to more \neffectively assume another persons identity.  \nPersonal Information Trust Relationships  \nID theft may exploit networks or accounts of trusted associates from  which to send malicious email, as these networks \nand systems are often not up -to-date with security procedures. Emails sent at specific times of the year may serve to \nincrease the believability of the phishing attempt, such as a tax service provider email  sent in the spring or a medical \nbenefits email sent in the fall. Examples of trusted service providers include:  \n    Personal: Spouse/childs employer or school, friends, associates, lawyers, social groups, educational groups \n(university associations as student, instructor, or alumni), and Facebook2  \n Professional: Workplace contacts, conferences, organizations, job posting sites, LinkedIn3, and certification \ngroups.  \n Medical: general practitioner, dentist, specialists, labs, hospitals, therapists  \n Financial: credit union, banks, investments, mortgage company , pension plans, income tax services, accountants, \ncredit card companies, online purchasing sites  \n Media/Entertainment: reporters/organizations (interviews, quotes), subscriptions, technical pu blications, special \ninterest sites, streaming video sites, gaming sites, and Twitch4/YouTube5 \n        Social Relationships: online fr iends, apps  \n Insurance: medical, life, homeowners, auto  \n Service Providers: utilities (Internet Service Provider s (ISP) , gas, electric, water), home security  \n Other: Department of Motor Vehicles (D MV), court (jury duty, subpoena), law e nforcement, Civilian Welfare Fund \n(CWF ), transportation   \nMitigations  Systems (Hardware, Software, Services)  \nSeveral steps that h elp safeguard hardware, software, and services against ID theft include securing systems, limiting \nexposure (electronic and physical), applying application controls, and service partitioning (e.g. using different \ndevices/OS es/browsers for activities of dif fering sensitivities). Specific areas that require attention include home networks, \nmobile devices, email services, authentication, storage, game consoles, and applications.  \nMobile Devices  \nMaintain physical control of the device. Turn off wireless, Bluet ooth6, and GPS when not in use. Exercise extreme \ncaution when considering connection to public WiFi networks, using cellular networks if available. Create a robust device \nPIN. Enable automatic screen locking (after inactivity) and device disk encryption, if available.  \nHome Network  \nKeep home network devices (e.g. WiFi routers) patched and updated to help deal with the latest attacks and to protect \nagainst website drive -by infection. Use anti -virus and anti -malware software to help eliminate threats. Keep browsers and \n                                                \n2 Facebook is a registered trademark of  Facebook , Inc.  \n3 LinkedIn is a registered trademark of  LinkedIn Corporation  \n4 Twitch is a registered trademark of  Twitch Interactive, Inc.  \n5 YouTube  is a registered trademark of  Google, Inc.  \n6 Bluetooth  is a registered trademark of the Bluetooth Special Interest Group  \n\n \n \n \n4 . \n PP-18-0696          18 September 2018  \n browser plug -ins up -to-date, enable automatic updates if possible, and disable Java7 in the browser. Limit privileges \n(e.g. guest or user privileges) for accounts used by guests, children, and other daily accesses. Periodically change \npasswords and keep a higher level of complexity. Make sure wireless access points and domain name servers are secure \nusing the most up -to-date methods.  \nSeparate Device Activities  \nConsider having different devices dedicated to different purposes, i.e. one computer for financial/PII use, another for \ngames/children, and another for use while travelling, etc. When travelling, do not take an unnecessary device (laptop or \nsmartphone) on the trip. In general, avoid accessing sensitive services (such as financial and medical) while travelling. Be \ncareful of services that are accessible from mobile devices, and know which services store credentials since these \nservices may not store these se curely.  \nEmail and Cloud  \nDo not open emails or email attachments from untrusted sources. Opening email attachments from unknown senders can \nload malware and access sensitive information via deceptive procedures such as whaling. Filter emails; run anti -malware \nand virus scans.  \nAuthentication/Passwords  \nSome online services are beginning to allow the use of physical tokens as a form of authentication. Many others allow for \nthe use of a second authentication channel, such as a text message with a passcode. B iometrics can be paired as a \nsecondary authentication when paired with a password. When these measures are available, use them.  \nFor online services that use password -based authentication. Make passwords complex, and do not use the same \npassword for multipl e accounts. If passwords are written down, they should not be associated with the account, and the \nwritten list should be stored in a safe place (e.g., in a locked box at home). Most services also provide password reset \nquestions based upon various life in formation. Often these questions have answers that can be discovered and used to \nfacilitate ID theft.  \nStorage (media, SD card, USB, portable, backups, file sharing, disposal)  \nDisable autorun capability. Never accept removable media from untrusted sources,  such as giveaways. Free storage \nmedia from conferences or from unknown source may contain malware. Remove or disable hardware from machines that \ndo not need removable media. Secure and maintain physical control over media, computers and mobile devices. Vi rus \nscan all removable media. When accessing this media, use non -privileged accounts; if possible, access such media from \na virtual machine or sandbox. Make use of document viewers instead of full applications. Prior to discarding removable \nmedia, or a com puter or smartphone with fixed media, delete all data or physically destroy the media. Consider using \nsecured USB storage, particularly bootable USB drives that offer secure operating systems with identity and password \nprotections.  \nMitigations  Behaviora l  \nSuccessfully protecting against ID Theft requires planning and effort. Be aware of how your normal mode of operation \n(behavior) could be used to compromise your identity, and implement safeguards to reduce the threat.  \nBe Aware of the Context of the Mac hine You Use  \nExercise extreme caution when accessing public WiFi hotspots.  Usually, using a mobile devices cellular data connection \nis safer than WiFi. Do not exchange any personal information or transact any sensitive business on untrusted networks. \n                                                \n7 Java is a trademark of  Oracle  Corporation  \n\n \n \n \n5 . \n PP-18-0696          18 September 2018  \n Do not exchange home and work content. Use different usernames for home and work email addresses. To prevent reuse \nof compromised passwords, use different passwords for each of your email accounts. Use password recovery or \nchallenge questions that no one els e (including children) would know or could find from Internet searches or public \nrecords. Use two -factor authentication when available for accessing webmail, social networking, financial, and other \naccounts. Avoid posting photos with embedded GPS coordinat es, since this provides information about the location of the \npersons in the photo at the time embedded in the photo metadata.  \nOffline Interactions  \nLock financial documents and reco rds, including Social Security c ards, in a safe place at home, and lock u p wallets or \npurses in a safe place at work. Before sharing information at the workplace, businesses, childrens schools, or a doctors \noffice, inquire as to why PII is required. Further, ask how will the PII be safeguarded, and discuss the consequences of  not \nsharing. Always shred receipts, credit offers, credit applications, insurance forms, physician statements, checks, bank \nstatements, expired charge cards, and similar PII related documents when no longer needed. Before disposing of a \ncomputer or mobile  device, always dispose of all the personal information it stores.  \nOnline Interactions  \nBe alert to impersonators. Make sure to know who is receiving personal or financial information. Unless initiating the \ncontact or the person communicated with is known, PII should not be given out on the phone, through the mail or over the \nInternet. If a c ompany that claims to have an account sends an email asking for PII, do not click on links in the email. \nInstead, type the company name directly into the web browser to access their site, and/or contact them through their \ncustomer service center to confirm  whether or not the company truly sent the request.  \nTravel  \nNever do online banking in public places. Maintain a low profile. If possible, use cash for purchasing personal items like \nsouvenirs. Advise family members not to discuss your travel details and not to post these on social networking sites.  \nCredit Freeze  \nTake steps to limit others from opening new credit cards and accounts by enabling a credit freeze. Safeguards are \navailable that disallow ahead of time any new purchases  \nMonitoring for Identity T heft  \nEveryone is a potential victim of ID theft; therefore, all must be keenly aware of indications that they have been victimized  \nor are actively being targeted. Monitoring these potential indicators is essential in identifying, mitigating and protecting  \nagainst the threat. There are two classes of monitoring that are key: personal and commercial.  \nPersonal Monitoring  \nPersonal monitoring involves individual steps that a person can take to detect ID theft activity. The steps involve routinely  \nsearching fo r evidence of compromise. Examples include reviewing credit card and bank statements, call logs, browser \nhistory, email (including the Sent Items folder), change in social networking privacy settings, and detecting an increase \nin unsolicited contacts. Be  mindful of credit card skimmers in public places like gas stations, and restaurants. A deluge of \nunsolicited emails, calls, or letters about making a purchase is an indicator that ID theft may be in progress.  \nCredit Report  \nThe most important personal mo nitoring is reviewing credit reports which contain a history of residences, credit accounts - \nminimum and maximum balance, open/close status and payment history. Any erroneous information in a credit report can \n\n \n \n \n6 . \n PP-18-0696          18 September 2018  \n be an  indicator of ID Theft. Credit b ureaus g enerate credit reports and are required by the Fair Credit Reporting ACT \n(FCRA) to provide a free copy of a persons credit report every 12 months.  \nCommercial Monitoring  \nCredit Monitoring is a commercially available service (normally $10 - $20/month) prov iding a subscriber with information \nthat indicates changes in their personal profile. Areas of monitoring can be divided into two categories  Financial (credit \nand banking) and Personal. Financial monitoring identifies changes that are specific to a perso ns credit, not necessarily \ntheir assets. For example, a new bank loan would be detected by a credit monitoring report but a large deposit or \nwithdrawal would not. Personal monitoring identifies non -fiduciary references to a subscribers identity. This inc ludes civil, \ncriminal or other personal information available in public records. Commercial Monitoring services have proven effective in \nusing Financial and Personal monitoring to identify and mitigate ID Theft activity.  \nResponse Steps  \nRecommended steps by the Federal Trade Commission (FTC), the US Government entity responsible for receiving and \nprocessing complaints concerning ID theft, are:  \n1. Place an Initial Fraud Alert  \n2. Order your credit reports  \n3. Create an Identity Theft Report with the FTC (1 -877-438-THEFT). The initial report is called a Theft Affidavit. The \nAffidavit in conjunction with a police report makes the formal Identity Theft Report. Identity Theft, Federal Trade \nCommission;  \nOther steps that can be taken include:  \n1. Contact the fraud departmen t of the three major credit bureaus  \n2. Contact the company that holds any account that you suspect may have been compromised. Ask for the \nfraud/security department; consider documenting all interactions with the company and closing all compromised \naccounts.  \n3. Contact your local police department and obtain copies of all police reports made in relation to the company.  \n4. Keep a detailed log of all contacts, notifications and interactions as you report the ID theft. Being as organized and \ndetailed as possible will  help you limit exposure to and recover from this crime.  \n ADDITIONAL REFERENCE S  \n DSS Identity Theft Guidance https://www.dss.mil/pyi/theft.html  \n FBIs Insider Threat Guidance  \nhttps://www.fbi.gov/ investigate/white -collar -crime/identity -theft  \n How To Keep Your Personal Information Secure: http://www.consumer.ftc.gov/articles/0272 -how-keep -your-personal -\ninformation -secure  \n Banking: Safeguarding Your Accounts: https://www.investopedia.com/university/banking/banking8.asp   \n U.S. Certs Identity T heft Guidance https://www.us -cert.gov/ncas/tips/ST05 -019 \n  \n\n \n \n \n7 . \n PP-18-0696          18 September 2018  \n CONTACT INFORMATION  \nClient Requirements and Inquiries or General Cybersecurity Inquiries  \nCYBERSECURITY REQUIREMENTS CENTER (CRC)  \n410-854-4200  \nCybersecurity_Requests@nsa.gov  \nDISCLAIMER OF WARRAN TIES  AND ENDORSEMENT  \nThe information and opinions contained in this document are provided as is and without any warranties or guarantees. \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not necessarily constitute or imply its endorsement, recommendation, or favoring by the United States \nGovernment. The views and opinions of authors expressed herein do not necessarily state or reflect those of the United \nStates Government, and  shall not be used for advertising or product endorsement purposes.  \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "identity theft threat and mitigations.docx - copy",
  "source": "nsa",
  "id": "edabbfac40ad58b649e706dcdcad987773911047a59512dd4d7f4d1ccda70055"
}