{
  "markdown": " \n \n \nU/OO/181523 -19          PP -19-0998         AUGUST 2019  1 INTEGRATE THREAT REP UTATION SERVICES  \nOVERWHELMING VOLUME  \nTodays adversaries use the complex and dynamic nature of  cyberspace to conduct a large volume of attacks using \nvaried vectors. Security devices deployed on enterprise networks help protect against malicious activity , but in order to \nkeep systems defended , security pros must relentlessly research the latest threats to keep up with the increasingly large \narray of  malicious activity.  Threat Reputation Services (TRS) gather crowdsourced intelligence from sensors worldwide , \nso that the slightest misstep by an adversary immedia tely alerts an entire community. Integrating TRS with existing \nnetwork security devices and applications contrib utes to a better defended  network while freeing valuable resources.  \nWHAT ARE THREAT REPU TATION SERVICES?  \nFundamentally, TRS are automated interfaces that provide client systems with a machine -readable score that describes \nthe perceived trustworthiness of a n object, based on an identifier/indicator. Vendors conduct frequent threat assessments \nagainst websites, files, domain names, and other objects to categorize how often they have been associated with \nmalicious activity, based on observed past behavior and shared intelligence. Reputation scores are assigned to the \nobjects to reflect these levels of observed activity. Objects associated with malicious activity are assigned worse scores \nwhile known good objects are assigned better scores. The resultant threat level/reputation scores can be used by security \ndevices to detect or block potentially malicious activity . TRS typically use indicators like Uniform Resource Locators \n(URL), Internet Protocol (IP) addresses, file hashes (like SHA256 or MD5), Domain Name Sy stem (DNS)  names , and \nemail addresses.  \nWHAT ARE THE THREATS ? \nAttackers often use email as a  threat vector, employing phishing to take advantage of users. Information in emails can be \ncrafted to trick users into thinking the emails are legitimate. Malicious  emails can contain attachments that download \nmalware, include links to infected websites, and request recipients to respond with sensitive information. Users that fall \nvictim can open the door for attackers to breach  not only the computer the user is usin g, but the rest of  the enterprise \nnetwork  too. Since email senders are associated with their email domains and IP addresses, TRS can use email domain \nauthentication with Domain -based Message Authentication, Reporting, and Conformance ( DMARC ) to prevent spo ofing \ndomains, and then lookup the domain and IP address reputations to block malicious emails, protecting networks an d \nusers from known bad senders  [1]. \nWebsites can contain links to malware downloads, links that redirect to other malicious websites, and login fields that steal \nusernames and passwords. Drive -by downloads can also occur, where malware is secretly downloaded onto workstations \nwith outdated and vulnerable web browsers the moment a user arrives on malicious websites. TRS addresses website \nthreats by assigning reputation scores to known bad URLs associated with the websites.1 TRS-enabled network devices \nand browsers block traffic containing URLs with bad reputation scores.  \nDNS utilizes a hierarchy of domains for translating website URLs into the ir associated IP addresses. When a user \nattempts to access a website, a DNS request for the relevant domain is performed. TRS can block DNS queries to known \nmalicious domains.  [2]  \nUnauthorized scanning can be used to conduct reconnaissance and gain information about networks, such as open ports \nand operating systems (OS). This information allows adversaries to tailor attacks, mapping them to known vulnerabilities \nand threats associated with the open ports and OSs. The techniques used to conduct the scanning, whether successful or\n                                                \n1 Access to malicious websites often requires DNS queries, but not always.  \n\n \n \n \nU/OO/181523 -19          PP -19-0998         AUGUST 2019  \n2 not, could also overwhelm affected network r esources, potentially resulting in denial of service. If IP  \naddresses have known  bad reputation scores, a TRS can support automated blocking.  \nLike URLs, IP addresses are also associated with websites. Traffic from malicious websites can also be blocked \naccording to their low -scored IP addresses. Additionally, IP -based TRS can block command and control (C2) and \nexfiltration traffic.  \nMalware and malicious files can affect network hosts through a myriad of vectors, including when victims browse infected \nwebsi tes or open malicious emails. Malware spreading from host to host can disrupt the entire network from the inside. In \norder to keep up with the volume of new malware variants, most anti -virus (AV) solutions support cloud -based lookups to \nTRS for detection, where they can draw upon a much larger corpus of malware knowledge. Such files can be detected \nafter they are downloaded or dropped onto systems, but before they execute.  \nThe term  zero-day can also be  used to describe malware artifacts that have not yet been identified as malicious and do \nnot have detection indicators developed. While security devices can fail to detect and prevent file artifacts, if C2 \ninfrastructure is reused, then IP - or DNS -based TRS can still be effective. In essence, the real -time u pdates of TRS force \nan adversary to simultaneously move away from or  burn all previously used infrastructure and recompile all malware in \norder to evade detection. Another way some enterprises with strict policies can use TRS to address zero-day malware is \nby blocking items with unknown reputations, effectively stopping threats that are not recognized as explicitly malicious. \nHowever, t his approach  presents a concern due to its potential to block legitimate items that also have unknown \nreputations  and must be carefully applied.  \nTHE PYRAMID OF PAIN  \nSome indicators, when used to detect and identify adversaries, cause the adversary more pain by forcing them to create \nnew attack infrastructure or change their tools. This observation inspired the develop ment of David Biancos Pyramid of \nPain concept which is helpful in understanding the value of TRS.  [3] \nFigure 1: The Pyramid of Pain  Identifier -based Indicators  \n\n\n \n \n \nU/OO/181523 -19          PP -19-0998         AUGUST 2019  \n3  \nAt the top of the pyramid are behavior - and pattern -based indicators , including the adversarys tactics, techniques, and \nprocedures (TTP s). These are the fundamental tools and behaviors integral to an attackers operation.  \nIf defenders can identify these TTPs and use them to detect and block an attack, it forces an attack er to rethink  \ntheir entire approach, sending them back to the drawing board. But these indicators are not just difficult for attackers to \ndevelop: they are also difficult for defenders to detect.  \nMoving down the pyramid  are identifier -based indicators . While they are excellent at pinpointing specific actors and \nactivity, these indicators have a narrow lifetime -of-value measured in mere hours.  It is easy for adversaries to launch \nattacks involving changes to IPs, URLs, and file hashes. The only way to keep up with these easy, frequent changes and \nevasions is complete automation and industrial -scale indicator sharing. TRS focuses on the detection of identifier -based \nindicators by drawing on shared intelligence, and integrates with network security devices to identify and block threats in \nreal time. This automation frees valuable security resources and informs the threat hunting process.2 \nAs defenders mature in their approach to threat hunting, they use increasingly advanced detection like correlation of logs, \nstatistical and visual analysis, machine learning, behavioral analysis, and creation of new and innovative detection \ncapabilities. Defenders require the time and resources needed to develop skills for threat hunting and to bring their threat \nhunting model to maturity . TRS can be used to detect simple indicators while defenders focus their resources to \ncontinuously hunt threats. Combining automated detection with pattern -matching/signature detection and behavioral \ndetection allows network defenders to counte r clever adversaries who use new infrastructure and more sophisticated \ntools.  \nIMPLEMENTATION  \nVendors  offer TRS as an additional feature that can be incorporated into endpoint security software and traffic inspection \nnetwork devices such as firewalls and proxies. This allows a network owner to set a simple policy for the categories and \nreputation scores allowed, alerted, or blocked. Licenses and subscriptions to the TRS threat databases need to be \nacquired before TRS filtering can be enabled on a device. F urther, licenses and subscriptions for each of the filtering \nservices desired must be acquired, and some vendors split services among item types (e.g., URLs, IP addresses, files, \nand DNS and email domains).  \n \n                                                \n2 For more information on threat hunting, please refer to Continuously Hunt for Network Intrusions, \" part of the NSA Cyberse curity Top 10 Mitigations . \n\n \n \n \nU/OO/181523 -19          PP -19-0998         AUGUST 2019  \n4  \nFigure  2: How TRS works  \n1. Intelligence data on reputation items is submitted to the Global TRS.  \n2. Local/customer owned TRS can pull reputation data from the Global/cloud TRS to supplement their own reputation data.  \n3. As clients reach out to external networks/enclaves, or the internet, network security devi ces like firewalls, now integrated with TRS and drawing on \nreputation data in real time, detect and block known threats.  \nCOMPONENTS  \nReputation Categories.  A category is a group of reputation items with similar characteristics. For example, some \ntypes of we bsites are known for having high amounts of malicious content and are categorized accordingly. Some \nexamples of categories applied to websites include, but are not limited to, malware, social media, news, pornography, \ngambling, and drugs. The categories to  be scanned are typically selected when adding TRS rules to an access policy.  \nReputation Scores.  A reputation score reflects the threat level assigned to URLs, IP addresses, files, and DNS and \nemail domains. The scoring uses a threat behavior scale from kn own bad behavior, to unknown, to known good behavior, \nand it varies based on the TRS vendor. Some scales are numeric, for example, ranging from zero to ten or one to five. \nItems at the known bad end of the scale are assumed to be infected with malicious content. The known good end of \nthe scale signifies reputation items with known legitimate sources which are believed to be good. Mid -scale reputation \nitems typically have not yet been identified as good or bad. Most enforcement points allow the network s ecurity \nadministrator to set a threshold for which reputation scores to block.  \nReputation Databases.  The last component is the reputation database. TRS vendors store and manage their \nreputation details in proprietary databases. The databases are constantly  updated as new reputations are assigned and \nold reputations are updated. The database is offered as a cloud service where products  automatically either download the \nlatest reputation data or make real -time queries to the TRS. Some products support a local  database which can augment \nglobal community reputation scores with local scores from file detonation chamber results or other sources specific to the \ncustomer.  \nDYNAMIC ADAPTATION  \nNetwork security devices like firewalls and proxies must be constantly updat ed to prevent the latest threats. Security \nadministrators can get overwhelmed trying to keep up with persistent adversaries , but TRS assesses threat levels for \nmillions of websites, files, and domains for enterprise network customers, helping to prevent th reats by blocking known \nbad sources. Resources like time and effort required to collect and apply threat intelligence can be allocated to ot her \n\n\n \n \n \nU/OO/181523 -19          PP -19-0998         AUGUST 2019  \n5 critical security tasks. TRS solutions  enhance a layered, defense -in-depth strategy. Integrating TRS crowdsource s the \ncollection of threat intelligence, achieves resource - and cost -savings, and helps defenses  to dynamically adapt with the \nrise and diversification of malicious activity.  \nREFERENCES  \n[1] Measuring the Impact of DMARCs Part in Preventing Business Email Compromise. The Global Cyber Alliance, 2019. [Online] Avai lable: \nhttps://www.globalcyberalliance.org/dma rc-economics -benefits -report/   \n[2] The Economic Value of DNS Security. The Global Cyber Alliance, 2019. [Online] Available: https://www.globalcyberalliance.org/dns -economic -\nvalue-report/   \n[3] D. Bianco, The Pyramid of Pain. 2014 January 17. [ Online blog ] Available: https://detect -respond.blogspot.com/2013/03/the -pryamind -of-pain.html  \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, tradema rk, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nCONTACT INFORMATION  \nClient Requi rements and General Cybersecurity Inquiries  \nCybersecurity Requirements Center (CRC), 410 -854-4200, email: Cybersecurity_Requests@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "integrate threat reputation services.docx - copy",
  "source": "nsa",
  "id": "4c4707e725a0fcb9afd85baa3e7747b8a721d9164d012f5da766ca48e6170221"
}