{
  "markdown": "  \n \n \n \n  \n   \n \nAll organizations should report incidents and anomalous activity to CISAs 24/7 Operations Center at report@cisa.gov  or \n(888) 282-0870. When available, please include the following information regarding the incident: date, time, and location of \nthe incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submittin g \ncompany or organizat ion; and a designated point of contact. For NSA client requirements or general cybersecurity inquiries, \ncontact Cybersecurity_Requests@nsa.gov . State, local, tribal, and territorial government entities can also report to the MS -\nISAC (SOC@cisecurity.org or 866 -787-4722).  \n \nThis document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information carries \nminimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to \nstandard copyright rules, TLP:CLEAR information may be distributed without restriction. For more information on the Traffic \nLight Protocol, see cisa.gov/tlp/. Product ID: AA23 -025A  \nJanuary 25, 2023  TLP:CLEAR  \n \nCo-authored by:  \nTLP:CLEAR  Protecting Against Malicious  Use of Remote \nMonitoring and Management Software  \nSUMMARY  \nThe Cybersecurity and Infrastructure Security Agency (CISA), National Security Agency (NSA), and \nMulti- State Information Sharing and Analysis Center (MS -ISAC) (hereafter referred to as the \nauthoring organizations) are releasing this joint Cybersecurity A dvisory (CSA) to warn network \ndefenders about malicious use of legitimate remote monitoring and management (RMM) software. In October 2022, CISA identified a widespread cyber campaign involving the malicious use of legitimate \nRMM software. Specifically, cy ber criminal actors sent phishing emails that led to the download of \nlegitimate RMM software ScreenConnect (now ConnectWise Control) and AnyDesk which the \nactors used in a refund scam to steal money from victim bank accounts.  \nAlthough this campaign appears  financially motivated, the authoring organizations assess it could \nlead to additional types of malicious activity. For example, the actors could sell victim account access \nto other cyber criminal or advanced persistent threat (APT) actors. This campaign highlights the threat of malicious cyber activity associated with legitimate RMM software: after gaining access to the target \nnetwork via phishing or other techniques, malicious cyber actors from cybercriminals to nation- state \nsponsored APTs are known to us e legitimate RMM software as a backdoor for persistence and/or \ncommand and control (C2).  \nUsing portable executables of RMM software provides a way for actors to establish local user access without the need for administrative privilege and full software ins tallation effectively bypassing \ncommon software controls and risk management assumptions.  \nThe authoring organizations strongly encourage network defenders to review the Indicators of \nCompromise (IOCs) and Mitigations sections in this CSA and apply the recommendations to protect \nagainst malicious use of legitimate RMM software.  \n\n \n  CISA | NSA | MS -ISAC  \nPage 2 of 7  |  Product ID : AA23 -025A  TLP:CLEAR   \n \nTLP:CLEAR   \n For a downloadable copy of IOCs, see AA23 -025.stix (STIX, 19 kb). \nTECHNICAL DETAILS  \nOverview  \nIn October 2022, CISA used trusted third- party reporting, to conduct retrospective analysis of \nEINSTEIN a federal civilian executive branch (FCEB) -wide intrusion detection system (IDS) \noperated and monitored by CISA and identified suspected malicious activity on two FCEB networks: \n I n mid -June 2022, malicious actors sent a phishing email containing a phone number to an \nFCEB employees government email address. The employee called the number, which led \nthem to visit the malicious domain, myhelpcare[.]online . \n I n mid -September 2022, there was bi- directional traffic between an FCEB network and \nmyhelpcare[.]cc .  \nBased on further EINSTEIN analysis and incident response support, CISA identified related activity \non many other FCEB networks. The authoring organizations assess this activity is part of a widespread, financially motivated phishing campaign and is related to malicious typosquatting activity \nreported by Silent Push in the blog post \nSilent P ush uncovers a large trojan operation featuring \nAmazon, Microsoft, Geek Squad, McAfee, Norton, and Paypal domains . \nMalicious Cyber Activity  \nThe authoring organizations assess that since at least June 2022, cyber criminal actors have sent help desk -themed phishing emails to FCEB federal staffs personal, and government email \naddresses. The emails either contain a link to a first -stage malicious domain or prompt the recipients \nto call the cybercriminals, who then try to convince the recipients to visit the first -stage malicious \ndomain. See figure 1 for an example phishing email obtained from an FCEB network.  \n  \n\n \n  CISA | NSA | MS -ISAC  \nPage 3 of 7  |  Product ID : AA23 -025A  TLP:CLEAR   \n \nTLP:CLEAR   \n  \nFigure 1: Help desk -themed phishing email example  \nThe recipient visiting the first -stage malicious domain triggers the download of an executable. The \nexecutable then connects to a second -stage malicious domain, from which it downloads additional \nRMM software . \nCISA noted  that the actors did not install downloaded  RMM clients on the compromised host. Instead, \nthe actors downloaded AnyDesk and ScreenConnect as self -contained, portable executables \nconfigured to connect to the actors RMM server.  \nNote:  Portable executables launch within the users context without installation. Because portable \nexecutables do not requi re administrator privileges, they can allow execution of unapproved software \neven if a risk management control may be in place to audit or block the same softwares installation \non the network. Threat actors can leverage a portable executable with local us er rights to attack other \nvulnerable machines within the local intranet or establish long term persistent access as a local user \nservice.  \n\n\n \n  CISA | NSA | MS -ISAC  \nPage 4 of 7  |  Product ID : AA23 -025A  TLP:CLEAR   \n \nTLP:CLEAR   \n CISA has observed that multiple first -stage domain names follow naming patterns used for IT \nhelp/support themed social -engineering, e.g., hservice[.]live , gscare[.]live , \nnhelpcare[.]info , deskcareme[.]live , nhelpcare[.]cc). According to Silent Push, some of \nthese malicious domains impersonate known brands such as, Norton, GeekSupport, Geek Squad, \nAmazon, Microsoft, McAfee, and PayPal.[ 1] CISA has also observed that the first -stage malicious \ndomain linked in the initial phishing email periodically redirects to other sites for additional redirects and downloads of RMM software.  \nUse of Remote Monitoring and Management Tools  \nIn this campaign, after downloading the RMM software, the actors used the software to initiate a refund scam. They first connected to the recipients system and enticed the recipient to log into their bank account while remaining connected to the system. The actors then used their access through \nthe RMM software to modify the recipients bank account summary. The falsely modified bank \naccount summary showed the recipient was mistakenly refunded an excess amount of money. The actors then instructed the recipient to refund this excess amount to the scam operator.  \nAlthough this specific activity appears to be financially motivated and targets individuals, the access \ncould lead to additional malicious activity against the recipients organizationfrom both other \ncybercriminals and APT actors. Network defenders should be aware that:  \n Although the cybercriminal actors in this campaign used ScreenConnect and AnyDesk, threat actors can maliciously leverage any legitimate RMM software.  \n Because threat actors can download legitimate RMM software as self -contained, portable \nexecutables , they can bypass both administrative privilege requirements and software \nmanagement control policies. \n The use of RMM software generally does not trigger antivirus or antimalware defenses. \n Malicious cyber actors are known to leverage legitimate RMM and remote desktop software  as \nbackdoors for persistence and for C2.[ 2],[3],[4],[5],[6],[7],[8\n]  \n RMM software allows cyber threat actors to avoid using custom malware.  \n \nThreat actors often target legitimate users of RMM software. Targets can include managed service providers (MSPs) and IT help desks, who regularly use legitimate RMM software  for technical and \nsecurity end- user support, network management, endpoint monitoring, and to interact remotely with \nhosts for IT -support functions. These threat actors can exploit trust relationships in MSP networks and \ngain access to a large number of the victim MSP's customers. MSP compromises  can introduce \nsignificant risk such as ransomware and cyber espionage\nto the MSPs customers.  \nThe authoring organizations strongly encourage network defenders to apply the recommendations in \nthe Mitigations section of this CSA to protect against malicious use of legitimate RMM software.  \n\n \n  CISA | NSA | MS -ISAC  \nPage 5 of 7  |  Product ID : AA23 -025A  TLP:CLEAR   \n \nTLP:CLEAR   \n INDICATORS OF COMPROMISE  \nSee table 1 for IOCs associated with the campaign detailed in this CSA. \nTable 1: Malicious Domains and IP addresses observed by CISA  \nDomain  Description  Date(s) Observed  \nwin03[.]xyz  Suspected first -stage \nmalware domain June 1, 2022  \nJuly 19, 2022  \nmyhelpcare[.]online  Suspected first -stage \nmalware domain June 14, 2022  \n \nwin01[.]xyz  Suspected first -stage \nmalware domain August 3, 2022  \nAugust 18, 2022  \nmyhelpcare[.]cc  Suspected first -stage \nmalware domain September 14, 2022  \n247secure[.]us  Second -stage malicious \ndomain October 19, 2022  \nNovember 10, 2022  \nAdditional resources to detect possible exploitation or compromise:  \n Silent Push: Silent Push uncovers a large trojan operation featuring Amazon, Microsoft, Geek \nSquad, M cAfee, Norton, and Paypal domains . \n  \n\n \n  CISA | NSA | MS -ISAC  \nPage 6 of 7  |  Product ID : AA23 -025A  TLP:CLEAR   \n \nTLP:CLEAR   \n MITIGATIONS \nThe authoring organizations encourage network defenders to:  \n Implement best practices to block phishing emails. See CISAs Phishing Infographic  for more \ninformation.  \n Audit remote access tools on your network to identify currently used and/or authorized RMM \nsoftware.  \n Review logs for execution of RMM software to detect abnormal use of programs running as a \nportable executable.  \n Use s ecurity software to detect instances of RMM software only being loaded in memory.  \n Implement application controls to manage and control execution of  software, including \nallowlisting RMM programs. \n See NSA Cybersecurity Information sheet Enforce Signed Software Execution \nPolicies.  \n Application controls should prevent both installation and execution of portable versions \nof unauthorized RMM software.  \n Require authorized RMM solutions only be used from within your network over approved remote access solutions, such as virtual private networks (VPNs) or virtual desktop interfaces (VDIs).  \n Block both inbound and outbound connections on common RMM ports and protocols at the \nnetwork perimeter.  \n Implement a user training program and phishing exercises to raise awareness among users \nabout the risks of visiting suspicious websites, clicking on suspicious links, and opening suspicious attachments. Reinforce the appropriate user response to phishing and spearphishing emails.  \n \nRESOURCES  \n See CISA Insights Mitigations and Hardening Guidance for MSPs and Small - and Mid -sized \nBusinesses  f or guidance on hardening MSP and customer infrastructure.  \n U.S. Defense Industrial Base ( DIB) Sector organizations may consider signing up for the NSA \nCybersecurity Collaboration Centers DIB Cybersecurity Service Offerings, including Protective Domain Name System (PDNS) services, vulnerability scanning, and threat intelligence collaboration for eligible organizations. For more information on how to enroll in \nthese services, email dib_defense@cyber.nsa.gov\n.  \n CISA offers several Vulnerability Scanning to help organizations reduce their exposure to \nthreats by taking a proactive approach to mitigating attack vectors. See cisa.gov/cyber -\nhygiene-services .  \n Consider participating in CISAs Automated Indicator Sharing (AIS)  to receive real -time \nexchange of machine- readable cyber threat indicators and defensive measures. AIS is offered \nat no cost to participants as part of CISAs mission to work with our public and private sector \n\n \n  CISA | NSA | MS -ISAC  \nPage 7 of 7  |  Product ID : AA23 -025A  TLP:CLEAR   \n \nTLP:CLEAR   \n partners to identify and help mitigate cyber threats through information sharing and provide \ntechnical assistance, upon request, that helps prevent, detect, and respond to incidents.  \nREFERENCES  \n[1] Silent Push uncovers a large trojan operation featuring Amazon, Microsoft, Geek Squad, McAfee, \nNorton, and Paypal domains.  Silent Push Threat Intelligence  \n[2] Impacket and Exfiltration Tool Used to Steal Sensitive Information from Defense Industrial Base \nOrganization | CISA  \n[3] Iranian Government -Sponsored Actors Conduct Cyber Operations Against Global Government \nand Commercial Networks | CISA  \n[4] Karakurt Data Extortion Group | CISA  \n[5] Compromise of U.S. Water Treatment Facility | CISA  \n[6] North Korean Advanced Persistent Threat Focus: Kimsuky | CISA  \n[7] Continued Threat Actor Exploitation Post Pulse Secure VPN Patching | CISA  \n[8] FBI Warns Public to Beware of Tech Support Scammers Targeting Financial Accounts Using \nRemote Desktop Software  FBI \nPURPOSE  \nThis advisory was developed by CISA, NSA, and MS -ISAC in furtherance of their respective \ncybersecurity missions, including their responsibilities to develop and  issue cybersecurity \nspecifications and mitigations.  \nDISCLAIMER  \nThe information in this report is being provided as is for informational purposes only. CISA, NSA, \nand MS -ISAC do not endorse any commercial product or service, including any subjects of analysis. \nAny reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring.  \n \n  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "joint_csa_rmm",
  "source": "nsa",
  "id": "d3abf2ac3e2a00564e01327139a7a968e2a7406e2167bebe08137cd01a1f8ed5"
}