{
  "markdown": "  \n \n \n \n  \n   \n \nTo report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory , contact \nyour local FBI field office at fbi.gov/contact -us/field , or the FBIs 24/7 Cyber Watch (CyWatch) at  \n(855) 292 -3937 or by e -mail at CyWatch@fbi.gov . When available, please include the following inf ormation \nregarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of \nequipment used for the activity; the name of the submitting company or organization; and a designated point of \ncontact. To reque st incident response resources or technical assistance related to these threats, contact CISA at \nCISAServiceDesk@cisa.dhs.gov . For NSA client requirements or general cybersecurity inquiries, contact the \nCybersecurity Requirements Center  at 410-854-4200  or Cybersecurity_Requests@nsa.gov . \nThis document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information \ncarries mini mal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public \nrelease. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction.  \nFor more information on the Traffic Light Protoc ol, see cisa.gov/tlp/ .  \nTLP: WHITE  Product ID: A2 2-011A \nJanuary 1 1, 2022  Co-Authored by:  \n TLP: WHITE   \nUnderstanding and Mitigating Russian State -\nSponsored Cyber Threat s to U.S. Critical \nInfrastructure   \nSUMMARY  \nThis joint Cybersecurity Advisory (CSA) authored by the \nCybersecurity and Infrastructure Security Agency (CISA), \nFederal Bureau of Investigation (FBI), and National Security \nAgency (NSA) is part of our cont inuing cybersecurity \nmission to warn organizations of cyber threats and help the \ncybersecurity community reduce the risk presented by these \nthreats. This CSA  provides an overview of Russian state -\nsponsored cyber operations; commonly observed tactics, \ntechn iques, and procedures (TTPs); detection actions; \nincident response guidance; and mitigations. This overview is \nintended to help the cybersecurity community reduce the risk \npresented by th ese threat s.  \nCISA, the FBI, and NSA encourage the cybersecurity \ncommunity especially critical infrastructure network \ndefenders to adopt a heightened state of awareness and to conduct proactive threat hunting, as \noutlined in the Detection  section. Additionally, CISA, the FBI, and NSA strongly urge network \ndefenders to implement the recommendations listed below and detailed in the Mitigations  section. \nThese mitigations will help organization s improve their functional resilience by reducing the risk of \ncompromise or severe business degradation . Actions critical infrastructure \norganizations should implement to \nimmediately strengthen their cyber \nposture.  \n Patch all systems. Prioritize \npatching known exploited \nvulnerabilities . \n Implement multi -factor \nauthentication.  \n Use antivirus software.  \n Develop internal contact lists \nand surge support.  \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 2 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n 1. Be prepared . Confirm reporting processes and minimize personnel gaps in IT/ OT security \ncoverage . Create, maintain, and exercise a cyber incident response plan, resilience plan, and \ncontinuity of operations plan so that critical functions and operations can be kept running if \ntechnology systems are disrupted or need to be taken offline.  \n2. Enhance your  organizations cyber posture . Follow best practices for identity and access \nmanagement, protective controls and architecture, and vulnerability and configuration \nmanagement.  \n3. Increase organizational vigilance . Stay current on reporting on this threat. Subscribe  to \nCISAs mailing list and feeds  to receive notifications when CISA releases information about a  \nsecurity topic or threat.  \nCISA, the FBI, and NSA encourage critical infrastructure organization leaders to review CISA \nInsights: Preparing for and Mitigating Cyber Threats  for information on reducing cyber  threat s to their \norganization.  \nTECHNICAL DETAILS  \nNote:  this advisory uses the MITRE ATT&CK for Enterprise framework, version 10. See \nthe ATT&CK for Enterprise  for all referenced threat actor tactics and techniques.  \nHistorically, Russian state -sponsored advanced persistent threat ( APT) actors have used common \nbut effective tactics including spearphishing, brute force, and exploiting known vulnerabilities against \naccounts and networks with weak security to gain initial access to target networks. Vulnerabilities \nknown to be exploited by Russian state -sponsored APT actors for initial acces s include:  \n CVE-2018 -13379  FortiGate VPNs  \n CVE-2019 -1653  Cisco router  \n CVE-2019 -2725  Oracle WebLogic Server  \n CVE-2019 -7609  Kibana  \n CVE-2019 -9670  Zimbra software  \n CVE-2019 -10149  Exim Simple Mail Transfer Protocol  \n CVE-2019 -11510  Pulse Secure  \n CVE-2019 -19781  Citrix  \n CVE-2020 -0688  Microsoft Exchange  \n CVE-2020 -4006  VMWare (note: this was a zero -day at time.)  \n CVE-2020 -5902  F5 Big -IP \n CVE-2020 -14882  Oracle WebLogic  \n CVE-2021 -26855  Microsoft Exchange (Note: this vulnerability is frequently observed used in \nconjunction with CVE-2021 -26857 , CVE-2021 -26858 , and CVE-2021 -27065 ) \nRussian state -sponsored APT acto rs have  also demonstrated  sophisticated tradecraft and cyber \ncapab ilities  by compromising third -party infrastructure, compromising third -party software, or \ndeveloping and deploying custom malware. The actors have also demonstrated the ability to maintain \npersistent, undetected, long -term access in compromised environment sincluding cloud \nenvironments by using legitimate credentials.  \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 3 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n In some cases, Russian state -sponsored cyber operations against critical infrastructure organizations \nhave specifically targeted operational technology ( OT)/industrial control systems ( ICS) networks with \ndestructive malware. See the following advisories and alerts for information on historical Russian \nstate -sponsored cyber -intrusion campaigns and customized malware that have targeted ICS:  \n ICS Advisory  ICS Focused Malware  Havex  \n ICS Alert  Ongoing Sophisticated Malware Campaign Compromising ICS (Update E)  \n ICS Alert  Cyber -Attack Against Ukrainian Critical Infrastructure  \n Technical Alert  CrashOverride Malware  \n CISA MAR HatMan: Safety System Targeted Malware ( Update B)  \n CISA ICS Advisory Schneider Electric Triconex Tricon (Update B)  \nRussian state -sponsored APT actors have used sophisticated cyber capabilities to target a variety of \nU.S. and international critical infrastructure organizations, including those in the Defense Industrial \nBase as well as the Healthcare and Public Health, Ene rgy, Telecommunications, and Government \nFacilities Sectors. High -profile cyber activity publicly attributed to Russian state -sponsored APT actors \nby U.S. government reporting and legal actions include s: \n Russian state -sponsored APT actors targeting state, l ocal, tribal, and territorial (SLTT) \ngovernments and aviation networks, September 2020, through at least December 2020.  \nRussian state -sponsored APT actors targeted dozens of SLTT government and aviation \nnetworks. The actors successfully compromised network s and exfiltrated data from multiple \nvictims.  \n Russian state -sponsored APT actors  global Energy Sector intrusion campaign, 2011 to \n2018.  These Russian state -sponsored APT actors conducted a multi -stage intrusion campaign \nin which they gained remote access  to U.S. and international Energy Sector networks, \ndeployed ICS -focused malware, and collected and exfiltrated enterprise and ICS -related data.  \n Russian state -sponsored APT actors  campaign against Ukrainian critical \ninfrastructure, 2015 and 2016.  Russian state -sponsored APT actors  conducted a \ncyberattack against Ukrainian energy distribution companies, leading to multiple companies \nexperiencing unplanned power outages in December 2015. The actors deployed BlackEnergy  \nmalware to steal user credentials and used its destructive malware component, KillDisk, to \nmake infected computers inoperable. In 2016, these actors  conducted a cyber -intrusi on \ncampaign against a Ukrainian electrical transmission company and deployed CrashOverride  \nmalware specifically designed to attack power grids.  \nFor more information on recent and hist orical Russian state -sponsored malicious cyber activity, see \nthe referenced products below or cisa.gov /Russia . \n Joint FBI -DHS -CISA CSA Russian Foreign Intelligence Service (S VR) Cyber Operations: \nTrends and Best Practices for Network Defenders  \n Joint NSA -FBI-CISA CSA Russian GRU Conducting Global Brute Force Campaign to \nCompromise Enterprise and Cloud Environments  \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 4 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n  Joint FBI -CISA CSA  Russian State -Sponsored Advanced Persistent Threat Actor \nCompromis es U.S. Government Targets  \n Joint CISA -FBI CSA  APT Actors Chaining Vulnerabilities against SLTT, Critical Infrastructure, \nand Elections Organizations  \n CISAs webpage Remediating Networks Affected by the SolarWinds and Active \nDirectory/M365 Compromise  \n CISA Alert  Russian Governm ent Cyber Activity Targeting Energy Sector and Other Critical \nInfrastructure Sectors  \n CISA ICS : Alert Cyber -Attack Against Ukrainian Critical Infrastructure   \nTable 1 provides common , publicly known TTPs employed by Russian state -sponsored APT actors, \nwhich map to the MITRE ATT&CK for Enterprise framework, version 10. Note : these lists are not \nintended to be all inclusive. Russian state -sponsored actors have modified their TTPs before  based \non public reporting.[ 1] Therefore, CISA , the FBI, and NSA  anticipate the Russian state -sponsored \nactors may modify their TTPs as they deem n ecessary to reduce their risk of detection.  \nTable 1: Common Tactics and Techniques Employed by Russian State-Sponsored APT Actors  \nTactic  Technique  Procedure  \nReconnaissance \n[TA0043 ] Active Scanning: \nVulnerability Scanning \n[T1595.002 ] Russian state -sponsored APT actors have performed large -\nscale scans in an attempt to find vulnerable servers.  \n \nPhishing for  Information \n[T1598 ] Russian state -sponsored APT actors have conducted \nspearphishing campaigns to gain credentials of target \nnetworks.  \nResource \nDevelopment \n[TA0042 ] \n Develop Capabilities: \nMalware [ T1587.001 ] \n Russian state -sponsored APT actors have developed and \ndeployed malware, including ICS -focused destructive \nmalware.  \n \nInitial Access \n[TA0001 ] \n Exploit Public Facing \nApplications [ T1190 ] \n Russian state -sponsored APT actors use publicly known \nvulnerabilities, as well as zero -days, in internet -facing \nsystems to gain access to networks.  \nSupply Chain \nCompromise: \nCompromise Software \nSupply Chain \n[T1195.002 ] Russian state -sponsored APT actors have gained initial \naccess to victim organizations by compromising trusted third -\nparty software. N otable incidents include M.E.Doc accounting \nsoftware and SolarWinds Orion.  \nExecution \n[TA0002 ] \n Command and Scripting \nInterpreter: PowerShell \n[T1059.003 ] and Russian state -sponsored APT actors have used cmd.exe  to \nexecute commands on remote machines. They have also \nused PowerShell to create new tasks on remote machines, \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 5 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n Tactic  Technique  Procedure  \nWindows Command \nShell [ T1059.003 ] identify configuration settings, exfiltrate data, and to execute \nother commands.  \nPersistence \n[TA0003 ] \n Valid Accounts [ T1078 ] \n Russian state -sponsored APT actors have used credentials of \nexisting accounts to maintain persistent, long -term access to \ncompromised networks.  \n \nCredential \nAccess \n[TA0006 ] \n Brute Force: Password \nGuessing [ T1110.001 ] \nand Password Spraying \n[T1110.003 ] \n Russian state -sponsored APT actors have conducted brute -\nforce password guessing and password spraying campaigns.  \nOS Credential Dumping: \nNTDS [ T1003.003 ] \n Russian state -sponsored APT actors have exfiltrated \ncredentials and exported copies of the Active Directory \ndatabase ntds.dit . \n \nSteal or Forge Kerberos \nTickets: Kerberoasting \n[T1558.003 ] Russian state -sponsored APT actors have performed \nKerberoasting, whereby they obtained the Ticket Granting \nService (TGS) Tickets for Active Directory Service Principal \nNames (SPN) for offline cracking.  \n \nCredentials from \nPassword Stores [ T1555 ] Russian state -sponsored APT actors have used previously \ncompromised account credentials to attempt to access Group \nManaged Service Account (gMSA) passwords.  \nExploitation for \nCredential Access \n[T1212 ] Russian state -sponsored APT actors have exploited Windows \nNetlogon vulnerability CVE-2020 -1472  to obtain access to \nWindows Active Directory servers.  \nUnsecured Credentials: \nPrivate Keys [ T1552.004 ] Russian state -sponsored APT actors have obtained private \nencryption k eys from the Active Directory Federation Services \n(ADFS) container to decrypt corresponding SAML signing \ncertificates.  \nCommand and \nControl \n[TA0011 ] Proxy: Multi -hop Proxy \n[T1090.003 ] Russian state -sponsored APT actors have used virtual private \nservers (VPSs) to route traffic to targets. The actors often use \nVPSs with IP addresses in the home country  of the victim to \nhide activity among legitimate user traffic.  \n \nFor additional enterprise TTPs used by Russian state -sponsored APT actors , see the ATT&CK for \nEnterprise pages on APT29 , APT28 , and the Sandworm Team , respectively. For information on ICS \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 6 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n TTPs see the ATT&CK for ICS  pages on the Sandworm Team , Black Energ y 3 malware, \nCrashOveride  malware, BlackEnergys KillDisk  component, and NotPetya  malware.  \nDETECTION  \nGiven Russian state -sponsored APT actors demonstrated capability to maintain persistent, long -term \naccess in compromised enterprise and cloud environments , CISA, the FBI, and NSA encourage all \ncritical infrastructure organizations to:  \n Implement robust log collection and retention. Without a centralized log collection and \nmonitoring capability, organizations have limited ability to investigate incidents or d etect the \nthreat actor behavior described in this advisory. Depending on the environment, examples \ninclude : \no Native tools such as M365s Sentinel.  \no Third -party tools, such as Sparrow, Hawk, or CrowdStrike's Azure Reporting Tool \n(CRT), to review Microsoft cl oud environments and to detect unusual activity, service \nprincipals, and application activity. Note : for guidance on using these and other \ndetection tools, refer to CISA Alert Detecting Post -Compromise Threat Activity in \nMicrosoft Cloud Environments . \n Look for behavioral evidence or network and host -based artifacts  from known Russian \nstate -sponsored TTPs. See table 1 for commonly observed TTPs.  \no To detect password spray activity, review authentication logs for system and \napplication login failures of valid accounts. Look for multiple, failed authentication \nattempts across multiple accounts.  \no To detect use of compromised credentials in combination with a VPS, follow the below \nsteps:  \n Look fo r suspicious impossible logins, such as logins with changing \nusername, user agent strings, and IP address combinations or logins where IP \naddresses do not align to the expected users geographic location.  \n Look for one IP used for multiple accounts, exclu ding expected logins.  \n Look for impossible travel. Impossible travel occurs when a user logs in from \nmultiple IP addresses that are a significant geographic distance apart (i.e., a \nperson could not realistically travel between the geographic locations of the two \nIP addresses during the time period between the logins). Note : implementing \nthis detection opportunity can result in false positives if legitimate users apply \nVPN solutions before connecting into networks.  \n Look for processes and program execution c ommand -line arguments that may \nindicate credential dumping, especially attempts to access or copy the \nntds.dit  file from a domain controller.  \n Look for suspicious privileged account use after resetting passwords or \napplying user account mitigations.  \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 7 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n  Look for unusual activity in typically dormant accounts.  \n Look for unusual user agent strings, such as strings not typically associated \nwith normal user activity, which may indicate bot activity.  \n For organizations with OT/ICS systems:  \no Take note of unexpected equipment behavior; for example, unexpected reboots of \ndigital controllers and other OT hardware and software.  \no Record delays or disruptions in communication with field equipment or other OT \ndevices. Determine if system parts or com ponents are lagging or unresponsive.  \nINCIDENT RESPONSE  \nOrganizations detecting potential APT activity in their IT or OT networks should:  \n1. Immediately isolate affected systems.  \n2. Secure backups. Ensure your backup data is offline and secure. If possible, sca n your backup \ndata with an antivirus program to ensure it is free of malware.  \n3. Collect and review relevant logs, data, and artifacts.  \n4. Consider soliciting support from a third -party IT organization to provide subject matter \nexpertise, ensure the actor is era dicated from the network, and avoid residual issues that \ncould enable follow -on exploitation.  \n5. Report incidents to CISA  and/or the FBI via your local FBI field office  or the FBIs 24/7 \nCyWatch at (855) 292 -3937 or CyWatch@fbi.gov . \nNote : for OT assets, organizations should have a resilience plan that addresses how to operate if \nyou lose access to or control of the IT an d/or OT environment. Refer to the Mitigations  section for \nmore information.  \nSee the joint advisory from Australia, Canada, New Zealand, the United Kingdom, and the United \nStates on  Technical Approaches to Uncovering and Remediating Malicious Activity  for guidance on \nhunting or investigating a network, and for common mistakes in incident handling. CISA, the FBI, and \nNSA encourage critical infrastructure owners and operators to see CISAs Federal Government \nCybersecurity Incident and Vulnerability Resp onse Playbooks . Although tailored to federal civilian \nbranch agencies, these playbooks provide operational procedures for planning and conducting \ncybersecurity incident and vulnerability response activities and detail each step for both incident and \nvulner ability response.   \nNote : organizations should document incident response procedures in a cyber incident response \nplan, which organizations should create and exercise (as noted in the Mitigations  section).  \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 8 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n MITIGATIO NS \nCISA, the FBI, and NSA encourage all organizations to implement the following recommendations to \nincrease their cyber resilience against this threat.  \nBe Prepared  \nConfirm Reporting Processes and Minimize Coverage Gaps  \n Develop internal contact lists. Assign main points of contact for a suspected incident as well \nas roles and responsibilities and ensure personnel know how and when to report an incident.  \n Minimize gaps in IT/OT security personnel availability by identifyin g surge support for \nresponding to an incident. Malicious cyber actors are known to target organizations on \nweekends and holidays  when there are gaps in organizational cybersecurity critical \ninfrastructure organizations should proactively protect themselves by minimizing gaps in \ncoverage.  \n Ensure IT/OT security personnel monitor key internal security capabilities and can identify \nanomalous behavior. Flag any identified IOCs and TTPs for immedia te response. (See table 1 \nfor commonly observed TTPs).  \nCreate, Maintain, and Exercise a Cyber Incident Response, Resilience Plan, and \nContinuity of Operations Plan  \n Create, maintain, and exercise a cyber incident response and continuity of operations plan.  \n Ensure personnel are familiar with the key steps they need to take during an incident and are \npositioned to act in a calm and unified manner. Key questions:  \no Do personnel have the access they need?  \no Do they know the processes?  \n For OT assets/networks,  \no Identify a resilience plan that addresses how to operate if you lose access to or \ncontrol of the IT and/or OT environment.  \n Identify OT and IT network interdependencies and develop workarounds or \nmanual controls to ensure ICS networks can be isolated if the co nnections \ncreate risk to the safe and reliable operation of OT processes. Regularly test \ncontingency plans, such as manual controls, so that safety critical functions can \nbe maintained during a cyber incident.  Ensure that the OT network can operate \nat nece ssary capacity even if the IT network is compromised.   \no Regularly test manual controls so that critical functions can be kept running if ICS or \nOT networks need to be taken offline.  \no Implement data backup procedures on both the IT and OT networks. Backup \nprocedures should be conducted on a frequent, regular basis. Regularly test backup \nprocedures and ensure that backups are isolated from network connections that could \nenable the spread of malware.  \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 9 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n o In addition to backing up data, develop recovery documents tha t include configuration \nsettings for common devices and critical OT equipment. This can enable more efficient \nrecovery following an incident.  \nEnhance your Organizations Cyber Posture  \nCISA, the FBI, and NSA recommend organizations apply the best practices  below for identity and \naccess management, protective controls and architecture, and vulnerability and configuration \nmanagement.  \nIdentity and Access Management  \n Require multi -factor authentication for all users, without exception.  \n Require accounts to have s trong passwords and do not allow passwords to be used across \nmultiple accounts or stored on a system to which an adversary may have access.  \n Secure credentials. Russian state -sponsored APT actors have demonstrated their ability to \nmaintain persistence using  compromised credentials.  \no Use virtualizing solutions on modern hardware and software to ensure credentials are \nsecurely stored.  \no Disable the storage of clear text passwords in LSASS memory.  \no Consider disabling or limiting New Technology Local Area Network Ma nager  \n(NTLM)  and WDigest Authentication.  \no Implement Credential Guard  for Windows 10 and Server 2016 (Refer to  Microsoft: \nManage  Windows Defender Credential Guard  for more information). For Windows \nServer 2012R2, enable Protected Process Light for Local Security Authority (LSA).   \no Minimize the Active Directory attack surface  to reduce malicious ticket -granting activity. \nMalicious ac tivity such as Kerberoasting takes advantage of Kerberos TGS and can \nbe used to obtain hashed credentials that attackers attempt to crack.  \n Set a  strong  password policy for service accoun ts. \n Audit Domain Controllers to log successful Kerberos TGS requests and ensure the events are \nmonitored for anomalous activity.   \no Secure accounts.  \no Enforce the principle of least privilege. Administrator accounts should have the \nminimum permission they nee d to do their tasks.  \no Ensure there are unique and distinct administrative accounts for each set of \nadministrative tasks.  \no Create non -privileged accounts for privilege d users and ensure they use the non - \nprivileged accounts for all non -privileged access (e.g ., web browsing, email access).  \nProtective Controls and Architecture  \n Identify, detect, and investigate abnormal activity that may indicate lateral movement by a \nthreat actor or malware. Use network monitoring tools and host -based logs and monitoring \ntools, such as an endpoint detection and response (EDR) tool. EDR tools are particularly \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 10 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n useful for detecting lateral connections as they have insight into common and uncommon \nnetwork connections for each host.   \n Enable strong spam filters.  \no Enable strong spam filters to prevent phishing emails from reaching end users.  \no Filter emails containing executable files to prevent them from reaching end users.  \no Implement a user training program to discourage users from visiting malicious \nwebsites or opening malicious atta chments.  \nNote : CISA, the FBI, and NSA also recommend, as a longer -term effort, that critical infrastructure \norganizations implement network segmentation to separate network segments based on role and \nfunctionality. Network segmentation can help prevent lat eral movement by controlling traffic flows \nbetween and access to various subnetworks.  \n Appropriately implement network segmentation between IT and OT networks. Network \nsegmentation limits the ability of adversaries to pivot to the OT network even if the IT network \nis compromised. Define a demilitarized zone that eliminates unregulated communication \nbetween the IT and OT networks.  \n Organize OT assets into logical zones by taking into account criticality, consequence, and \noperational necessity. Define acceptabl e communication conduits between the zones and \ndeploy security controls to filter network traffic and monitor communications between zones. \nProhibit ICS protocols from traversing the IT network.  \nVulnerability and Configuration Management  \n Update software, i ncluding operating systems, applications, and firmware on IT network \nassets, in a timely manner. Prioritize patching known exploited vulnerabilities , especially those \nCVEs iden tified in this CSA, and then critical and high vulnerabilities that allow for remote \ncode execution or denial -of-service on internet -facing equipment.  \no Consider using a centralized patch management system. For OT networks, use a risk -\nbased assessment strate gy to determine the OT network assets and zones that should \nparticipate in the patch management program.   \no Consider signing up for CISAs cyber hygiene services , including vulnerability \nscannin g, to help reduce exposure to threats. CISAs vulnerability scanning service \nevaluates external network presence by executing continuous scans of public, static IP \naddresses for accessible services and vulnerabilities.   \n Use industry recommended antivirus p rogram s. \no Set antivirus/antimalware programs to conduct regular scans of IT network assets \nusing up -to-date signatures.  \no Use a risk -based asset inventory strategy to determine how OT network assets are \nidentified and evaluated for the presence of malware.  \n Implement rigorous configuration management programs. Ensure the programs can track and \nmitigate emerging threats. Review system configurations for misconfigurations and security \nweaknesses.  \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 11 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n  Disable all unnecessary ports and protocols  \no Review network securit y device logs and determine whether to shut off unnecessary \nports and protocols. Monitor common ports and protocols for command and control  \nactivity.  \no Turn off or disable any unnecessary services (e.g., PowerShell) or functionality within \ndevices.  \n Ensure OT hardware is in read -only mode.  \nIncrease Organizational Vigilance  \n Regularly review reporting on this threat. Consider signing up  for CISA notifications to receive \ntimely information on c urrent security issues, vulnerabilities, and high -impact activity.  \nRESOURCES  \n For more information on Russian state -sponsored malicious cyber activity, refer to \ncisa.gov/Russia . \n Refer to CISA Analysis Report Strengthening Security Configurations to Defend Against \nAttackers Targeting Cloud Services  for steps for guidance on strengthening your organizations \ncloud security practice s. \n Leaders of small businesses and small and local government agencies should see CISAs \nCyber Essentials  for guidance on developing an actionable understanding of implementing \norganizational cyberse curity practices.  \n Critical infrastructure owners and operators with OT/ICS networks, should review the following \nresources for additional information:  \no NSA and CISA joint CSA NSA and CISA Rec ommend Immediate Actions to Reduce \nExposure Across Operational Technologies and Control Systems  \no CISA factsheet Rising Ra nsomware Threat to Operational Technology Assets  for \nadditional recommendations.  \nREWARDS FOR JUSTICE PROGRAM  \nIf you have information on state -sponsored Russian cyber operations targeting U.S. critical \ninfrastructure, contact the Department of States Rewar ds for Justice Program. You may be eligible \nfor a reward of up to $10 million, which DOS is offering for information leading to the identification or \nlocation of any person who, while acting under the direction or control of a foreign government, \nparticipa tes in malicious cyber activity against U.S. critical infrastructure in violation of the Computer \nFraud and Abuse Act (CFAA). Contact +1 -202-702-7843 on WhatsApp, Signal, or Telegram, or send \ninformation via the Rewards for Justice secure Tor -based tips li ne located on the Dark Web. For more \ndetails refer to rewardsforjustice.net/malicious_cyber_activity . \n\n \n  CISA |  FBI |  NSA  TLP: WHITE  \nPage 12 of 12  |  Prod uct ID:  A22-011A  \nTLP:WHITE   \n CAVEATS  \nThe information you have accessed or received is being provided  as is for informational purposes \nonly. CISA, the FBI, and NSA do not endorse any commercial product or service, including any \nsubjects of analysis. Any reference to specific commercial products, processes, or services by service \nmark, trademark, manufac turer, or otherwise, does not constitute or imply endorsement, \nrecommendation, or favoring by CISA, the FBI, or NSA.  \nREFERENCES  \n[1] Joint NCSC -CISA UK Advisory: Further TTPs Associated with SVR Cyber Actors  \nhttps://www.ncsc.gov.uk/news/joint -advisory -further -ttps-associated -with-svr-cyber -actors  \n\n",
  "cves": [],
  "techniques": [
    "T1595.002",
    "T1090.003",
    "T1078",
    "T1552.004",
    "T1110.001",
    "T1555",
    "T1587.001",
    "T1190",
    "T1003.003",
    "T1558.003",
    "T1212",
    "T1059.003",
    "T1598",
    "T1110.003",
    "T1195.002"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "joint_csa_understanding_mitigating_russian_cyber_threats_to_us_critical_infrastructure_20220111",
  "source": "nsa",
  "id": "72d59c04511edef2410ffbd390f896497701c2c5aee495b4f6d34f6d523ae8b6"
}