{
  "markdown": "  \nU/OO/196888 -19 | PP-19-1293  | 7 OCTOBER 2019  \nNational Security Agency  | Cybersecurity Advisory  \nMitigating Recent VPN Vulnerabilities  \nActive Exploitation  \nMultiple Nation State Advanced Persistent Threat (APT) actors have weaponized CVE -2019 -11510, CVE -2019 -11539, \nand CVE-2018 -13379 to gain access to vulnerable VPN devices.  \nIn August, 2019, the Canadian Centre for Cyber Security released guidance for mitigating vulnerabilities in 3 major VPN \nproducts (Pulse Secure, Palo Alto GlobalProtect, and Fortinet Fortigate). Th at guidance lists indicators of \ncompromise for detecting malicious activity [1]. This Cybersecurity Advisory is intended to convey additional actions for \ncompromise recovery and longer -term actions for hardening.  \nMitigations for Pulse Secure VPN Client  \nOn April 24, 2019, security researchers released a series of vulnerabilities in the Pulse Secure VPN from version 5.1RX \nto 9.0RX [2]. These vulnerabilities allow for remote arbitrary file downloads and remote code execution on Pulse Connect \nSecure and Pulse  Policy Secure gateways. Other vulnerabilities in the series allow for interception or hijacking of \nencrypted traffic sessions. Exploit code is freely available online via the Metasploit framework, as well as GitHub. \nMalicious cyber actors are actively u sing this exploit code. System owners are strongly recommended to upgrade to the \nrespective versions listed in the table below [3].  \nAffected Versions  Recommended Patch Version Deployment  \nPulse Connect Secure 9.0RX  Pulse Connect Secure 9.0R3.4 & 9.0R4  \nPulse Connect Secure 8.3RX  Pulse Connect Secure 8.3R7.1  \nPulse Connect Secure 8.2RX  Pulse Connect Secure 8.2R12.1  \nPulse Connect Secure 8.1RX  Pulse Connect Secure 8.1R15.1  \nPulse Policy Secure 9.0RX  Pulse Policy Secure 9.0R3.2& 9.0R4  \nPulse Policy Secure 5 .4RX  Pulse Policy Secure 5.4R7.1  \nPulse Policy Secure 5.3RX  Pulse Policy Secure 5.3R12.1  \nPulse Policy Secure 5.2RX  Pulse Policy Secure 5.2R12.1  \nPulse Policy Secure 5.1RX  Pulse Policy Secure 5.1R15.1  \nCVE-2019 -11508 and CVE -2019 -11538 can also be mitigated by disabling File Share features on the Pulse Connect \nSecure device if such file sharing is not needed [3].  \nIt was previously reported that requiring certificate -based authentication would mitigate the CVE -2019 -11510 vulnerability, \nbut in fact th e vulnerability is still exploitable due to traversals from unauthenticated directories [4].  \nMitigations for Palo Alto VPN Client  \nVulnerability CVE -2019 -1579 against Palo Alto GlobalProtect VPN allows remote code execution and is being exploited in \nthe wi ld, according to researchers [5] [6]. Upgrade devices to the latest version.  \n\n \n \n U/OO/196888 -19 | PP-19-1293  | 7 OCTOBER 2019  2 \nNSA | Mitigating Recent VPN Vulnerabilities  \nMitigations for Fortinet Fortigate VPN Client  \nVulnerabilities in Fortinet Fortigate VPN devices have also been disclosed recently, including CVE 2018 -13379, and \nsecurity researche rs are reporting active exploitation [7]. Upgrading to the latest version will remove the vulnerabilities.  \nResetting Credentials  \nIf a malicious actor previously exploited the vulnerability to collect legitimate credentials, these credentials would still b e \nvalid after patching. NSA recommends resetting credentials after a vulnerable VPN device is upgraded and before it is \nreconnected to the external network:  \n Immediately update VPN user, administrator, and service account credentials.  \n Immediately revoke and generate new VPN server keys and certificates. This may require redistributing VPN \nconnection information to users.  \n If compromise is suspected, review accounts to ensure no new accounts were created by adversaries.  \nPublic -facing VPN Deployment & Hardenin g Controls  \nOnce credentials have been reset, the following actions will further harden the VPN:  \n Discourage use of proprietary SSLVPN/TLSVPN protocols. Transition SSLVPN/TLSVPN deployments to either \nIETF standard -conformant TLS - for single application use cases, or to IKE/IPsec VPNs, preferring the evaluated \nTLS software applications and IPSec VPN gateways/clients listed on the National Information Assurance \nPartnership (NIAP) Product Compliant List (PCL).  \n If continuing to use SSLVPNs, require public -facing  VPN web applications to only use strong TLS (i.e. TLS 1.2 or \nlater) for network traffic encryption, certificate -based authentication, and integrity.  \n Discourage the use of self -signed and wild card certificates for public -facing VPN web applications, and p eriodically \nrotate and update legitimate certificates.  \n Attackers that manage to compromise administrator credentials could try to authenticate into web management \ninterfaces and maliciously perform privileged operations. Do not allow VPN administrators to login to the \nmanagement interface via the public -facing VPN web application; instead, restrict administrative access to \ndedicated internal management networks. If an attacker tries to use administrator credentials to access the public -\nfacing VPN web applic ation, the access attempt should be denied, even if the credentials were correct.  \n Require mutual TLS authentication for remote TLS clients attempting to access the VPN. Solutions should be set to \ndrop connections with clients that do not present valid, tru sted TLS certificates.  \n Use multi -factor authentication to prevent attackers from authenticating with compromised passwords by requiring a \nsecond authentication factor [8].  \n Enable logging to record and track VPN user activity, including authentication and a ccess attempts, configuration \nchanges, and network traffic metadata (e.g. IP addresses, ports, protocols, and sessions).  \n Some VPN vendors may provide features that help enhance web application security to prevent attacks against \npublic -facing VPN web appli cations, such as malicious re -use of users previous, outdated sessions to bypass \nauthentication. Enable these features when possible. Pulse Secure provides session security guidance in their \nsecurity configuration best practices document [9]. Palo Alto pr ovides authentication session timeout settings in \ntheir documentation [10]. Review Fortinet documentation on authentication timeout settings to prevent session \nspoofing [11].  \n Deploy a web application firewall that can detect and block web application attac ks, like specially -crafted HTTP \nrequests containing malformed strings that exploit VPN vulnerabilities, in front of the VPN web application.  \n In cases where web traffic is encrypted, monitoring and detecting web application attacks may require tools that ca n \ninspect the encrypted traffic to see the underlying web plaintext.  \n Constantly follow VPN vendors to look for the latest updates, and apply the updates immediately to patch \nvulnerabilities and fix bugs.  \n Disable services (e.g. file share services) that cou ld be leveraged for post -compromise activities like lateral \nmovement, data exfiltration, and command and control.  \n\n \n \n U/OO/196888 -19 | PP-19-1293  | 7 OCTOBER 2019  3 \nNSA | Mitigating Recent VPN Vulnerabilities  \n Continuously monitor and conduct analytics on all logs to look for unauthorized access, malicious configuration \nchanges, anomalous network tra ffic, and other indicators of compromise [12].  \nWorks Cited  \n[1] Active exploitation of VPN vulnerabilities. Canadian Centre for Cyber Security, 28 August 2019. [Online] Available:  \nhttps://cyber.gc.ca/en/alerts/active -exploitation -vpn-vulnerabilities  \n[2] O. Tsai and M. Chang, Attacking SSL VPN  Part 3: The Golden Pulse Secure SSL VPN RCE Chain, with Twitter as Case Study! \nDEVCORE Security Consulting, 02 September 2019. [Online] Available: https://devco.re/blog/2019/09/02/attacking -ssl-vpn-part-3-the golden -\nPulse -Secure -ssl-vpn-rce-chain -with-Twitter -as-case -study/   \n[3] SA44101  2019 -04: Out -of-Cycle Advisory: Multiple vulnerabilities resolved in Pulse Connect Secure / Pulse Policy Secure 9.0RX. Pulse \nSecure, 20 August 2019. [Online] Available: https://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44101   \n[4] Multiple Vulnerabilities in Pulse Secure VPN. Carnegie Mellon University Software Engineering Institute, CERT Coordination Center, 16 \nOctober 2019. [Online] Available: https://www.kb.cert.org/vuls /id/927237   \n[5] CVE -2019 -1579. Common Vulnerabilities and Exposures. [Online database entry] Available: https://cve.mitre.org/cgi -\nbin/cvename.cgi?name=CVE -2019 -1579   \n[6] O. Tsai and M. Chang. Attacking SSL VPN  Part 1: PreAuth on Palo Alto GlobalProtect, with Uber as Case Study! DEVCORE Security \nConsulting, 17 July 2019. [Online] Available: https://devco.re/blog/2019/07/17/attacking -ssl-vpn-part-1-PreAuth -RCE -on-Palo-Alto-\nGlobalProtect -with-Uber -as-case -study/   \n[7] Z. Zorz. Attackers are targeting vulnerable Fortigate and Pulse Secure SSL VPNs. Help Net Security, 26 August 2019. [Online] Available: \nhttps://www.helpnetsecurity.com/2019/08/26/vulnerable -fortigate -pulse -secure -ssl-vpn/  \n[8] Transition to Multi -factor Authentication. National Security Agency, August 2019. [Online] Available: \nhttps://media.defe nse.gov/2019/Sep/09/2002180346/ -1/-1/0/TRANSITION TO MULTI -FACTOR AUTHENTICATION.PDF   \n[9] KB29805  Pulse Connect Secure: Security configuration best practices. Pulse Secure, 02 July 2019. [Online] Available: \nhttps://kb.pulsesecure.net/articles/Pulse_Secure_Article/KB29805   \n[10] HOW TO CONFIGURE AUTHENTICATION IDLE TIMEOUT. Palo Alto Networks, 05 August 2019. [Online] Available: \nhttps://knowledgebase.paloaltonetworks.com/KCSArticleDetail?id=kA10g000000Cm29CAC   \n[11] Configuring authenticated access. Fortinet. [Online] Available: https://help.fortinet.com/fos50hlp/54/Content/FortiOS/fortigate -authentication -\n54/Auth_Access.htm   \n[12] Continuously Hunt for Network Intrusions. National Security Agency, August 2019 . [Online] Available: \nhttps://media.defense.gov/2019/Sep/09/2002180360/ -1/-1/0/CONTINOUSLY HUNT FOR NETWORK INTRUSIONS.PDF    \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nMetaploit  is a registered trademark of Rapid7 LLC. GitHub is a registered trademark of GitHub, Inc. Pulse Secure is a registered tradem ark of Pulse \nSecure, LLC. Fortinet and FortiGate are registered trademarks of Fortinet, Inc. GlobalProtect is a trademark of Palo Alto Networks, Inc.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "mitigating recent vpn vulnerabilities - copy",
  "source": "nsa",
  "id": "d41ee3758972c0827c062a040c479a484cec5962da9653260b848d32da79d85a"
}