{
  "markdown": " \n \n \n \n 1 \nU/OO/163759 -18          PP -18-0389          May 2018  Mobile Device Best Practices When Traveling OCONUS  \nIn their brief history, mobile devices have evolved to become the critical link between a remote user and the home office, \nproviding travelers with access to business applications and data they would otherwise lack. Ensuring that this line of \ncommunication is private and secure is imperative. The security guidance outlined below applies to U.S. Government \npersonnel using Government -issued commercial mobile devices in a public network as they travel in foreign countries. \nThe purpose is to minimize an adversary's ability to obtain sensitive data through mobile devices and limit damage should \none be compromised. The mitigations address a ra nge of threats that might be encountered in foreign countries.  \nMobile devices have inherent vulnerabilities associated with their software and hardware. Foreign countries often leverage \ntheir security apparatus, especially airport security and customs, and  connections to the tourism industry, to conduct \nphysical attacks on mobile devices. Also, in many foreign countries the government has direct or proxy control of the \ncommercial cellular infrastructure, which gives them a remote conduit to attack connected  mobile devices. Cellular borne \nattacks are particularly damaging, as most mobile devices, as designed, trust the low level communication from the \ncellular network.  \nSuccessful exploitation can allow adversaries to remotely activate microphones and cameras,  geolocate and track specific \ndevices, and steal the information processed by or stored on the device. A compromised device can also be used as a \nvector to attack networks to which it later connects. High profile U.S. Government personnel are top targets a nd should \nnot carry or employ any commercial mobile devices in high threat environments.  \nFor those personnel that must carry and use unclassified official government -issued, commercial mobile devices when \ntraveling OCONUS, certain countermeasures can be em ployed to mitigate some of the vulnerabilities. These \nrecommendations are based on current DoD guidance and known security risks.  \nGeneral Risk Mitigations  \n Keep all software (operating systems and apps) up -to-date.  \n Use strong lock -screen pins/passwords (min imum 6 character length).  \n Set displays to automatically lock after 5 minutes or less.  \n Set password attempts to 10 or less.  \n Disable lock -screen notifications.  \n Encrypt data stored on devices.  \n Use a VPN and encrypted VoIP applications whenever possible. Ensu re that all VPN/VoIP providers are reputable \nand US -based.  \n Connect devices only to authorized computers and peripherals.  \n Cover all cameras with opaque tape and disable in settings whenever possible.  \n Install applications only from trusted sources.  \n Do not charge your devices by connecting them to charging stations, computers, televisions, DVRs, etc. Use only \nissued chargers or those acquired with sufficient OPSEC.  \n Do not open any unknown email attachments.  \n Do not click on any unknown web links sent via emai l or text messaging.  \n Do not circumvent restrictions on government issued devices.  \n Report suspicious device behavior to your IT department as soon as possible.\n\n \n \n2 U/OO/ 163759 -18          PP-18-0389          May 2018  Pre-Travel Guidance  \n Prepare dedicated devices with limited contacts and emails for the exclusive purpose of your imminent travel.  \n Acquire and install new SIM cards for the destination se rvice area. Using international SIM cards purchased \ndomestically is preferable; however, if this is not possible, make sure to utilize good OPSEC by purchasing SIM cards \nfrom standalone stores and not from a store or kiosk at the airport.  \nOn-Travel Guidan ce \n Maintain positive physical control of devices at all times (Do not leave in hotel safe).  \n Turn off unused wireless communications (e.g., Bluetooth1, NFC, Wi -Fi). \n Disable GPS and location services (unless required).  \n Do not connect to open Wi -Fi networks.  \n Do not connect personal devices with official devices.  \n Regularly inspect devices for signs of tampering.  \n Avoid logging into USG networks unless absolutely necessary.  \n Avoid surrendering devices to Foreign Customs Officials.  \nPost-Travel Guidance  \n Physically inspect your travel devices.  \n Wipe and reload your travel devices.  \nDisclaimer of Warranties and Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  Refer ence herein to any  \nspecific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or im ply its endorsement,  \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertis ing or product endorsement purposes.  \nContact Information  \nClient Requirements or General Cyber security Inquiries  \nCybersecurity Requirements Center (CRC), 410 -854-4200, email: Cybersecurity_Requests @nsa.gov  \n \n                                                \n1 Bluetooth is a registered trademark of Bluetooth SIG, Inc.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "mobile device best practices when traveling oconus - copy",
  "source": "nsa",
  "id": "544aafdabebfa3e92965b2b695a8946fa8b2527ce6e0c7c1d8094e965977ea84"
}