{
  "markdown": "  \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  \nNational Security Agency | Cybersecurity Information  \nSelecting Secure Multi -factor Authentication Solutions  \nUnited States Government Agencies are required by the Federal Information System Management Act (FISMA) to utilize \nPersonal Identity Verification ( PIV) cards to authenticate employees to official information systems. During a global \npandemic or in other scenarios where authorized users do not have access to government furnished equipment (GFE) or \ncannot utilize a  PIV card, using other strong authentication mechanisms becomes necessary and unavoidable.1, 2 \nU.S. Government Agencies and their partners who want to integrate secure alternatives to PIV -based authentication  need \nto support authorized users who will be employi ng persona lly owned or partner -owned devices , such as smart phones \nand home or non -government office computers , to access government or partner information systems containing sensitive \ninformation. By using the objective criteria in this guidance, government organiz ations can make  better informed decisions \nabout which multi -factor solutions meet their particular needs. And b y following the practical guidelines, users can reduce \ntheir risk exposure and become harder targets for malicious threat actors.3 \nCriteria to co nsider when selecting a multi -factor authentication solution  \nThe National Institute of Standards  and Technologys Computer Security Resource Center recently updated its Digital \nIdentity Guidelines4 (SP 800 -63-3). It provides standard definitions and assign s assurance levels for various \nauthentication solutions. The criteria below reflect NISTs requirements to  ensure that a solution is validated to resist a \nnumber of common exploits.  \nA complete authentication solution must be properly implemented using standard, validated mechanisms . It must also \ninclude authenticators, validators , and supporting lifecycle processes. Some commercial solutions focus on authenticators \nand require an organization to manage validators and lifecycle processes. Other commercia l solutions validate multiple \ntypes of authenticators, manage multi -step authentication mechanisms, and manage trust in authenticators from various \nidentity providers in support of multiple services. These often require the customer to acquire one or more authenticator \nsolutions and configure servers to accept the assertions of an authentication server that performs identity federation. SP \n800-63-3 also includes criteria for identity federation.  \nNISTs  Digital Identity Guidelines  consists of the following three parts : \n SP 800 -63-3 Part A  defines identity vetting processes that are expected to be managed by the organization as part \nof their identity lifecycle management. Part A is n ot covered in this document . \n SP 800 -63-3 Part B  defines three authenticator ass urance levels (AAL) for authenticators. Government Agencies \nrequire AAL 2 solutions for access to official information systems, and may require AAL 3 solutions for access to \nsensitive or mission critical information; solutions that do not align to SP 800 -63-3, or which only provide AAL 1 \nmechanisms, are not discussed  in this document .  \n SP 800 -63 Part C  discusses identity federation and defines three Federation Assurance Levels (FAL).  \nTo provide a complete and secure authentication solution for your organiz ation, evaluate possible solutions against  the \nfollowing criteria : \n1. Does the solution adequately protect the authenticator from common exploitation techniques?  Most \nauthentication solutions depend on secret keys that require integrity protection , protection  from disclosure , and \nproperly implemented secure random number generators and cryptography.  \n                                            \n1 This is also true for collaboration scenarios where some authorized users cannot obtain a PIV card.  \n2 For more information, please refer to Transition to Multi -factor Authentication,  part of NSAs Cybersecurity Top Ten Mitigations.  \n3 Individual departments and agencies may provide specific services or issue specific direction for their teleworkers. T his document does not override or supersede any official guidance \nprovided by your organization. Consult your department or agency IT support or CIO organization for further guidance.  \n4 See csrc.nist.gov/publications/detail/sp/800 -63/3/final  \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  2 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \n2. Does the solution ensure the validator is effective in confirming that a request for access is from the user \nbound to the authenticator?  Confirming this binding r equires proof -of-possession of what you have and \nevidence that what you know and/or what you are have been confirmed.  \n3. Are communications among components of the authentication solution adequately protected using \nstrong, well -known , and testable crypt ographic standards?  Communications need integrity  protection , source \nauthentication, and/or encryption to protect authentication evidence from modification or replay.  \n4. Does the solution provide  support  for managing the lifecycle of digital identities and au thenticators?  \nOrganizations are responsible for the lifecycle management of digital identities . Solutions that support  these \nactivities can be more easily  managed , and therefore often more securely managed . \n5. If the solution authenticates a users request on behalf of a requested service, does the solution securely \ncommunicate that authentication to the requested service?  Secure integration of an authentication solution \ninto existing mechanisms ensures that the  solution does not allow malicious actors to bypass authentication.  \nThe detailed criteria used to answer these questions depend on the type of multi -factor authentication mechanism used. \nSP 800 -63-3 defines a number of single response multi -factor mechanis ms, as well as combinations of single -factor \nmechanisms (referred to as multi -step authentication mechanisms) suitable for AAL 2 or AAL 3. The authenticator type \ncan be implemented in a hardware device ( e.g., a key -chain fob) or by software installed on a mobile device.  \nSingle response, multi -factor authentication mechanisms require activation of  the device, either with a PIN/p assword or \nbiometric. The device provides what you have and activation of the device implies that what -you-know or what -you-are \nhas been verified.  \nOn the other hand, multi -step authenticators often include a password to provide what -you-know and another \nauthenticator that provides what -you-have. Note that SP 800 -63-3 Part B de fines the requirements for PIN/p assword \nactivatio n differently from the passwords that are used directly to  provide what -you-know. PINs/p assword s used for \nactivation of an authenticator device are typically 6 -to-8 characters and the device integrates thresholds to address \npass word guessing attacks, whe reas p asswords used directly are required to be longer and have complexity \nrequirements.  \nUsing multi -factor authentication  services securely  \nIf possible, use GFE that is managed and intended for government use only.  No authentication mechanism can \ndefend against a compromised device. Personal devices are often exposed to considerable risk of compromise due to \nfailure to apply patches in a timely fashion  or installing an application that users fail to recognize as being malicious. \nResulting malware infectio ns can interface with connected authenticators to initiate unauthorized accesses  or replay a \npasscode input into the compromised device. This is true for PIV authentication as well as the alternative authentication \nmechanisms discussed in this document . \nCarefully managed GFE devices are often more secure than personal devices , unless configuration control policies delay \nthe deployment of critical patches. If GFE is available, it should be used. If GFE cannot be used, NSA recommends a \ntemporary secure operat ing system such as the publicly -available DoD  Trusted End Node Security (TENS) solution to \ncreate a virtual GFE.5 If neither is practical, device owners  should ensure that user accounts do not have administrator \nprivileges (which are only  for managing the system). I f possible , device owners  should also  create a separate user \naccount with low privileges for only work use.6 \nEnsure all components of the authentication solution are securely integrated.  Integrating multi -factor authentication \ntechniques into customer servers can be challenging. Even for PIV, it is important to pay attention to validator \n                                            \n5 For more inf ormation about TENS, please see www.tens.af.mil/ . \n6 For more information on protecting personal devices, please refer to NSAs Best Practices for Keeping Your Home Network Secure . \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  3 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \nconfigurations to ensure that the authentication mechanism is not easily bypassed . When configuring commercial multi -\nfactor authentication solut ions: \n Use only configurations  that support  approved authenticators . \n Ensure that all software components (client agents, authentication software, platform O/S, and validation  softwar e) \nare patched and up -to-date. \n Support the digital identity and authenticat or specific lifecycle requirements . \n Monitor  for unexpected or malicious behaviors.  \nTrain all users on the proper handling of authenticators.  Users must not disclose what -you-know and maintain  \ncontrol of authenticators that convey what -you-have. In addi tion to understanding these responsibilities, users need to \nknow how to report a potential compromise resulting from inadvertent loss of control of devices  or authenticators .  \nAssessment of common multi-factor authentication solutions  \nThe following table, based on publicly available information, illustrates how various common solutions claim to meet the \nSP 800 -63-3 criteria for the types of mechanisms supported. The list below includes common  solutions that completed \nFederal Information Processing Standard (FIPS ) validation within the last 2 years as well as those non-FIPS -validated \nsolutions with current DoD approvals. Where the authenticator or validator is FIPS 140 -2 validated, the certificate number \nis listed. On -premises implementations of the va lidator  require NIST SP 800 -53 m oderate baseline se curity controls for \nAAL 2, and h igh baseline controls for AAL 3, as noted  in the validator column  other dependencies are listed specifically. \nPartial AAL compliance refers to solutions where evidence of complia nce is lacking  with the specific requirement that is \nneeded noted. Since the criteria depend on the specific type of authenticator, this is denote d in the Type column of the \ntable using the following key : \nKey:  Authentication method  Multi -factor authent icator  Form factor  \nOut-of-Band (OOB)  Multi -factor - PIN/p assword or Biometric Activation (MF)  Device (D)  \nOne-Time Password (OTP)  Single factor - Activation Not Required (SF)  Software (SW)  \nCryptographic Signature (Crypt)    \nDirect Password (PW)    \n \nTable I : Examples of Multi -factor Authentication Solutions  - alternatives to PIV  \nSolution  Type and AAL  Authenticator  Validator  Secure \nchannel  Lifecycle \nsupport  Federation  \nDuo Federal \nMFA7: Duo \nMobile \nPasscode  PW (provided by \nclient, server)   \n+ \nSF-OTP-SW \n \nAAL 2  dependent \non client,  server  FIPS validated \n(#2671)  \n \nDuo Mobile Passcode   \nSW installed on:  \n iOS 6+ \n Android 3.25 + \n Windows Phone 2.0 +  FEDRAMP8 \napproved  \n \nDepends on  \ncomplian t \nnative logon  TLS 1.2  \nHTTPS \n(StartTLS) , \nLDAPS  \n \nNative logon \nuses RDP  Device and \nUser \nEnrollment  \n \nAuthenticator \nRevocation  Authentication \nAgent and \nProxy \nintegrate with \nFIPS \nvalidated \nWindows9: or \nLinux10 OS \n                                            \n7 Refer to Ciscos Duo Security Achieves FedRAMP Authorization ( blogs.cisco.com/government/fedramp -authorization -cisco -duo-security ) for vendor claims. Refer to Guide to Duos \nFederal Editions ( duo.com/docs/duo -federal -guide ) for guidance and dependency information. Cisco is a registered trademark of Cisco Systems, Inc..  \n8 Refer to fedramp.gov/assets/documents/CSP_Digital_Identity_requirements.pdf  for SP 800 -63-3 B AAL 2 compliance.  \n9 Windows is a registered trademark of Microsoft Corporation . \n10 Linux OS is a registered trademark of Linus Torvalds . \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  4 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \nSolution  Type and AAL  Authenticator  Validator  Secure \nchannel  Lifecycle \nsupport  Federation  \nDuo Federal \nMFA11: Duo \nMobile Push  PW ( provided by \nclient, server)  \n+  \nSF-OOB -SW  \n \nAAL 2   dependent \non client, server  FIPS validated \n(#2671)  \n \nDuo Mobile Push SW \ninstalled on:  \n iOS 6+12 \n Android 3.25 +13 \n Windows Phone \n2.0+14 FEDRAMP15 \napproved  \n \nDepends on \ncompliant  \nnative logon  TLS 1.2  \nHTTPS \n(StartTLS) , \nLDAPS  \n \nNative logon \nuses RDP  Device and \nUser \nEnrollment  \n \nAuthenticator \nRevocation  Authentication \nAgent and \nProxy \nintegrate with \nFIPS \nvalidated \nWindows or \nLinux OS \nDuo Federal \nMFA16: Third \nParty Token  PW (provided by \nclient, server)  \n+  \nSF authenticator  \n \nor \n \nMF authenticator   \n \nAAL 2 dependent on \ntoken, client,  server.  Requires FIPS \nvalidated token   \n \nSupports:  \n Yubikey OTP17 \n WebA uthn Crypt  \nTokens  FEDRAMP18 \napproved  \n \nUse of PW \ndependent on  \ncomplian t \nnative logon  TLS 1.2  \nHTTPS \n(StartTLS) , \nLDAPS  \n \nNative logon \nuses RDP  Device and \nUser \nEnrollment  \n \nAuthenticator \nRevocation  Authentication \nAgent  and \nProxy \nintegrate with \nFIPS \nvalidated \nWindows or \nLinux OS \nGoogle19 \nAuthenticator  PW (provided by \nclient, server)   \n+ \nSF-OTP  \n \nPartial AAL 2  \nrequires integration \ninto FIPS validated \nplatform; dependent \non client, server, \nvalidator  Open source app \nrequires integration \ninto FIPS validated \nplatform20  \n \nSupports : \n Android \n BlackBerry21 \n iOS Requires \ncompliant \nvalidator  Dependent \non client, \nserver us ing \nTLS 1.2  No information  \nprovided  Dependent on \nvalidator \ncapabilities  \n                                            \n11 Refer to Ciscos Duo Security Achieves FedRAMP Authorization ( blogs.cisco.com/government/fedramp -authorization -cisco -duo-security ) for vendor claims. Refer to Gu ide to Duos \nFederal Editions ( duo.com/docs/duo -federal -guide ) for guidance and dependency information.  \n12 iOS is a registered trademark of Cisco Systems, Inc. in the United States and other countries  and is used under license to Apple, Inc.  \n13 Android  is a registered trademark of Google LLC.  \n14 Windows Phone is a registered trademark of Microsoft Corporation . \n15 Refer to fedramp.gov/assets/documents/CSP_Digital_Identity_requirements.pdf  for SP 800 -63-3 B AAL 2 compliance.  \n16 Refer to Ciscos Duo Security Achieves FedRAMP Authorization  (blogs.cisco.com/government/fedramp -authorization -cisco -duo-security ) for vendor claims. Refer to Guide to Duos \nFederal Editions ( duo.com/docs/duo -federal -guide ) for guidance and dependency information.  \n17 Yubico  is a registered trademark of Yubico or Yubicos Licensors . \n18 Refer to fedramp.gov/assets/documents/CSP_Digital_Identity_requirements.pdf  for SP 800 -63-3 B AAL 2 compliance.  \n19 Google is a registered trademark of Google, Inc.  \n20 Refer to github.co m/google/google -authenticator/wiki . No FIPS 140 -2 claims for current proprietary implementations.  \n21 BlackBerry is a registered trademark of BlackBerry . \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  5 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \nSolution  Type and AAL  Authenticator  Validator  Secure \nchannel  Lifecycle \nsupport  Federation  \nMicrosoft \nAuthenticator  PW  \n+  \nSF-OTP \n \nPartial AAL 2   \nrequires integration of \nSW into FIPS \nvalidated platform . Not FIPS validated22  \n \nSupports : \n Android \n iOS \n Win 10 Mobile23 \n Windows Phone \n8.0, 8.1  Government \ncloud services  \nFEDRAMP  \napproved24 TLS 1.2 \nsupported  Guidance \nprovided for \nadmin istrators  Integrated into \nAzure25 \nAD26 \nMicrosoft \nAzure Multi -\nfactor27: \nThird Party \nOATH HW  \nToken  PW \n+ \nSF/MF-OTP \n \nor \n \nAAL 2/3 dependent  \non token  Requires FIPS \nvalidated token  Government \ncloud services  \nFEDRAMP \napproved28 TLS 1.2 \nsupported  Guidance \nprovided for \nadmin strators  Integrated into \nAzure AD \nOKTA29 \nVerify  \n(FIPS 140 -2 \nvalidated \noption)30 PW  \n+  \nSF-OTP \n \nAAL 2   dependent \non validator  FIPS validated \n(#3344)  \n \nSW installed on:  \n iOS 7+ \n Android 6+ FIPS \nvalidated \ncrypto \n(#3344)   \n \nDependent on \nSP 800 -53 \ncontrols  Enforces TLS \n1.2 Device and \nUser \nEnrollment  \n \nPost \nEnrollment (to \nadd additional \nauthenticators)  \n \nAuthenticator \nExpiration  and  \nRevocation  Integrates \nwith FIPS \nvalidated \nWindows \nOKTA  \nThird party  \nOTP HW  PW \n+ \nSF/MF -OTP \n \nAAL 2  token , \nvalidator  dependent  Requires FIPS \nvalidated token  \n \nSupports:  \n Google \nAuthenticator  \n Duo Mobile \nPasscode  \n RSA31 SecurID  \n WebAuthn token  \n Yubikey OTP FIPS \nvalidated \ncrypto \n(#3344) for \nOTP \n \nDependent on \nSP 800 -53 \ncontrols  Enforces TLS \n1.2 Device and \nUser \nEnrollment  \n \nPost \nEnrollment (to \nadd additional \nauthenticators)  \n \nAuthenticator  \nExpiration  and \nRevocation  Integrates \nwith FIPS \nvalidated \nWindows \n                                            \n22 Beraud, P. Jumelet, A., & Grasse, J. (2015) Leverage Azure Multi -Factor Authentication with Azure AD  Microsoft (pp. 1 -40, Rep). Microsoft France  \n23 Windows is a registered trademark of Microsoft Corporation in the United States and/or other countries.  \n24 Refer to docs.microsoft.com/en -us/Microsoft -365/compliance/offering -fedramp?view=o365 -worldwide.  Compliant with FedRamp High controls (SP 800 -53, SP  800 -63B AAL 3).  \n25 Azure is a registered trademark of Microsoft Corporation in the Unit ed States and/or other countries.  \n26 Active Directory (AD)  is a registered trademark of Microsoft Corporation in the United States and/or other countries.  \n27 Refer to docs.microsoft.com/en -us/azure/active -directory/authentication/concept -mfa-howitworks . Supports OATH compliant tokens.  \n28 Refer to docs.microsoft.com/en -us/Microsoft -365/compliance/offering -fedramp?view=o365 -worldwide. . Compliant with FedRamp High controls. Refer to \nfedramp.gov/as sets/resources/documents/CSP_Digital_Identity_requirement.pdf  for SP 800 -63-3B AAL 3 compliance.  \n29 OKTA is a registered trademark of Okta, Inc.  \n30 Refer to www.okta.com/blog/2019/01/okta -releases -fips-140-2-validated -encryption -in-okta-verify  for details about Oktas FIPS 140 -2 claims.  \n31 RSA is a registered trademark of RSA Security LLC.  \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  6 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \nSolution  Type and AAL  Authenticator  Validator  Secure \nchannel  Lifecycle \nsupport  Federation  \nOneLoginTM32 \nProtect33 PW  \n+  \nOTP  \n \nPartial AAL 2   \nrequires authenticator \nintegration into FIPS \nvalidated platform , \nand additional \nvalidator controls . No FIPS 140 -2 \nvalidation.  \n \nSolutions for:  \n iOS \n Android AICPA SOC \ncompliant34  \nNo FIPS 140 -\n2 validated \ncrypto  No specific \nreference to \ntraffic \nprotection  No details \nindicated  SAML, \nOpenAuth  \nWebauthn \nassertions  \nOneLoginTM  \nPKI Browser \nCertificate35 PW +  \nSF-Crypt -SW  \n \nPartial AAL 2   \nrequires additional \nvalidator controls;  \ndependent on client .  Dependent on \nintegration in to FIPS \nvalidated client \nbrowser or OS  AICPA SOC \ncompliant36  \nNo FIPS 140-\n2 validated \ncrypto  No specific \nreference to \ntraffic \nprotection  No details \nindicated  SAML, \nOpenAuth  \nWebauthn \nassertions  \nOneLoginTM, \nThird party \ntoken  Third party  token  \n \nPartial AAL 2   \nrequires additional \nvalidator controls, \nFIPS; dependent on \ntoken  Requires FIPS \nvalidated token  \n \nSupports : \n Duo37 Mobile \nPush \n Google \nAuthenticator  \n Google TitanTM38 \n RSE SecurID39 \n YubiKey \n WebAuthn  AICPA SOC \ncompliant40  \nNo FIPS 140 -\n2 validated \ncrypto  No specific \nreference to \ntraffic \nprotection  No detail s \nindicated  SAML, \nOpenAuth  \nWebauthn \nassertions  \n                                            \n32 OneloginTM is a registered trademark of Onelogin . \n33 Refer to onelogin.com/kb_view_customer.do?sysparm_article=KB0010426 , for a general description, as well as onelogin.com/kb_view_customer.do?sysparm_article=KB0010517  \n(iOS), and onelogin.com/kb_view_customer.do?sysparm_article=KB001011  (Android) for information r egarding the solutions implementation for a particular device type.  \n34 Refer to onelogin.com/compliance : OneLogin claims compliance with AICPA, ISO, and CSA STAR, none of which fully address SP -800-53 baseli nes (refer to \naicpa.org/interestareas/frc/assuranceadvisoryservices/aicpacybersecurityinitiative.html  for comparison). OneLogin also claims sec urity controls are aligned with SP 800 -53, but with no \nclaims for compliance to baselines.  \n35 Refer to onelogin.com/kb_view_customer.do?sysparm_article=KB0010604 . Only suppo rts OneLogin certificates; Certification authority (part of validator function) is not NIAP \nvalidated.  \n36 Refer to onelogin.com/compliance : OneLogin claims compliance with AICPA, ISO, and CSA STAR, none of which fully address SP -800-53 baselines (refer to \naicpa.org/interestareas/frc/assuranc eadvisoryservices/aicpacybersecurityinitiative.html  for comparison). OneLogin also claims security controls are aligned with SP 800 -53, but with no \nclaims for compliance to baselines.  \n37 Duo is a registered trademark of Duo Security, Inc.  \n38 Google TitanTM is a registered trademark of Google , Inc.  \n39 RSE is a registered trademark of EMC Corporation in the United States and/or other countries.  \n40 Refer to onelogin.com/compliance : OneLogin claims compliance with  AICPA, ISO, and CSA STAR, none of which fully address SP -800-53 baselines (refer to \naicpa.org/interestareas/frc/assuranceadvisoryservices/aicpa cybersecurityinitiative.html  for comparison). OneLogin also claims security controls are aligned with SP 800 -53, but with no \nclaims for compliance to baselines.  \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  7 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \nSolution  Type and AAL  Authenticator  Validator  Secure \nchannel  Lifecycle \nsupport  Federation  \nRSA \nSecurID41 \nSID 800 HW  MF-OTP \n \nPartial AAL 2   \nrequires FIPS \nvalidated token or \nintegration into FIPS \nvalidated platform; \ndependent on \nvalidator controls  Partial FIPS 140 -2 \nvalidation42 (#844)  \n \nApproved for DoD  Authentication \nmanager \nv8.2+  \nFIPS 140 -2 \nvalidated \n(#3184)  \n \nDependent on \nSP 800 -53 \ncontrols  Compliant  \nTLS 1.2  Token \nmanagement \nsupport  Agent \nintegrates \nwith FIPS \nvalidated \nWindows or \nLinux OS; \nSAML \nassertions  \nRSA \nSecurID \nSID 700 HW  MF-OTP \n \nPartial AAL 2   \nrequires FIPS \nvalidated token ; \ndependent on \nvalidator controls  Not FIPS 140 -2 \nvalidated43 \n  \nApproved for DoD  Authentication \nmanager \nv8.2+  \nFIPS 140 -2 \nValidated \n(#3184)  \n \nDependent on \nSP 800 -53 \ncontrols  Compliant  \nTLS 1.2  Token \nmanagement \nsupport  Agent \nintegrates \nwith FIPS \nvalidated \nWindows or \nLinux OS \nRSA \nSecurID \nSW tokens  MF-OTP \n \nAAL 2   dependent \non validator controls  \n SW installed on FIPS \nvalidated device:  \n iOS 2.4.6 - 2.4.8 \n(#3172)  \n Android 2.4 -2.71 \n(#2097)  Authentication \nmanager \nv8.2+  \nFIPS 140-2 \nValidated \n(#3184)  \n \nDependent on \nSP 800 -53 \ncontrols  Compliant  \nTLS 1.2  Token \nmanagement \nsupport  Agent \nintegrates \nwith FIPS \nvalidated \nWindows  or \nLinux OS \nYubikey OTP \n(touch)44 PW (Provided by \nclient, server)  \n+  \nSF-OTP-D \n \nPartial AAL 2  \nrequires compliant \nvalidator;  \ndependent on client, \nserver  \n FIPS validated \n(#3517)  \n \nApproved for DoD  Requires \ncompliant \nvalidator  Dependent \non client, \nserver use of \nTLS 1.2  Token \nmanagement \nsupport  Dependent on \nvalidator \ncabilities  \n                                            \n41 RSA is a registered trademark of EMC Corporation in the United States and/or other countrie s. \n42 Refer to community.rsa.com/docs/DOC -46887 : SID 800 in FIPS mode uses a FIPS validated chip and OS  \n43 Refer to community.rsa.com/docs/DOC -46887 : SID 700  is not FIPS validated.  \n44 Refer to www.yubico.com/solutions/cybersecurity -compliance . Yubikey in OTP mode and configured for touch activati on is an authenticator that can interface with a SP 800 -63-3 AAL \n2 compliant validator and an existing password -based logon, to create an AAL 2 compliant solution.  \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  8 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \nSolution  Type and AAL  Authenticator  Validator  Secure \nchannel  Lifecycle \nsupport  Federation  \nYubikey U2F \n(touch)45 PW (Provided by \nclient, server)  \n+ \nSF-Crypt -D \n \nPartial AAL 2   \nrequires compliant \nvalidator;  \ndependent on client, \nserver  FIPS validated \n(#3517)  \n \nApproved for DoD  Requires \ncompliant \nvalidator  Dependent \non client, \nserver use of \nTLS 1.2  Token \nmanagement \nsupport  Dependent on \nvalidator \ncapabilities  \nYubikey OTP \n(fingerprint, \nPIN)46 MF-OTP-D  \n \nPartial AAL 2   \nrequires compliant \nvalidator;  dependent \non client, server  FIPS validated \n(#3517)  \n \nApproved for DoD  Requires \ncompliant \nvalidator  Dependent \non client, \nserver use of \nTLS 1.2  Token \nmanagement \nsupport  Dependent on \nvalidator \ncapabilities  \nYubikey \n(U2F/PIV)  MF-Crypto -D  \n \nPartial AAL 3   \nrequires compliant \nvalidator; dependent \non client, server.  FIPS validated \n(#3517)  \n \nApproved for DoD  Requires \ncompliant \nvalidator  Dependent \non client, \nserver use of \nTLS 1.2 with \nclient \nauthentication  Token \nmanagement \nsupport  Dependent on \nvalidator \ncapabilities  \nSome commercial solutions support additional multi -factor authentication methods not defined in SP 800 -63-3 for AAL 2 \nor 3. While such solutions might arguably provide better authentication than username/password alone, it is not clear that \nall desired features are provided. For example, SMS authentication (OOB) is not recommended without mitigations \nbecause it is f airly simple to redirect SMS messaging and defeat the what you have factor. Also, biometric authentication \nfor uses other than activation of a user device is not recommended. The majority of biometric solutions used in a user \nauthentication setting do no t have independent certification of accuracy or security . Examples of programs providing \nindependent verification of biometric solutions include those associated with  FIPS 201 (PIV) systems47, and an emerging \neffort associated with the FIDO Alliance48. Simil arly, combinations of single -factor authenticators not identified in SP 800 -\n63-3 in support of AAL 2 or AAL 3 might not combine effectively to meet the desired strength. This document does not \naddress vendor claims that are inconsistent with SP 800 -63-3. \n  \n                                            \n45 Refer to www.yub ico.com/solutions/cybersecurity -compliance . Yubikey, in U2F mode and configured for touch activation is an authenticator that can interface with a SP 800 -63-3 AAL \n3 compliant validator and an existing password -based logon, to create an AAL 2 or AAL 3 comp liant solution depending on the client and validator.  \n46 Refer to www.yubico.com/solutions/cybersecurity -compliance . Yubikey, in U2F or PIV mode, configured for fingerprint or PIN ac tivation, is an authenticator that can interface with a SP \n800-63-3 AAL 3 compliant validator to create an AAL 3 compliant solution.  \n47 Refer to idmanagement.gov/sell/fips201/  \n48 Refer to fidoalliance.org/certification/biometric -component -certification . \n\n \n \nU/OO/170915 -20 | PP-20-0839  | Sept 2020 ver. 1.0  9 \nNSA | Selecting Secure Multi -factor Authentication Solutions  \n \nPurpose  \nThis document was developed in furtherance of NSAs cybersecurity missions, including its responsibilities to identify and di sseminate threats to \nNational Security Systems, Department of Defense, and Defense Industrial Base information systems an d to develop and issue cybersecurity \nspecifications and mitigations, as well as to assist Executive departments and agencies with operations security programs.  T his information may be \nshared broadly to reach all appropriate stakeholders.  \nDisclaimer of End orsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nNote that this does not constitute a Qualified Products List, wi thin the meaning of the definition of Federal Acquisition Regulation (FAR) 2.101 or a \nQualified Manufacturers List under FAR subpart 9.2 Qualification Requirements. The government has not undertaken any testing or evaluation of the \nproducts listed under th is analysis, but has only reviewed the published attributes of the products. The list is not all -inclusive. This list may be amended \nand supplemented from time to time as market research discloses other items or new products become available. The descripti ons and procedures \nexplained in this document do not constitute or imply an endorsement by NSA/CSS, DoD, or USG of the products in question. It is intended solely for the \nnon-commercial use of USG personnel for purpose of explaining and giving operating in structions for the use of the particular product in question. Any \nfurther use for other purposes is prohibited.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "multifactor_authentication_solutions_uoo17091520",
  "source": "nsa",
  "id": "eded7f29ed1e2d6f13ae6f1d07a435ffd2cbfa6f81be29a8ba6b4ced5ee7ac21"
}