{
  "markdown": "NCTOC TOP 5 SECURITY OPERATIONS CENTER (SOC) \nPRINCIPLES \nNSA's Cybersecurity Threat Operations Center (NCTOC) serves as the foca l point for execution of the agency's 24/7/365 \ncybersecurity operations mission. NCTOC leverages unique insights into adversary intentions and tradecraft to develop \nand implement strategic defense measures for the nation's most critica l networks. NCTOC resources fully equipped \nteams who partner with U.S. Cyber Command to serve as the 'front lines' in defending the unclassifi ed Department of \nDefense Information Network (DoDIN), a global network encompassing 3 million global users everywhere from office \nbuildings i n Wash ington DC, to battlefields in Afghanistan. This enormous footprint encounters a wide variety of cyber \nthreats on a daily basis, and from our years of exper ience NCTOC offers the following 5 key principles for those who \noperate in, or oversee, a Security Operations Center (SOC): \n1) Establish a defendable perimeter \nOver the last severa l years, the DoDIN network infrastructure has been consolidated so rather than hundreds of enclaves \nwith direct connect ions to the Internet, DoDIN traffic is routed through a very finite number of Internet-fac ing gate ways. \nThis results in centra lized coverage on over 99% of network traffic , sharpen ing the ability to detect threats while reduc ing \nthe potential attack surface an adversary can potentially exploit. A defensib le perimete r should also utilize a combination \nof known indicators, heur istics, and behav ioral analysis, deployed across an array of host-based (compute r/endpoint) and \nnetwork-based (boundary protect ion) platforms , to see and act upon cyber activity in real time. \n2) Ensure visibility across the network \nVisibility and continuous monitoring of network traffic must encompass all levels of the network, to include gateway, \nmidpoint, and endpo ints. If a rule-set alerts at the network level, analysts must be able to pinpoint and isolate the actua l \nend-host which generated the activity. The efficacy of this process shou ld be measured in minutes, not hours . \nFurther more, as the majority of network traffic becomes encry pted, SOCs must architect solutions to ensure v isibility \nagainst soph isticated threats who blend into legitimate activity. \n3) Harden to best practices \nIncidents are most often a result of vulnerable networks that are not comp liant with current software and hardware \nupdat es, as well as substandard security practices such as using applications that are no longer vendor-supported. \nFurth ermore, when an exploit is disclosed or a patch is released, within 24 hours the DoDIN is scanned for unpatched \nservers by malicious actors. Therefore applying updates in a timely manner to reduce vulnerability exposure and \nmax imize software reliability and protections rema ins one of the best defense practices NCTOC can advocate. \n4) Use comprehensive threat intelligence and machine learning \nCustomized threat intelligence sources are recommended to be tailored based on the network environment. For examp le, \nthe DoDIN may not be subject to the same cyber threat activity that a hosp ital network may encounter. SOCs should \nunderstand the defensive arch itecture that is already in place, determine what network assets may be of value to an \nadversary, and tailor threat intelligenc e feeds accord ingly. Furthermore, when faced with an overwhelming amount of \nthreat intelligence or network activ ity alerts, SOCs shou ld employ data science and mach ine learning concepts to \nexpeditiously distill this volume into actionable results. Security teams should have the capac ity to both respond to pre\nexisting alerts, and proactiv ely hunt for previously undetected threat activ ity across the network. \nPP-18-0079 29 MARCH 2018 \n\n \n \n2 PP-18-0079          29 MARCH  2018  \n 5) Create a culture of curiosity \nCybersecurity metrics based on how fast an incident ticket is closed can be misleading.  Responders may focus on \nclosing the alert, as opposed to seeking a holistic understanding of the threat activity.  Incident responders should be \nchallenged to anticipate reactions that would be used against newly implemented countermeasures, as a persiste nt \nadversary may continue to probe for entry points into a network of interest.  SOCs should always strive to preemptively \ndefensive actions and infuse an innovative mentality amongst their teams in pursuit of new adversary tradecraft. \nTAGS  \nCybersecurity, NCTOC, DoDIN, Security, SOC, Operations Center  \nDISCLAIMER OF WARRANTIES AND ENDORSEMENT \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees.  \nReference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endorsement purposes. \nCONTACT INFORMATION \nClient Requirements or General Cybersecurity Inquiries \nCybersecurity Requirements Center (CRC)  \n410-854-4200 \nEmail: Cybersecurity_Requests@nsa.gov \n  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "nctoc-top-5-soc-principles",
  "source": "nsa",
  "id": "02ad95a45c2cab755ed9a9933d7073e703a3da58d77e1eba9a46135da3357a18"
}