{
  "markdown": "2023 NSA Cybersecurity\nYear in Review.\n\n\nwww.NSA.gov/cybersecurityWelcome\nSince World War II, the National Security Agency (NSA) and \nits predecessors have protected the United States most \nsensitive information. As technological advancements have \ncreated a more interconnected world with ever-increasing \nthreats, NSAs mission has expanded. NSA has embraced new responsibilities and operational authorities to ensure our networks remain secure.\nToday, NSAs cybersecurity mission integrates cryptographic \nexpertise, foreign signals intelligence, vulnerability analysis, \ndefensive operations, and more to prevent and eradicate cyber threats to three key areas.\nNSA Cybersecurity protects and defends:\n National Security Systems (NSS):  Networks that \ncontain classified information or are otherwise critical \nto United States military and intelligence activities. It \nis vital that these networks remain secure to ensure \nU.S. warfighting capabilities are mission-ready and to \nprotect the nations most sensitive information.\n The Department of Defense (DoD):  U.S. Military \nservices and combatant commands as well as U.S. \ngovernment agencies and departments related to \nnational security.\n The Defense Industrial Base (DIB): The ever-growing \ngroup of companies that design, develop, operate, \nand maintain the Department of Defenses critical \nsystems, platforms, and technologies required to \ndefend the nation. Their products, services, and \ncapabilities are vital to the security of the U.S. and \nour allies.\nIn an effort to be more transparent, NSA publishes an \nannual year in review sharing information regarding \ncybersecurity efforts that better equipped U.S. defenses \nagainst high priority cyber threats. NSAs efforts to help \nsecure the nations most sensitive systems also help your \ncybersecurity  because NSA cascades these solutions \nthrough public guidance and engages with key technology \nproviders to help them bolster the security of their products \nand services.\nVisit NSA.gov/cybersecurity  to access the report \ndigitally. Provide NSA Cybersecurity with feedback \nor ask questions by emailing cybersecurity@nsa.gov\nTop and bottom image courtesy of Getty Images, middle photo courtesy DoD\n\nFollow us @NSACyber01 Follow us @NSACyberCONTENTS\n02 \nLetters From \nthe Director  of NSA & the Director of NSA Cybersecurity06 \nVigilance Toward National Threat & Priorities09 \nPartnering with Industry & Defense Industrial  Base\n17 \nArming Net  Defenders with Guidance18 \nDefending our Most Critical Networks21 \nModernizing Cryptographic Solutions \n23 \nProtecting  the Warfighter & Supporting Combatant Commands29 \nResearching \nCybersecurity Solutions31 \nDeveloping \nCurrent and Next Generation Cyber Experts\n\n02\nwww.NSA.gov/cybersecurityCybersecurity is\nNational Security.\nGeneral Paul M. Nakasone \nCommander, U.S. Cyber Command,  \nDirector, NSA/Chief CSS\nA Letter\nFrom the NSA Director\nIn my role as the Director of the National Security Agency \n(NSA), I am humbled and privileged to lead a workforce that \nsupports every component of the Intelligence Community \nand Department of Defense through its signals intelligence \nand cybersecurity missions.\nNSA is the world leader in making and breaking codes. \nTalented people at our Agency work tirelessly to protect our Nation from our foreign adversaries.\nNSAs contributions are critical in the current era of strategic \ncompetition , wherein global powers are competing \neconomically, militarily, technologically and diplomatically. \nThe Peoples Republic of China (PRC) has emerged as the \npacing challenge  to the United States and as a competitor \nwith both the intent and ability to reshape the international \norder to fit its own designs. The PRC, an adversary that is unique in the scope, scale, and sophistication of the threat it poses, has stated its desire to become one of the worlds leading powers.\nRussia remains an acute threat and continues to threaten \nregional security and global stability through its disregard \nof international norms and its willingness to use its \nweapons to target civilians and critical infrastructure. \nWeve witnessed a telling example of this during Russias \nillegal invasion of Ukraine. Russia has also deployed \ninformation operations intended to weaken democratic \ninstitutions around the world.We need to be able to respond to threats from the PRC, \nRussia, and other global adversaries today and in the \nfuture. We must stay ahead of our global competitors  \nwho constantly seek to reshape the global information \nenvironment and the world order as we know it.\nAuthorities like Section 702 of the Foreign Intelligence \nSurveillance Act (FISA) allow us to do that. FISA Section 702 is a key foreign intelligence authority that helps keep \nthe United States and its allies safe and secure. Intelligence \nfrom Section 702 is used every day to protect the nation \nfrom critical threats, inform U.S. Government strategy, \nand save American lives.  Since any lapse in this law would \nhave a blinding effect on our insights into hostile foreign \nactors operating beyond our borders, we look to Congress \nreauthorizing Section 702.\nThe authorities with which NSA is entrusted allow NSA \nto tackle our most significant national security concerns, including cybersecurity . Recently, weve seen the nature \nof conflict evolve: cyberspace is contested space.  Its \nbecome clear that the shift from competition to crisis to \nconflict can now occur in weeks, days, or even minutes. \nEvery day at NSA, we strive to prevent and eradicate cyber \nthreats  to U.S. National Security Systems, the Department \nof Defense, and the Defense Industrial Base (DIB).\n\nFollow us @NSACyber03The new National Cyber Security Strategy outlines a clear and \ndedicated focus on leveraging international partnerships to \npursue shared goals in securing software, critical infrastructure, \nand global networks, dismantling and defeating ransomware \nactors, increasing operational collaboration in cyberspace, and \nbuilding incident detection and response capabilities.\nOur intelligence and cybersecurity relationships with our allies and \npartners are a strategic asset that will increasingly factor into our \ncompetition with our rivals, especially in technological competition.\nThe global landscape becomes ever more complex as the \ntechnology we use in cyberspace continues to advance. One such \nexample is Artificial Intelligence (AI) , which has the capacity to \nupend multiple sectors of society simultaneously. We must stay \nahead of our global competitors in the race to understand and \nharness its potential, as well as protect ourselves from adversarial \nuse. At NSA, we are uniquely positioned to do so by coalescing our \ndeep technical expertise, threat insights, and authorities to support \nthese efforts.\nI recently announced that NSA is consolidating its various AI \nsecurity related activities into a new entity, the NSA Artificial \nIntelligence Security Center. The AI Security Center, located within \nour Cybersecurity Collaboration Center, will allow us to work closely \nacross the Intelligence Community, the Department of Defense, the \nindustrial base, national labs, academia, and select foreign partners \nto ensure the United States enduring advantage in AI.\nNSAs principles and values, along with our culture of compliance \nand protection of privacy and civil liberties , have served as the \nfoundation for the cybersecurity successes detailed in this report and will continue to serve as the bedrock of NSA in the future.\nAt NSA, our people and our partnerships make the difference. \nNSA employees have a steadfast belief in the importance of the \ntrust granted to them through the oath they swore to uphold. \nOur deep and enduring partnerships allow us to tackle threats \nand scale solutions together to make this Nation  and our allies  more secure. On behalf of NSA, I share my sincere thanks for \nthe work all of our partners do in this space, since our collective cyber resilience and agile responses to threats are better when we work together.\nPAUL M. NAKASONE\nGeneral, U.S. Army  \nCommander, U.S. Cyber Command, \nDirector, National Security Agency/Chief, Central Security Service \n\n04\nwww.NSA.gov/cybersecurityA Letter\nFrom the NSA Cybersecurity Director\nThe NSA Cybersecurity Directorate was established with \nthe intention of connecting to industry and other partners. \nThat trend continued in the past year, as we leaned into \npartnerships more than ever before. We focus on taking \nwhat we know and turning it into actions that secure \nnetworks and disrupt our adversaries in new ways. Our \ndomestic and international partnerships help us tackle \nthreats together to scale cybersecurity solutions  and \nmake even greater impacts.\nWhen we know something, it only provides value when \nnet defenders can take real action with it. By sharing \ninformation bi-directionally in an unclassified environment  \nwith our partners, we improve both cybersecurity and \nnational security.\nThe combined talent of our partnerships  is the greatest \ncompetitive advantage we have to confront the increasingly \nsophisticated threats we see today.In the past year, weve exposed numerous cybersecurity \nthreats. Working with industry and international partners, we identified indicators of compromise associated with a \nPeoples Republic of China (PRC) state-sponsored cyber \nactor using living off the land techniques -- using built-in network tools to evade defenses without leaving a trace-- \nto target networks across U.S. critical infrastructure . We \nbenefitted from multiple private sector entities to better \nunderstand this threat and released guidance to help \nnetwork defenders hunt and detect this type of malicious activity on their systems and critical networks.\nWorking with partner agencies also allowed us to identify a \nsophisticated Russian cyberespionage Snake malware tool \nbeing used in over 50 countries worldwide.  Together, we \nattributed Snake operations to a known unit within Center \n16 of Russias Federal Security Service. The technical \ndetails we released with partners enabled Federal Bureau \nof Investigation (FBI) operations and helped many \norganizations find and shut down the malware globally.\nSeparately, collaboration with industry partners led to \ndiscovering a vulnerability in Citrix servers that could \nhave resulted in information stolen from the Defense \nIndustrial Base. Because of these partnerships, the zero-\nday vulnerability was exposed and patched , and the \nnumber of vulnerable servers across the country dropped \nsignificantly .\nOur Cybersecurity Collaboration Center (CCC) allows us to \nbuild coalitions to share information together and address \nthreats like these. This year, the CCC tripled its partnerships, \nso we now collaborate in more than 750 open and robust \nrelationships  across industry and government, which \nallows us to scale prevention, detection, and mitigation \ntechniques to billions of endpoints worldwide . The CCC scaled its cybersecurity as a service program to include \nsmall-to-medium businesses within the Defense Industrial \nBase (DIB) supply chain. This years 400% increase in \nenrollments in our services helps to ensure our critical \npartners in defense  including small and medium-size \nbusinesses  dont have to secure their systems alone. \nOur partnerships allow us to lean forward and proactively \nshare insights as we do what were charged to do: help \nsecure our Nations defenses, its most critical networks, \nand the DIB.\nOne emerging threat  and opportunity  is Artificial \nIntelligence (AI). AI and machine learning technologies are \nbeing developed and proliferating faster than companies \nand governments can shape norms, create standards, \nand ensure positive outcomes. While the tools may \nenable amazing new defensive capabilities, they may also \nempower attackers. NSAs recently established Artificial \nIntelligence Security Center  within our Cybersecurity \nCollaboration Center is the Agencys new focal point to \napply the unique insights from NSA signals intelligence and \ntechnological expertise, while collaborating with industry \nto help industry counterparts understand, prevent, and \nmitigate  threats in the AI ecosystem. The center will \nserve as a focal point to develop best practices, evaluation \nmethodology, and risk frameworks, while we aim to \npromote secure adoption of AI capabilities.\nWe also made progress in the marathon to transition to \nquantum-resistant cryptography  to protect our networks, \nthe technology we rely on, and our weapons platforms. \nWe completed cryptographic roadmaps for each U.S. \ncombatant command coalition partner to help our partners \nidentify where they need to invest to secure against \nadvanced cyber threats and become fully interoperable \nwith U.S. and allied forces.\nIn the end, these significant outcomes are powered by the \nfolks at NSA and our partner organizations who innovate, come up with brilliant ideas, and act on them with urgency \nto secure our Nation and our partners now and in the future.\nRegards,\nRob Joyce\nDirector, NSA Cybersecurity \n\nTogether, the cybersecurity  \ncommunity is so much better  \nthrough the power of partnership.\nRob Joyce \nDirector, NSA Cybersecurity\n\n06\nwww.NSA.gov/cybersecurityVigilance\nToward National Threats and Priorities\nCountering Global Threats\nTogether with U.S. and international partners NSA continues to scale its \nimpact against increasing global threats and sophisticated adversaries.\nWhile the U.S. Government relies on NSAs unique foreign signals intelligence \ninsights to inform key decisions, public and private sector collaboration \nbuilds on that foundation to better inform understanding of the threats and \nhow to counter them.\nEvery organization brings their own unique capabilities, authorities, and \ninsights to paint a broader picture  thereby enhancing NSAs ability to \nprevent and eradicate some of the worlds most concerning cyber threats.\nExposing and Mitigating Peoples Republic of Chinas \nMalicious Activity\nTogether with key industry partners, NSA identified a Peoples Republic of \nChina (PRC) state-sponsored cyber actor using built-in network tools to \ntarget U.S. critical infrastructure. To help network defenders hunt and detect \nthis type of PRC malicious activity on their systems, NSA coordinated with \nU.S. and international partners to publicly release the Peoples Republic of \nChina State-Sponsored Cyber Actor Living off the Land to Evade Detection  \njoint Cybersecurity Advisory. The advisory provides an overview of hunting \nguidance and associated best practices, and includes examples of actors commands and detection signatures.\nCyber actors find it easier and more effective to use capabilities \nalready built into critical infrastructure environments. A PRC state-\nsponsored actor is living off the land, using built-in network tools \nto evade our defenses and leaving no trace behind, that makes it \nimperative for us to work together to find and remove the actor from our critical networks.\nRob Joyce  \nDirector, NSA Cybersecurity\n\nFollow us @NSACyber07In another instance, when an industry partner detected \nPRC actors targeting critical DIB organizations using a \nzero-day vulnerability, NSA immediately shared technical \nindicators with DIB partners to enable discovery on \ntheir networks. The vulnerability specifically targeted \nwidely-used devices throughout the DIB so NSAs daily \nengagements with industry over a two-month period \nhelped disrupt and mitigate the campaign.\nHunting Russian Intelligence  \nSnake Malware\nIn coordination with partners, NSA identified a \nsophisticated Russian cyberespionage Snake malware \ntool being used in over 50 countries worldwide.  Together, \nNSA, USCYBERCOMs Cyber National Mission Force, \nFBI, Cybersecurity and Infrastructure Security Agency, \nthe Canadian Cyber Security Centre, the Australian \nCyber Security Centre, the New Zealand Government \nCommunications Security Bureau, and the U.K.s National \nCyber Security Centre, attributed Snake operations \nto a known unit within Center 16 of Russias Federal \nSecurity Service. This infrastructure was identified across \nNorth America, South America, Europe, Africa, Asia, and \nAustralia, including the U.S. and even Russia. The technical \ndetail released with partners helped FBI operations, \npartnering with many organizations, find and shut down the malware globally.Collaborating Internationally  \nTo Release Guidance\nWorking across the U.S. Government and international \ncollaborators, NSA has enabled increased sharing through \nCybersecurity Advisories regarding nation-state threats.\nIn a first, we collaborated with the Japan National Police \nAge\nncy and the Japan Center of Incident Readiness and \nStrategy for Cybersecurity, NSA alongside the FBI and \nthe U.S. Cybersecurity and Infrastructure Security Agency \n(CISA), released a joint Cybersecurity Advisory to detail \nactivity of PRC-linked cyber actors known as BlackTech.  \nBlackTech demonstrated capabilities in modifying router \nfirmware without detection and exploiting routers \ndomain-trust relationships for pivoting from international \nsubsidiaries to their parent companies in Japan and the U.S.\nIn another first, NSA worked with the Republic of Koreas \nNational Intelligence Service, National Police Agency, \nand Ministry of Foreign Affairs along with our partners \nat the FBI, and U.S. Department of State, to jointly issue \na Cybersecurity Advisory highlighting the use of social \nengineering by Democratic Peoples Republic of Korea \nstate-sponsored cyber actors  to enable computer network \nexploitation globally against individuals employed by \nresearch centers and think tanks, academic institutions, \nand news media organizations.\n\n08\nwww.NSA.gov/cybersecurityThe Department of Defense (DoD) serves as \nthe Sector Risk Management Agency for the \nDefense Industrial Base (DIB).In this role, the \nDepartment interfaces with DIB companies, \nmonitors and prioritizes threats, oversees \nincident management, and provides technical \nassistance, among other duties. The Departments \nDIB cybersecurity initiatives include the DIB \nCybersecurity Program, the DoD Cyber Crime \nCenters DoD-DIB Collaborative Information \nSharing Environment, National Security Agencys \nCybersecurity Collaboration Center, and the \nEnduring Security Framework.  \nExcerpt from the DoD Cyber Strategy Summary  \n released September 2023\n\nFollow us @NSACyber09Partnering\nWith Industry and Defending the Defense Industrial Base\nProtecting the Defense Industrial Base (DIB)\nAlthough many people associate the DIB with large defense contractors, more than \n70% of the DIB is made up of small businesses. Upon signing a contract with DoD, \nthese companies often become targets for nation state actors. Small businesses \ngenerally do not have the resources to defend against nation-state activity alone. NSA works with DIB companies large and small  NSAs critical partners in defense - bringing the worlds leading code-making and code-breaking Agency to stand by their side.\nWe are at the forefront of change to share our insights with \nthe private sector. We see the power of NSAs expertise in a way we havent seen before.\nMorgan Adamski\nChief, Cybersecurity Collaboration Center\nNSA provides no-cost cybersecurity services to DoD \ncontractors , informed by NSAs decades of expertise in making \nand breaking codes. These services are designed to defend \nagainst the top ways NSA sees foreign adversaries targeting the \nDIB and are infused with NSAs unique insights and analytics. In \n2023, thanks to aggressive outreach and development efforts, \nNSA grew cybersecurity service enrollment by almost 400% . \nNSA now provides cybersecurity assistance to more than 600 \ncompanies within the DoD supply chain, including suppliers \nwho may lack adequate cybersecurity resources of their own. \nWhile these services are open to any company with an active \nDoD prime contract or subcontract, NSA launched several new \ncampaigns in 2023 to prioritize outreach to companies supporting: \n1. The U.S. Indo-Pacific Command Area of Responsibility\n2. The Russia/Ukraine conflict, and \n3. DoDs priority weapons systems \nFurther, NSA worked with DoDs Office of Small Business to ensure minority-owned \nsmall businesses are aware of these services  and have the opportunity to leverage \nthem for cost savings and better network security.What NSAs Industry  \nPartners Are Saying:  \nAs a small business, we dont \nhave the unlimited resources that the big players have, so we appreciate anything that gives us an edge. It is one less thing to think about, one less expense, and one less worry\n.\n\nPhoto courtesy of G etty Images\n10\nwww.NSA.gov/cybersecurityThe Enduring Security Framework (ESF), through collaboration with 17 government and 62 industry partners, released 6 \nsecurity products addressing threats within the Communications, DIB, and Information Technology critical infrastructure \nsectors. Specifically, ESFs products addressed threats associated with 5G, identity and access management, and the \nsoftware supply chain. These issuances provided impactful recommendations, and established industry best practices to mitigate the identified threats.\n Securing the Software Supply Chain: Recommended Practices Guide for Suppliers\n Securing the Software Supply Chain: Recommended Practice Guide for Customers\n Potential Threats to 5G Network Slicing\n Recommended Best Practices for Administrators  Identity and Access Management\n Identity and Access Management Educational  \nAid & associated talking points\n 5G Network Slicing: Security Considerations for Design, \nDeployment, and Maintenance\nScaling DIB Cybersecurity Services\nThis year, NSA also enriched its offerings by harnessing \nNSAs unique insights on nation-state cyber activity. \nNSAs Protective Domain Name System (PDNS) \nservice, which blocks users from connecting to known \nmalicious or suspicious websites, is a prime example. \nNSA developed a custom threat feed for PDNS through \nwhich NSA is providing hundreds of unique Indicators \nof Compromise (IOCs) per week  to its DNS filtering \nvendor so they can update their blocklist. These IOCs are derived from three sources:\n1. NSAs SIGINT insights,\n2. NSA analytics, or\n3. Tipped from inter-agency, industry,  \nor international partners.\nTo date, NSAs PDNS service has generated 10 billion \nblocks for participating customers.  Of these, 20 million \nblocks have come from NSA-provided indicators, \nmeaning NSA is thwarting emerging malicious cyber \nactivity which would have otherwise gone undetected \nand unmitigated.  These IOCs are also being shared \nacross the U.S. Government and international partners \nto enable defensive actions.\nThis year, NSA also improved its vulnerability scanning \nprogram to offer comprehensive attack surface \nmanagement support.  This program offers two significant \nbenefits for DIB businesses. First, it leverages open source \ntools to provide companies with a full inventory of their \ninternet-facing assets, since you cant protect what you dont know about.  \nThen, this program runs vulnerability \nscans across those assets and provides a  tailored report with vulnerabilities prioritized leveraging NSAs insights about what nation-state actors are exploiting.\nNew this year, NSA also launched a continuous monitoring \nfeature. Every day, NSA monitors various sources to see \nwhen nation-state actors begin exploiting publicly known vulnerabilities. When a vulnerability goes from known to exploited, NSA immediately searches its asset discovery inventory to identify which DIB customers may have that \nvulnerability within their environment, and flag for them \nthat there is active exploitation against a device that is \npresent within their environment. These notices have an \n80% response rate and prove that as a result, companies \nare finding and fixing issues prior to compromise and \ndata exfiltration.\nThis year, the attack surface management program helped \nuncover a massive, Peoples Republic of China-associated \ncampaign targeting multiple DIB companies by leveraging \na vulnerability in Citrix environments.  As a result of NSAs \ncollaboration with large and small DIB companies and \nCitrix, NSA publicly exposed this campaign in conjunction \nwith a patch release. Independent researchers published \nblogs noting that within days of the advisorys publication, \nthe number of vulnerable servers across the U.S. and \nallied nations dropped by almost 25%.\nNSAs threat intelligence collaboration service  matured \nthis year. Through this service, companies can receive \nnon-public, DIB-specific NSA threat intelligence through \na secure, unclassified collaboration channel. This method \ngives companies access to NSAs analytic capabilities \nsimply by opening an app on their phone, increasing their \ncapacity and ability to take action and better protect \ntheir- and their customers-networks.\n\nIncreasing Innovative Pilots\nInvestment in DIB cybersecurity services didnt stop there. NSA launched four new pilots this year, which will run for \n12 months and will measure if the service is effective at mitigating nation-state activity, low-cost, and scalable with no significant overhead to participating companies. The new pilots are:\n Cloud Security:  As cloud computing is swiftly becoming the norm for cybersecurity, NSA is focusing efforts \non discovering and mitigating vulnerabilities and misconfigurations within the DIB that leave their networks and intellectual property vulnerable. This pilot will also provide NSA CCC analysts with the data necessary  \nto understand the DIB cloud attack surface, which will be used to craft and distribute DIB-specific cloud \nsecurity guidance .\n Threat Hunting:  Identifying and mitigating threats before they cause harm involves actively providing a system \ninformation and event management platform to DIB partners to facilitate the detection and mitigation of malicious \nand suspicious network activity. NSA analysts will hunt alongside the DIB partners and will develop threat-hunting \nguides and analytics to distribute throughout the DIB.\n Phishing Protection:  Phishing attacks are pervasive. This pilot provides DIB customers with a secure email \ngateway to filter phishing attacks, along with access to a sandbox to better understand any malware associated with the malicious attachments to enable appropriate mitigation development.\n Autonomous Penetration Testing:  This pilot innovatively leverages automated tools, algorithms, and AI to identify \ndigital vulnerabilities more continuously than human capabilities. Mimicking the actions of hackers, this testing provides real-time threat assessments to reduce human intervention, increasing efficiency and providing a more insightful view into how our adversaries are thinking.\nBy the Numbers\n750\nPartners10B\nMalicious/suspicious domains processed \nand/or blocked, including ransomware activity and nation-state malware, spearphishing, and botnets100s\nOf new unique IOCs fed  \ninto NSAs blocklist weekly\n20M\nBlocks generated  \nfrom NSAs unique IOCs312,000\nInternet-facing assets identified and inventoried for participating DIB companies1.3M\nVulnerabilities discovered and flagged for remediation\n550+\nPartner Vulnerability Notifications sent, with 80% response rate70 \nUnique clusters of known  \nnation-state activity consistently tracked by NSA and industryMultiple\nNation-state campaigns targeting  \nDIB revealed, including those leveraging zero-day vulnerabilities\n11 Follow us @NSACyber\n\nPhoto courtesy of Getty Images\n12\nwww.NSA.gov/cybersecuritySecuring Artificial Intelligence (AI)\nNSAs new AI Security Center, housed at the Cybersecurity \nCollaboration Center will promote the secure development, \nintegration, and adoption of AI capabilities  within national \nsecurity systems and the DIB. This center will also leverage \nNSAs unique foreign signals intelligence insights to help \nindustry understand how adversaries use and target AI. \nBy engaging leaders from U.S. industry, national labs, \nacademia, in concert with the Intelligence Community, the \nDoD, and foreign partners, the AI Security Center will help \ndevelop AI security best practices and guidance.\nPartnering to Tackle Threats  \nand Establish Standard\nThe Center for Cyber Security Standards (CCSS) is focused \non authoring, informing, and driving adoption of standards \nfor telecommunications, with a focus on securing 5G and \npreparing protocols for quantum-resistant cryptography. \nTo date, CCSS has authored and submitted more than \n95 standards for 5G, cloud networks, and internet \nprotocols. This work ensures security is baked in and \nreduces our adversaries ability to steal U.S. intellectual \nproperty.  NSA engages in more than 15 Standards \nDevelopment Organizations and more than 40 working \ngroups. NSA supported the U.S. Government by providing \ntechnical expertise in various forums. At the International \nTelecommunication Union Telecommunication Sector \nforum, CCSS served as the acting U.S. delegation working \nin close partnership with Department of State. CCSS \nadvanced multiple secure protocol standards drafts at the \nInternet Engineering Task Force, to ensure post-quantum resistance and interoperability.\nNSAs CCSS is now a member of the Open Radio Access \nNetwork (O-RAN) Alliance, an international consortium \nthat develops Radio Access Network (RAN) standards for 5G. The O-RAN Alliance has been historically closed to U.S. \nGovernment participation and formerly more focused on \nmarket incentives than security requirements. With RAN \ntechnology at the core of 5G infrastructure, participation in the consensus-driven O-RAN Alliance represents a way for \nthe U.S. to bolster security objectives for 5G .\nThrough the Enduring Security Framework, CCSS completed \na study to reinvigorate U.S. and allied investment in Standards \nDevelopment Organizations (SDOs), which ensured the \nlong-term security of critical technologies. The group \nassessed technical and geopolitical threats to international \nSDOs and developed strategies to counter these threats. \nNSA and its U.S. Government, industry and international \npartners increased awareness about the threats to standards and strategized to combat these threats. The greatest way \nto combat foreign adversarial influence in international \nSDOs is for nations that share the same values of security, \nprivacy, and global market competition to contribute \ntechnically sound standards proposals.\nCommercial products are increasingly relied upon to \nsecure National Security Systems (NSS). Through the \nNational Information Assurance Program (NIAP), the \nCCC certified 57 commercial components for protecting \nNSS.  Additionally, NIAP published 3 Protection Profiles \nto raise security in those products. Protection Profiles \nare vendor-agnostic guidelines that raise security in \ncommercial products by defining minimum security and testing requirements. NIAP is also ramping up to update \nProtection Profiles to be compliant with Commercial \nNational Security Algorithm (CNSA) 2.0 guidelines, \nmultifactor authentication and Zero Trust principles.\nNIAP continued to strengthen the global IT security \nposture through ongoing partnerships with 31 nations \nwithin the Common Criteria Recognition Arrangement \n(CCRA). The CCRA guarantees consistent evaluations \nbetween members and mutual recognition to allow \nvendors to test once and then sell in multiple countries. \nIt has positioned the United States as a leader within \nthe global community through further adoption of its \nstandards and by certifying more products than any \nother nation within the CCRA. NIAP continued to chair \nthe CCRA Management Committee and orchestrated \ncollaboration towards mutual recognition. NIAP also \nhosted the International Common Criteria Conference and \nthe Common Criteria Meeting at Washington, D.C. with \n26 countries represented, further emphasizing the value \nof international partnerships for the next generation of \ncommercial technologies.\n\nImage taken durring the Threats to Standards Summit.\nFollow us @NSACyber\n13NSA hosted a Deception Operations working group with \nindustry partners. This working group developed from \nindustry partner success with the use of honeypots and \na desire among our partners to share other tools and \ntechniques associated with deception operations. Industry \npartners shared their experiences and explained various \napproaches to deception operations while NSA subject \nmatter experts offered their technical perspectives. \nThe working group created an open dialogue for future \ncollaboration between industry and NSA to explore new \ntechniques to not only defend networks against foreign \nadversaries but also learn more about the evolving \ntechniques malicious actors are using to target the Defense \nIndustrial Base, DoD, and other U.S. critical infrastructure.NSA also continued to engage with partners to establish cybersecurity standards by hosting the inaugural Threats \nto Standards Summit, bringing together standards experts \nacross the U.S. government, foreign partners, industry, \nand academia to explore growing challenges and risks \nassociated with cybersecurity standards.\n\nWhat this collective effort has accomplished already is the creation of a road-map for our partners to provide accountability and help us all continue to improve.\nMorgan Adamski  \nChief, Cybersecurity Collaboration Center\n\nBlocked 1B instances of known malicious or suspicious cyber activity \nthrough Protective DNS\nIdentified over a million network vulnerabilities for remediation \nDiscovered over 8,000 vulnerable host devices  \nIdentified over 202,000 vulnerable Partner IPs  \nIdentified almost 70,000 vulnerable connective services  \nNATIONAL SECURITY AGENCY\nCYBERSECURITY SERVICES\nDrive Down Risk, Protect DoD Information \nBenets\nReceive NSA Threat Intel \nPartner with NSA on non-public,\nDIB-specific NSA threat \nintelligence NSA is offering companies with an active DoD contract (sub or prime), or with access to non-public, DoD information, several threat-informed cybersecurity solutions to help reduce risk of network compromise and protect sensitive but unclassified information.\nImprove Network Defense\nOur services will help increase the security of your networks  \nEngage Privately\nAll partnerships are underpinned by Non-Disclosure Agreements (NDAs)Attain Mitigation Guidance\nWe provide guidance to mitigate the vulnerabilities illuminated using our services \nCMMC Support\nOur services support several NIST 800-171 requirements for Risk Assessment, System and Communications Protection, and System and Information Integrity families of requirements. \nSuccess By the Numbers\nnsa.gov/ccc  FREE FOR DIB CONTRACTORS \n\nOUR SERVICES\nAsk us about additional \npilots and services! Protective Domain Name System (PDNS) \nBlock users from connecting to malicious or suspicious \ndomains, driving down risk and protecting DOD information. \n10B Malicious/suspicious domains blocked, \nincluding nation-state spear phishing, malware, botnets, and ransomware activity.\nCMMC Support - NIST 800-171 System & Information Integrity 3.14.06 \nAttack Surface Management\nFind and fix issues before they become compromises.Step one: identify internet-facing assets and determine possible \nvulnerabilities. Step two: company receives a tailored remediation list, prioritized by severity and likeliness of exploitation based on NSA's unique insights.\nCMMC Support - NIST 800-171 Risk Assessment 3.11.02, 3.11.03 \nThreat Intelligence Collaboration\nPartner with NSA to receive non-public, DIB-specific threat intelligence \nand the opportunity to engage on the materials being shared.\nOur services have illuminated, exposed, and remediated active \nnation-state exploitation attempts across hundreds of enrolled customers. \nCMMC Support - NIST 800-171 System & Information Integrity 3.14.03 \nEnrollment is Easy: \n1.Click GET STARTED on nsa.gov/ccc \n2.Confirm you meet eligibility criteria\n3.Sign DIB Framework agreement \nnsa.gov/ccc  FREE FOR DIB CONTRACTORS Thank you for your support during the \nseamless integration of the NSA Cyber Security suite for the Defense Industrial Base...Within fifteen minutes...we were able to configure our...firewall for the various services. Industry Partner Testimonial:\n\n\n\n\nFollow us @NSACyber17Arming\nNet Defenders with Guidance\nSharing Timely, Actionable Guidance\nNet defenders have a lot on their plates in todays sophisticated threat \nlandscape, and they need timely information to mitigate against significant \nvulnerabilities and protect their networks against cybercriminal and adversary \nthreats.\nNSAs public reports, often released with increasingly more collaborators, \nhelp arm net defenders with the guidance they need to address these critical cybersecurity issues.\nIn coordination with collaborators, NSA produced 27 Cybersecurity Advisories \nand Cybersecurity Information Sheets for public release  this year. Available on \nNSA.gov, these reports cover a wide array of topics from how to best secure home networks, to how the North Korean government uses social engineering to hack think tanks, academia, and the media.\nAnother example helps organizations contextualize deepfake threats . Deepfakes \nare AI-generated, highly realistic synthetic media that can be abused to threaten \nan organizations brand, impersonate leaders, and enable access to networks, communications, and sensitive information. In collaboration with the FBI and CISA, NSA released the Contextualizing Deepfake Threats to Organizations cybersecurity information sheet. This offered an overview of synthetic media \nthreats, techniques, and trends, as well as recommendations, guidance and \nmitigation strategies focused on protecting organizations from evolving \ndeepfake threats.\nBy publishing this guidance publicly, NSA along with the co-authoring agencies \nare able to provide important mitigation steps to help protect a range of \nnetwork information systems.\nNSA also streamlined the release of indicators of compromise associated with \nvarious types of malware through automated Network Defense Notice (NDN) \nreporting. These NDNs provide community partners with quick updates on \nindicators of compromise related to malware observed in the wild that they \ncan use to prevent potential compromises of their systems.\n27Cybersecurity Advisories  \n& Cybersecurity Information Sheets \nFor Public Release\n\nPhoto courtesy of Getty Images\nNSA CYBERSECURITY REPORTS \nUNIQUE. TIMELY. ACTIONABLE. \nNSAs guidance noties network defenders of relevant \nthreats and explains how to protect their systems by detecting and mitigating the malicious activity. \nNSA collaborates with government and industry \npartners to develop and share a comprehensive understanding of nation-state and cybercriminal malicious activity. \nNSA and its partners also work together to recommend \nproven defensive measures that can prevent and even eradicate cyber threats.\nVisit NSA.gov/cybersecurity-guidance to review NSAs cybersecurity advisories and technical guidance. \nReceive the latest alerts by following @NSACyber on X.\n18\nwww.NSA.gov/cybersecurityDefending\nOur Most Critical Networks\nDefending Key Systems\nNSA continues to support implementation of the \nMemorandum on Improving the Cybersecurity of National Security, Department of Defense, and \nIntelligence Community Systems  , known as National \nSecurity Memorandum-8 (NSM-8).\nThis memo provided the NSA Director, as the National \nManager for National Security Systems (NSS), new \nauthorities that increased NSAs cybersecurity visibility \ninto networks that contain classified information or are \notherwise critical to military and intelligence activities \nacross the Government. Since NSM-8 was signed, NSA \nhas even closer relationships with the more than 50 U.S. \ndepartments and agencies that own or operate NSS. \nNSA continues to increase the security of critical U.S. \nGovernment systems to protect sensitive military and \nintelligence data from our adversaries.\nProtecting The Nations Secrets\nNSA is integrated into the design and build of DoDs national \nsecurity and weapons systems and their cryptography. \nNSA continues to secure millions of devices around the \nworld  and manage the infrastructure to key those devices \nthrough its keys, codes, and cryptography mission. This \nincludes producing and distributing the keys, codes, and \ncryptographic materials that the U.S. Government and \nmilitary use  to secure weapons, satellites, communications, \nand many other systems in which national security  \ncritically relies.\nNSA is responsible for protecting the nations most critical \nsecrets from the nations most capable adversaries, the \ncyber-capable nation-states and individuals who want to \nget into our networks or attack our encryption.\nNSAs keys, codes and cryptography secures everything \nfrom NSA-certified tactical radios and any encrypted gear \nin the hands of U.S. soldiers, sailors, airmen, guardians \nand marines to their critical weapons platforms, including \nnuclear command and control systems. NSA ensures \nthese systems our warfighters are using are resilient \nto cybersecurity attacks and protect the US strategic \nadvantage in conflict.Within the past year, NSAs unclassified analysis of PRC \nobfuscation infrastructure yielded better defense of \nnational security systems.  The Cybersecurity Collaboration \nCenter identified malicious cyber activity attributed to \nthe PRC through analytic tradecraft using unclassified \ncommercial threat intelligence data feeds.  Automated \ngeneration of sensor fingerprints based on this tradecraft \nstreamlined identification of the PRC activity against \nnational security systems network fabric.\nSecuring Operational Technology\nCyber actors are willing to conduct malicious cyber \nactivity against critical infrastructure by exploiting internet-\naccessible and vulnerable Operational Technology (OT) \nassets. NSA evaluated numerous DoD sites, released \nmultiple Cybersecurity Advisories and Network Defense \nNotifications to secure OT, and continues to secure OT \ninfrastructure and national security systems. To that end, \nNSA released a repository for OT intrusion detection \nsignatures and analytics to the NSA CyberGitHub. The \ncapability, known as ELITEWOLF, can enable defenders \nof critical infrastructure, the Defense Industrial Base, and \nnational security systems to identify and detect potentially \nmalicious cyber activity in their OT environments. \n\nNSA CYBERSECURITY REPORTS \nUNIQUE. TIMELY. ACTIONABLE. \nNSAs guidance noties network defenders of relevant \nthreats and explains how to protect their systems by detecting and mitigating the malicious activity. \nNSA collaborates with government and industry \npartners to develop and share a comprehensive understanding of nation-state and cybercriminal malicious activity. \nNSA and its partners also work together to recommend \nproven defensive measures that can prevent and even eradicate cyber threats.\nVisit NSA.gov/cybersecurity-guidance to review NSAs cybersecurity advisories and technical guidance. \nReceive the latest alerts by following @NSACyber on X.\n\n\n\nModernizing\nCryptographic Solutions to Protect Data and Communications\nProgressing Toward  \nQuantum-Resistant Cryptography\nWhen achieved, a cryptanalytically relevant quantum \ncomputer will change the game. It will introduce threats \nto our nations most critical information systems and will break cryptographic systems that secure the internet and information systems worldwide.\nQuantum-resistant cryptography continues to be the best \ndefense against this looming threat.\nNSA continues to strategically execute National \nSecurity Memorandum-10 (NSM-10) , Promoting United \nStates Leadership in Quantum Computing While \nMitigating Risks to Vulnerable Cryptographic Systems, \nwhich directs U.S. Government agencies to migrate \nvulnerable cryptographic systems to quantum-resistant cryptography, a multi-year transition.\nAs the National Manager for National Security Systems \n(NSS), the NSA Director oversees the transition to \nquantum-resistant cryptography across the more than \n50 government departments and agencies that use NSS.\nContinued partnerships and collaboration with government \nand private partners is key to fighting this cybersecurity \nchallenge. NSA partners with the National Institute of \nStandards and Technology (NIST)  the U.S. Government \ncommercial algorithm approval lead as well as the \nCybersecurity and Infrastructure Security Agency (CISA), the Office of the Director of National Intelligence Science \nand Technology (ODNI S&T), the DoD, and external \nstandards organizations.\nThe cybersecurity community  including industry, \ngovernment, and academia - must plan now to modernize \ncryptography.  Quantum computing may not feel like an \nimminent threat, but it is a looming threat for which action \nmust be taken now.\nIn the past year, NSA built upon its previously published \nCommercial National Algorithm Suite 2.0 that notified NSS \nowners, operators, and vendors of the future requirements \nfor quantum-resistant algorithms for use in all NSS. In \nMarch and June, NSA released guidance to assist the \nU.S. Government to identify and inventory quantum-vulnerable cryptography, strengthen the current set of \ncryptography, and plan for migration to quantum resistant \ncryptography. Transitioning toward this modernization \nincludes inventorying cryptography and prioritizing, \nscheduling, and applying resources toward quantum-\nresistant efforts, as well as planning to adopt NSAs \nquantum-resistant algorithm suite and NSS and NISTs \ncryptographic standards.\nPost-quantum cryptography is about proactively \ndeveloping and building capabilities to secure critical \ninformation and systems from being compromised \nthrough the use of quantum computers. The transition \nto a secured quantum computing era is a long-term \nintensive community effort that requires extensive \ncollaboration between government and industry. The \nkey is to be on this journey today and not wait until \nthe last minute.\nRob Joyce, \nDirector of NSA Cybersecurity\nThe transition to quantum-resistant cryptography is just \none example of how NSA is staying a step ahead of our \nnations adversaries to protect our most sensitive data. \nNSA continually modernizes its cybersecurity solutions \nto be agile, threat adaptive, and scalable across multi-\ndomain operations.\n21 Follow us @NSACyber\n\n550\nCOMSEC Devices \nRapidly Deployed\n234,415\nTamper-indicating\nProducts Delivered \nGlobally\n20+ \nCyber Table Top  \nExercises & Technical  \nExchange Meetings61 \nUnique Customers \nSupported for Critical \nOperations \nU.S. Navy photo by Mass Communications Specialist  \n 3rd Class Nicholas V. Huyhn\n\n23Protecting\nThe Warfighter and Supporting Combatant Commands\nSupporting the Military\nAs part of the DoD, NSA is a combat support agency and supports the military services by providing \ntwo key missions: foreign signals intelligence and cybersecurity. While NSAs foreign signals intelligence \nexperts deliver intelligence support to military operations, its cybersecurity experts help ensure military communications and data remain secure.\nNSA furthered its robust partnership with U.S. Cyber Command, providing support to hunt forward \noperations  wherein teams deploy around the world at the request of our partners to assist them against \nmalicious cyber actors.\nWarfighters must have confidence in their operations. NSAs contributions help to do just that, so that \nthe U.S. military has the ability to secure communications for operations such as nuclear command and control and differentiate between friend and foe. Together with government partners, NSA helps ensure key management functions, networks, systems and communications devices used by the DoD are secure. NSA also delivers communications security best practices to ensure that the cryptographic material used with these systems and devices is securely handled.\nNSA also provides cryptographic security products to meet unplanned emergent requirements and to \nsupport urgent missions. In the last year, NSA rapidly deployed approximately 550 communications security \n(COMSEC) devices  to support mission operations during global crises, and delivered 234,415 tamper-\nindicating products  globally in 2023. The tamper-indicating products prevent or detect physical exploitation \nof cryptographic equipment and classified material during shipping or deployment around the world.\nIn the last year, NSA continued to support 61 unique customers for critical operations  such as U.S. Indo-\nPacific Command, U.S. European Command, the Joint Chiefs of Staff, U.S. Transportation Command, \nNational Aeronautics and Space Administration (NASA), Federal Emergency Management Agency (FEMA), \nand many more.\nNSA participated in more than 20 cyber table top exercises and technical exchange meetings  which resulted \nin 7 vulnerability assessment reports with mitigation plans and engineering security recommendations. \nNSA continues to help provide guidance to develop defensive monitoring strategies to help improve the \nsituational awareness of weapons platforms.\nNSA also partnered with the Space Development Agency (SDA) to develop the Proliferated Warfighting \nSpace Architecture that allowed the SDA to successfully launch their first ten satellites, marking a new era in national defense.\nOur strength is the incredible diversity of our country \nand our forces that keep our Nation protected and give it an advantage.\nMajor General Lorna Mahlock, USMC  \nDeputy Director for Combat Support  \nNSA Cybersecurity Directorate\n\nPhotos courtesy of Getty Images\n24\nwww.NSA.gov/cybersecurityIn addition, NSA participated in multiple briefings and discussions with \nU.S. Space Command leadership and staff. NSA provided insights to \nmembers of U.S. Space Command staff regarding cybersecurity service \nofferings and business practices used by the Cybersecurity Collaboration \nCenter to initiate and develop relationships with industry partners. U.S. \nSpace Command participants also offered a brief regarding U.S. Space \nCommands commercial relationship development. This partnership will \nhelp facilitate further expansion of the Cybersecurity Collaboration Centers \npartnerships among key U.S. Space Command partners.\nAs previously described, the entire cybersecurity community must plan now \nto modernize encryption and prevent against the looming quantum threat. \nIn the past year, NSA continued its efforts to modernize encryption across \nthe U.S. combatant commands.  By working with U.S. Cyber Command and \nJoint Force Headquarters-Department of Defense Information Networks, \nNSA is reducing the chance that U.S. adversaries can access warfighter \ncommunications and sensitive data.\nThe Joint COMSEC Monitoring Activity (JCMA) continued to identify the \nleakage of critical military operation details and VIP travel information \nfound in unclassified communications that can increase risks to missions \nand personnel. JCMA issued reports to Combatant Commands for action and remediation related to these findings.\nAssessing Systems and Creating Roadmaps\nConducting critical cybersecurity assessments on some of the nations \nmost important weapons and space systems across all warfighting domains \nhelps ensure they arent vulnerable to cyber adversaries. NSA continued this \ncritical work over the past year.\nIn 2023, the agency completed cryptographic roadmaps for each U.S. \ncombatant command  coalition partner. NSA used Command and Control \nInteroperability Board meetings between U.S. warfighting commands and \ntheir partners to identify critical missions employing obsolete cryptography \nand direct mission-driven modernization, an approach that baselines the \npartners cryptographic posture, maps the crypto to specific weapon \nplatforms, and maps the platforms to mission support. This effort pinpoints \nwhere resources must be committed to ensure partners are secure \nagainst advanced cyber threats across the warfighting domains and fully interoperable with U.S. and allied forces.\nThrough the DoD Strategic Cybersecurity Program, NSA worked in concert \nwith DoD leaders and the U.S. military services to assess their systems  \nand deliver plans to mitigate vulnerabilities, modernize cryptography, and monitor the systems. In the future, NSA plans to scale this activity through \ncontinued collaboration with the military services to perform additional \ncybersecurity assessments on priority systems. NSA also provided \noperational support to military exercises  and planning conferences.\nNSA continues to orchestrate and execute cybersecurity risk evaluations  of \nDoDs most critical systems, helping DoD ensure that its systems continue \nto improve and harden in the face of persistent and tenacious cyber threats. \nWithin the past year, NSA provided Zero Trust reviews and implementation \nroadmaps for two critical systems for the Navy and Air Force. The products \nwere the result of enduring collaboration with the Navy and Air Force \nthroughout the year.\n\nCybersecurity matters. It matters  \nto our partners and it matters to \nus. It ensures that our information, our intelligence, our knowledge can be shared securely.\nGeneral Paul M. Nakasone,  \nCommander, U.S. Cyber Command, Director, NSA/Chief, CSS\n\n26\nwww.NSA.gov/cybersecurityAiding Interoperable Missions\nNSA continues to represent the U.S. in NATOs information assurance and cyber defense capability \npanel, strengthening relationships with partner nations and focusing on driving platform and equipment \nmodernization to aid interoperable missions.  As the U.S. continues to modernize cryptography, NSA shares \nadvanced cryptographic logic with capable NATO partners to help modernize the NATO enterprise and \nalliance. This year, NSA emphasized the work NIST performed developing quantum resistant capabilities. The panel is developing technical guidance and cybersecurity information sharing across NATO to secure critical networks from advanced cyber threats.\nFurthering Nuclear Command, Control, and Communications (NC3) \nCybersecurity\nIn 2023, NSA continued to partner with agencies across the DoD to prevent and eradicate cyber threats to \nNuclear Command and Control Systems, focusing efforts to strengthen and cultivate partnerships. These relationships will be pivotal in scaling cybersecurity practices and leveraging innovative successes.\nFueled by a key partner, U.S. Strategic Command, NSA delivered a prototype capability to leverage sensing \nand monitoring, and provided visualization to deliver deep insight into the Nuclear Command, Control, and Communications (NC3) enterprise. NSA will continue to harness big data to inform decisions that will harden systems and eradicate threats.\nNSA also established new and strengthened existing partnerships to deliver NC3 Strategic Cybersecurity \nProgram evaluations providing cybersecurity risk, mitigation plans, and defensive monitoring \nrecommendations for fielded systems. This years operational support during war-game exercises provided \nDoD partners with real examples of how to prevent and eradicate threats to weapons and space systems.\nSecuring NSS with Commercial Solutions\nNSAs Commercial Solutions for Classified (CSfC) program enables customers to layer commercial solutions \nto protect classified information.  CSfC Capability Packages protect NSS by offering a robust systems \napproach for U.S. military services, combatant commands, and other federal partners.\nCSfC allows customers to quickly configure and deploy secure cybersecurity solutions using NSAs \npreapproved systems-level designs and commercially available components to meet a wide range of \nmission use cases  not only within and between secure facilities, but also to enable remote access for \ntelework and work that occurs outside of standard workspaces.\nIn 2023, CSfC continued to improve and update its publicly available Capability Packages, which guide \ncustomers toward implementing their own solutions. This year, CSfC published the supplemental guidance \ncreated for thin end user devices and private keys.NSA also provides assurance of fielded solutions for customers such as the FBI and other critical systems. \nCSfC conducted an on-site assessment of four customers CSfC registrations, which compares the \nregistered solution with what was actually fielded by the implementing organization. NSA ensured that \nconfigurations, monitoring, and administration were in line with CSfC Capability Package requirements. This \nprovides an opportunity for mutual technology enrichment and sharing, while capturing opportunities to \nimprove the security and clarity of the requirements. NSA plans to continue these assessments in the future.\n\nPhoto courtesy of Getty Images\n\nPhoto courtesy of Getty Images\n\nFollow us @NSACyber29Researching\nCybersecurity Solutions\nNSAs Laboratory for Advanced Cybersecurity Research  remains at the forefront of protecting \nand securing our nations cyber ecosystem, through robust and thriving partnerships with \nacademic institutions, federally-funded research labs, and the private sector. NSA is uniquely \npositioned to bring world-class technical expertise to support whole-of-government efforts to \nensure the United States enduring advantage in Artificial Intelligence and Machine Learning. \nNSAs scientists, engineers, and thought-leaders have led and advanced research, tradecraft, and capabilities in data science for years, and our subject-matter expertise will be called upon \nto deliver secure development, integration, and adoption of AI capabilities within U.S. National \nSecurity Systems and the Defense Industrial Base.\nOther recent cybersecurity research advances include:\n Strengthening cybersecurity standards in future technologies and forums critical to \nthe nation, such as the 3rd Generation Partnership Project, which serves as the premier \n5G standards entity.\n Provisioning foundational supply chain guidance to National Security System and \nDefense Industrial Base network defenders, ensuring the integrity of devices such as \ndesktops, servers, and laptops involved in all enterprise-based procurement activities.\n Concluding the latest iteration of NSAs Science of Security Program, which promotes foundational cybersecurity research at academic institutions in cutting-edge science and emerging technologies, and kicking off the next version, sponsoring a series of new \nprojects across seven different universities. The Science of Security program invites \ncollaboration between academia, industry, and government to advance cybersecurity through scientific rigor.\n Developing cyber operator courses designed to equip the next generation of cyber professionals with cutting-edge skills to assess software vulnerabilities and protect our national cyber assets.\n\nWOMENimmersed\ninNSA\n for cybersecurity\n30\nwww.NSA.gov/cybersecurity\n\nWIN-Cyber 23 program participants.WIN-Cyber 23 program participant.\nFollow us @NSACyber\n31Developing\nThe Current and Next Generation of Cyber Experts\nEnhancing the Cyber Workforce\nSponsored by the White House Office of the National Cyber \nDirector,NSA partnered with other federal agencies to \ndraft and publish the first-ever National Cyber Workforce \nand Education Strategy, approved by the Biden-Harris \nAdministration in July. This strategy was designed with  \na people-focused component to augment National \nCybersecurity Strategy that President Biden signed in \nMarch, and features four key pillars:\n Equip Every American  \nwith Foundational  \nCyber Skills\n Transform Cyber \nEducation\n Expand and Enhance  \nthe Cyber Workforce\n Strengthen the Federal Cyber Workforce\nThe strategy was developed in consultation with industry, \nacademia, non-profit organizations, and government \npartners. NSA contributed to the strategy and \nparticipated White House working groups, focusing on \ncyber education efforts and the federal cyber workforce.  \nNSAs commitments include a pilot initiative to help  \ndevelop cyber clinics across the nation which will support \ncommunities and small governments that would otherwise \nnot have access to cyber risk assessment and planning \nassistance. The clinics will also provide an opportunity for more than 200 students to develop competencies while in a supervised learning environment.Spotlighting and Recruiting Women  \nin Cybersecurity\nNSAs Cybersecurity Collaboration Center is leading \nthe charge with academic, industry, and government \npartners to encourage more women to pursue careers  \nin cybersecurity.\nFollowing last years successful Women Immersed in NSA \nCybersecurity (WIN-Cyber) pilot, five new schools and \ntwenty eager students participated in WIN-Cyber 23, \nhosted at the Cybersecurity Collaboration Center.\nThe WIN-Cyber program is a week long, immersive \nlearning experience that allows students to collaborate and \nlearn from some of NSA and U.S. Cyber Commands top \ncybersecurity professionals. WIN-Cyber 23 participants \nwere nominated by their respective professors and \nrepresented schools including a 2-year community \ncollege, a Historically Black College and University, a \nHispanic Serving Institution, and a 4-year public \nuniversity. Students learned about NSAs cybersecurity \nmission and many have returned to their schools as \nNSA ambassadors who advocate for public service  \non their campuses.WIN-Cyber 23 program participants with NSA Cybersecurity Director, Rob Joyce.\n\nPhoto taken at the NCX 23 event.\n32\nwww.NSA.gov/cybersecurityPartnering with Academia\nNSA continues to execute its cybersecurity academic strategy to inspire the cyber warriors of tomorrow through \ninitiatives such as:\nThe NSA Codebreaker Challenge  provides students \nattending U.S.-based academic institutions the chance \nto sharpen their cyber skills and gain experience in \nrealistic NSA mission-centric scenarios. Through \nDecember 21, students are working to interpret and \ndiscover an unknown signals origin identified by the \nU.S. Coast Guard. Students are presented with a series \nof nine increasingly complex tasks to locate and analyze \nwhat produced the signal, discover an active collection \noperation tasked by a rogue server, and subvert the \nrogue server to stop the collection device.\nThe GenCyber  program offers year-round cybersecurity \ntraining to students and teachers at the secondary level. \nThis annual competitive program is offered to educational \ninstitutions and not-for-profit and non-profit institutions \nby way of an academic institution. Proposers can submit for four types of programs: student, teacher, combination and student language. In 2023, 160 programs were funded across 47 states, plus District of Columbia and Puerto Rico, serving approximately 5300 students and teachers. NSA and the National Science Foundation make this possible\n.The NSA Cyber Exercise (NCX)  develops future military \nand civilian cyber warriors and leaders by developing \nand testing their cybersecurity skills, teamwork, \nplanning, communication, and decision-making. This \nannual exercise is the competitive cyber event of the \nyear for the U.S. Service Academies, Senior Military \nColleges, and NSA professional development program participants. The U.S. Air Force was awarded the 2023 NCX trophy.\n\nPhoto courtesy of Getty Images.\nFollow us @NSACyber\n33The NSA Experiential Tour  provides four-to-six week tours within NSA, U.S. Cyber \nCommand, and partners to nearly 200 service academy, Senior Military College, and select \nReserve Officer Training Corps (ROTC) members. These tours provide both classified and unclassified experiences, allowing participants to shape mission as they prepare to assume leadership roles.\nAdvancing the Study of Cybersecurity\nNSA is invested in promoting cybersecurity careers throughout all levels of education. NSAs \nNational Cryptologic University runs the National Centers of Academic Excellence in Cybersecurity \n(NCAE-C)  program creates and manages a collaborative cybersecurity educational program with \ncommunity colleges, colleges, and universities that:\n Establishes standards for cybersecurity curriculum and academic excellence\n Includes competency development among students and faculty\n Values community outreach and leadership in professional development\n Integrates cybersecurity practice within the institution and across academic disciplines\n Actively engages in solutions to challenges facing cybersecurity education\nMore than 400 schools have received the NCAE-C designation in designations of cyber, \ncyber defense, and cyber research.\n\n\n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "nsa_cybersecurity_yir23_book_508",
  "source": "nsa",
  "id": "6c583ba343a48957b506e0382ea5cacd97ed9abac757b0f850c0899153ff3ecd"
}