{
  "markdown": "  \nU/OO/200914 -19           PP-19-1354          21  October 2019  Introduction  \nThe Turla group, also known as Waterbug or VENOMOUS BEAR, is widely reported to be associated with Russian  \nactors . Turla uses a range of tools and techniques to target government, military, technology, energy and commercial \norganizations for the purposes of intelligence collection.  \nPrevious advisories from NCSC  detailed Turlas use of Neuron and Nautilus impla nts and an ASPX -based backdoor \nalongside the Snake rootkit. This document provides an update on the reported activity, with a particular focus on how \nthose tools were used in the period leading up to, and following, the publication of those advisories.  \nSince those advisories were published, NCSC, NSA and partner -shared analysis of additional victims and infrastructure \ndetermined the Neuron and Nautilus tools were very likely Iranian in origin. Those behind Neuron or Nautilus were almost \ncertainly not aware  of, or complicit with, Turlas use of their implants.  \nAfter acquiring the tools  and the data needed to use them operationally  Turla first tested them against victims they had \nalready compromised using their Snake toolkit, and then deployed the Iranian  tools directly to additional victims. Turla \nsought to further their access into victims of interest by scanning for the presence of Iranian backdoors and attempting to \nuse them to gain a foothold. The focus of this activity from Turla was largely in the M iddle East, where the targeting \ninterests of both Advanced Persistent Threats ( APTs ) overlap.   \nThe timeline of incidents, and the behavior of Turla in actively scanning for Iranian backdoors, indicates that while Neuron \nand Nautilus tools were Iranian in origin, Turla were using these tools and accesses independently to further their own \nintelligence requirements. The behavior of Turla in scanning for backdoor shells indicates that although they had a \nsignificant amount of insight into the Iranian tools, t hey did not have full knowledge of where they were deployed.  \nWhile attribution of attacks and proving authorship of tools can be very difficult  particularly in the space of incident \nresponse on a victim network  the weight of evidence demonstrates that  Turla had access to Iranian tools and the ability \nto identify and exploit them to further Turlas own aims.  \nBackground: Neuro n and Nautilus Usage by Turla  \nThe NCSC published two advisories  on the use of Neuron and Nautilus tools by Turla in late 2017 and early 2018. These \ntools were observed in use alongside Snake on a number of victims.  \nSince publication of those advisories, further analysis by NCSC, the NSA and the wider Cybersecurity comm unity \ndetermined Neuron and Nautilus tools were present on a range of victims, with a large cluster in the Middle East. Victims \nin this region included military establishments, government departments, scientific organizations and universities. Some of \nthese victims, but not all, also had a Snake implant present.  \nVictim Overlap  \nInvestigation into these victims identified that while some implants had been deployed and administered from \ninfrastructure associated with the Turla group, others had previously been  connected to by Virtual Private Server (VPS) IP \naddresses associated in the Cybersecurity  community with Iranian APT groups.  \nInterestingly, in some instances, it appeared  an Iranian APT -associated IP address first deployed the implant, and later, \nTurla -associated infrastruc ture accessed the same implant .  Turla Group Exploits Iranian APT To Expand Coverage O f Victims  \n\n \n \n  U/OO/200914 -19           PP-19-1354          21  October 2019  \n In order to initiate connections with the implants, Turla must have had access to relevant cryptographic key s, and likely \nhad access to controller software to produce legitimate tasking.  \nIn other instances, Turla deployed Neuron to victims in which they already had access to via their Snake toolkit, all with \nobserved connections from Turla -associated infrastructure.  \nScanning for Backdoors  \nTurla also made use of existing Snake victim networ ks to scan for the ASPX shell described in the initial advisory - \nattempting to identify the presence of, and access, the ASPX webshell on IP addresses in at least 35 countries, including \nSaudi Arabia, Kuwait, Qatar and UAE.  \nCommands were passed to the ASP X shell in encrypted HTTP Cookie values, requiring knowledge of the cryptographic \nkeys to produce valid tasking and successfully interact with it.  \nFrom one Snake victim, a log file was recovered which recorded the output of Turlas scanning for these ASPX shells with \nthe strings !!!MAY BE SHELL!!! (check version) and !!!MAY BE SHELL!!! (100%); over 3500 unique IP addresses were \nscanned.  \nOnce identified, Turla appeared to use these ASPX shells to gain an initial foothold into victims of interest, and th en \ndeploy further tools.  \nTurla Compromise of Iranian C2 Infrastructure  \nTurla accessed and used the Command and Control (C2) infrastructure of Iranian APTs to deploy their own tools to \nvictims of interest. Turla directly accessed Poison Frog C2 panels fro m their own infrastructure and used this access to \ntask victims to download additional tools.  \nReporting from Symantec 12 details a specific victim in the Middle East where Turla  was observed delivering their own \nmalware via a Poison Frog panel, which Symantec and others in the Cybersecurity  community attribute to APT34 (also \nknown as OilRig/Crambus).  \nTurla Compromise of Iranian Operational Infrastructure  \nThe Turla group deployed their own implants against the operational infrastructure used by an Iranian APT actor and used \nthis to further their own accesses into the Iranian APTs global infrastructure.  \nExfiltration of data from Iranian APT infrastructure to Turla infrastructure t ook place.  \nData exfiltrated from the Iranian infrastructure by Turla included directory listings and files, along with keylogger output \ncontaining operational activity from the Iranian actors, including connections to Iranian C2 domains. This access gave \nTurla unprecedented insight into the  tactics, techniques and procedures (TTPs) of the Iranian APT, including lists of active \nvictims and credentials for accessing their infrastructure, along with the code needed to build versions of tools such as \n                                            \n1 Waterbug: Espionage Group Rolls Out Brand  New Toolset in Attacks Against Governments ( Blogpost), 20 June 2019  \n2 Symantec  is a registered trademark of Symantec . \n\n \n \n  U/OO/200914 -19           PP-19-1354          21  October 2019  \n Neuron fo r use entirely independently of Iranian C2 infrastructure.  \nIndicators of Compromise  (IOC ) \nAs this advisory provides additional context around historical activity from the Turla group, these IOCs are provided for \ncompleteness. They may be useful to any inve stigator with historic data from a previous Turla (or Iranian APT) \ninvestigation.  \nIndicators for Forensics Analysis  \nThe following indicators can be used to search for the presence of Turla activity described in this document within forensic \nanalysis tools . \n!!!MAY BE SHELL!!! (check version)  \n!!!MAY BE SHELL!!! (100%)  \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. \nReference herein to any specific commercial prod ucts, process, or service by trade name, trademark, manufacturer, or \notherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, \nand this guidance shall not be used for advertising or product endors ement purposes . \nNotice  \nThe information contained in this document was developed in the course of NSAs cybersecurity missions including its \nresponsibilities to identify and disseminate threats to national security systems and Department of Defense informat ion \ntechnologies, develop and issue security implementation specifications for cybersecurity -enabled products, and to assist \nExecutive departments and agencies with operational security programs. The information may be shared broadly to reach \nall appropria te stakeholders. It has been produced in collaboration and with the support of the United Kingdoms National \nCyber Security Centre.  \n \nContact  \nFor general cybersecurity inquiries and reporting, contact the NSA Cybersecurity Requirements Center ,  \n410-854-4200 , Cybersecurity_Requests@nsa.gov , or the NCSC via their website . \nFor media inquiries, contact Press Desk: 443 -634-0721   Email: MediaRelations@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "nsa_csa_turla_20191021 ver 4 - nsa.gov",
  "source": "nsa",
  "id": "c17a24d52e1ae6af56f057622dfb84af07d7b08b18883f37e1d67eecc644e169"
}