{
  "markdown": "  \nU/OO/154383 -20 | PP-20-0622 | July 2020  Rev 1.0 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nCybersecurity Advisory  \nNSA and CISA Recommend Immediate Actions to Reduce \nExposure Across all Operational Technologies and Control \nSystems  \nSummary  \nOver recent months, cyber actors have demonstrated their continued willingness to conduct malicious cyber activity \nagainst Critical Infrastructure  (CI) by exploiting Internet -accessible Operational Technology (OT) assets [1]. Due to the \nincrease in adversary capabilities and act ivity, the criticality to U.S. n ational security and way of life, and the vulnerability \nof OT systems, civilian infrastructure makes attractive targets for foreign powers attempting to do harm to US interests or \nretaliate for perceived US aggression. OT assets are critical to the Departmen t of Defense (DoD) mission and underpin \nessential National Security Systems (NSS) and services, as well as the Defense Industrial Base (DIB) and other critical \ninfrastructure. At this time of heightened tensions, it is critical that asset owners and operat ors of critical infrastructure take \nthe following immediate steps to ensure resilience and safety of US systems should a time of crisis emerge in the near \nterm. The National Security Agency along with the Cybersecurity and Infrastructure Security Agency re commend that all \nDoD, NSS, DIB, and U.S. Critical Infrastructure facilities take immediate actions to secure their OT assets.  \nInternet -accessible OT assets are becoming more prevalent across the 16 US CI Sectors as companies increase remote \noperations and monitoring, accommodate a decentralized workforce, and expand outsourcing of key skill areas such as \nInstrumentation & Control, OT asset management/maintenance, and in some cases, process operations and \nmaintenance. Legacy OT assets that were not designed to defend against malicious cyber activities, combined with \nreadily available information that identifies OT assets connected via the Internet (e.g., Shodan1 [2], Kamerka [ 3]), are \ncreating a perfect storm of 1) easy access to unsecured assets, 2) use of  common, open -source information about \ndevices, and 3) an extensive list of exploits deployable via common exploit frameworks [ 4] (e.g., Metasploit2 [5], Core \nImpact3 [6], and Immunity Canvas4 [7]). Observed cyber threat activities can be mapped to the MIT RE5 Adversarial \nTactics, Techniques, and Common Knowledge (ATT&CK6) for Industrial Controls Systems (ICS) framework  [8]. It is \nimportant to note that while the behavior may not be technically advanced, it is still a serious threat because the potential  \nimpact to critical assets is so high.  \nRecently Observed Tactics, Techniques, and Procedures  \n Spear phishing [ T1192 ] to obtain initial access to the organizations information technology (IT) network before \npivoting to the OT network.  \n Deployment of commodity ransomware to Encrypt Data for Impact [ T1486 ] on both networks . \n Connecting  to Internet Accessible PLCs [T883]  requiring no authentication for initial access.  \n Utilizing Commonly Used Ports [T885]  and Standard Application Layer Protocols  [T869] , to communicate with \ncontrollers and download modified control logic.  \n Use of vendor engineering software and Program Downloads [T843] .  \n Modifying Control Logic  [T833]  and Parameters [T836]  on PLCs.  \n \n                                            \n1 Shodan is a registered trademark of Shodan Limited Liability Company.  \n2 Metasploit  is a registered trademark of Rapid7 Limited Liability Company . \n3 Core Impact  is a registered trademark of Help/Systems, Limited Liability Company.  \n4 Canvas  is a registered trademark of Immunity Products, Limited Liability Company . \n5 MITRE is a registered trademark of The MITRE Corporation.  \n6 ATT&CK i s a registered trademark of The MITRE Corporation.  \n\n \n \n U/OO/154383 -20 | PP-20-0622  | July 2020  Rev 1.0 2 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nNSA and CISA Recommend  Immediate Actions to Reduce \nExposure Across all Operational Technologies and Control Systems  \n \nImpacts  \n Impacting a Loss of Availability [ T826 ] on the  OT network .  \n Partial Loss of View [ T829 ] for human operators . \n Resulting in Loss of Productivity and Revenue [ T828 ].  \n Adversary Manipulation of Control [T831]  and disruption to physical processes . \nRecommendations  \nHave  a Resilience Plan  for OT  \nSince the Ukraine cyberattack of 2015 organizations must assume in their planning of not only a malfunctioning or \ninoperative control system, but a control system that is actively acting contrary to the safe and reliable operation of  the \nprocess. Organizations need an OT resilience plan that allows them to:  \n Immediately disconnect systems from the Internet that do not need Internet connectivity for safe and reliable \noperations . Ensure that compensating controls are in place where connectivity cannot be removed.  \n Plan f or continued manual process operations should the ICS become unavailable or need to be deactivated due \nto hostile takeover . \n Remove additional functionality that could induce risk and attack surface area . \n Identify  system  and operational  dependencies.  \n Restor e OT  devices and services in a timely manner . Assign roles and responsibilities for OT network and device \nrestoration.  \n Backup gold copy  resources, such as  firmware, software , ladder logic, service contracts, product licenses, \nproduct keys, and configuration information . Verify that all gold copy resources  are stored  off-network  and store \nat least one copy in a locked tamperproof environment (e.g., locked safe).  \n Test and validate data backup s and  processes in the event of data loss due to malicious cyber activity . \nExercise your Incident Response Plan  \nIn a state of heightened tensions and a dditional risk and exposure, it is critical to have a well-exercised incident response \nplan that is developed before an incident.  \n Conduct a tabletop exerc ise including, executive personnel, to test your existing incident response plan . \n Be sure to include your public affairs and legal teams in your exercise in addition to your IT, OT and executive \nmanagement . \n Discuss key decisions points in the response plan  and identify who has the authority to make key decisions under \nwhat circumstances . \n Ensure you r plan takes into account a scenario inclusive of the TTPs above and where the control system is \nactively operating counter to safe and reliable operations . \n Partn er with third -parties for support. Review service contracts and government services for emergency incident \nresponse and recovery support.  \nHarden Your Networ k \nRemote connectivity to OT networks and devices provides a known path that can be exploited by cybe r actors, External \nexposure should be reduced as much as possible.  \n Remove access from networks, such as non -US IP addresses if applicable, that do not have legitimate business \nreasons to communicate with the system.  \n Use publicly available tools, such as Sh odan1 to discover Internet -accessible OT devices. Take corrective actions \nto eliminate or mitigate Internet -accessible connections immediately. Best practices include:  \no Fully patch all Internet -accessible systems.  \n\n \n \n U/OO/154383 -20 | PP-20-0622  | July 2020  Rev 1.0 3 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nNSA and CISA Recommend  Immediate Actions to Reduce \nExposure Across all Operational Technologies and Control Systems  \n \no Segment networks to protect PLCs and workstations from direct exposure to the Internet. Implement \nsecure network architectures utilizing demilitarized zones (DMZs), firewalls, jump servers, and/or one -way \ncommunication diodes.  \no Ensure all communications to remote devices use a virtual private network (VPN) with strong encryption \nfurther secured with multifactor authentication.  \n Check and validate the legitimate business need for such access.  \no Filter network traffic to only allow Internet Protocol (IP) addresses that are known to need access , and \nuse geo -blocking where appropriate.  \no Connect remote PLCs and workstations to network intrusion detection systems where feasible.  \n Capture and review access logs from these systems.  \no Encrypt network traffic preferably using NIAP -validated VPN products and /or CNSSP - or NIST -approved \nalgorithms when supported by OT system components to prevent sniffing and man -in-the-middle tactics. \nAvailable at: https://niap -ccevs.org . \n \n Use the validated inventory to investigate which OT devices are Internet -accessible.  \n Use the validated inventory to identify OT devices that connect to business, telecommunications, or wireless \nnetworks.  \n Secure all required and approved remote access and user accounts.  \no Prohibit the use of default passwo rds on all devices, including controllers and OT equipment.  \no Remove, disable, or rename any default system accounts wherever possible, especially those with \nelevated privileges or remote access.  \no Enforce a strong password security policy (e.g., length, compl exity).  \no Require users to change passwords periodically, when possible.  \no Enforce or plan to implement two -factor authentication for all remote connections.  \n Harden or disable unnecessary features and services (e.g., discovery services, remote management servi ces, \nremote desktop services, simulation, training, etc.).  \nCreate an Accurate As -operated OT Network Map Immediately  \nAn accurate and detailed OT infrastructure map provides the foundation for sustainable cyber -risk reduction.  \n Document and validate an ac curate as -operated OT network map . \n Use vendor -provided tools and procedures to identify OT assets.  \n Use publically available tools, such as Wireshark7 [9], NetworkMiner  [10], GRASSMARLIN [1 1], and/or other \npassive network mapping tools.  \n Physically  walk down to check and  verify the OT infrastructure  map. \n Create a n asset inventory . \n Include OT devices assigned an Internet  Protocol (IP) address . \n Include software and firmware versions . \n Include process logic and OT programs.  \n Include removable media . \n Include standby and spare equipment . \n Identify all communication protocols used across the OT networks . \n Use vendor -provided tools and procedures to identify OT communications.  \n Use publically available tools, such as Wireshark7 [9], NetworkMiner  [10], GRASSMARLI N [11], and/or other \npassive network mapping tools.  \n Investigate all unauthorized OT communications.  \n Catalog all external connections to and from the OT networks.  \n Include all business, vendor, and other remote access connections.  \n Review service contracts to  identify all remote connections used for third -party services.  \n                                            \n7 Wireshark  is a registered trademark of Wireshark Foundation, Inc . \n\n \n \n U/OO/154383 -20 | PP-20-0622  | July 2020  Rev 1.0 4 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nNSA and CISA Recommend  Immediate Actions to Reduce \nExposure Across all Operational Technologies and Control Systems  \n \nUnderstand and Evaluate Cyber -risk on As -operated OT Assets  \nInformed risk awareness can be developed using a variety of readily available resources, many of which include specific \nguidance a nd mitigations.  \n Use the validated asset inventory to investigate and determine specific risk(s) associated with existing OT devices \nand OT system software.  \n Vendor -specific cybersecurity and technical advisories.  \n Department of Homeland Security - Cybersecurity and Infrastructure Security Agency Advisories [1 2]. \nAvailable at https://us -cert.cisa.gov/ics/advisories . \n Department of Homeland Security  Cybersecurity and Infrastructure Security Agen cy Cyber Security \nEvaluation Tool [1 3]. Available at https://us -cert.gov/ncas/current -activity/2019/11/04/cset -version -92-now-\navailable . \n MITRE5 Common Vulnerabilities and Exposures (CVE8) for both Information Technology and OT devices and \nsystem software [1 4]. Available at https://cve.mitre.org . \n National Institute of Standards and Technology  National Vulnerability Database [1 5]. Available at \nhttps://nvd.nist.gov . \n Implement mitigations for each relevant known vulnerability, whenever possible (e.g., apply software patches, \nenable recommended security controls, etc.).  \n Audit and iden tify all OT network services (e.g., system discovery, alerts, reports, timings, synchronization, \ncommand, and control) that are being used.  \n Use vendor provided programming and/or diagnostic tools and procedures.  \nImplement a Continuous and Vigilant System Monitoring  Program  \nA vigilant monitoring program  enable s system anomal y detection, including many malicious cyber tactics like living off the \nland techniques  within  OT systems.  \n Log and review all authorized external access connections for misuse or unusua l activity.  \n Monitor for unauthorized controller change attempts.  \n Implement integrity checks of controller process logic against a known good baseline.  \n Where possible, ensure process controllers are prevented from remaining in remote program mode while in \noperation.  \n Lock or limit set points in control processes to reduce the consequences of unauthorized controller access.  \nWorks Cited  \n[1] Lyngaas, S. Israeli official confirms attempted cyberattack on water systems. Cyberscoop, 28 May, 2020. [Online] Available at : \nhttps://www.cyberscoop.com/israel -cyberattacks -water -iran-yigal-unna  \n[2] Shodan. [Online] Available at: https://shodan.io   \n[3] Kamerka. [Online ] Available at: https://github.com/woj -ciech/kamerka   \n[4] Fireeye (2020).Monitoring ICS Cyber Operation Tools and Software Exploit Modules to Anticipate Future Threats. [Online] \nAvailable at: https://www.fireeye.com/blog/threat -research/2020/03/monitoring -ics-cyber -operation -tools -and-software -exploit -\nmodules .html  \n[5] Metasploit. [Online] Available at: https://metasploit.com   \n[6] Core Impact. [Online] Available at: https://coresecurity.com/products/core -impact  \n[7] Immunity CANVAS. [Online] Available at: https://immunityinc.com/products/canvas  \n[8] MITRE ATT&CK for Industrial Control Systems. [Online] Available at:  \nhttps://collaborate.mitre.org/attackics/index.php/Ma in_Page  \n[9] Wireshark. [Online] Available at: https://www.wireshark.org   \n[10] NetworkMiner. [Online] Available at: https://netresec.com/?page=Networkminer   \n[11] GRASSMARLIN . [Online] Available at: https://github.com/nsacyber/GRASSMARLIN  \n[12] Department of Homeland Security - Cybersecurity and Infrastructure Security Agency Advisories. [Online] Available at: \nhttps://us -cert.cisa.gov/ics/advisories  \n[13] Department of Homeland Security - Cybersecurity and Infrastructure Security Agency Cyber Security Evaluation Tool. [Online] \nAvailable at: https://us -cert.gov/ncas/current -activity/2019/11/04/cset -version -92-now-available  \n[14] MITRE Common Vulnerabilities and Exposures. [Online] Available at: https:// cve.mitre.org  \n                                            \n8 CVE is a registered trademark of The MITRE Corporation . \n\n \n \n U/OO/154383 -20 | PP-20-0622  | July 2020  Rev 1.0 5 \nNational  \nSecurity  \nAgency  \nCybersecurity & \nInfrastructure \nSecurity Agency  \nNSA and CISA Recommend  Immediate Actions to Reduce \nExposure Across all Operational Technologies and Control Systems  \n \n[15] National Institute of Standards and Technology National Vulnerability Database. [Online] Available at https://nvd.nist.gov  \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nContact  \nNSA Cybersecurity  \nClient Requirements / General Cybersecurity I nquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: 443 -634-0721, MediaRelations@nsa.go v  \nDHS Cybersecurity & Infrastructure Security Agency  \nCISA encourages recipients of this report to contribute any additional information that they may have related to this threat.  For any questions related to \nthis report, please contact CISA at  \n 1-888-282-0870 (From outside the United States: +1 -703-235-8832)  \n CISAServiceDesk@cisa.dhs.gov  \nCISA encourages you to report any suspicious activity, including cybersecurity incidents, possible malicious code, softwa re vulnerabilities, and phishing -\nrelated scams. Reporting forms can be found at http://www.us -cert.gov/ . \nCISA strives to make this report a valuable tool for our partners and welcomes feedback on how this publication could be impr oved. You can help by \nanswering a few short questions about this report at the following URL: https://www.us -cert.gov/forms/feedback . \n\n",
  "cves": [],
  "techniques": [
    "T1486",
    "T1192"
  ],
  "advisory": "cybersecurity-alerts",
  "title": "ot_advisory-dual-official-20200722",
  "source": "nsa",
  "id": "e1a5c22925e7652a656c279f125a2aeddf6bd8c0b18bc2eabeaa7fc04d6ee8b7"
}