{
  "markdown": "  \nU/OO/169570 -20 | PP-20-0807  | Sep 2020 ver. 1.0 \nNational Security Agency  | Cybersecurity Information  \nPerforming Out -of-Band Network Management  \nOut-of-Band (OoB) network management is a concept that uses an alternate communication path to manage network \ninfrastructure devices. These alternate paths are designed to isolate management traffic from operational traffic. This \nisolation prevents compromised user devices  or malicious network traffic  from impacting network operations or \ncompromising network infrastructure. Implementing these alternate paths can vary in configuration from virtual tunneling \n(sharing the physical network connections with the operational network) to a physically segmented network infrastructure. \nOoB management creates a framework that enables administrators to imp rove the security of the ir network s by \nsegmenting management traffic from operational traffic, and ensuring that management traffic only comes from the OoB \ncommunication path.  \nOut-of-Band Architecture D esign  \nA single OoB management design may not fall with in the security requirements or financial constraints  for each \ninstallation. Fortunately, there are multiple approaches to implementing OoB management with a range of security \nprotection s and related costs. To begin the process of determining which impleme ntation will provide the desired level of \nprotection, network owners need to perform a vulnerability and risk assessment. The information gathered from these \nassessments will aid in deciding to implement a virtually or physically segmented OoB network arch itecture. Regardless of \narchitecture design, NSA recommends all management traffic utilize only encrypted protocols , such as Secure Shell \n(SSH), Hypertext Transfer Protocol Secure (HTTPS), Simple Network Management Protocol v3 (SNMPv3), Secure Copy \n(SCP), and Secure File Transfer Protocol (SFTP) , with strong encryption algorithms and key sizes . NSA also \nrecommends never managing any device over an untrusted network, which includes the operational network, without a \nstrong Virtual Private Network ( VPN). Neve r should a network devices management interface be directly accessible from \nthe Internet.  \nPhysical Segmentation  \nThe most secure OoB management design is to create a physically segmented management infrastructure that allows for \nsecure administration and m onitoring of network devices. Each operational network device will have a dedicated interface \nconnecting to the physically segmented management network. These dedicated interfaces must be isolated from the \noperational network and have strict Access Control  Lists (ACLs) implemented to prevent a possible misconfiguration from \nallowing unauthorized access to management  services. Administrator workstations should only be connected to the \nmanagement network and all other network access  should  be restricted. For critical devices , such as perimeter firewalls or \nrouters, the use of console management switches can be used to create a protocol break and eliminate the possibility of a \ncompromised device from accessing other devices on the management network. A dedicate d physical network \ninfrastructure is the most secure option ; however , it can be expensive to implement and maintain as it requires additional \nnetwork devices, cabling, and servers.  \nVirtual Segmentation  \nCompleting detailed vulnerability and risk assessments  allows the network owners to consider implementing a more cost -\neffective and economical virtual segmentation approach to network management. The virtual segmentation design is a \nless secure option , but it is attractive due to reduced cost and maintenance.  Virtual segmentation allows the management \ntraffic to share the same physical links with operational traffic. However, the network designer must logically segment the \ntwo types of traffic. This virtual segmentation can be implemented using multiple Virtua l Local Area Networks (VLANs), \nVirtual Routing and Forwarding (VRFs),  VPNs , or oth er zero  trust and micro -segmentation technologies. The major \nvulnerability in these configuration s is potential data leakage where devices on the operational network may capt ure \nsensitive management traffic or management traffic is accidentally sent over the operational network. To mitigate most of \nthese vulnerabilities , NSA recommends the management traffic utilize strong encryption.  \nAn often overlooked security design flaw w ith virtually segmented networks is authentication, logging, and other \nmanagement services that are not properly  isolated. When deploying a virtually segmented OoB network, these services \nshould not be shared with the operational network. If these services  are shared between the management and the \n\n \n \nU/OO/169570 -20 | PP-20-0807  | Sep  2020 ver.  1.0 2 \nNSA | Performing Out -of-Band Network Management  \noperational network , they create a hop point between the two. Adversaries will use this access to expand to other network \ndevices through the legitimate management network. Also, a shared authentication server could allow an adversary to \npivot from the operational network to the management network by compromising the authentication server itself with a \nsimple Pass -the-Hash type of credential reuse . \nRecommendations  \nImplement Encryption  \n Utilize only encrypted protocols on all OoB management traffic.  \n Utilize VPNs when connecting to management networks over an operational network.  \n Ensure encrypted protocols are configured to use strong cryptographic algorithms and key sizes.  \nHarden Network Management Devices  \n Restrict all management access on network devices to only allow the management network.  \n Execute all management operations from dedicated, fully patched hosts accessible only by authorized network \nadministrators. At least two such management hosts should be available to provide redundancy.  \n Allow only dedicated management hosts to access network devices to prevent compromised lateral movement from \nuser devices.  \n Secure OoB networks by continually applying patches . \n Test patches prior t o implementing them on the network.  \n Turn off unnecessary services on routers and switches.  \n Implement multi -factor authentication to access the devices securely.  \n Use only serial connections or console management switches for critical devices.  \nMonitor Networ k and Review Logs  \n Establish and adhere to a Site Security Policy (SSP) for the OoB network guidelines that articulate the design for \nmanagement devices, the roles and responsibilities of administrators, and the process for logging.  \n Check logs for unauthori zed logins, unauthorized reboots, and misconfigured settings.  \n Monitor and verify network configurations on a regular basis.  \nEstablish Configuration Management Procedures  \n Configuration management is critical to the health, maintenance, and security of any n etwork. NSA recommends \nestablishing a configuration review and check -in process. This process will create a history of network changes and \nallow an administrator to quickly identify malicious changes.  \n Include the identification by job title of all individu als who must approve changes to the OoB management network \nas well as those who execute the changes.  \n Define access control configurations in the security policy.  \n Use Principle of Least Privilege when defining access controls.  \n Enable strong authentication  mechanisms and require network administrators to use strong passwords with a \nminimum length of 14 characters.  \n Use secure communication protocols on the OoB management network and disable all protocols that are not \nrequired.  \n Maintain A CLs to permit needed services (HTTPS, SNMPv3, SSH, SCP, and SFTP)  and deny all others . \n Use Simple Network Management Protocol (SNMP) version 3 or newer with encryption enabled . Avoid using  \nSNMPv1 and SNMPv2 . They  are legacy protocols and do not provide an adequate level of sec urity.  \n\n \n \nU/OO/169570 -20 | PP-20-0807  | Sep  2020 ver.  1.0 3 \nNSA | Performing Out -of-Band Network Management  \nDisclaimer  \nThe information and opinions contained in this document are provided as is and without any warranties or guarantees.  Refer ence herein to any \nspecific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nPurpose  \nThis document was developed in furtherance of  NSAs cybersecurity missions, including its responsibilities to identify and disseminate threats to \nNational Security Systems, Department of Defense, and Defense Industrial Base information systems , and to develop and issue cybersecurity \nspecifications an d mitigations.  This information may be shared broadly to reach all appropriate stakeholders.  \nContact Information  \nClient Requirements / General Cybersecurity Inquiries: Cy bersecurity Requirements Center , 410 -854-4200,  Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "performing_out_of_band_network_management20200911",
  "source": "nsa",
  "id": "c783ed1b41d0a273a93b05d873026f2e8144561375f381a7fe4849bb498af3dc"
}