{
  "markdown": "POTENTIAL THREAT VECTORS \nTO 5G INFRASTRUCTURE\n2021\nTLP:WHITE\n\nPOTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITEi\nEXECUTIVE SUMMARY\nThe fifth-generation (5G) of wireless technology represents a complete transformation of telecommunication \nnetworks, introducing a vast array of new connections, capabilities, and services. These advancements will provide \nthe connection for billions of devices and will pave the way for applications that will enable new innovation, new \nmarkets, and economic growth around the world. However, these developments also introduce significant risks that \nthreaten national security, economic security, and impact other national and global interests. Given these threats, \n5G networks will be an attractive target for criminals and foreign adversaries to exploit for valuable information and \nintelligence.\nTo address these concerns, the United States National Telecommunications and Information Administration (NTIA) \ndeveloped the National Strategy to Secure 5G , a strategic document that expands on how the United States \nGovernment will secure 5G infrastructure domestically and abroad. The National Strategy to Secure 5G  aligns to \nthe National Cyber Strategy  and establishes four lines of effort: (1) facilitating the rollout of 5G domestically; (2) \nassessing the cybersecurity risks to and identifying core security principles of 5G capabilities and infrastructure; \n(3) addressing risks to United States economic and national security during development and deployment of 5G\ninfrastructure worldwide; and (4) promoting responsible global development and deployment of secure and reliable\n5G infrastructure.\nIn alignment with Line of Effort 2 in the National Strategy to Secure 5G, the Enduring Security Framework (ESF) was \nidentified t\no assist with assessing risks and vulnerabilities to 5G infrastructure. This included building on existing \ncapabilities in assessing and managing supply chain risk. As a result, the ESF 5G Threat Model Working Panel was \nestablished.1\nThe preliminary focus of the 5G Threat Model Working Panel was to explore and prioritize potential threat vectors \nthat may be associated with the use of 5G non-standalone (NSA) networks. The working panel reviewed existing \nbodies of work to identify and generate an aggregated list of known and potential threats to the 5G environment, \ndetermined and developed sample scenarios of where 5G may be adopted, and assessed risks to 5G core \ntechnologies. This analysis paper represents the beginning of the Working Panels thinking on the types of risks \nintroduced by 5G adoption in the Unites States, and not the culmination of it. This product is not an exhaustive risk \nsummary or technical review of attack methodologies and is derived from the considerable amount of analysis that \nalready exists on this topic, to include public and private research and analysis.\n1 The ESF is a cross-sector working group that operates under the auspices of Critical Infrastructure Partnership Advisory Council (CIPAC) to \naddress threats and risks to the security and stability of U.S. national security systems. It is comprised of experts from the U.S. government as \nwell as representatives from the Information Technology, Communications, and the Defense Industrial Base sectors. The ESF is charged with \nbringing together representatives from private and public sectors to work on intelligence-driven, shared cybersecurity challenges.\n\nCONTENTS\nINTRODUCTION 01POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITEii\n5G THREAT VECTORS 03\nPOLICY AND STANDARDS THREAT SCENARIOS\nGLOSSARYOverview of Threat Vectors\nSUPPLY CHAIN THREAT SCENARIOS\n5G SYSTEMS ARCHITECTURE THREAT SCENARIOS05\n07\n09\n11Nation-State Influence on 5G Standards\nUniversity Implementation of Optional 5G Security Controls\nImplementation of Counterfeit Components\nUnintentional Adoption of Untrusted Components\nInherited Vulnerabilities from 4G Networks\nFirmware Vulnerability within the Multi-Access Edge Compute\n\n1 POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nINTRODUCTION\nWhile the transition to 5G presents a wealth of opportunities and capabilities, it also introduces new \nvulnerabilities and threats. The following threat vectors identified by the E SF and 5G Threat Model Working Panel \nrepresent an initial list of threats across the various 5G domains. Within these three threat vectors are sub-threats \nthat describe additional points of vulnerability for threat actors to exploit. While not all inclusive, these types of \nthreats have the potential to increase risk to the United States as the country transitions to 5G.\nOverview of Threat Vectors\nPolicy and Standards\nThe development of 5G policies and standards serve as the foundation for securing 5Gs \nfuture communications infrastructure. Through global standards-setting bodies, like the \n3rd Generation Partnership Pr\noject, Internet Engineering Task Force, and the International \nTelecommunication Union, telecommunications standards de\nvelopment organizations are \ndeveloping technical standards and security contr\nols that will influence the design and \narchitecture of new technologies, such as aut\nonomous vehicles, edge computing, and\ntelemedicine. Given the impact that these decisions hav\ne on implementing and adopting 5G \ntechnologies, it is critical that international standards and policies are open, transparent, and \nconsensus driven.\nAs new 5G policies and standards are released, there remains the potential f\nor threats that \nimpact the end-user. For exam\nple, nation states may attempt to exert undue influence on \nstandards that benefit their proprietary t\nechnologies and limit customers choices to use other \nequipment or software. There are also risks associated with the de\nvelopment of standards, \nwhere standard bodies may develop optional contr\nols, which are not implemented by operators. \nBy not implementing these subjective security measures, operator\ns could introduce gaps in the \nnetwork and open the door for malicious threat act\nors.\nTLP:WHITE\n\n2 POTENTIAL THREA T VECTORS TO 5G INFRASTRUCTURE\nSupply Chain  \nSupply chain risk refers to efforts by threat actors to exploit information and communications \ntechnologies (ICTs) and their related supply chains for purposes of espionage, sabotage, \nforeign interference, and criminal activity. The 5G supply chain is similarly susceptible to the \nintroduction of risks like malicious software and hardware, counterfeit components, poor \ndesigns, manufacturing processes, and maintenance procedures. The exposure to these risks \nis heightened by the broad appeal of 5G technologies and the resulting rush to deployment. \nThis may result in negative consequences , such as data and intellectual property theft, loss of \nconfidence in the integrity of the 5G network, or exploitation to cause system and network \nfailure.\nWith the potential for the connection of billions of 5G devices, there is an increased risk for \nuntrusted or counterfeit components to be introduced within the 5G supply chain. This could \ninclude compromised devices or infrastructure that ultimately affects end-user devices, such as \ncomputers, phones, and other devices. Untrusted companies or government-backed suppliers \nalso contribute to the supply chain risk, especially those that have significant international \nmarket share within telecommunication networks. For example, those countries that purchase \n5G equipment from companies with compromised supply chains could be vulnerable to the \ninterception, manipulation, disruption, or destruction of data. This would pose a challenge \nwhen sending data to international partners, where one countrys secure network could  be \nvulnerable to threats because of an untrusted telecommunication network in another country.\n5G Systems Architecture  \n5G system architectures are being designed and developed to meet increasing data, capacity, \nand communications requirements. Although 5G component manufacturers and service \nproviders are enhancing security through technology improvements, both legacy and new \nvulnerabilities may be exploited by malicious actors. Additionally, 5G networks will use more ICT \ncomponents than previous generations of wireless networks, which could provide malicious \nactors with other vectors to intercept, manipulate, disrupt, and destroy critical data. The \nincreased capacity of 5G facilitates the proliferation of the Internet of Things, which adds \nnumerous and potentially less secure devices into the 5G network. This increased diversity of \ncomponents can lead to complexity within the 5G architecture and may introduce unforeseen, \noverall system weaknesses or vulnerabilities.\nAs new 5G components and technologies are developed and deployed, new weaknesses will be \ndiscovered. The future 5G systems architecture (e.g., software defined networking, cloud native \ninfrastructure, network slicing, edge computing) may introduce an increased attack surface for \nmalicious actors to exploit. For example, the overlay of 4G legacy and 5G architectures could \nprovide the opportunity for a malicious actor to carry  out a downgrade attack, where \na user on a 5G network could be forced to use 4G , thereby allowing the malicious actor to \nexploit known 4G vulnerabilities.  These threats and vulnerabilities could be used by malicious \nthreat actors to negatively impact organizations and users. Without continuous focus on 5G \nthreat vectors and early identification of weaknesses in the system architecture, new \nvulnerabilities will increase the impact of cyber incidents.\nTLP:WHITE\n\n3\n5G THREAT VECTORS\nBuilding upon the three threat vectors of Policy and Standards, Supply Chain, and 5G Systems Architecture, \nthe following descriptions detail sub-threats of each primary threat vector. \nPolicy and Standards Sub-Threat Vectors\nOpen Standards\nAs adversarial nations contribute to the development of technical standards, the potential exists for \nstandards to include untrusted technologies and equipment that are unique to their systems. These \nproprietary technologies and equipment may limit competition and force customers to adopt \nuntrusted, new technologies. The lack of interoperability with these untrusted  proprietary \ntechnologies limits the ability of trusted companies to compete in the 5G market. The custom 5G \ntechnologies that do not meet interoperability standards may be difficult to update, repair, and \nreplace or they could be entirely invisible to the customer. This potentially increases the life-cycle \ncost of the product and delays 5G deployment if the equipment requires replacement.\nOptional Controls\nStandards bodies develop protocols for mobile telecommunications, some of which contain security \ncontrols that are either required or optional. Network operators that do not implement optional \nsecurity controls may have more vulnerable networks and be at higher risk for cyber-attacks.\nSupply Chain Sub-Threat Vectors\nCounterfeit Components\nCounterfeit components are more  susceptible to cyber-attack and are more likely to break \nbecause of their poor quality. Compromised counterfeit components could enable a malicious \nactor to impact the confidentiality, integrity, or availability of data that travels through the devices \nand to move laterally to other more sensitive parts of the network.\nInherited Components\nInherited components may come from extended supply chains consisting of third-party suppliers, \nvendors, and service providers. Supply chains may be compromised via attacks on suppliers, \nincluding suppliers of suppliers, who may have  weaker security controls and audits on their \ndevelopment, production, or delivery channels. Flaws or malware inserted early in the \ndevelopment phases are more difficult to detect and could lead to the developer marking the \ncomponent as legitimate through digital signatures or other approvals. These vulnerabilities could \nthen later be exploited by malicious actors.\nPOTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\n4\n5G Systems Architecture Sub-Threat Vectors\nSoftware/Configuration\nUnauthorized access to software or network components provides a malicious actor with the \nopportunity to modify configurations to reduce security controls, install malware on the system, or \nidentify weaknesses in the product. These vulnerabilities could be exploited for increased \npersistent and privileged access within a system or network.\nNetwork Security\n5G technologies enable the potential for billions of connected network devices, supporting a \nwealth of new capabilities and innovation. These devices and infrastructure capabilities, such \nas cellular towers, beamforming transmission, small cells, and mobile devices, introduce the \nopportunity for malicious actors to expose vulnerabilities across an increased set of threat vectors.  \nIf network devices were compromised through a network layer exploit, malicious actors could \nobtain unauthorized access to the 5G network, potentially disrupting operations and enabling the \ninterception, manipulation, and destruction of critical data.\nNetwork Slicing\nNetwork slicing allows users to be authenticated for only one network area, enabling data \nand security isolation. However, network slicing can be difficult to manage, and the slices add \ncomplexity to the network. While there are standards defining specifications for how operators \nbuild their 5G networks, there are no clear specifications for how network operators should \ndevelop and implement security for network slicing. Improper network slice management may \nallow malicious actors to access data from different slices or deny access to prioritized users.\nLegacy Communication s Infrastructure\nWhile 5G network infrastructure is designed to be more secure, many of the security \nspecifications and protocols from 4G legacy communication s infrastructure are supported in 5G \nnetworks. This legacy communication s infrastructure contains inherent vulnerabilities that , if not \naddressed, can be exploited by malicious actors.\nMulti-Access Edge Computing\nMulti-Access Edge Computing (MEC ) transforms the way data is processed and stored by moving \nsome core network functions closer to the end user at the network edge, rather than relying\non a central location that may be hundreds of miles away. The introduction of untrusted 5G \ncomponents into the MEC could expose core network elements to risks introduced by software \nand hardware vulnerabilities, counterfeit components, and com ponent flaws caused by poor \nmanufacturing processes or maintenance procedures.\nSpectrum Sharing\nTo reach its potential, 5G systems require a complement of spectrum frequencies (low, mid, and \nhigh) because each frequency type offers unique benefits and challenges. With an increasing \nnumber of devices competing for access to the same spectrum, spectrum sharing is becoming \nmore common. Spectrum sharing may provide opportunities for malicious actors to jam or \ninterfere with non-critical communication paths, adversely affecting more critical communications \nnetworks.\nSoftware Defined Networking\nSoftware Defined Networking (SDN ) is an architecture for automatically configuring routes across \na network, primarily using an SDN controller. While SDN improves network flexibility and eases \nmanagement, malicious  actors may embed code in SDN controller applications to constrict \nbandwidth and negatively affect operations.\nPOTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\nNATION-STATE INFLUENCE \nON 5G STANDARDS\nOVERVIEW\nUndue influence from nation-states in sector specific or emerging technology standards, (e.g., autonomous vehicles, \nedge computing, telemedicine ) can negatively affect the competitive balance within the 5G market, potentially \nlimiting the availability of trusted suppliers and leading to a situation where untrusted suppliers are the only options. \nNation-states may pursue early adoption of emerging technologies to increase their global influence over 5G \ntechnologies and lead to an environment in which U.S. companies are forced to use untrusted components within \ntheir networks.\nSCENARIO\nThe Healthcare and Public Health sector is forced to adopt standards developed by a nation-state that benefit \ntheir manufacturing and cyber capabilities while putting the U.S. at a disadvantage. U.S. hospitals begin to adopt \ntelesurgery to provide better support to rural and disadvantaged communities, as well as to meet the growing \ndemand for the emerging service. The same  nation-state started its development of telesurgery hardware and \nsoftware several years ago and is now a global leader in the field. U.S. hospitals are forced to either use their \nuntrusted technologies or use similar technologies from trusted providers that are built according to the nation-\nstates de facto standards. The nation-state can influence these companies to develop or utilize technologies that \nputs the U.S. at a disadvantage and inhibits market growth.Open \nStandardsPOLICY AND STANDARDS \nTHREAT SCENARIOS5 POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\nUNIVERSITY IMPLEMENTATION OF \nOPTIONAL 5G SECURITY CONTROLS\nOVERVIEW\nOrganizations and communication s providers that choose not to implement optional security controls will likely \nhave more vulnerabilities and be at higher risk for cyber -attacks.  In these instances, nation-state actors, who have \ncontributed to security control development or are aware of vulnerabilities in systems that do not have them \nimplemented, may target those entities . As a result,  malicious actors could identify and utilize methods to take \nadvantage of private networks that do not put  these  optional controls in place.\nSCENARIO\nAcross the U.S., 5G begins to replace Wi-Fi in homes, offices, and in large private networks. A university \nimplements a 5G network across its large campus but does not adequately configure or maintain all of the \nrecommended, but optional, security controls. Many of the optional security controls, as outlined by primary \nstandard s bodies, are followed by telecom munications companie s and other enterprise adopters. The universitys \ndecision not to implement all of the security controls results in significant cybersecurity gaps within their network. \nA malicious actor targets and tests for lack of these controls and exploits them within the universitys 5G network.Optional  \nControls6 POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\nIMPLEMENTATION OF \nCOUNTERFEIT COMPONENTS\nOVERVIEW\nCounterfeit components are inserted at the component manufacturing or distribution stage in the supply chain \nin order to impact components delivered to a subset (potentially a targeted subset) of downstream customers. \nCounterfeit parts look like regular parts and are a form of fraud. Counterfeiters prey on customers seeking high- \nquality parts from reputable manufacturers and instead are unknowingly sold substandard or defective parts. A \ncounterfeiters intent to deceive is the difference between a counterfeit part and a faulty part, which has defects  \nor malicious functionalities  that are unknown to the manufacturer or the distributor.\nSCENARIO\nA malicious actor identifies a government contractor that provides ICT components and attempts to sell modified or \ncounterfeit products to them at discounted prices. While the contractor is legitimate and has the most to lose from \ncounterfeit products, they are unaware that there is a potential problem and do not conduct an initial analysis of \npossible counterfeiting risks that exist within its industry. To save money, the contractor purchases the counterfeit \ncomponents from the malicious actor and inserts them into their product. The counterfeit part has gone undetected \nin usability and functional testing and is placed into production. The resulting effect on the overall system and the \nend customer can take a variety of forms, such as impacting system performance, the availability of critical services, \nor resulting in the loss of data.Counterfeit \nComponentsSUPPLY CHAIN\nTHREAT SCENARIOS7\n POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\nUNINTENTIONAL ADOPTION OF \nUNTRUSTED COMPONENTS\nOVERVIEW\nA software supply chain attack occurs when malicious code is purposefully added to a component that is sent to \ntarget users. The code may be introduced to the component in several different ways, such as via compromise \nof the source code repository, theft of signing keys, or penetration of distribution sites and channels. As a part of \nan authorized and normal distribution channel, customers unknowingly acquire and deploy these compromised \ncomponents on to their systems and networks. Advanced malicious code typically does not disrupt normal \noperations and may not activate for several days or weeks, thereby remaining hidden from typical application and \nsoftware testing practices.\nSCENARIO\nA telecom munications  company buys core network systems management software from a trusted provider ; however, \nunbeknownst to the trusted provider, one of the components it uses in the product has been compromised and now \ncontains malicious code. This is a threat that results from inheriting risk decisions made by a supplier within the \nsupply chain that impacts the end user of the final product or service. The deeper into the supply chain it occurs, the \nmore difficult it is to identify in advance. This inserted vulnerability may be used by the malicious actor as a part of  a \nlarger attack chain that uses the malicious code to gain access within the core network of the telecom and pivot \ntowards other attack vectors.Inherited \nComponents8\n POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\nINHERITED VULNERABILITIES \nFROM 4G NETWORKS\nOVERVIEW\n5G builds upon previous generations of wireless network and will initially be integrated with 4G Long  Term Evolution \n(LTE) networks that contain legacy vulnerabilities. While 5G technologies are being designed to be more secure \nthan previous mobile network generations, they may be vulnerable to certain legacy exploits , such as Signaling \nSystem 7 (SS7) and diameter protocol vulnerabilities , because they will initially be overlaid on the existing 4G LTE \nnetworks. \nSCENARIO\nA threat actor gains access to a 5G small cell near a United States Government (USG) office and configures the \nsmall cell to allow for 4G spoofing. The threat actor then forces a downgrade in the 5G network to a vulnerable 4G \nconfiguration , which allows them to use vulnerabilities within SS7 to gain access to ICT components in use by \nemployees in the nearby USG office. The threat actor can then use that information to gain further access into \nmore secured networks, potentially gaining access to sensitive data.Legacy \nCommunication s \nInfrastructure5G SYSTEMS ARCHITECTURE \nTHREAT SCENARIOS9\n POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\nFIRMWARE VULNERABILITY WITHIN \nTHE MULTI-ACCESS EDGE COMPUTE\nOVERVIEW\nUnlike traditional network configurations, Multi-Access Edge Compute  (MEC) delivers core traffic functions \nlike data processing and storage within the last mile of telecommunication networks. The presence of system \ncomponents, such as hypervisors, operating systems, and applications in the MEC, may provide malicious actors \nwith additional attack vectors to intercept, manipulate, and destroy critical data. Untrusted components or malware \ninserted within the MEC may impact user privacy by providing malicious actors the capability to clone devices and \nimpersonate end-users to make calls, send texts, and use data. Malicious actors can use untrusted components or \nmalware to gain access to the MEC and end-user components, leveraging them to gain access to the wider radio \naccess network (RAN).\nSCENARIO\nA firmware vulnerability in the MEC allows a threat actor to gain a persistent foothold on the MEC system, which \nallows them to deny access to data and impact the ultra-low latency required by many 5G use cases. The malicious  \nactor can use this access to impact the confidentiality, integrity, and availability of the network by stealing sensitive \nsensor and user equipment data, modifying data streams, and denying access to certain data or sensor streams. \nThe malicious  actor now has the bandwidth to gain full access to the RAN and is able to clone end-users devices.10\nMulti-\nAccess Edge \nComputing\nPOTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\nTLP:WHITE\n\nGLOSSARY\nTERMS DEFINITIONS\n3G Thir d generation communications system, bringing Internet and higher bandwidth to \nmobile de\nvices.\n4G F\nourth generation communications system, offering speed and congestion \nim\nprovements over 3G\n4G Spoofing An attack where an agent can sub\nvert the security and privacy controls of 4G to \nenable phone call and messaging blocking, int\nerception and spoofing, location \ntracking, and targe\nted phishing attacks. Some security and privacy controls in 5G have \nbeen similarly spoof\ned.\nA\nttack Surface The places in a com\nputer or communications network where a trust boundary might \nbe cr\nossed by an unauthorized person or software/hardware.1\nCNCF Cloud Native Computing Foundation\nControls Pre\nvent threats from exercising a vulnerability.2\nCore Network The core ne twork forms the bridge between the RAN and the Internet, the wired \nt\nelephone system, and Internet protocol-based (IP-based) services. The core network \ncontr\nols RAN functions on the entire network: All data (e.g., voice, video, text) on a \nne\ntwork traverse the core, and it determines how those data are routed.3\nCyber Actor An agent employing a computer and/or network-based action against a target. \nDowngrade Attack An attack where the threat act\nor forces a network to downgrade from 5G to a 4G \nconfiguration which has security vulnerabilities \nEdge Com\npute The distribution of com\npute power closer to the edge to provide better quality of \ne\nxperience and to fulfill new use-cases.\nICT Inf\normation and communications technology\nIMSI International mobile subscriber identity\nMalicious actor An agent accessing a network or computer with malicious intent.\nMEC Multi-\nAccess Edge Compute, delivers 5G services from a distributed cloud enabling \nne\nw mobile use cases. It is a distributed cloud with multiple sites that bring the \ne\nxecution environment geographically closer to the UE. The main benefits of MEC are \nlo\nw latency, high bandwidth, device density, data offload, and trusted computing and \nst\norage. These benefits enable 5G use cases like enterprise private networks for\nindustrial IoT\n, smart cities, autonomous vehicles, remote surgery, virtual reality, cloud\ngaming, and high-q\nuality video streaming without buffering.\nNSA 5G non-standalone\n1Shostack, Adam. Threat Modeling: Designing for Security. Wiley, 2014. \n2Pfleeger, Charles P., et al. Security in Computing. Pearson India Education Services, 2018.\n3Rasser, Martinj, and Ainikki Riikonen. Center for a New American Security, 2020, Open Future: The Way Forward on 5G, www.cnas.org/\npublications/repor\nts/open-future. \nTLP:WHITEPOTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE 11\n\nTERMS DEFINITIONS\nRAN Radio Access Network\nThe RAN is the part of a telecommunications syst\nem that connects individual \nwireless devices to o\nther parts of a network through radio connections. While the \ninterf\naces to do so are open and standardized, the equipment neededbase stations, \nradio amplifiers, management syst\nemsare closed (not interoperable with other \nvendors) and do no\nt completely abide by these standards. RAN equipment is vendor-\nproprietar\ny, and the global market is dominated by just a handful of manufacturers: \nHuawei, Nokia, Ericsson, and t\no a lesser extent Samsung and ZTE. In 4G, the fourth \ngeneration of wireless telecommunications, this part of the ne\ntwork is called the \nedge. \nThere are only two major non- Chinese suppliers of RAN eq\nuipment: Nokia of \nFinland and Ericsson of Sweden. Samsung of South Korea is a distant thir\nd. Given \nthe importance of RAN t\no future critical digital infrastructure, the industry is too \nconsolidated to ensure sufficient supply chain div\nersity and security.4\nSA 5G standalone\nSDN Software Defined Network\nS-NSSAI Single Network Slice Selection Assistance Information\nSS7 Signaling System No. 7, a telephony protocol used to manage telephone connections.\nThreat  Agent An agent actively att\nempting to exploit a vulnerability.\nThreat Model Threat modeling is about using models to find security problems. Using a model \nmeans abstracting awa\ny a lot of details to provide a look at a bigger picture, rather \nthan the code itself. You model because it enables you t\no find issues in things you \nhavent built y\net, and because it enables you to catch a problem before it starts. Lastly, \nyou threat model as a wa\ny to anticipate the threats that could affect you.5\nThreat Vector The path or means by which a threat may exploit a vulnerability\nTrust Boundary The boundaries in a computer or network over which agents of different organizations \nor trust levels interact. Threats are not restricted to trust boundaries but almost always involve actions across trust boundaries.\n6\nUDM User Data Management\nUE User Equipment\nUMTS Universal mobile telecommunications system\nURLLC Ultra-Reliable Low-Latency Communications\nUSG United States Government\nUSIM Universal Subscriber Identity Module\nVulnerability A weakness in a computer system or network that could be exploited to cause harm or disruption.\n7\nV2X Vehicle-to-Everything\nVNF Virtualized Network Function\n4Rasser and Riikonen. Open Future: The Way Forward on 5G. \n5Shostack. Threat Modeling: Designing for Security, 3. \n6Shostack. Threat Modeling: Designing for Security, 541. \n7Pfleeger, Security in Computing.\nTLP:WHITE12 POTENTIAL THREAT VECTORS TO 5G INFRASTRUCTURE\n\nTLP:WHITE\n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "potential threat vectors to 5g infrastructure",
  "source": "nsa",
  "id": "2d8fda9cafb58fd0cece8546e53fc0bf301c00b3816189bdfac2ce656b0fd14f"
}