{
  "markdown": "TLP:CLEAR  \n\n\nTLP:CLEAR   \nPotential Threats to 5G Network Slicing  i \nTLP:CLEAR   Disclaimer \nThis document was written for general informational purposes only. It is intended to apply to \na variety of factual circumstances and industry stakeholders. The guidance in this document is provided as is based on knowledge and recommended practices in ex istence at the time \nof publication. Readers should confer with their respective network administrators and information security personnel to obtain advice applicable to their individual circumstances. \nIn no event shall the United States Government be liabl e for any damages arising in any way \nout of the use of or reliance on this guidance. \n \nReference herein to any specific commercial product, process, or service by trade name, \ntrademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not \nbe used for advertising or product endorsement purposes. All trademarks are the property of their respective owners  \nPurpose  \nThe National Security Agency ( NSA ) and The Cybersecurity and Infrastructure Security \nAgency  (CISA ) developed this document in furtherance of their respective cybersecurity \nmissions, including their responsibilities to develop and issue cybersecurity specifications and mitigations. This information may be shared broadly to reach all appropriate \nstakeholders.  \nContact \nClient Requirements / Inquiries : Enduring Security Framework nsaesf@cyber.nsa.gov  \nMedia Inquiries / Press Desk : \nNSA  Media Relations, 443 -634- 0721, MediaRelations@nsa.gov\nCISA  Media Relations, 703 -235- 2010, CISAMedia@cisa.dhs.gov\n\nTLP:CLEARWHITE  \nTLP:CLEAR   Table of Contents  \nExecutive Summary .............................................................................................................................................. 1  \nNetwork Slicing Overview ................................................................................................................................. 2  \nDefinition  ............................................................................................................................................................. 2  \nDeploying a Network Slice ............................................................................................................................ 2  \nNetwork Function Virtualization ................................................................................................................ 4  \nNetwork Slicing Threat Vectors  ...................................................................................................................... 4  \nNetwork Slicing Threat  In Real Life  ....................................................................................................... 6  \nManagement and Monitoring of a Network Slice ..................................................................................... 7  \nStrategies for Network Slicing  ......................................................................................................................... 9  \nMulti -Layer Security  ........................................................................................................................................ 9  \nCross Domain Solutions  .............................................................................................................................. 10 \nPost Quantum Cryptography  .................................................................................................................... 10 \nIsolation  ............................................................................................................................................................. 10 \nConclusion ............................................................................................................................................................. 10 \n\nTLP:CLEAR   \nPotential Threats to 5G Network Slicing  1 \nExecutive Summary  \nBuilding upon the work published in the Enduring Security Frameworks Potential Threat \nVectors to 5G Infrastructure,  the Enduring Security Framework1 (ESF) established a working \npanel comprised of government and industry experts and conducted an in- depth review of \nnetwork slicing, a key component of 5G infrastructure. This working panel assessed the \nsecurity, risks, benefits, design, deployment, operations, and maintenance of a network slice. \nFor this paper, a network slice is defined as an end -to-end logi cal network that provides \nspecific network capabilities and characteristics for a user.  \nAs with any emerging technology, with increased benefits come increased risks. This paper \nintends  to introduce 5G stakeholders to the benefits associated with network slicing and \nintroduce perceived risks and management strategies that may address those risks.  \n1 The ESF is a cross -sector working group that operates under the auspices of Critical Infrastructure Partnership \nAdvisory Council (CIPAC) to address threats and risks to the security and stability o f U.S. national security \nsystems. It is comprised of experts from the U.S. government as well as representatives from the Information \nTechnology, Communications, and the Defense Industrial Base sectors. The ESF is charged with bringing \ntogether representat ives from private and public sectors to work on intelligence -driven, shared cybersecurity \nchallenges. \nTLP:CLEAR   \n\nTLP:CLEAR   \n2 Potential Threats to 5G Network Slicing  \nTLP:CLEAR   Network Slicing Overview  \nDefinition  \nA network slice is an end -to-end logical network that provides specific network capabilities \nand characteristics to fit a users needs. Although multiple network slices run on a single \nphysical network, network slice users are authenticated for only one network area, enabling \ndata and security isolation.  \nDeploying a Network Slice  \nA network slice spans multiple connected components that form a network. These \ncomponents include physical computing, storage, and networking infrastructure; with \nnetwork slicing,  they are virtualized, and protocols are in place to create specific network \nslices for specific users or applications. It is important to note that network slicing components can span multiple operators, so interoperability, security, and robustness \nbecom e important challenges to address. From a security standpoint, the resources of one \nnetwork slice should be isolated from other network slices to ensure confidentiality, integrity , \nand availability.  \nFor example, vehicles in an autonomous fleet can be on di fferent network slices even though \nthey are providing similar services. Graphics -intensive applications like Virtual Reality or \nAugmented Reality could have a network slice separating them from other applications. \nDifferent network slices can also be provi sioned for a customer within the same enterprise \nlocation that separates different user groups based on their roles.  \nFigure 1 Possible uses for a network slice2 \n2 U.S. Government Accountability Office. https://www.gao.gov/assets/gao- 21-26sp.pdf  \n\n\nTLP:CLEAR   \nPotential Threats to 5G Network Slicing  3 \nTLP:CLEAR   This type of architecture heavily relies on a Network -as-a-Service (NaaS) model, combining \nInfrastructure -as-a-Service with network and security services, which enhances the \noperational efficiency and resiliency of the 5G infrastructure. Within a 5G archit ecture, the \nplan is to deliver the whole NaaS so that different customer segments can be efficiently \nsupported. The 5G network is re -designed based on a service- oriented architecture by \nbreaking everything down into detailed functions and sub -functions.  \nAccess and Mobility Management Function (AMF) offers registration, reachability,\nSession Management Function (SMF) to handle  session establishment and session\nmanagement responsibilities.\nPacket routing and forwarding functions are now realized as services rendered\nthrough a new network function called the User Plane Function (UPF ), and is achieved\nwith technologies such as Software Defined Network (SDN) and 5G Network Function\nVirtualization (NFV).\nIn order to design, deploy, manage, and operate a mobile network with the functions \npreviously mentioned, mobile network operators must use a Management and Network Orchestration (MANO) system. MANO systems allow for a mobile  network operator to create \nend-to-end network slices and operate them over their entire lifecycle as they are ordered by \na customer. Below is an example of a MANO system that  can create, manage, and operate a \nnetwork slice end -to-end. The MANO system shown supports slice design and creation,  \nactivation, deactivation, and termination across t he Radio Access Network (RAN), core \nnetwork, and transport network domains.\n \nFigure 2 Architecture Diagram for End- to-End Network Slicing  \n\n\nTLP:CLEAR   \n4 Potential Threats to 5G Network Slicing  \nTLP:CLEAR   Network Function Virtualization  \nNetwork Function Virtualization (NFV) is a core 5G architecture that is fundamental to \nnetwork slicing. NFV enables the following attributes:   \nEliminates the need for purpose- built hardware and allows carriers to move network\nfunctions, such as routers and firewalls, to cloud -based servers.\nMoves network functions nearer to the radio interface or out into the cloud , which\nenables a flexible and elastic network that is more capable of meeting the demands of\nnetwork traffic in real time.\nOptimizes performance of multiple applications, even those that require different\nlevels of  bandwidth, latency, availability, and security.\nIncreases monitoring and logging options; enhancing the visibility into the system andthe ability to detect anomalies or prevent vulnerability exploitations.\nNetwork Slicing Threat Vectors \nThe ESF previou sly identified potential threat vectors to 5G infrastructure spanning policy \nand standards, supply chain, and system architecture, as reported in Potential Threat Vectors \nto 5G Infrastructure. Although all are important, for the purposes of assessing threa ts to \nnetwork slicing, the primary concern is systems architecture. Within 5G systems architecture, as ascertained  by ESF, the following sub -threats were identified.  \nSoftware Configuration\nNetwork Security\nNetwork Slicing\nLegacy Communications Infrastructure\nMulti -Access Edge Computing\nSpectrum Sharing\nSoftware Defined Networking\nIn Potential Threat Vectors to 5G Infrastructure, the threat presented by an improperly \ndeveloped and implemented network slice is  described as:  \nNetwork Slicing allows users to be authenticated for only one network area, enabling \ndata and security isolation. However, network slicing can be difficult to manage, and the \nslices add complexity to the network. While there are standards defining specifications \nfor how network operators build their 5G network, there are not clear specifications for \nhow network operators should develop and implement security for network slicing. \nImproper network slice management may allow malicious actors to access data from \ndiffer ent network slices or deny access to prioritized users.  \n\nTLP:CLEAR   \nPotential Threats to 5G Network Slicing  5 \nFurther analysis of the relationship between general 5G threat vectors and a network slicing \nthreat, as defined above, was used to develop a high , medium , and low relativity assessment. \nThis informa tion is reflected in Table 1.  \nThreat Vectors  Descriptions  Network Slicing Relativity  \nDoS attack on signaling \nplane   DoS on c entralized control elements  H \nHijacking attacks Attacks on SDN h ypervisor  controller  L \nUnauthorized access Unauthorized access through low-\npower access points   L \nConfiguration attacks Attacks  that take advantage of \nmisconfigured system controls  H \nSaturation attacks  Ping -pong behavior in access points \nand MME due to service saturation   M \nPenetration attacks Malware attack that exposes \nsubscriber info   M \nUser identity  theft  Breaking into user information \ndatabases and stealing user \ncredentials  M \nMan -in-the -Middle attack   Accessing unencrypted channels or \nnetwork links and acting as a relay in \ncommunications between 2 parties     H \nTCP Level attacks TCP Session or SYN Flooding in \ngateways, routers   M \nKey exposure Compromise of the a uthentication and \nkey agreement  L \nSession replay attack  Session keys in a non -3GPP access  M \nIP spoofing  Control channels  M \nScanning attacks  Radio interface interference  L \nIMSI caching attacks  Roaming and U ser Equipment (U E) M \nJamming attacks  Wireless channels  L \nChannel prediction attacks  Radio interfaces  L \nActive eavesdropping  Control channel  L \nPassive eavesdropping Eavesdropping on control channel ( i.e., \ninter -Virtual Network Function ( VNF ) \ndata) can reveal slice configurations \nand users, and enable hijacking and \nother attacks   L \nNAS signaling storms Attack against UE traffic and signaling  \nmessages to core network   M \nTraffic bursts by IoT  Saturation of GTP endpoints  M \nTabl e 1 Potential 5 G threat v ectors \nAmong the se threat vectors, three were assessed as having a high level of relativity to network \nslicing. These threats are denial of service (DoS), Man- in-the-Middle  (MitM) attacks , and \nconfiguration attacks. \nTLP:CLEAR   \n\nTLP:CLEAR   \n6 Potential Threats to 5G Network Slicing  \nDenial of Service Attacks\noDoS attacks primarily impact the availability of a network slice , causing\ncommunication services to be severely compromised or unavailable under\nthese types of attacks.\noDoS attacks will likely target the signaling plane .\nMan-in-the-Middle Attacks\noMitM  attacks can have a broad range of adverse effects on the confidentiality,\nintegrity, and availability of a network slice.\noMitM  attacks imply that the adversary relays and possibly alters\nthe communications  between two endpoints. Such an attack could be\ndevastating , as misinformation and disinformation could result from the\nmalicious actor modifying the contents of the messages.\noConfidentiality can also be violated when information or data is intercepted\nand exposed to the malicious actor.\nConfiguration Attacks\noConfiguration attacks have a broad range of adverse effects on theconfidentiality, integrity, and availability of a netw ork slice.\noThese attacks are when malicious actors exploit configured system controls.\noThey may also include security features that are inadvertently turned off or\nsystem monitoring services being disabled.\nAlthough not identified in Table 1 , Network Function Virtualization  (NFV)  is another aspect \nof network slicing that presents increased potential risks. These include but are not limited \nto:  \nThe additional microservices and functionalities required by NFV make  integration\nand testing activi ties more difficult, resulting in new attack surfaces.\nIn a virtualized architecture it will be more difficult to detect and recognize the types\nof traffic crossing these networks and mitigate against any new threats.\nMalicious actors may compromise a network slice by gaining access via the physical\ncomponents from another slice due to a lack of isolation. This type of compromise may\nresult in data spills.\nNetwork S licing T hreat  In Real Li fe \nNetwork slicing will play a pivotal role in emerging techno logy such as autonomous vehicles. \nThe slice is used to connect to and communicate with the autonomous vehicle which can \npresent the opportunity for a malicious actor to conduct an International Mobile Subscriber \nIdentity (IMSI) caching attack which degrades the performance, reliability, and robustness of \nthe network services.  \nThe actor can use IMSI caching to expose the autonomous vehicles geolocation, as well as \ninformation about the cargo such as sender, destination, and traffic routes. From here, the \nactor can launch a DoS attack on the network signaling plane to cause disruptions \nbetween \nTLP:CLEAR   \n\nTLP:CLEAR   \nPotential Threats to 5G Network Slicing  7 \nthe autonomous vehicle and its authorized controller. Assuming the malicious actor has \naccess to the subscriber identity, the actor can also separately launch a configuration attack \nto tamper with the security features and virtual network function (VNF) po licies.  \nThis can compromise authentication and authorization policies , thereby granting illicit  access \nto the network slice. This type of attack can afford the malicious actor an opportunity to \nexpand unauthorized access to other network slices if the security between the slices is not adequate.  \nManagement and Monitoring of a Network Slice  \nDue to the nature of the threats to network slicing, proper management and continu ous \nmonitoring are crucial to the security of a network slice. The management can be ap plied at \nfour logical layers, as described in Table 2. \nLogical Layer  Descriptions  \nNetwork Slice Subnet \nManagement Function (NSSMF)  NSSMF decomposes slice subnet instances on its network into \nvirtualized network functions (VNF) instances and related \nconnections; access network (AN), transport network (TN) and core \nnetwork (CN) have their respective NSSMFs to manage and \norchestrate their slice subnets.   \nNetwork Slice Management \nFunction (NSMF)  NSMF manages and orchestrates network slice instances and \ndecomposes network slice requirements into network slice subnet requirements.  \nCommunication Service \nManagement Function (CSMF)  CSMF translates service requirements into specific requirements for \nnetwork slicing, such as the number of users allowed, uplink and \ndownlink transmission rates, latency, and jitter. It also manages \nservice subscription and cancellation.  \nCapability Exposure Pl atform  This platform provides standard application programming interfaces \nand a self -management portal; it also connects to the CSMF, NSMF, \nbusiness support system (BSS), operations support system (OSS), network exposure function (NEF), multi- access edge c omputing \n(MEC) and other such functions and nodes that integrate and orchestrate their network capabilities.  \nTable 2 Network Slicing M anagement P lane logical layers \nFrom a network slicing management perspective, monitoring should be performed relative \nto these four logical layers. This is especially critical due to the dynamic and complex nature \nof 5G network s. These activities are also critical as a malicious actor attempts to disrupt, deny, \nor degrade a mobile network operators 5G infrastruc ture.  \nIn addition to proper network slice management, continual monitoring is crucial in detecting \nmalicious activity. Mobile network monitoring and security tools often focus on network \nperformance, fraud detection, revenue assurance, or device behavior that impacts network \nperformance and not on detecting adversarial malicious activity. Table 2 lists typical \nmobile \nTLP:CLEAR   \n\nTLP:CLEAR   \n8 Potential Threats to 5G Network Slicing  \nTLP:CLEAR   network monitoring types, as well as recommended network monitoring types to consider \nwhen monitoring 5G network security.  \nTypes of Network \nMonitoring  Explanation  \nPerformance \nManagement  Due to the complex nature of mobile networks and vendors diversity of hosting \nplatforms, a unique overarching performance management technique across \ndifferent networks and vendors is required.  \nQuality of Service \n(QoS)  5G QoS should include network performance metrics (e.g., latency, throughput, etc.) \nbut might also include availability, reliability, accessibility, retainability, etc.  \nSecurity Controls  The Risk Management Framework (RMF) process is a cycl ical process to ensure \nsecurity controls and best practices are in place. NIST 1800 -33B is an example of \nsecurity controls for 5G cybersecurity.  \nControl plane \nCommunication  Control plane communication is not only protected for privacy but also protected \nagains t a malicious actors modifications, performance issues, and anomalous \nbehaviors.  \nUser -plane \nCommunication  This is the communication that connects the actual data coming over the Radio \nAccess Network (RAN) to the Internet, which is helpfu l to detect acceptable use \nviolations.  \nAnomaly Detection  Anomaly detection is the capability of identifying unusual activities or behaviors in \nnetworks. A variety of sensors, filtering and advanced (e.g., AI/ML -based) security \nanalytics are necessary to detect sophisticated and zero -day threats.  \nTable 3 Types of Network Monitoring for 5G Networks  \nThrough 5G network monitoring, various types of data can be collected. The collected data \ncan be analyzed and used to gain insight into  authorized and unauthorized network activity. \nThis data can then be used to build network analytics, network alerting, n etwork \nvisualization, and network reporting. Table 3 provides a description of these data processing \nactivities.  \nData Processing  Description  \nAnalytics  Analytics is about finding patterns in disparate data sources, which requires the \nability to collect, process and interpret data.  \nAlerting  Alerts make data useful. As data is a crucial aspect of network performance and \nsecurity monitoring. Organization relies on accurate alert notifications so that \nappropriate resources can be applied to respond to potential system failures and \nmalicious effects.  \nVisualization  A good dashboard environment should compose of easy -to-understand \nvisualization tool for both technical and non -technical users. The dashboard \nshould display highest -level information (which devices are at risk, aggregate \nreports, system health, etc.), but also provides the ability to drill down as \nappropriate.  \nReporting  Moni toring performs multiple analyse s and provides a reporting summary, for \nexample system status, overview, and open summary.  \nTable 4 Data Processing in 5G Network Monitoring  \n\nTLP:CLEAR   \nPotential Threats to 5G Network Slicing  9 \nStrategies for Network Slicing  \nAs discussed in the previous sections, it is paramount to ensure confidentiality, integrity , and \navailability for 5G network slicing protection. In addition , more advanced mitigations might \ninclude Zero Trust Architecture (ZTA) requirements, Multi- Layer Security (MLS), Cross -\nDomain Solutions (CDS), Post -Quantum Cryptography (PQC), and I solation.   \nZero Trust Architecture \nZTA is based on the principle of never trust, always verify, which directly relates to the \nconfidentiality and integrity of a given system. It focuses on eliminating implicit trust and continuously validating every stage of a digital interaction through strong authentication and authorization methods. If implemented appropriately, it can drastically reduce the possibility \nof attacks like M itM and configuration attacks in network slicing.   \nUpon detecting anomalous  behavior, var ious actions can be triggered , including segregating \nand isolating the interactions, terminating access credentials, or initiating multi -factor \nauthentication (MFA). The tenets of ZTA aim to reduce the exposure of resources to malicious actors by leveraging network segmentation. This can prevent incidents and minimize lateral \nmovement.  \nCommon ZTA techniques:  \nMFA\nEncryption\nAccess control\nMulti -Layer Security \nZTA is also a prerequisite for enabling Multi -Layered Security (MLS). With the proper access \ncontrol and authentication, MLS permits access  to users with different levels of access while \npreventing users from obtaining access to information for which they lack authorization. MLS \nprotects itself from subversion and has robust mechanisms to separate infor mation domains \nbased on trustworthiness.  \nTLP:CLEAR   \n\n\nTLP:CLEAR   \n10 Potential Threats to 5G Network Slicing  \nTLP:CLEAR   Cross- Domain Solutions \nCross -Domain Solutions (CDS) is defined as a form of controlled interface, a boundary with a \nset of mechanisms that enforces the security policies and controls the flow of information \nbetween interconnected information systems, that provides the ability to manually and/or \nautomatically access and/or transfer information between different security domains3. CDS \nis intended for use in high -value networks where assurance- based security measures, such \nas firewalls, Security Information and Event Management, and Intrusion Detection System s, \nare not sufficient to ensure the security of the trusted domain.  \nPost -Quantum Cryptography  \nAnother way to further mitigate ris ks is the use of advanced encryption techniques.  A future \nquantum computer, if built, would be capable of undermining the widely deployed  public key \nalgorithms currently used for asymmetric key exchanges and digital signatures. New quantum -safe solutions will eventually need to be adopted in critical infrastructure to \nmitigate this potential vulnerability. Post -quantum cryptography (PQC) algorithms are under \nevaluation and will be standardized for the relevant technologies, including 5G. PQC can be seen as  a possible solution to enhance data protection when a higher level of security is \nrequired. 5G vendors and operators must incorporate updated standards to mitigate potential future risks, as they become available.  \nIsolation  \nIsolation is another cyber tech nique to enhance security in 5G network slicing. The l evel and \nstrength of isolation may vary depending on slicing requirements and usage. In some network \nslicing instances, there may be a security requirement for strict slice isolation, but other \nslicing instances may require the need for communication between slices. Thus, isolation may \nbe perceived in many ways, and it constitutes a set of properties chosen according to \nimplementation needs. Isolation could be based on a sandbox, virtual machine, operati ng \nsystem, or hardware and physical. Some of the enabling technologies might include physical resource block scheduling, slice scheduling, and traffic shaping.  \nConclusion  \nAlthough network slicing is not solely unique to 5G, it is a critical component becau se 5G \nspecifications call for network slicing as a fundamental component and therefore require network operators to adopt security practices that can mitigate threats like those described \nin this paper, DoS, MitM attacks, and configuration attacks.  \nThe mon itoring and maintenance of a network slice are  crucial to detecting and mitigating \npotential compromises and form ing a basic level of defense. For more robust security, \nnetwork operators should consider techniques, as referenced in this paper, such as zero  trust, \nmulti -layer security, cross -domain solutions, post -quantum cryptography, and isolation.  \n3 NIST Computer Security Resource Center. https://csrc.nist.gov/glossa ry/term/cross_domain_solution.  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "potential threats to 5g network slicing_508c_final",
  "source": "nsa",
  "id": "56af110b61bec4abf773462f7c8725afbfa8fc2569ef14313d1ab8cccaee1aac"
}