{
  "markdown": "  \nU/OO/148259 -20 | PP-20-0504  | October 2020  ver. 1.2 \nNational Security Agency | Cybersecurity Information  \nSecuring  IPsec Virtual Private Network s  \nMany organizations currently utilize IP Security (IPsec) Virtual Private Networks (VPNs) to connect remote sites and \nenable telework capabilities. These connections use cryptography  to protect sensitive information that traverse s untrusted \nnetworks. To protect this traffic  and en sure data confidentiality , it is critical that t hese VPNs use strong cryptography.  This \nguidance identifies  common VPN misconfigurations and  vulnerabilities .1  \nMaintaining a secure VPN tunnel can be complex and requires regular maintenance. To maintain a secure VPN, network \nadministrators should perform the following tasks on a regular basis:  \n Reduce the VPN gateway attack surface  \n Verify that cryptographic  algorithms are  Committee on National Sec urity Systems Policy (CNSSP) 15 -compliant  \n Avoid using  default VPN settings  \n Remove unused or non -compliant cryptography  suites  \n Apply vendor -provided updates (i.e. patches) for VPN gateways and clients  \nReduce the VPN gateway attack surface  \nVPN gateways tend to be directly accessible from the Internet and are prone to network scanning , brute force attacks, and \nzero-day vulnerabiliti es. To mitigate many of these vulnerabilities, network administrators should implement strict traffic \nfiltering rules  to limit the ports, protocols, and IP addresses of network traffic to VPN devices . If traffic cannot be filtered to \na specific IP address,  NSA recommends  an Intrusion Prevent ion System (IPS) in front of the VPN gateway to monitor for \nundesired  IPsec traffic and inspect IPsec session negotiations.  \nVerify only CNSSP 15 -compliant algorithms are in use \nAll IPsec VPN configurations require at lea st two items: (1) the Internet Security Association and Key Management \nProtocol ( ISAKMP ) or Internet Key Exchange ( IKE) policy ; and (2) the IPsec policy.  If the cryptography on either of these \npolicies  is configured to allow obsolete  cryptographic algorith ms, the entire VPN is at risk  and dat a confidentiality may be \nlost. Annex B of CNSSP 15 provides guidance on using strong cryptograph y [1]. As the computing environment evolves \nand new weaknesses in algorithms are identified, administrators should prepare for cryptographic agility: periodically \ncheck CNSSP and NIST guidance for the latest cryptographic requirements, standards, and recommendat ions.  \nWhen configuring ISAKMP/IKE , many vendors support having sever al possible ISAKMP/IKE policies. The device then \nchoose s the strongest matching policy between the remote and local ends of the VPN. Some vendors do this through \npriority numbers and other s through explicit selection. NSA recommends  configuring only those policies that strictly use  \nCNSSP 15 -compliant  algorithms ,  and removing all others . Also, if priority numbers are used, the strongest I SAKMP/IKE \npolicy should be  the highest priority . Many vendors also support configuring multiple IPsec  policies; however, these \npolicies are normally explicitly configured for a specific VPN. NSA recommends utilizing the strongest FIPS -validated \ncryptography  suites supported by the device.  \nThe best way to verify that existing VPN configurations are using  approved cryptographic  algorithms  is to review the \ncurrent ISAKMP/IKE and IPsec security associations (SAs). NSA recommends using this ap proach when reviewing \nISAKMP/IKE and IPsec configurations because it displays  the exact cryptography  settings that were negotiated . \nOtherwise, administrators may miss connections where a device is selecting a non -compliant algorithm that was a device \ndefau lt or left over from a previous VPN configuration.  \nIf SAs are identified with non -compliant algorithms, administrators should  immediately investigate why the VPN negotiated \na lower cryptography  standard and make appropriate configuration changes. Also, if  utilizing pre -shared keys for VPN \nauthentication , NSA recommends that all keys be replaced as they may be compromised . \n                                            \n1 For detailed instructions on how to securely configure  an IPsec VPN , please refer to the Configuring  IPsec Virtual Private Networks  guide at https://www.nsa.gov/cybersecurity -\nadvisories .  \n\n \n \n U/OO/148259 -20 | PP-20-0504 | Oct ober 2020  ver. 1.2 2 \nNSA | Securing IPsec Virtual Private Networks  \nAvoid using default VPN settings  \nDue to the complexity of establishing a VPN, many vendors provide default configurations, automated configuration \nscripts, or graphical user interface wizards to aid in the deployment of VPNs. These tools take care of setting up the \nvarious aspects of a VP N to include ISAKMP/IKE and IPsec policies. However, many will configure a wide range of \ncryptography  suites to ensure compatibility with the remote side of a VPN.  NSA rec ommends avoiding these tools as they \nmay allow undesired cryptography  suites . If thes e tools are used, evaluate all configuration settings that the tool d eployed. \nAdministrators should  then remove any non -compliant ISAKMP/IKE and IPsec policies. As a best practice, administrators \nshould not utilize any default settings and ensure that all ISAKMP/IKE and IPsec policies are explicitly configured for the \nCNSS P 15-compliant algorithms.  \nRemove unused or non-compliant cryptography  suites  \nIt is very common for vendors to include extra ISAKMP/IKE and I Psec policies by default. These extra policies may \ninclude non -compliant cryptographic  algorithms. Leaving extra ISAKMP/IKE and IPsec policies as acceptable policies  \ncreates a vulnerability  to downgrade  attack s. In downgrade attacks,  a malicious  user or Man -in-the-Middle offers only \nobsolete  cryptograp hy suites and forces the VPN endpoints to negotiate non -compliant cryptography  suites.  In doing so, it \nleaves the encrypted VPN vulnerable to decryption. Verifying  that only compliant ISAKMP/IKE and IPsec policies are \nconfigured and all unused or non -compl iant policies are explicitly removed from the configuration  mitigates this risk . NSA \nalso recommends periodically validating that only compliant policies are configured as the use of automated tools, \ngraphical interfaces, or user error could reintroduce th ese non -compliant policies.  \nApply vendor -provided updates  \nAfter ensuring that all configuration settings are using  compliant cryptography  suites and removing all non-compliant \nsuites , implement a robust patch manageme nt procedure . Over the past several years, multiple vulnerabilities have been \nreleased related to IPsec VPNs. Many of these vulnerabilities are only mitigated by routinely applying vendor -provided \npatches  to VPN gateways and clients . Many network equipment vendors all ow customers to sign up for notification emails \nfor new security alerts. These notifications are an excellent way to stay up -to-date on relevant out -of-cycle patches.  \nProtect the essential  \nVPNs are essential for enabling remote access and securely connecti ng remote sites , but without proper configuration, \npatch management, and hardening, VPNs are vulnerable to  attack. To ensure that the confidentiality and integrity of a \nVPN is  protected, reduce the VPN gateway attack surface, always use CNSSP 15 -compliant and FIPS -validated \ncryptography  suites, avoid using vendor defaults, disable all other cryptography  suites, and  apply patches in a timely \nmanner . \nWorks Cited  \n[1] CNSSP 15 - Use of Public Standards for Secure Information Sharing. Committee on National Securit y Systems, 20 October 2016. [Online] \nAvailable at: https://www.cnss.gov/CNSS/issuances/Policies.cfm   \nRelated Guidance  \n Mitigating Recent VPN Vulnerabilities . National Security Agency, 2019. [Online] Available  at: \nhttps://media.defense.gov/2019/Oct/07/2002191601/ -1/-1/0/CSA -MITIGATING -RECENT -VPN-VULNERABILITIES.PDF   \n Configuri ng IPsec Virtual Private Networks.  National Security Agency, July  2020.  Available at: https://www.nsa.gov/cybers ecurity -guidance   \nDisclaimer of Endorsement  \nThe information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Refere nce herein to any specific \ncommercial products, process, or service by trade name, t rademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nContact  \nClient Requirements / General Cybersecurity Inquiries: Cybersecurity Requirements Center, 410 -854-4200, Cybersecurity_Requests@nsa.gov   \nMedia inquiries / Press Desk: Media Relations, 443-634-0721, MediaRelations@nsa.gov   \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "securing_ipsec_vpn_executive_uoo148259_20_v1_2",
  "source": "nsa",
  "id": "cbbf1963fd726fa1c1dd326b26834756ab2bd7ec6493d3607c5617b4e89922f5"
}