{
  "markdown": " \nTLP:WHITE     \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSECURITY GUIDANCE FOR 5G \nCLOUD INFRASTRUCTURES  \nPart III:  \nData Protection  \n2021  \n \n\nPart III: Data Protection   i \n \nTLP:WHITE  DISCLAIMER OF ENDORSEMENT  \nThe guidance in this document is provided as is. In no event shall the United States \nGovernment be liable for any damages arising in any way out of the use of or reliance on this \nguidance. Reference herein to any specific commer cial product, process, or service by trade \nname, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not \nbe used for advertising or produc t endorsement purposes. All trademarks are the property of \ntheir respective owners.  \nPURPOSE  \nNSA and CISA developed this document in furtherance of their respective cybersecurity \nmissions, including their responsibilities to develop and issue cybersecurity specifications \nand mitigations. This information may be shared broadly to reach all appropriate \nstakeholders.  \nCONTACT  \nClient Requirements / Inquiries : Enduring Security Framework nsaesf@cyber.nsa.gov   \nMedia Inquiries / Press Desk : \n NSA  Media Relations , 443 -634-0721, MediaRelations@nsa.gov   \n CISA  Media Relations, 703 -235 -2010, CISAMedia@cisa.dhs.gov   \n \n\nii    Part III: Data Protection  \n \nTLP:WHITE  TABLE OF CONTENTS  \n \nBackground  ................................ ................................ ................................ ................................ .............................  1 \nScope  ................................ ................................ ................................ ................................ ................................ ...... 1 \n5G Cloud Security Challenge Overview  ................................ ................................ ................................ .... 1 \n5G Threat  ................................ ................................ ................................ ................................ .............................  2 \n5G Cloud Security Guidan ce ................................ ................................ ................................ .........................  2 \nData Protection  ................................ ................................ ................................ ................................ ......................  4 \nConfidentiality, Integrity, Availability (CIA) Triad  ................................ ................................ ..............  5 \nProtection of Data -in-Transit  ................................ ................................ ................................ .......................  6 \nProtection of Data -at-Rest  ................................ ................................ ................................ .............................  7 \nProtection of Data -in-Use ................................ ................................ ................................ ...........................  10 \nConclusion ................................ ................................ ................................ ................................ .............................  12 \n \n\nPart III: Data Protection   1 \n \nTLP:WHITE  BACKGROUND  \nThe Enduring Security Framework (ESF) hosted a 5G study group comprised of government \nand industry experts over the course of eight weeks during the summer of 2020 to explore \npotential threat vectors and vulnerabilities inherent to 5G infrastructures. At the conclusion \nof the study , the group recommended a three -pronged approach to explore this threat space1: \n1. Identify and assess threats posed to 5G;  \n2. Determine w hat standards and implementations can achieve a higher baseline of 5G \nsecurity; and  \n3. Identify risks inherent to the cloud that affect 5G security.  \nIn support of this task, the ESF established a 5G Cloud Working Panel to engage with experts \nacross governmen t and industry to document 5G cloud security challenges, threats, and \npotential mitigations, to include guidance, standards, and analytics. The result of this \ncollaboration is a four -part series of publications that addresses the third task identified by \nthe 5G study group: applying a threat -based approach to identify and mitigate risks in 5G \nnetworks that derives from the use of cloud technologies and  providing mitigations that can \nbe applied to harden 5G cloud infrastructures.  \nSCOPE  \nThis four -part series builds on the ESF Potential Threat Vectors to 5G Infrastructure  white \npaper, released in May 2021, which focused specifically on threats, vulnerabilities, and \nmitigations that apply to the deployment of 5G cloud infrastructures.2 \nAlthough all 5G network s takeholders can benefit from this guidance, the recommendations \nare intended for service providers  and system integrators  that build and configure 5G cloud \ninfrastructures . This includes core network equipment vendors, cloud service providers , \nintegrators, and mobile network operators. The audience for each set of recommendation s \nwill be identified  throughout the series, providing a layered approach to building hardened \n5G cloud deployments.  \n5G CLOUD SECURITY CHALLENGE OVERVIEW  \n5G networks are b eing designed to handle the bandwidth, compute, and storage \nrequirements that will be required for a predicted massive increase in network capacity as \n \n1 The ESF is a cross-sector working group that operates under the auspices of Critical Infrastructure \nPartnership Advisory Council (CIPAC) to address threats and risks to the security and stability of U.S. national \nsecurity systems. It is comprised of experts from the U.S. government as well as representatives from the \nInformation Technology, Communications, and the Defense Industrial Base sectors. The ESF is charged with \nbringing together representatives from private and public sectors to work on intelligen ce-driven, shared \ncybersecurity challenges. \n2 ESF, Potential Threat Vectors to 5G Infrastructure , 2021. https://www.nsa.gov/news-features/press-\nroom/Article/2601078/nsa-odni-and-cisa-release- 5g-analysis-paper \n\n2  Part III: Data Protection  \n \nTLP:WHITE  well as connected devices. For scalability, resilience, and agility, 5G networks leverage cloud \ninfrastru ctures in the radio access network, core, and network edge. Cloud technologies \nunderpin the implementation of virtual networking in 5G, enabling the dynamic allocation \nand management of networks for specific use cases, mobile network operators, or customer s. \nA characteristic of cloud infrastructure that presents a significant security challenge in 5G is \nmultitenancy, the use of a shared physical infrastructure by multiple cloud infrastructure \ncustomers, e.g., mobile network operators. Multitenancy highlight s the need to harden and \nsecurely configure technologies that isolate the workloads (e.g., virtualization/  \ncontainerization) for each of those customers. In addition, cloud providers and mobile \nnetwork operators may share security responsibilities in a man ner that requires the \noperators to take responsibility to secure their tenancy in the cloud. An additional factor \ncreating security challenges is the increasing deployment of a multi -cloud deployment model \nin 5G with diverse and evolving architectures an d design approaches used by wireless \ncarriers.  \n5G THREAT  \nAmong the threat vectors presented in the Potential Threat Vectors to 5G Infrastructur e \nanalysis paper , several pertained to 5G cloud infrastructure, including Software/  \nConfiguration , Network Secur ity, Network Slicing , and Software Defined Networking .  \n5G networks, which are cloud -native, will be a lucrative target for cyber threat actors who \nwish to deny or degrade network resources or otherwise compromise information. To \ncounter this threat, it is  imperative that 5G cloud infrastructures be built and configured \nsecurely, with capabilities in place to detect and respond to threats, providing a hardened \nenvironment for deploying secure network functions. It is also important that 5G network \nfunctions  be implemented using security best practices. This four -part series will address the \nformer, providing guidance on hardening 5G cloud infrastructure deployments that are \ndriven by threat information.  This approach supports the May 2021 Presidential Execut ive \nOrder on  Improving the Nations Cybersecurity , which called  for secure  products and services  \nand enabling easier detection of unexpected behaviors and actions.3 \n3 Executive Office of the President, Executive Order on Improving the Nations Cybersecurity , 2021. \nhttps://www.whitehouse.gov/briefing -room/presidential -actions/2021/05/12/executive -order -on-\nimproving -the-nations -cybersecurity  5G CLOUD SECURITY GUIDANCE  \nBased on preliminary analysis and threat assessment, the Cloud Working Panel concluded \nthat the top 5G cloud infrastructure security challenges could be divided into a four -part \nseries that addressed different aspects of securing 5G clouds, facilitating the application of \nbroad sets of mitigations.  \n \n\nPart III: Data Protection   3 \n \nTLP:WHITE   Part I: Preve nt and Detect Lateral Movement : Detect malicious cyber actor activity \nin 5G clouds and prevent actors from leveraging the compromise of a single cloud \nresource to compromise the entire network.  \n Part II: Securely Isolate Network Resources : Ensure that there  is secure isolation \namong customer resources with emphasis on securing the container stack that \nsupports the running of virtual network functions.  \n Part III: Protect Data in Transit, In -Use, and at Rest : Ensure that network and \ncustomer data is secured dur ing all phases of the data lifecycle (at -rest, in transit, while \nbeing processed, upon destruction).  \n Part IV: Ensure Integrity of Infrastructure : Ensure that 5G cloud resources (e.g., \ncontainer images, templates, configuration) are not modified without aut horization.  \nZero Trust is the concept that perimeter defenses are no longer sufficient to secure a network, \nand that there should always be an assumption that a threat actor has established a foothold \nin the network4. This four -part series will document b est practices that strive to bring a Zero \nTrust mindset into 5G cloud endpoints and growing multi -cloud environments. All actions \nshould be explicitly verified and monitored. Although the best practices documented in this \nseries do not constitute a complet e Zero Trust template for securing 5G cloud infrastructures, \nif the best practices are applied, a 5G cloud environment will have made significant strides \ntoward the implementation of Zero Trust principles.  \n  \n \n4 NIST Special Publication 800 -207. Zero Trust Architectures . \nhttps://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800 -207.pdf  \n\n4  Part III: Data Protection  \n \nTLP:WHITE  \n \nDATA PROTECTION  \nA 5G Cloud Infrastructure compris es four security domains:  \n1. Workload : Virtual network functions (VNF) and cloud native network functions \n(CNF , previously referred to as  Containerized Network Functions) deployed on \nvirtual machines or containers, respectively.  \n2. Platform : Hardware, software, and network that supports workloads.  \n3. Front -end Networks : Network connectivity between the platform and other \nnetworks.  \n4. Back -end Networks : Network connectivity between the platform and Data Center \nOperations.5, 6 \nPart III focuses on  protecting the confidentiality and integrity of data within a 5G cloud \ninfrastructure. Data confidentiality measures should  be designed to protect  sensitive \ninformation from unauthorized  access . Data integrity ensures that data is not tampered with \nor altered by unauthorized access . Authenticity mechanisms play a key role in data \nprotection by confirming users and systems are authorized  with the correct rights to access \nthe 5G cloud infrastructu re data. 7  \n \n5 CNTT Cloud iNfrastructure Telco Taskforce Reference Model.  \nhttps://cntt.readthedocs.io/en/stable -elbrus/ref_model/chapters/chapter01.html  \n6 CNTT Cloud iNfrastructure Telco Taskforc e Chapter 7.  \nhttps://cntt.readthedocs.io/en/stable -elbrus/ref_model/chapters/chapter07.html#7.4.1  \n7 Ibid p4.  \n\nPart III: Data Protection   5 \n \nTLP:WHITE   \nFigure 1: 5G cloud infrastructure security domains  \nCONFIDENTIALITY , INTEGRITY , AVAILABILITY (CIA)  TRIAD  \nThe confidentiality , integrity, and availability (CIA)  triad  drives the requirements for secure \n5G cloud infrastructure systems and data.  Figure 1 illustrates the 5G cloud infrastructure \nsecurity domains and several  high -level requirements for achieving CIA  protection in each \ndomain . \nAudience : Cloud Providers, Mobile Network Operators, Customers  \nGuidance/Mitigations  \n The Platform must support confidentiality  and integrity  of data at -rest , in-transit , as \nwell as related metadata. 8 \n The Platform must support confidentiality and integrity of processes an d restrict \ninformation sharing with only authorized parties  (e.g., tenant).  \n The Platform must support confidentiality and integrity of process -related metadata \nand restrict information sharing with only authorized parties  (e.g., tenant ) \n The Platform must support confidentiality and integrity of workload resource \nutilization (RAM, CPU, Storage, Network I/O, cache, hardware offload) and restrict \ninformation sharing with only authorized parties . \n The Platform must not allow memory inspection by any actor other than the \nauthorized actors for the Entity to which Memory is assigned (e.g., tenants owning the \nworkload), for Lawful Inspection, an d by secure monitoring services.  \n \n8 Ibid p4.  \n\n6  Part III: Data Protection  \n \nTLP:WHITE   The monitoring system must not affect the data confidentiality of the infrastructure, \nworkloads, or the user data.  \nPROTECTION OF DATA-IN-TRANSIT  \nIn a 5G context, data in transit applies in two different planes: the control plane (CP) and the \nuser plane  (UP) . In 5G the control plane signaling data is encrypted via  Transport Layer \nSecurity  (TLS)9. Work is underway within the GSMA10 to define the implementation specifics \nfor how TLS is implemented in the control plane, and internet between networks.  The \nalgorithms required are specified by the 3GPP.11 \nControl plane data confidentiality and integrity are both required capabilities  on 5G \nendpoint devices and 5G base stations12.   All control plane data between the endpoint device \nand the base station (with a few exceptions, including unauthenticated emergency calls), \nmust have integrity protection.  However, confidentiality for control  plane data remains \noptional.    \nUser plane data confidentiality and integrity capabilities are required, but their use is \noptional at the discretion of the operator.   This is optional  primarily due to the additional \nprocessing load at the user equipment a nd base station and its impact to the size of the \nresulting communication packets.  \nAudience : Cloud Providers, Mobile Network Operators  \nGuidance/ Mitigations  \n Some of the user plane threats, such as Person -in-the-Middle and privacy violations, \nmay be mitigated through the required use of the optional confidentiality and required \nintegrity capabilities discussed above.  Others, such as routing and D enial of Service  \n(DoS) attacks must be handled in the control plane and above and  would benefit from \nthe required use of both the optional confidentiality and integrity capabilities \ndiscussed above.  \n Where there are multiple hosting facilities used in the provisioning of a service, \nnetwork communications between the facilities for  the purpose of backup, \nmanagement, and workload communications should be cryptographically protected \nin transit between data center  facilities.13 \n \n9 NIST Special Publication 800 -52  Guidelines for the Selection, Configuration, and Use of Transport Layer \nSecurity (TLS) Implementatio ns. https://csrc.nist.gov/publications/detail/sp/800 -52/rev -2/final  \n10 GSMA Cloud Infrastructure Reference Model v1.0.  \nhttps://www.gsma.com/newsroom/wp -content/uploads//NG.126 -v1.0 -1.pdf  \n11 3GPP Portal Specification #: 33.501.  \nhttps://portal.3gpp.org/desktop modules/Specifications/SpecificationDetails.aspx?specificationId=3169  \n12 Ibid p4.  \n13 Ibid p4.  \n\nPart III: Data Protection   7 \n \nTLP:WHITE   Systems transmitting data should  use protocols that limit security risk such as \nSNMPv3, SSH v2, ICMP, NTP, sy slog, and TLS v1.2 or higher. 14 For example, mutual \nauthentication must be performed b efore encrypted data is sent  from one system to \nanother.  \n Ensure all forms of data in transit are protected using strong cryptographic algorithms \nwith strong integrity p rotection. Select cryptographic algorithms, modes and key sizes \nfrom the Commercial National Security Algorithm Suite (CNSA)15 when applicable.  \n These mitigations require the use of key and certificate management systems \n(preferably global or federated, rather than ad hoc ) between organizations sending \nand receiving this encrypted data.  \n Multiple c loud -based Hardware Security Modules (HSMs) should b e employed where \npractical and should be required as a Root -of-Trust for high -risk or high -value data \ntransmissions.  This will also aid  availability, data security monitoring, and \ngovernance.  \nPROTECTION OF DATA-AT-REST \n5G d ata at rest is provided by any 5G network function responsible for storing data used in  \nuser plane  and control plane  processing . \nProtecting data at rest in a 5G solution must meet 3GPP requirements in addition to meeting \nlocal regulation s related to protecting sensitive and confidential data.  \nData at rest in a cloud environment, specifically a 5G cloud infrastructure,  can exist  in \nmultiple forms.  Examples of forms of data at rest include:  \n Persistent subscriber -level application data that allows subscribers to access the 5G \nnetwork.  \n Persi stent data that affects and tracks 5G Network Function (NF) processing.  \n Ephemeral data that affects and tracks 5G NF processing.  \n Confidential system internal data that controls  and defines the NF.  Confidential \nsystem internal data includes authentication data (e.g. PINs, cryptographic keys, \npasswords, and cookies) as well as system internal data that is not required for \n \n14 Ibid p4.  \n15 Commercial National Security Algorithm Suite.  \nhttps://apps.nsa.gov/iaarchive/programs/iad -initiatives/cnsa -suite.cfm  \n\n8  Part III: Data Protection  \n \nTLP:WHITE  systems administrators and could be of advantage to attackers (e.g. error messages \ncontaining stack traces) .16 \nData at rest can reside  in primary, replica or backup storage.   All forms of storage related to \ndata at rest must meet a minimum set of requirements for protecting data at rest.   Guidance \nrelated to protecting data at rest is available from the National Institute of Standards and \nTechnology ( NIST ). \n5G s ubscriber data exists in both storage related to the profile of the subscriber in the 5G \nenvironment  as well as in tracing or logging information related to the subscriber.  \nSubscriber data contains Personally Identifiable Information (PII) that define s unique \ncharacteristics of a subscriber  as well as sensitive subscriber data elements like the long -\nterm key K .17 PII and sensitive subscriber data must be protected when the data is at rest . \nConfidential system internal data must be prot ected as well by ensuring that access is limited \nand the data at rest is protected by strong cryptography and access rules.  \nAudience : Cloud Providers, Mobile Network Operators, Customers  \nGuidance /Mitigations  \n All data persisted to primary, replica, or backup storage is to be encrypted.18 \n Ensure all forms of data at rest are protected using strong cryptographic algorithms \nwith strong integrity protection . Select cryptographic algorithms, modes and key sizes \nfrom the Commercial National Security Algorithm  Suite (CNSA)15 when applicable.  \n Refresh cryptographic keys, used to protect data, periodically.  A good practice \ninvolves refreshing keys at least once a year.19 \n Best practice is to secure the workload volumes by encrypting them and storing the \ncryptographic keys at multiple safe locations.  \n The hypervisor should be configured to securely erase the virtual volume disks in the \nevent of applicatio n crashes or is intentionally destroyed to prevent it from \nunauthorized access.  \n Clean all subscriber data removed from the data at rest storage  \n The Platform should support self -encrypting storage devices.  \n \n16  3GPP Portal Specification #: 33 .117, Section 4.2.3.2.2.  \nhttps://portal.3gpp.org/desktopmodules/Specifications/SpecificationDetails.aspx?specificationId=2928  \n17 Ibid p6.  \n18 Ibid p4  \n19 NIST Special Publication 800 -53 Rev 5. Security and Privacy Controls for Information Systems and \nOrganizati ons. https://csrc.nist.gov/publications/detail/sp/800 -53/rev -5/final  \n\nPart III: Data Protection   9 \n \nTLP:WHITE   Institute policies and processes that evaluate and categorize data to ensure that data \ncontaining sensitive and confidential attributes receive the proper level of protection.  \n Perform security -related testing and auditing of environments that store data at rest \nto ensure the effectiveness of  the protection  scheme  and the protection of all sensitive \nand confidential data . \n Ensure that access , Identity and Access Management (IAM),  to data at rest is secured \nin a manner that strictly controls access to the data at rest according to the role, or \naccess needs, required by the accessor.  \n Ensure that access to data is traceable by ensuring that all accessors of data are \nuniquely identifiable.  \n Ensure the availability of the data by performing real -time or near real -time  back -ups \nof the data in order to protect  from attacks (e.g. , Ransomware attacks ) and facilitate \nrecovery from successful attacks . \n User authentication related to access to data at rest should use multi -factor \nauthentication  or Public Key Infrastructure (PK I) based certificate authentication . \n Ensure that tools are in place to detect data integrity impacting events and processes \nexist that define recovery procedures.  \n Cryptography enlisted to protect data at rest must be defined and approved by \nrelevant standa rds bodies such as the NIST.   NIST publication s provide guidance \nrelated to the use of approved cryptographic functions.  \n All forms of storage related to data at rest, such as primary, replica, and backup, must \nmeet the minimum requirements in terms of secu ring the data.  \n Backup storage can incorporate data integrity protection measures like a write once \nand read many approaches . \n The Platform must support Secure Provisioning, Availability, and Deprovisioning \n(Secure Clean -Up) of workload resources where Secur e Clean -Up includes tear -down, \ndefense  against virus , or other attacks. Note: Secure clean -up: tear -down, defending \nagainst virus or other attacks, or observing of cryptographic or user service data.  \n Like data -in-transit, m ultiple cloud -based Hardware Secu rity Modules (HSMs) should \nbe employed where practical and should be required as a Root -of-Trust for high -risk \nor high -value dat a-at-rest .  This will also aid regulatory requirements, availability, data \nsecurity monitoring, and governance.  \n  \n\n10  Part III: Data Protection  \n \nTLP:WHITE  PROTECTION OF DATA-IN-USE \nIt is universal practice  currently  in cloud and enterprise  environments  to protect data -at-\nrest using strong encryption in local and/or network -attached storage.   However, when the \nsame data is being processed by the central proce ssing unit (CPU), it is held as plain text in \nmemory and not protected by encryption.   Memory contains high -value assets such as \nstorage encryption keys, session keys, credentials, PII, customer IP, and important system \ndata. Virtualization, cloud, and mul ti-tenancy brings the additional dimension where \nenvironments (ex. VMs or Containers) from two different customers could be running on the \nsame machine.   For sensitive / regulated workloads, there is a desire to protect data - in- use \nfrom the underlying pr ivileged system stack as well as physical access threats. Therefore, it \nis critical that data in memory has comparable protection to data -at-rest.    This is the focus \nof confidential computing  protecting data in use on compute devices using hardware -base d \ntechniques like Trusted Execution Environments.   \nPlaintext sensitive data elements, such as the long -term key  K, should not leave the \nboundaries of the components  that use the data elements .  The Authentication credential \nRepository and Processing Functi on (ARPF) that resides in the 5G Unified Data Management \n(UDM) Network Function (NF) is an example of a boundary that uses  sensitive subscriber \ndata.  \nA Trusted Execution Environment (TEE) is an area in memory protected by the processor in \na computing devic e.  Hardware ensures confidentiality and integrity of code and data inside \na TEE. The code that runs in the TEE is authorized, attested, and verified. Data inside a TEE \ncannot be read or modified from outside the TEE even by privilege system processes. Dat a is \nonly visible while in the CPU caches during execution.      \nTEEs reduce the need to trust firmware and software layered on the system processing the \nworkload. The trusted compute base (TCB), the hardware, firmware, and software \ncomponents acting as the  trusted system, is very small.    In most TEEs, the TCB is the CPU \n(hardware and microcode) and the code defined by the owner.   In some cases, the code is \njust a specific application; in others, it might be a purpose -built micro  OS and the \napplication.   The CPU includes the TEE and the Rich Execution Environment (REE), allowing \nfor decisions on where applications and data should be processed according to protection \nneeds.   The REE executes non -sensitive data, whereas the TEE can be programmed to \nexecute enc ryption functions or the processing of sensitive applications for instance.   \nKnown TEE v ulnerabilities  of data -in-use include  vulnerabilities  in TEE code  and \ninfrastructure , the possibility for opening s ide-channels , and exposure of data by design \noutside of the TEE, e.g., c ode in TEE sends data to external application in the clear or fails to \nuse TEE intrinsic encryption features . \n  \n\nPart III: Data Protection   11 \n \nTLP:WHITE  Audience : Cloud Providers, Mobile Network Operators  \nGuidance/Mitigations  \n Implement S ource Code Analysis of Code prior  to lo ad into TEE  \n Perform r egular updates/patching of Systems & Firmware for latest security fixes  \n Leverage s ecure design guidance for code developed for TEE uses  \n Verif y and validate code before lode into TEE using cryptographic methods such as \nSignature o r hash checking.  \n Threats with the Mitigations provided by TEEs  including:  \no Malicious/compromised admin CSP: A bad actor at the Cloud Service Provider \n(CSP) cannot access the TEE memory even with physical access to the server.   \no Malicious/compromised tenant of a hypervisor: A rogue app or compromised \ncomponent of the system cannot access the TEE memory, even with a privilege \nescalation on the virtual machine manager (VMM).   \no Malicious/compromised tenant of a Container Engine/Environment: A rogue \napp, rogue co ntainer, or compromised component of the system cannot access \nthe TEE memory, even with a privilege escalation on the OS.   \n Malicious/compromised network: A rogue app or actor using a compromised network \ncannot access the data/IP inside the TEE.   \n Compromi sed firmware/BIOS: Tampered BIOS or firmware will not be able to access \nthe TEE memory.   \n Physical Access Attacks at the edge: A bad actor targeting the edge compute nodes \ncannot access the TEE memory even with physical access to the system.   \n Malicious/co mpromised admin at the Edge: A bad actor at the edge provider cannot  \naccess the TEE memory even with physical access to the system.  \n Utilize devices, systems, and infrastructure that provides access to TEEs  \n Verify the devices, systems, and infrastructure th at provide the TEEs have been \nregularly patched/updated and are current  \n Leverage TEEs for Sensitive and Regulated workloads and data protection  \n \n\n12  Part III: Data Protection  \n \nTLP:WHITE  CONCLUSION  \nPart III of this series focus ed on protecting the confidentiality , integrity , and availability  of \ndata within a 5G cloud infrastructure. Implementing 5G mitigations , based on cybersecurity \nrisks  against data in transit, at rest, or in use, will ensure  that only authorized  services or \nfunctions  have  access to data within the network . \n \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "security_guidance_for_5g_cloud_infrastructures_part_iii_508 compliant",
  "source": "nsa",
  "id": "0ad8fefc4e1a8444be91b79a4d3ff2fc06135cebed7b2658bcc81859d41256ac"
}