{
  "markdown": " \n \n \nU/OO/184967 -19          PP-19-1040          SEPTEMBER 2019  1 SEGMENT NETWORKS AND  DEPLOY  \nAPPLICATION -AWARE DE FENSES  \nA CHANGE IN TACTICS  \nDuring the last few years, the world has seen a surge of ransomware, which is malicious code that encrypts data, making \nit inaccessible .  Ransomware can cripple networks unless a ransom is paid or the encryption key is obtained . The critical \nservice disruptions from many of these incidents are amplified  by lateral movement, the ability to maneuver across a \nnetwork using vulnerable internal protocols or privileged features of devices not accessible outside  of the network . Some \nof these ransomware cases involved SMB (Server Message Block) worms that took advantage of vulnerabilities to rapidly \nspread via the SMB protocol and disrupt large areas of a flat network . Some relied on encrypted malicious traffic and \nprotocols which could have been isolated. With granular network segmentation and application -aware defenses, these \ntypes of attack can be contained to minimize damage. Further, analy sis of encrypted traffic is becoming increasingly \nimportant as the majority of network traffic is now encrypted, allowing malicious activity to pass through it or blend in wit h \nit. \nUsing application -aware firewalls, Virtual Local Area Networks (VLANs), Vir tual Routing and Forwarding instances \n(VRFs), Virtual Private Networks (VPNs), and Software Defined Networking (SDN) to segment network traffic within the \nnetwork reduces the attack surface and makes it harder for the adversary to move laterally through th e network. \nCombining this with Network Function Virtualization (NFV) in virtualized environments can achieve a more granular level \nof segmentation or micro -segmentation of the network, further restricting an adversarys movements. Failure to \nsegment networ ks and deploy these application -aware defenses can result in extensive adversary proliferation and \nmalicious insider access within a network.  \nNETWORK SEGMENTATION  \nSegmentation is the practice of dividing a network into sub -networks (segments) of devices th at share similar security \nrequirements. Generally, segmentation is done by separating access to the most sensitive and vulnerable services on the \nnetwork, such as directory services, file -share services, and network management. The network can be further \nsegmented by user groups and determinations made on the level of access each user group requires. Once a network is \nproperly segmented , appropriate application -aware defenses can be utilized to isolate and secure each network segment.  \nSuch isolation is esse ntial to blocking an adversarys lateral movement through the network and instilling the principle of \nleast privilege to every network device. Limiting device communication between segments also enables better monitoring \nand visibility into an adversarys attempts to spre ad from one segment to another.  \nPhysical segmentation uses the configuration and placement of physical devices like routers and switches to create \nnetwork segments based on functional importance and/or levels of access. Each of these segmen ts can be configured to \nbe physically isolated or connected together using application -aware detection devices. With proper filtering rules and \npolicy implemented at the border of each segment , physical segmentation is the most secure method of segmentatio n and \nprovides the most protection against adversary lateral movement. However, this technique can be expensive as it requires \nthe use of separate infrastructure for every subnetwork and requires extensive out of band network management . \nVirtual segmentati on bears similarities to physical segmentation, but  utilizes software features on network devices to \nperform the segmentation. These software features inclu de VLANs , VPNs , VRFs , and VLAN Access Control Lists \n(VACLs). VLANs logically separate hosts and endp oints by creating separate subnets and utilize network layer and \napplication aware filtering devices to prevent segments from communicating with each other based on a configured policy. \nWhen deploying VLANs, VACLs can be implemented to restrict, allow, or redirect the flow of intra -VLAN traffic on \nswitching devices.  Utilizing a combination of VACLs, network layer and application -aware filtering devices provides a \ndefense in depth strategy.  \n\n \n \nU/OO/184967 -19          PP-19-1040          SEPTEMBER  2019  \n2  \nVRFs can also be deployed to virtually segment devices by creating s eparate routing domains on layer 3 devices. In ord er \nfor subnets in separate VRFs to communicate, routes between VRFs must be deliberately  shared. One benefit of VRFs \nover VLANs is that VRFs are not susceptible to VLAN hopping attacks. Last of all, VPNs provide a secure communication \nchannel or tun nelthrough a network. A VPN establishes a one -for-one, or gateway -to-gateway connection between an \nendpoint and a network resource, or two network segments. Encrypted VPNs can provide confidentiality, integrity, and \nauthentication security techniques that  make it difficult for an adversary to access these resources. All methods of virtual \nsegmentation require attention to the details of implementation and the filtering policies between segments to ensure \nproper segmentation is maintained.  \nAs you segment yo ur network, pay attention to how protocols like SMB, NetBIOS, and RPC services are configured. \nConstraints on these protocols will limit the damage of pass -the-hash and SMB relay attacks. Ensure these protocols are \nonly implemented in accordance with appro ved policy. This is one way of better defend ing privileges and accounts.1 \nAPPLICATION -AWARE FI REWALLS  \nAs attackers become better at obfuscating malicious traffic, firewall manufacturers have added more functionality to \ninspect deeper into the packet and tr affic flow. Traditional firewalls would block or allow data traffic based on packet \nheaders, making assumptions about how traffic will be treated based on its port numbers. Application -aware firewalls \nperform deep packet inspection and attempt to identify the applications that are traversing the firewall. Blocking traffic that \nis not properly formatted for the type of applications that are permitted on the network helps prevent adversaries from \nabusing allowed application protocols. This approach to whiteli sting  for network applications does not rely on generic ports \nas the filtering criteria. Additionally, some application -aware firewalls provide automatic signature updates and can filter \ndynamically changing applications like peer -to-peer connections, which can  evade traditional firewall rules.  \nIn addition to those features specific to application -aware firewalls, some offer the ability to control traffic based on things \nsuch as specific parts of a website or user actions. When all of these features are utilized  together they give network \nadministrators the ability to apply policy at a very granular level. As application -aware firewalls are deployed between \nnetwork segments, these granular policies can be configured in such a way to dramatically limit an adversar ys lateral \nmovement. As a best practice , every network segment should be filtered on the inbound and outbound direction with only \nthe permitted applications allowed in or out. To provide the highest level of security, consider  deploying additional feature s \nsuch as network appliances that perform virus scanning, and Data Loss Prevention (DLP).  \nSOFTWARE DEFINED NET WORKING  \nTraditional routing strategies typically describe the actions of the forwarding plane , which  carries data traffic, the control \nplane , which  decides how to route or handle data traffic, and the management plane.  Software Defined Networking \n(SDN) works to decouple the control plane from the forwarding plane so that control of data flow over the entire network \ncan be directly programmable  from a central location. In other words, SDN moves from a distributed control configuration \nto a logically centralized controller.  \nThe term SDN has taken on many different meanings and become a buzz word within the industry. For the purposes of \nthis paper  SDN will be broken into two different technologies: automated provisioning  and control plane abstraction. \nAutomated provisioning is defined as any solution that will automatically connect to network devices and reconfigure the \ndevice based on a set policy  in the controller  (e.g. using standard protocols such as SSH and SNMP ). On the other hand, \nwith control plane abstraction every device forwards traffic based upon a set of rules that are pushed to the device from a \ncentral controller most commonly using a  protocol known as OpenFlow. In summary , with automated provisioning every \ndevice maintains its own control plane, and with control plane abstraction every device depends on a central controller for \ntheir control plane. Deployed  properly , both methods prov ide a flexible way to perform network segmentation and traffic \ncan be dynamically directed to an application -aware firewall when traversing segments. Each method does come with \nsecurity concerns and caution should be taken when deploying SDN.  \n                                                \n1 For more information on this, please refer to Defend Privileges and Accounts, one of NSAs Top 10 Cybersecurity Mitigations.  \n\n \n \nU/OO/184967 -19          PP-19-1040          SEPTEMBER  2019  \n3  \n \nSome of the  security concerns that need to be addressed with SDN revolve around the security of the controller and the \nsecurity of the control protocols. With both SDN technologies discussed it is paramount that the central controller have the  \nappropriate security co ntrols in place to limit network accessibility and provide strong authent ication of all administrators.  \nThe control protocols should always utilize encryption to provide confidentiality, integrity, and authentication. If the control \nprotocols do not provi de strong authentication and integrity checking, then it is likely that an adversary will be able to \nmake unauth orized changes to the network. When deploying the control plane abstraction methodology administrators \nshould  physically separate control plane traffic from user traffic by implementing an out of band management network.  \nAfter properly securing the controller and control protocols, SDN can quickly adjust network configuration. One of the \nmajor benefits to SDN is that it is highly programmable and the network can dynamically adjust based on policy, the \napplication in use, or which  user is logged on. With the growth of network device malware and new  \npowerful SDN application programming interfaces (APIs), great care should be taken when programming a n  \nSDN network so as not to introduce unexpected behavior (such as security vulnerabilities) with poor development \npractices.  \nApplication -aware segmentation using SDN techniques individually directs data traffic by linking the applications \ncommunication p references and paths together with policies that determine how and where that data should flow. The \nSDN policies can even be configured to inspect the application traffic and make determinations on the validity of \napplication traffic. In other words, once an application has been identified, pre -determined policies can dictate how \nsoftware should segregate the data by placing it into the appropriate VLANs, redirecting the traffic to application -aware \ndefenses, or apply filtering rules to limit access to spec ific segments. This allows for multiple segmentation strategies to \nbe applied simultaneously.  \nMICRO -SEGMENTATION O F THE APPLICATION LA YER \nThe increased use of Virtual Machines (VM) and NFV makes it possible to micro -segment the network in virtualized \nenvir onments such as cloud data centers. Micro -segmentation is the deployment of a virtual firewall at every single virtual \nnetwork interface where network traffic enters and leaves each virtual machine. The firewall residing on each virtual \nmachine serves to i solate every network resource and endpoint from each other even when residing on the same subnet.  \nDirect communication between virtual network resources can be controlled at the most granular level. The virtual firewalls \ncan be dynamically created or torn -down on the fly as network resources are provisioned or modified. Because micro -\nsegmentation is software -based, administrative control can be centralized through a single SDN -like controller. Just as in \nSDN, central policies can determine whether to deny or permit applications from flowing through or to a device. Host -\nbased firewalls, with or without a host intrusion detection system, are another option that can be used on the virtual \nmachine. However, these systems tend to be more vulnerable due to the fa ct that they are required to operate on the host \noperating system. If this operating system becomes compromised by either vulnerabilities in the software or \nmisconfiguration, the host -based firewall may be easily disabled by the attacker.  \nCONCLUSION  \nTo pr otect against attacks such as pass -the-hash, SMB worms, adversary lateral movement, and malicious insiders, \nnetwork segmentation and application -aware defenses are essential to a networks security. The deployment of \napplication -aware defenses such as fire walls and proxies, coupled with emerging techniques like SDN and micro -\nsegmentation, create very granular control over data flows allowing administrators to reduce the adversarys attack \nsurface and enhance overall network security.  \n \n \n\n \n \nU/OO/184967 -19          PP-19-1040          SEPTEMBER  2019  \n4  \n \nDISCLAIMER OF WARRA NTIES AND ENDORSEMEN T \nThe information and opinions contained in this document are provided \"as is\" and without  any warranties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product e ndorsement purposes.  \nCONTACT INFORMATION  \nClient Requirements and Genera l Cybersecurity Inquiries  \nCybersecurity Requirements Center (CRC), 410 -854-4200, email: Cybersecurity_Requests@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "segment networks and deploy application aware defenses - copy",
  "source": "nsa",
  "id": "4c03c254e29dd2c157c2736f6e77f8f810963f7b33af55ab8788ab38be87e230"
}