{
  "markdown": " \n \n \nU/OO/181 607-19          PP -19-1038         AUGUST 2019  1 TRANSITION TO MULTI -FACTOR AUTHENTICATIO N \nA COMMON TACTIC \nWhile network attacks have become more complex, the compromise of passwords continues to be one of the main tactics \nused to successful ly attack networks and data. One of many examples occurred in September 2017 when Deloitte, one of \nthe worlds largest accounting firms, reported a breach that resulted in the compr omise of client emails and data including \nthose of government agencies and other large enterprises. After further analysis  it was concluded that the attackers \ngained access to the email server through an administrator account that was protected only by password [1]. Public \nestimates indicate such data breaches can cost an organization millions of dollars [2]. While smart timeout and lockout \nmechanisms can almost prevent brute force attacks on remote services, passwords are often easily compromised through \nmethods such as dictionary attacks on password hashes, keylogging,  sniffing of passwords sent in the clear, malicious \nTLS inspection, social engineering, and lack of user awareness.  \nAlthough selecting strong passwords and setting timeout and lockout policies play an important role in securing an \nenterprise, relying on password strength alone is not sufficient in many cases. There are plenty of social engineering, \npassword- guessing, password- cracking, and password- sniffing tools and techniques available for attackers to gain initial \naccess or maintain persistence within networks. This is why the concept of Multi -factor Authentication (MFA) has evolved \nas one of the most effective controls to protect an enterprise. Password- based authentication involves use of a single \ncredential to authenticate to a system. MFA requires tw o or more factors for successful authentication, preferably \nincluding at least one that is resistant to replay attacks. When properly implemented, MFA presents a significant obstacle \nto attackers trying to gain or maintain access  to an organizations network: attackers would have to expend resources to \ncoordinate a compromise of all factors in the MFA system before t he user discover s the compromise and reset s or \nrevokes  the associated credentials.  \nWHAT IS MULTI -FACTOR AUTHENTICATIO N? \nAuthentication is the process of verifying the identity of a user to a system that provides access. MFA is an authentication \nmethod that combines two or more authentication factors to validate a users identity. There are three types of factors of \nauthentication: something you k now (e.g. a password), something you have (e.g. a token), and something you are (e.g. \nbiometrics). Examples of MFA implementations include:  \n Inserting a chip- based ATM card (something you have) and entering a PIN (something you know)  \n Swiping a badge (something you have), scanning your fingerprint (something you are), and entering a PIN  \n(something you know)  \n Entering a password (something you know) and r eceiving a one- time-use code via SMS on a registered mobile \ndevice (something you have).  \nAn important consideration for the effectiveness of an MFA implementation is how the factors are protected and combined. In the first example, a stolen card is likely to be reported and replaced before the PIN  can be guessed. In the \nsecond example however, the badge swipe va lue might be able to be recovered remotely. If the verification provides user \nfeedback on each of the fac tors ( e.g. invalid badge, misread fingerprint, and wrong PIN are all valid responses for failed \nauthentication), an adversary can verify that they have the correct input for the badge and biometric input, and \nindependently attempt to guess the PIN. Similarly, for the third example, an adversary can discover  the passw ord before \nattempting to discover  the SMS -based input, and then try to intercept the one- time-use code. Basic MFA mechanisms like \nthe third example are nearly as easy to exploit as passwords [3], whereas those that effectively combine and protect the \nfactors require a more coordinated attack against two or more factors.   \n\n \n \nU/OO/181 607-19          PP -19-1038         AUGUST 2019  \n2 WHAT ARE THE THREATS?  \nThere are methods that target each of the authentication factor categories. The strength of MFA decreases when all the \nfactors can be compromised independently without alerting the legitimate user. To counter this, monitor the use of MFA \ncredentials and alert on unusual access behavior that might indicate a compromise has gone undetected by the legitimate \nuser. One can also implement time and/or location based attributes to limit access based on the legitimate users \nbehaviors.  \nFactors you know are always at risk for disclosure or guessing by an adversary. Social engineering, open source \nresearch, key logging, and capturing successful authentication traffic are all tactics that adversaries regularly use to reveal \npasswords, PINs, or answers to security questions. Kerberos tickets and password hashes based on user passwords can \nalso be stolen from compromised dev ices and replayed (aka Pass -the-Ticket and Pass -the-Hash). At the time of this \nwriting it is increasingly common for one- time-password mechanisms that send passwords over partially unsecured \ncommunications (e.g. PINs over SMS) to be compromised by reroutin g those messages [4]. Use MFA that include both \nwhat the user knows (with timeout and lockout) and what the user has. For U.S, government employees, a Personal Identity Verification (PIV) token provides such a combination that optionally allows fingerprint  activation to be used as a \nsecond factor, with a PIN, to provide a third factor. Commercially available tokens, such as the YubiKey (FIPS or \nUniversal -2-Factor modes) or SecurID time- based one -time password tokens for example, also effectively combine what \nyou have with one or more of what you know or what you are.  \nPhysical tokens and devices can always be lost, stolen, or duplicated. In some cases an adversary with physical access \nto the token could tamper with the token to change its behavior or use it t o infect the host it interfaces with, though for \nmany modern tokens this requires significant skill, investment, and risk [5]. Consider using devices that include physical \nsecurity mechanisms, such as tamper evidence or response. The NSA recommends using d evices validated by the NIST \nCryptographic Module Validation Program to the FIPS 140- 2 standard. FIPS 140- 2 level 1 validation is sufficient for most \ndevices that will remain in a users possession and can be easily revoked and replaced if lost; devices va lidated to levels \n3 or 4 provide tamper evidence or tamper responses (respectively) that can provide additional protection if the device is \ntemporarily left unattended in high risk environments. Some MFA token systems depend on central authentication \nserve rs, certification authorities, and/or token issuance systems , and these servers should be very carefully protected and \nisolated .\n1 \nAdvanced threat actors can replicate biometric factors. For example, when Samsung first released the fingerprint \nauthentication feature on the Galaxy S5, groups of researchers and hackers claimed to have successfully unlocked \nphones including one belonging to a German official by using photos of users fingerprints and inexpensive fingerprint \nrecreations made with household materials [6]. Liveness testing has improved some biometrics, but they are often still \nbased on information accessible from used drinki ng glasses and high- resolution photography. Since biometric spoofing is \na concern, consider using biometric factors as an  addition to two others if strong authentication is needed.  \nSome systems may not support MFA, and can only work with traditional password authentication. Attackers that detect the use of these systems on enterprise networks may focus their efforts on compromising the passwords for and gaining \naccess to those systems, rather than expending their resources trying to break into MFA -protected systems. Employ \nprivilege access management\n2 devices to enforce MFA to devices that only support password- based authentication. Such \nPAM solutions can proxy the request to the target devices using randomly generated, well protected, one- time-use \npasswords  and can implement dynamic access control rules to limit the damage an adversary can cause if they succeed \nin hijacking an authentication mechanism or bypassing the PAM.  \nRather than try to compromise each MFA factor individually, attackers may try to find and gain persistence on a host \nwhere the factors come together. Manage host  security configurations3 to reduce the risk of  an adversary gaining  access \nto the host ( where they can recover and/or abuse all the factors ). Consider including device authentication and health \nchecks as part of a dynamic access control system.  \n                                                \n1 Network isolation is a core concept further explored in Segment Networks and Deploy Application- Aware Defenses , part of NSAs Cybersecurity Top 10 Mitigations packet.  \n2 Privilege d access management is further explored in Defend Privileges and Accounts , part of NSAs Cybersecurity Top 10 Mitigations packet.  \n3 For more d etails, see Actively Manage Systems and C onfigurations , part of NSAs Cybersecurity Top 10 Mitigations packet.  \n\n \n \nU/OO/181 607-19          PP -19-1038         AUGUST 2019  \n3  \nTrain users and administrators regularly on the specifics of the MFA systems they use and the associated threats. All \nusers and administrators of the system should be able to identify a compromise of one or more of the  \nfactors when it happens and know the appropriate responses and reporting requirements. Timely and non- punitive \nreporting, revocation,  and replacement processes will minimize the burden on users and minimize the tim e an adversary \ncan abuse a compromised MFA.  \nADAPTIVE ACCESS CONT ROL \nIn addition to authentication, access decisions should include other identity attributes and integrate behavior analytics \nusing these attributes to recognize and respond to high risk requests. Examples of identity attributes that are beginning to \nbe used include where you request access from  (e.g. geolocation) and when you request access, as well as traditional \nattributes like organizations and rol es. Modern, adaptive, attribute- based acces s control systems are recommended for \naccess to high- value resources such as domain and enterprise administrative functions and especially sensitive or \nmission critical data. Such systems can recognize a request from an unusual place, at an unusual time, or for resources inconsistent with the users role, and can detect and respond to other anomalous requests. Adaptive access control \nresponses can range from alerting administrators on suspicious access attempts to denying access.  \nMAKE IT EASY ON THE USER  \nSome MFA credentials make authentication easier and faster than ever before. For example, fingerprint readers and facial \nrecognition offer seamless and near -instantaneous authentication ( appropriate only for low-risk environments  since  \nbiometrics alone often do not  provide strong assurance) . When properly implemented on devices with lockout features , \nrandom PINs are far shorter than full passwords and can often be more easily remembered. While MFA can provide  \nsecurity and usability benefits over traditional password- based authentication, failure to carefully plan the transition from \npasswords to MFA credentials can create unnecessary burden. MFA systems require users to enroll in the system, and a \nlengthy, confusing enrollment process could disrupt users. User s will need to become accustomed to keeping track of \ntheir tokens, and accommodations for forgotten tokens must be made. Account lockout resulting from too many \nconsecutive false password or PIN authentication attempts will  frustrate users, and users may dread the thought of an \nMFA system that now includes two or more potential points of authentication failures. Lockout recovery mechanisms that require the user to follow complicated procedures and find an issuance/re- issuance infrastructure that is hard to access \ncan become frustrating and reduce productivity. These usability drawbacks can lead to users rejection of an MFA system; \nand, even if MFA is mandated, upset users might  avoid putting effort into protecting their credentials, leaving MFA factors \nmore susceptible to compromise.  \nEnterprises must consider the impact to users that MFA systems present and carefully coordinate the transition to gain \nusers acceptance. Train administrators, help desk personnel, and users on the MFA system as well as the enr ollment \nplan. Describe key usability improvements that MFA provides over password- only authentication. For example, the need \nto memorize and manage multiple complex passwords for multiple systems has always placed a burden on users; an \nMFA token with PIN authentication can help significantly reduce this burden. Anticipate potential issues with user access \nrequirements and successful and failed authentication behavior. Provide a reliable and readily available issuance/re-issuance and compromise reporting inf rastructure to minimize the pain associated with reporting and replacing lost or \nstolen tokens. Finally, train users and administrators on the benefits of and procedures for authentication factor revocation.  \nMAKE IT TOUGH FOR THE ADVERSARY \nMulti -factor Aut hentication is a beneficial tool designed to defend against an array of authentication attacks, which rely on \nstealing user credentials. Traditional password- based authentication is susceptible to password- guessing, password-\ncracking, and password- sniffing tools and techniques, and users can be tricked into divulging their credentials through \nsocial e ngineering campaigns. A compromise of single -factor authentication costs attackers minimal resources as they \nattempt to get inside enterprise networks and ther efore  allows them to spend their remaining time and effort conducting \nmore advanced attacks from the inside. And, as seen in the Deloitte attack, the compromise of one set of credentials can \nresult in the exposure of even more credentials. MFAs uniting of  two or more additional or alternative factors protects  \n\n \n \nU/OO/181 607-19          PP -19-1038         AUGUST 2019  \n4  \n \nagainst threats targeting the inherent flaw s with password- only authentication. Proper MFA implementation will cost the \nadversary more resources, increase the chances of detection, and significantly hinder their ability to exploit the \nauthentication system.  \nREFERENCES \n[1]  Hopkins, N. Deloitte hit by cyber attack revealing clients secret emails. The Guardian. 25 September, 2017. [Online], Available: \nhttps://www.theguardian. com/business/2017/sep/25/deloitte- hit-by-cyber -attack -revealing- clients -secret -emails  \n[2]  Ponemon, L. Calculating the Cost of a Data Breach in 2018, the age of AI and the IoT, (2018, July 11). Retrieved March 28, 2019. From \nhttps://securityintelligence.com/ponemon- cost-of-a-data- breach- 2018/   \n[3]  Cox, S. When Two- Factor Authentication Fails: Rethinking The Approach To Identity Security. Forbes.  \nhttps:// www.forbes.com/sites/forbestechcouncil/2018/02/21/when- two-factor -authentication- fails-rethinking -the-approach- to-identity -\nsecurity/#7aed40bb6fea  \n[4]  Barret, B. How to Protect Yourself Against a SIM Swap Attack (2018, August 19). Retrieved March 28, 2019. From \nhttps://www.wi red.com/story/sim -swap -attack -defend- phone/   \n[5]  Boudriga, N. Smart Card Security: The SIM/USIM Case. Information Systems Security, Auerbach   excerpt from Security of Mobile \nCommunications, New York: Auerbach Publications (2009). R etrieved March 28, 2019. From http://www.infosectoday.com/Articles/Smart -Card -\nSecurity.htm    \n[6]  Can Your Face Be Hacked On An iPhone? (2018, May 01). Retrieved January 29, 2019. From https://www.tracesecurity.com/blog/articles/can- your-\nface- be-hacked- on-an-iphone  \nRELATED NSA CYBERSECURITY GUIDANCE  \n Privileged Access Management, 25 Apr 2017 https://apps.nsa.gov/iaarchive/library/ia- guidance/security -tips/privileged-\naccess- management.cfm  \n Least Privilege, 10 Apr 2017 https://apps.nsa.gov/iaarchive/library/ia- guidance/security -tips/least -privilege.cfm  \n Hardening Authentication, 03 Nov 2016 https://apps.nsa.gov/iaarchive/library/ia- guidance/security -tips/hardening-\nauthentication- update.cfm  \n Hardening Authentication (NSA Video), 21 Jul 2016 https://www.youtube.com/watch?v=fXpKl3Jam -w  \nDISCLAIMER OF WARRAN TIES AND ENDORSEMENT  \nThe information and opinions contained in this document are provided \"as is\" and without  any warranties or guarantees. Reference herein to any specific \ncommercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply i ts endorsement, \nrecommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes.  \nCONTACT INFORMATION  \nClient Requirements and General Cybersecurity Inquiries  \nCybersecurity Requirements Center (CRC), 410- 854-4200, email: Cybersecurity_Requests@nsa.gov  \n\n",
  "cves": [],
  "techniques": [],
  "advisory": "cybersecurity-alerts",
  "title": "transition to multi-factor authentication - copy",
  "source": "nsa",
  "id": "d687c6362a3faf2afee45ba5025f56e529b41b72b4deec2e06fc0ecbec9f143a"
}