{
  "id": "b4b580a9ad8c344fbfad26db08c76c22171cdf481ed3f7871b65bc2f5cc82dea",
  "markdown": "HomeCIS AdvisoriesAbout usMultiple Vulnerabilities in VMware Products Could Allow for Remote Code ExecutionMS-ISAC ADVISORY NUMBER:2024-073DATE(S) ISSUED:06/18/2024OVERVIEW:Multiple vulnerabilities have been discovered in VMware vCenter Server and Cloud Foundation, the most severe of which could allow for remote code execution. VMware vCenter Server is the centralized management utility for VMware. VMware Cloud Foundation is a multi-cloud platform that provides a full-stack hyperconverged infrastructure (HCI) that is made for modernizing data centers and deploying modern container-based applications. Successful exploitation of these vulnerabilities could allow for remote code execution in the context of the administrator account. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights.THREAT INTELLIGENCE:There are no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:VMware vCenter Server versions prior to 8.0 U2dVMware vCenter Server versions prior to 8.0 U1eVMware vCenter Server versions prior to 7.0 U3rVMware Cloud Foundation (VMware vCenter Server) versions prior to KB88287RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in VMware vCenter Server and Cloud Foundation, most severe of which could allow for remote code execution. Details of these vulnerabilities are as follows:\nTactic: Initial Access (TA0001):\nTechnique: Exploit Public-Facing Application (T1190):\n\nThe vCenter Server contains multiple heap-overflow vulnerabilities in the implementation of the DCERPC protocol. Successful exploitation of these vulnerabilities could allow for remote code execution in the context of the administrator account. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. A malicious actor with network access to vCenter Server may trigger these vulnerabilities by sending a specially crafted network packet potentially leading to remote code execution. (CVE-2024-37079, CVE-2024-37080)\nAdditional lower severity vulnerabilities include:\nThe vCenter Server contains multiple local privilege escalation vulnerabilities due to misconfiguration of sudo. An authenticated local user with non-administrative privileges may exploit these issues to elevate privileges to root on vCenter Server Appliance. (CVE-2024-37081)\nRECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply appropriate updates provided by Broadcom to vulnerable systems immediately after appropriate testing. (M1051: Update Software) \n\n\nSafeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\n\n\nSafeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\n\n\nSafeguard 7.6: Perform Automated Vulnerability Scans of Externally-Exposed Enterprise Assets: Perform automated vulnerability scans of externally-exposed enterprise assets using a SCAP-compliant vulnerability scanning tool. Perform scans on a monthly, or more frequent, basis.\n\n\nSafeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\n\n\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management) \n\n\nSafeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\n\n\nSafeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\n\n\nPrevent access to file shares, remote access to systems, unnecessary services. Mechanisms to limit access may include use of network concentrators, RDP gateways, etc. (M1035: Limit Access to Resource Over Network)\n\n\nUse intrusion detection signatures to block traffic at network boundaries. (M1031: Network Intrusion Prevention) \n\n\nSafeguard 13.3: Deploy a Network Intrusion Detection Solution: Deploy a network intrusion detection solution on enterprise assets, where appropriate. Example implementations include the use of a Network Intrusion Detection System (NIDS) or equivalent cloud service provider (CSP) service.\n\n\nSafeguard 13.8: Deploy a Network Intrusion Prevention Solution: Deploy a network intrusion prevention solution, where appropriate. Example implementations include the use of a Network Intrusion Prevention System (NIPS) or equivalent CSP service.\n\n\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection) \n\n\nSafeguard 13.10:  Performing Application Layer Filtering:  Perform application layer filtering. Example implementations include a filtering proxy, application layer firewall, or gateway.\n\nREFERENCES:Broadcom/VMwarehttps://support.broadcom.com/web/ecx/support-content-notification/-/external/content/SecurityAdvisories/0/24453CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-37079https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-37080https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-37081Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Advisory09.27.20242024-106: Multiple Vulnerabilities in PHP Could Allow for Remote Code ExecutionRead MoreAdvisory09.27.20242024-105: Multiple Vulnerabilities in Foxit PDF Reader and Editor Could Allow for Arbitrary Code ExecutionRead MorePress Release09.19.2024CIS Releases Results of 18 Month Study of U.S. Tribal Organization CybersecurityRead MoreWhite Paper09.18.2024DMARC Guide: Microsoft 365 and Google WorkspaceRead More",
  "cves": [
    "CVE-2024-37079",
    "CVE-2024-37080",
    "CVE-2024-37081"
  ],
  "techniques": [
    "T1190"
  ],
  "title": "About us",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}