{
  "id": "44e94d149ebdb55063334f15ff836024b2a5b1d90ef49a4694686f678c7df3ec",
  "markdown": "HomeCIS AdvisoriesCritical Patches Issued for Microsoft Products, February 13, 2024Critical Patches Issued for Microsoft Products, February 13, 2024MS-ISAC ADVISORY NUMBER:2024-020DATE(S) ISSUED:02/13/2024OVERVIEW:Multiple vulnerabilities have been discovered in Microsoft products, the most severe of which could allow for remote code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.THREAT INTELLIGENCE:Two zero-day vulnerabilities addressed in this advisory were reported by Microsoft; both have been seen in the wild. The first zero day, CVE-2024-21351 - Windows SmartScreen Security Feature Bypass Vulnerability, is a security feature bypass vulnerability allows an authorized attacker to send the user a malicious file and after the user to opens it, the attacker could bypass the SmartScreen user experience. The second zero day, CVE-2024-21412 - Internet Shortcut Files Security Feature Bypass Vulnerability is also a security feature bypass vulnerability that allows an attacker to distribute and install malware by crafting a malicious file that would evade Mark of the Web (MOTW) defenses, resulting in a limited loss of integrity and availability of security features such as Protected View in Microsoft Office, which rely on MOTW tagging.\nFebruary 23rd - UPDATED THREAT INTELLIGENCE:\nThree additional vulnerabilities were reported for exploration in the wild:\n\nCVE-2024-21410 - Microsoft Exchange Server Elevation of Privilege Vulnerability – A threat actor could exploit this vulnerability to target an NTLM client such as Outlook with an NTLM credentials-type vulnerability. If successful, a threat actor could authenticate as a user by relaying a user’s leaked Net-NETLMv2 hash to a vulnerable Exchange server, and would allow the threat actor to perform operations on the victim’s behalf. \nCVE-2024-21413 - Microsoft Outlook Remote Code Execution Vulnerability – A threat actor could exploit this vulnerability by crafting a malicious link that bypasses the Protected View Protocol, which leads to the leaking of local NTLM credential information and remote code execution (RCE). \nCVE-2024-21401 - Microsoft Entra Jira Single-Sign-On Plugin Elevation of Privilege Vulnerability – A threat actor could exploit this vulnerability to fully update Entra ID SAML metadata and info for the plugin, and then modify the application’s authentication to their tenant.\nSYSTEMS AFFECTED:.NETAzure Active DirectoryAzure Connected Machine AgentAzure DevOpsAzure File SyncAzure Site RecoveryAzure StackInternet Shortcut FilesMicrosoft ActiveXMicrosoft Azure Kubernetes ServiceMicrosoft Defender for EndpointMicrosoft DynamicsMicrosoft Edge (Chromiumbased)Microsoft Exchange ServerMicrosoft OfficeMicrosoft Office OneNoteMicrosoft Office OutlookMicrosoft Office WordMicrosoft Teams for AndroidMicrosoft WDAC ODBC DriverMicrosoft WDAC OLE DB provider for SQLMicrosoft WindowsMicrosoft Windows DNSRole: DNS ServerSkype for BusinessSQL ServerTrusted Compute BaseWindows HyperVWindows Internet Connection Sharing (ICS)Windows KernelWindows LDAP-Lightweight Directory Access ProtocolWindows Message QueuingWindows OLEWindows SmartScreenWindows USB Serial DriverWindows Win32K  ICOMPRISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Microsoft products, the most severe of which could allow for remote code execution.\nA full list of all vulnerabilities can be found at the link below:\nhttps://msrc.microsoft.com/update-guide/releaseNote/2024-Feb\nSuccessful exploitation of the most severe of these vulnerabilities could result in an attacker gaining the same privileges as the logged-on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.RECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply appropriate patches or appropriate mitigations provided by Microsoft to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\n\n\nApply the Principle of Least Privilege to all systems and services, and run all software as a non-privileged user (one without administrative rights) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\n\n\nRemind all users not to visit untrusted websites or follow links/open files provided by unknown or untrusted sources. (M1017: User Training)\no   Safeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\n\n\nUse capabilities to prevent suspicious behavior patterns from occurring on endpoint systems. This could include suspicious process, file, API call, etc. behavior. (M1040 : Behavior Prevention on Endpoint)\no   Safeguard 13.2 : Deploy a Host-Based Intrusion Detection Solution: Deploy a host-based intrusion detection solution on enterprise assets, where appropriate and/or supported.\no   Safeguard 13.7 : Deploy a Host-Based Intrusion Prevention Solution: Deploy a host-based intrusion prevention solution on enterprise assets, where appropriate and/or supported. Example implementations include use of an Endpoint Detection and Response (EDR) client or host-based IPS agent.\n\nREFERENCES:Artic Wolfhttps://arcticwolf.com/resources/blog/cve-2024-21410-cve-2024-21413-and-cve-2024-21401/Microsofthttps://msrc.microsoft.com/update-guide/https://msrc.microsoft.com/update-guide/releaseNote/2024-FebSpiceworkshttps://www.spiceworks.com/it-security/vulnerability-management/news/azure-microsoft-exchange-servers-active-exploitation-hackers/amp/Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Related ResourcesMicrosoft Windows DesktopMicrosoft OfficeMicrosoft Web BrowserMicrosoft Exchange ServerMicrosoft AzureInformation HubAdvisories See All Advisories Blog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead MoreAdvisory08.13.20242024-091: Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code ExecutionRead MoreAdvisory08.13.20242024-090: Multiple Vulnerabilities in Ivanti Products Could Allow for Remote Code ExecutionRead MoreBlog Post08.09.2024Top 10 Malware Q2 2024Read More",
  "cves": [
    "CVE-2024-21413",
    "CVE-2024-21412",
    "CVE-2024-21351",
    "CVE-2024-21410",
    "CVE-2024-21401"
  ],
  "techniques": [],
  "title": "Critical Patches Issued for Microsoft Products, February 13, 2024",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}