{
  "id": "dfee9125e4efb02094e46c9d627620f1d06c2096c81524605009333c331174d4",
  "markdown": "HomeCIS AdvisoriesCritical Patches Issued for Microsoft Products, April 11, 2023Critical Patches Issued for Microsoft Products, April 11, 2023MS-ISAC ADVISORY NUMBER:2023-038DATE(S) ISSUED:04/12/2023OVERVIEW:Multiple vulnerabilities have been discovered in Microsoft products, the most severe of which could allow for remote code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.THREAT INTELLIGENCE:One zero-day vulnerability addressed in this advisory was reported by Microsoft and has been seen in the wild. The zero day, CVE-2023-28252 - Windows Common Log File System Driver Elevation of Privilege Vulnerability, elevates privileges to SYSTEM, the highest user privilege level in Windows.SYSTEMS AFFECTED:.NET CoreAzure Machine LearningAzure Service ConnectorMicrosoft Bluetooth DriverMicrosoft Defender for EndpointMicrosoft DynamicsMicrosoft Dynamics 365 Customer VoiceMicrosoft Edge (Chromium-based)Microsoft Graphics ComponentMicrosoft Message QueuingMicrosoft OfficeMicrosoft Office PublisherMicrosoft Office SharePointMicrosoft Office WordMicrosoft PostScript Printer DriverMicrosoft Printer DriversMicrosoft WDAC OLE DB provider for SQLMicrosoft Windows DNSVisual StudioVisual Studio CodeWindows Active DirectoryWindows ALPCWindows Ancillary Function Driver for WinSockWindows Boot ManagerWindows Clip ServiceWindows CNG Key Isolation ServiceWindows Common Log File System DriverWindows DHCP ServerWindows Enroll EngineWindows Error ReportingWindows Group PolicyWindows Internet Key Exchange (IKE) ProtocolWindows KerberosWindows KernelWindows Layer 2 Tunneling ProtocolWindows Lock ScreenWindows NetlogonWindows Network Address Translation (NAT)Windows Network File SystemWindows Network Load BalancingWindows NTLMWindows PGMWindows Point-to-Point Protocol over Ethernet (PPPoE)Windows Point-to-Point Tunneling ProtocolWindows Raw Image ExtensionWindows RDP ClientWindows RegistryWindows RPC APIWindows Secure BootWindows Secure ChannelWindows Secure Socket Tunneling Protocol (SSTP)Windows Transport Security Layer (TLS)Windows Win32KRISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Microsoft products, the most severe of which could allow for remote code execution.\nA full list of all vulnerabilities can be found at the link below:\nhttps://learn.cisecurity.org/e/799323/update-guide/4svhhn/891363448?h=cGiUn-JuoozoVqGeaGS2SneGHf4UowI_y3oBToOO2sQ\nSuccessful exploitation of the most severe of these vulnerabilities could result in an attacker gaining the same privileges as the logged-on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.RECOMMENDATIONS:We recommend the following actions be taken:\n\nApply appropriate patches or appropriate mitigations provided by Microsoft to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\nApply the Principle of Least Privilege to all systems and services, and run all software as a non-privileged user (one without administrative rights) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\nRemind all users not to visit untrusted websites or follow links/open files provided by unknown or untrusted sources. (M1017: User Training)\no   Safeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\nUse capabilities to prevent suspicious behavior patterns from occurring on endpoint systems. This could include suspicious process, file, API call, etc. behavior. (M1040 : Behavior Prevention on Endpoint)\no   Safeguard 13.2 : Deploy a Host-Based Intrusion Detection Solution: Deploy a host-based intrusion detection solution on enterprise assets, where appropriate and/or supported.\no   Safeguard 13.7 : Deploy a Host-Based Intrusion Prevention Solution: Deploy a host-based intrusion prevention solution on enterprise assets, where appropriate and/or supported. Example implementations include use of an Endpoint Detection and Response (EDR) client or host-based IPS agent.\nREFERENCES:BleepingComputerhttps://www.bleepingcomputer.com/news/microsoft/microsoft-april-2023-patch-tuesday-fixes-1-zero-day-97-flaws/Microsofthttps://msrc.microsoft.com/update-guide/https://msrc.microsoft.com/update-guide/releaseNote/2023-AprGet Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Related ResourcesMicrosoft Windows DesktopMicrosoft 365Microsoft AzureMicrosoft OfficeInformation HubAdvisories See All Advisories Advisory09.03.20242024-094: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreWhite Paper08.29.2024The CIS Security Operations Center (SOC): The Key to Growing Your SLTT's Cyber MaturityRead MoreAdvisory08.24.20242024-093: Multiple Vulnerabilities in SolarWinds Web Help Desk Could Allow for Remote Code ExecutionRead MoreBlog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead More",
  "cves": [
    "CVE-2023-28252"
  ],
  "techniques": [],
  "title": "Critical Patches Issued for Microsoft Products, April 11, 2023",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}