{
  "id": "ff09b361d5fad54971d357e2ebeffbce58fe768cd868799ce813736b54398245",
  "markdown": "HomeCIS AdvisoriesMS-ISAC CYBERSECURITY ADVISORY - Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code ExecutionMS-ISAC CYBERSECURITY ADVISORY - Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code ExecutionMS-ISAC ADVISORY NUMBER:2023-031DATE(S) ISSUED:03/14/2023OVERVIEW:Multiple vulnerabilities have been discovered in Adobe products, the most severe of which could allow for arbitrary code execution. \nMultiple vulnerabilities have been discovered in Adobe products, the most severe of which could allow for arbitrary code execution. \n\nAdobe Commerce is a platform for delivering eCommerce capabilities, including out-of-the-box features, an ability to customize, and third-party integrations.\nAdobe Experience Manager Forms is an end-to-end digital document solution that makes it easy to create responsive forms that customers can easily complete and securely e-sign.\nAdobe Illustrator is a vector graphics editor and design program.\nAdobe Dimension is a 3D rendering and design software.\nAdobe Creative Cloud is a collection of software for graphic design, video editing, web development, and photography.\nAdobe Substance 3D Stager is a state-of-the-art staging tool to create 3D scenes with real-time 3D visualization and high-quality renders.\nAdobe Photoshop is a raster graphics editor.\nAdobe ColdFusion is a commercial rapid web-application development computing platform.\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nTHREAT INTELLIGENCE:Adobe is aware that CVE-2023-26360 has been exploited in the wild in very limited attacks targeting Adobe ColdFusion.SYSTEMS AFFECTED:Adobe Commerce 2.4.4-p2 and earlier versionsAdobe Commerce 2.4.4-p1 and earlier versionsMagento Open Source 2.4.4-p2 and earlier versionsMagento Open Source 2.4.4-p1 and earlier versionsAdobe Experience Manager (AEM) AEM Cloud Service (CS)•    Adobe Experience Manager (AEM) 6.5.15.0 and earlier versionsIllustrator 2023 27.2.0 and earlier versions for Windows and macOSAdobe Dimension 3.4.7 and earlier versions for Windows and macOSCreative Cloud Desktop Application 5.9.1 and earlier version for WindowsAdobe Substance 3D Stager 2.0.0 and earlier versions for Windows and macOSAdobe Photoshop 2022 23.5.3 and earlier versions for Windows and macOSPhotoshop 2023 24.1.1 and earlier versions for Windows and macOSColdFusion 2018 Update 15 and earlier versionsColdFusion 2021 Update 5 and earlier versionsRISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Adobe Products, the most severe of which could allow for arbitrary code execution. Details of these vulnerabilities are as follows\nTactic: Execution (TA0002):\nTechnique: Exploitation for Client Execution (T1203):\nAdobe Commerce:\n\nXML Injection (aka Blind XPath Injection) which could result in Arbitrary file system read. (CVE-2023-22247)\nCross-site Scripting (Stored XSS) which could result in Arbitrary code execution. (CVE-2023-22249)\nImproper Access Control which could result in Security feature bypass. (CVE-2023-22250)\nImproper Authorization which could result in Security feature bypass. (CVE-2023-22251)\nAdobe Experience Manager\nCross-site Scripting (Reflected XSS) which could result in Arbitrary code execution. (CVE-2023-22252, CVE-2023-22253, CVE-2023-22254)\nURL Redirection to Untrusted Site ('Open Redirect') which could result in Security feature bypass. (CVE-2023-22256, CVE-2023-22257, CVE-2023-22258, CVE-2023-22259, CVE-2023-22260, CVE-2023-22261, CVE-2023-22262, CVE-2023-22263, CVE-2023-22264, CVE-2023-22265, CVE-2023-22266)\nCross-site Scripting (Stored XSS) which could result in Arbitrary code execution. (CVE-2023-22269, CVE-2023-21615, CVE-2023-21616)\nWeak Cryptography for Passwords which could result in Privilege escalation. (CVE-2023-22271)\nAdobe Illustrator\nImproper Input Validation which could result in Arbitrary code execution. (CVE-2023-25859)\nOut-of-bounds Write which could result in Arbitrary code execution. (CVE-2023-25860, CVE-2023-25861)\nOut-of-bounds Read which could result in Memory Leak. (CVE-2023-25862)\nUse After Free which could result in Arbitrary code execution. (CVE-2023-26426)\nAdobe Dimension\nImproper Input Validation which could result in Arbitrary code execution. (CVE-2023-25879, CVE-2023-25881)\nOut-of-bounds Write which could result in Arbitrary code execution. (CVE-2023-25880, CVE-2023-25905, CVE-2023-26328, CVE-2023-26330)\nHeap-based Buffer Overflow which could result in Arbitrary code execution. (CVE-2023-25882, CVE-2023-25883, CVE-2023-25885, CVE-2023-25890, CVE-2023-25895, CVE-2023-25897, CVE-2023-25898)\nOut-of-bounds Read which could result in Arbitrary code execution. (CVE-2023-25884, CVE-2023-25886, CVE-2023-25887, CVE-2023-25888, CVE-2023-25889, CVE-2023-25891, CVE-2023-25892, CVE-2023-25900, CVE-2023-25902, CVE-2023-25904, CVE-2023-25906, CVE-2023-25907, CVE-2023-26327, CVE-2023-26333, CVE-2023-26335)\nUse After Free which could result in Arbitrary code execution. (CVE-2023-25893, CVE-2023-25894, CVE-2023-25896, CVE-2023-25899, CVE-2023-26336)\nImproper Input Validation which could result in Arbitrary code execution. (CVE-2023-25901)\nInteger Overflow or Wraparound which could result in Arbitrary code execution. (CVE-2023-25903)\nOut-of-bounds Read which could result in a Memory leak. (CVE-2023-26329, CVE-2023-26331, CVE-2023-26332, CVE-2023-26338, CVE-2023-26339, CVE-2023-26340, CVE-2023-26341, CVE-2023-26342, CVE-2023-26343, CVE-2023-26344, CVE-2023-26345, CVE-2023-26346, CVE-2023-26348, CVE-2023-26350, CVE-2023-26351, CVE-2023-26352, CVE-2023-26353, CVE-2023-26354, CVE-2023-26355, CVE-2023-26356)\nAccess of Uninitialized Pointer which could result in a Memory leak. (CVE-2023-26334)\nStack-based Buffer Overflow which could result in Arbitrary code execution. (CVE-2023-26337)\nUse After Free which could result in a Memory leak. (CVE-2023-26349)\nAdobe Creative Cloud\nUntrusted Search Path which could result in Arbitrary code execution. (CVE-2023-26358)\nAdobe Substance 3D Stager\nOut-of-bounds Read which could result in Arbitrary code execution. (CVE-2023-25863, CVE-2023-25869, CVE-2023-25873)\nHeap-based Buffer Overflow which could result in Arbitrary code execution. (CVE-2023-25864, CVE-2023-25868, CVE-2023-25872, CVE-2023-25874)\nAccess of Memory Location After End of Buffer which could result in Arbitrary code execution. (CVE-2023-25865, CVE-2023-25867)\nOut-of-bounds Write which could result in Arbitrary code execution. (CVE-2023-25866)\nUse After Free which could result in Arbitrary code execution. (CVE-2023-25870, CVE-2023-25871)\nOut-of-bounds Read which could result in a Memory leak. (CVE-2023-25875, CVE-2023-25876, CVE-2023-25877, CVE-2023-25878)\nAdobe Photoshop\nUse After Free which could result in Arbitrary code execution. (CVE-2023-25908)\nAdobe ColdFusion\nDeserialization of Untrusted Data which could result in Arbitrary code execution. (CVE-2023-26359)\nImproper Access Control which could result in Arbitrary code execution. (CVE-2023-26360)\nImproper Limitation of a Pathname to a Restricted Directory ('Path Traversal'). (CVE-2023-26361)\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply the stable channel update provided by Adobe to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1 : Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\no   Safeguard 7.5 : Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\n\n\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\n\n\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection)\no   Safeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\n\n\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content)\no   Safeguard 9.2: Use DNS Filtering Services: Use DNS filtering services on all enterprise assets to block access to known malicious domains.\no   Safeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\no   Safeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\n\n\nRemind users not to visit un-trusted websites or follow links provided by unknown or un-trusted sources. Inform and educate users regarding the threats posed by hypertext links contained in emails or attachments especially from un-trusted sources. (M1017: User Training)\no   Safeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\n\nREFERENCES:ADOBEhttps://helpx.adobe.com/security.htmlAdobehttps://helpx.adobe.com/security/products/magento/apsb23-17.htmlhttps://helpx.adobe.com/security/products/experience-manager/apsb23-18.htmlhttps://helpx.adobe.com/security/products/illustrator/apsb23-19.htmlhttps://helpx.adobe.com/security/products/dimension/apsb23-20.htmlhttps://helpx.adobe.com/security/products/creative-cloud/apsb23-21.htmlhttps://helpx.adobe.com/security/products/substance3d_stager/apsb23-22.htmlhttps://helpx.adobe.com/security/products/photoshop/apsb23-23.htmlhttps://helpx.adobe.com/security/products/coldfusion/apsb23-25.htmlCVEhttp://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21615http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21616http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22247http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22249http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22250http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22251http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22252http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22253http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22254http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22256http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22257http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22258http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22259http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22260http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22261http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22262http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22263http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22264http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22265http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22266http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22269http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22271http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25690http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25859http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25860http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25861http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25862http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25863http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25864http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25865http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25866http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25867http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25868http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25869http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25870http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25871http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25872http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25873http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25874http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25875http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25876http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25877http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25878http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25879http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25880http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25881http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25882http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25883http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25884http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25885http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25886http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25887http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25888http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25889http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25890http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25891http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25892http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25893http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25894http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25895http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25896http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25897http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25898http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25899http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25900http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25901http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25902http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25903http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25904http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25905http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25906http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25907http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25908http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26327http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26328http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26329http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26330http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26331http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26332http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26333http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26334http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26335http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26336http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26337http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26338http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26339http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26340http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26341http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26342http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26343http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26344http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26345http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26346http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26348http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26349http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26350http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26351http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26352http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26353http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26354http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26355http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26356http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26358http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26359http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26360http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26361http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26426Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Advisory09.03.20242024-094: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreWhite Paper08.29.2024The CIS Security Operations Center (SOC): The Key to Growing Your SLTT's Cyber MaturityRead MoreAdvisory08.24.20242024-093: Multiple Vulnerabilities in SolarWinds Web Help Desk Could Allow for Remote Code ExecutionRead MoreBlog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead More",
  "cves": [
    "CVE-2023-25902",
    "CVE-2023-26353",
    "CVE-2023-25884",
    "CVE-2023-25860",
    "CVE-2023-26336",
    "CVE-2023-25863",
    "CVE-2023-26339",
    "CVE-2023-25892",
    "CVE-2023-25859",
    "CVE-2023-26332",
    "CVE-2023-25898",
    "CVE-2023-22259",
    "CVE-2023-26343",
    "CVE-2023-22269",
    "CVE-2023-26338",
    "CVE-2023-26356",
    "CVE-2023-26341",
    "CVE-2023-25888",
    "CVE-2023-26354",
    "CVE-2023-22263",
    "CVE-2023-25890",
    "CVE-2023-26346",
    "CVE-2023-25869",
    "CVE-2023-25874",
    "CVE-2023-25865",
    "CVE-2023-25908",
    "CVE-2023-25690",
    "CVE-2023-25883",
    "CVE-2023-26351",
    "CVE-2023-25900",
    "CVE-2023-26359",
    "CVE-2023-25903",
    "CVE-2023-25891",
    "CVE-2023-26361",
    "CVE-2023-25893",
    "CVE-2023-25871",
    "CVE-2023-26358",
    "CVE-2023-25870",
    "CVE-2023-26349",
    "CVE-2023-25878",
    "CVE-2023-22262",
    "CVE-2023-25862",
    "CVE-2023-22253",
    "CVE-2023-26344",
    "CVE-2023-25881",
    "CVE-2023-26334",
    "CVE-2023-25885",
    "CVE-2023-26360",
    "CVE-2023-26331",
    "CVE-2023-25895",
    "CVE-2023-22258",
    "CVE-2023-25867",
    "CVE-2023-25886",
    "CVE-2023-25894",
    "CVE-2023-25887",
    "CVE-2023-22260",
    "CVE-2023-25906",
    "CVE-2023-26350",
    "CVE-2023-26355",
    "CVE-2023-26330",
    "CVE-2023-22261",
    "CVE-2023-22271",
    "CVE-2023-26328",
    "CVE-2023-25877",
    "CVE-2023-25889",
    "CVE-2023-21616",
    "CVE-2023-26345",
    "CVE-2023-22251",
    "CVE-2023-25875",
    "CVE-2023-22266",
    "CVE-2023-25866",
    "CVE-2023-25876",
    "CVE-2023-22249",
    "CVE-2023-22247",
    "CVE-2023-26352",
    "CVE-2023-26348",
    "CVE-2023-22257",
    "CVE-2023-25882",
    "CVE-2023-26329",
    "CVE-2023-25901",
    "CVE-2023-25907",
    "CVE-2023-25872",
    "CVE-2023-25861",
    "CVE-2023-26333",
    "CVE-2023-26337",
    "CVE-2023-22265",
    "CVE-2023-25904",
    "CVE-2023-21615",
    "CVE-2023-25873",
    "CVE-2023-22252",
    "CVE-2023-22250",
    "CVE-2023-25879",
    "CVE-2023-22256",
    "CVE-2023-26335",
    "CVE-2023-25880",
    "CVE-2023-25868",
    "CVE-2023-26340",
    "CVE-2023-26426",
    "CVE-2023-26327",
    "CVE-2023-25905",
    "CVE-2023-25897",
    "CVE-2023-25896",
    "CVE-2023-22254",
    "CVE-2023-25899",
    "CVE-2023-22264",
    "CVE-2023-26342",
    "CVE-2023-25864"
  ],
  "techniques": [
    "T1203"
  ],
  "title": "MS-ISAC CYBERSECURITY ADVISORY - Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}