{
  "id": "8d8901e8347edf56a4ce69c7e1e193d94223509ce7210a17193ef1496d77a88e",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Atlassian Products Could Allow for Remote Code ExecutionMultiple Vulnerabilities in Atlassian Products Could Allow for Remote Code ExecutionMS-ISAC ADVISORY NUMBER:2023-143DATE(S) ISSUED:12/12/2023OVERVIEW:Multiple vulnerabilities have been discovered in Atlassian products which could allow for remote code execution. Confluence is a collaboration tool that brings people, knowledge, and ideas together in a shared workspace. Successful exploitation of these vulnerabilities could allow for remote code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rightsTHREAT INTELLIGENCE:There are currently no reports of these vulnerabilities being exploited in the wildSYSTEMS AFFECTED:Confluence Data Center and Server: 4.x.x, 5.x.x, 6.x.x, 7.x.x, 8.0.x, 8.1.x, 8.2.x, 8.3.x, 8.4.0, 8.4.1, 8.4.2, 8.4.3, 8.4.4, 8.5., 8.5.1, 8.5.2, 8.5.3Confluence Data Center: 8.6.0, 8.6.1Jira Service Management Cloud Insight Discovery 1.0 – 3.1.3Jira Service Management Cloud Assets Discovery 3.1.4 – 3.1.7Jira Service Management Cloud Assets Discovery 3.1.8-cloud – 3.1.11-cloudJira Service Management Data Center and Server Insight Discovery 1.0 – 3.1.7Jira Service Management Data Center and ServerAssets Discovery 3.1.9 – 3.1.11Jira Service Management Data Center and ServerAssets Discovery 6.0.0 – 6.1.14, 6.1.14-jira-dc-8Atlassian Companion App for MacOS: All versions (MacOS) up to but not including 2.0.0Automation for Jira (A4J) Marketplace App: 9.0.1, 9.0.0, versions up to 8.2.2Bitbucket Data Center and Server: 7.17.x, 7.18.x, 7.19.x, 7.20.x, 7.21.0, 7.21.1, 7.21.2, 7.21.3, 7.21.4, 7.21.5, 7.21.6, 7.21.7, 7.21.8, 7.21.9, 7.21.10 7.21.11, 7.21.12, 7.21.13, 7.21.14, 7.21.15, 8.0.x, 8.1.x, 8.2.x, 8.3.x, 8.4.x, 8.5.x, 8.6.x, 8.7.x, 8.8.0, 8.8.1, 8.8.2, 8.8.3, 8.8.4, 8.8.5, 8.8.6, 8.9.0, 8.9.1, 8.9.2, 8.9.3, 8.10.0, 8.10.1, 8.10.2, 8.10.3, 8.11.0, 8.11.1, 8.11.2, 8.12.0Confluence Data Center and Server: 6.13.x, 6.14.x, 6.15.x, 7.0.x, 7.1.x, 7.2.x, 7.3.x, 7.4.x, 7.5.x, 7.6.x, 7.7.x, 7.8.x, 7.9.x, 7.10.x, 7.11.x, 7.12.x, 7.13.0, 7.13.1, 7.13.2, 7.13.3, 7.13.4, 7.13.5, 7.13.6, 7.13.7, 7.13.8, 7.13.9, 7.13.10, 7.13.11, 7.13.12, 7.13.13, 7.13.14, 7.13.15, 7.13.16, 7.13.17, 7.14.x, 7.15.x, 7.16.x, 7.17.x, 7.18.x, 7.19.0, 7.19.1, 7.19.2, 7.19.3, 7.19.4, 7.19.5, 7.19.6, 7.19.7, 7.19.8, 7.19.9, 7.20.x, 8.0.x, 8.1.x, 8.2.x, and 8.3.0Jira Core Data Center and Server and Jira Software Data Center and Server: 9.4.0, 9.4.1, 9.4.2, 9.4.3, 9.4.4, 9.4.5, 9.4.6, 9.4.7, 9.4.8, 9.4.9, 9.4.10, 9.4.11, 9.4.12, 9.5.x, 9.6.x, 9.7.x, 9.8.x, 9.9.x, 9.10.x, 9.11.0, and 9.11.1Jira Service Management Data Center and Server: 5.4.0, 5.4.1, 5.4.2, 5.4.3, 5.4.4, 5.4.5, 5.4.6, 5.4.7, 5.4.8, 5.4.9, 5.4.10, 5.4.11, 5.4.12, 5.5.x, 5.6.x, 5.7.x, 5.8.x, 5.9.x, 5.10.x, 5.11.0, 5.11.1RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Atlassian products which could allow for remote code execution. Details of these vulnerabilities are as follows:\nTactic: Initial Access (TA0040):\nTechnique: Exploit Public-Facing Application (T1485):\n\nConfluence Data Center and Confluence Server Remote Code Execution Vulnerability - An authenticated attacker, including one with anonymous access, can insert unauthorized user input into a Confluence page by using the Template Injection vulnerability. (CVE-2023-22522)\nAssets Discovery Remote Code Execution Vulnerability - The vulnerability exists between the Assets Discovery application (formerly known as Insight Discovery) and the Assets Discovery agent. (CVE-2023-22523)\nAtlassian Companion App for MacOS Remote Code Execution Vulnerability - An attacker may use WebSockets to bypass Atlassian Companion’s blocklist and MacOS Gatekeeper to perform code execution. (CVE-2023-22524)\nSnakeYAML Library Remote Code Execution Vulnerability - The deserialization flaw in the SnakeYAML library for Java may allow an attacker to perform remote code execution on target instances. The SnakeYAML library is used in various Atlassian Data Center and Server products. (CVE-2022-1471)\nAn attacker could exploit one of these vulnerabilities to execute remote code execution and take control of an affected system\nRECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply appropriate patches and workarounds provided by Atlassian to vulnerable systems, immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.2: Establish and Maintain a Remediation Process: Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.\no   Safeguard 7.3: Perform Automated Operating System Patch Management: Perform operating system updates on enterprise assets through automated patch management on a monthly, or more frequent, basis\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\no   Safeguard 7.5: Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\no   Safeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\no   Safeguard 12.1: Ensure Network Infrastructure is Up-to-Date: Ensure network infrastructure is kept up-to-date. Example implementations include running the latest stable release of software and/or using currently supported network-as-a-service (NaaS) offerings. Review software versions monthly, or more frequently, to verify software support.\no   Safeguard 18.1: Establish and Maintain a Penetration Testing Program: Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include scope, such as network, web application, Application Programming Interface (API), hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; point of contact information; remediation, such as how findings will be routed internally; and retrospective requirements.\no   Safeguard 18.2: Perform Periodic External Penetration Tests: Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.\no   Safeguard 18.3: Remediate Penetration Test Findings: Remediate penetration test findings based on the enterprise’s policy for remediation scope and prioritization.\n\n\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\no   Safeguard 5.5: Establish and Maintain an Inventory of Service Accounts: Establish and maintain an inventory of service accounts. The inventory, at a minimum, must contain department owner, review date, and purpose. Perform service account reviews to validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently.\n\n\nVulnerability scanning is used to find potentially exploitable software vulnerabilities to remediate them. (M1016: Vulnerability Scanning)\no   Safeguard 16.13: Conduct Application Penetration Testing: Conduct application penetration testing. For critical applications, authenticated penetration testing is better suited to finding business logic vulnerabilities than code scanning and automated security testing. Penetration testing relies on the skill of the tester to manually manipulate an application as an authenticated and unauthenticated user.\n\n\nArchitect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. Configure separate virtual private cloud (VPC) instances to isolate critical cloud systems. (M1030: Network Segmentation)\no   Safeguard 12.2: Establish and Maintain a Secure Network Architecture: Establish and maintain a secure network architecture. A secure network architecture must address segmentation, least privilege, and availability, at a minimum.\n\n\nRestrict execution of code to a virtual environment on or in transit to an endpoint system. (M1048: Application Isolation and Sandboxing)\no   Safeguard 16.8: Separate Production and Non-Production Systems: Maintain separate environments for production and non-production systems.\n\n\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection)\nSafeguard 10.5: Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Apple® System Integrity Protection (SIP) and Gatekeeper™.\n\n\nTake and store data backups from end user systems and critical servers. Ensure backup and storage systems are hardened and kept separate from the corporate network to prevent compromise. (M1053: Data Backup)\no   Safeguard 11.1: Establish and Maintain a Data Recovery Process: Establish and maintain a data recovery process. In the process, address the scope of data recovery activities, recovery prioritization, and the security of backup data. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 11.2: Perform Automated Backups: Perform automated backups of in-scope enterprise assets. Run backups weekly, or more frequently, based on the sensitivity of the data.\no   Safeguard 11.3: Protect Recovery Data: Protect recovery data with equivalent controls to the original data. Reference encryption or data separation, based on requirements.\no   Safeguard 11.4: Establish and Maintain an Isolated Instance of Recovery Data: Establish and maintain an isolated instance of recovery data. Example implementations include, version controlling backup destinations through offline, cloud, or off-site systems or services.\nSafeguard 11.5: Test Data Recovery: Test backup recovery quarterly, or more frequently, for a sampling of in-scope enterprise assets.\n\nREFERENCES:Atlassianhttps://confluence.atlassian.com/security/cve-2023-22524-rce-vulnerability-in-atlassian-companion-app-for-macos-1319249492.htmlhttps://confluence.atlassian.com/security/cve-2023-22523-rce-vulnerability-in-assets-discovery-1319248914.htmlhttps://confluence.atlassian.com/security/cve-2023-22522-rce-vulnerability-in-confluence-data-center-and-confluence-server-1319570362.htmlhttps://confluence.atlassian.com/kb/faq-for-cve-2022-1471-1295810798.htmlGet Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Advisory09.03.20242024-094: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreWhite Paper08.29.2024The CIS Security Operations Center (SOC): The Key to Growing Your SLTT's Cyber MaturityRead MoreAdvisory08.24.20242024-093: Multiple Vulnerabilities in SolarWinds Web Help Desk Could Allow for Remote Code ExecutionRead MoreBlog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead More",
  "cves": [
    "CVE-2023-22524",
    "CVE-2022-1471",
    "CVE-2023-22522",
    "CVE-2023-22523"
  ],
  "techniques": [
    "T1485"
  ],
  "title": "Multiple Vulnerabilities in Atlassian Products Could Allow for Remote Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}