{
  "id": "a949ce51b077b773c192b820381475467e24829cb9b27a364279c19f54511fc0",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Apple Products Could Allow for Arbitrary Code ExecutionMultiple Vulnerabilities in Apple Products Could Allow for Arbitrary Code ExecutionMS-ISAC ADVISORY NUMBER:2023-033DATE(S) ISSUED:03/28/2023OVERVIEW:Multiple vulnerabilities have been discovered in Apple Products, the most severe of which could allow for arbitrary code execution.\n\nSafari is a graphical web browser developed by Apple.\niOS is a mobile operating system for mobile devices, including the iPhone, iPad, and iPod touch.\nmacOS Monterey is the 18th and release of macOS.\nmacOS Big Sur is the 17th release of macOS.\nwatchOS is the mobile operating system for Apple Watch and is based on the iOS operating system.\niPadOS is the successor to iOS 12 and is a mobile operating system for iPads.\nmacOS Ventura is the 19th and current major release of macOS\ntvOS is an operating system for fourth-generation Apple TV digital media player.\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nTHREAT INTELLIGENCE:Apple is aware of a report that CVE-2023-23529 may have been actively exploited.SYSTEMS AFFECTED:Safari prior to 16.4iOS prior to 15.7.4 and iPadOS prior to 15.7.4iOS prior to 16.4 and iPadOS prior to 16.4watchOS prior to 9.4tvOS prior to 16.4macOS Big Sur prior to 11.7.5mac OS Monterey prior to 12.6.4macOS Ventura prior to 13.3Studio Display Firmware prior to 16.4RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Apple Products, the most severe of which could allow for arbitrary code execution. Details of the most critical vulnerabilities are as follows:\nTactic: Execution (TA0001):\nTechnique: Exploitation for Client Execution (T1203):\n\nAn app may be able to cause unexpected system termination or write kernel memory(CVE-2023-27968, CVE-2023-27936)\nAn app may be able to execute arbitrary code with kernel privileges(CVE-2023-28181, CVE-2023-23514, CVE-2023-27969, CVE-2023-23540, CVE-2022-26702, CVE-2023-27959, CVE-2023-27970)\nA remote user may be able to cause unexpected app termination or arbitrary code execution(CVE-2023-27934, CVE-2023-27935)\nA remote user may be able to cause unexpected system termination or corrupt kernel memory(CVE-2023-27953, CVE-2023-27958)\nParsing a maliciously crafted plist may lead to an unexpected app termination or arbitrary code execution(CVE-2023-27937)\nProcessing a maliciously crafted file may lead to unexpected app termination or arbitrary code execution(CVE-2023-27946, CVE-2023-27957, CVE-2023-27949)\nAn app with root privileges may be able to execute arbitrary code with kernel privileges(CVE-2023-27933)\nProcessing maliciously crafted web content may lead to arbitrary code execution (CVE-2023-23529)\nTactic: Privilege Escalation (TA0004):\nTechnique: Exploitation for Client Execution (T1203):\nAn app may be able to gain root privileges(CVE-2023-23525)\nDetails of lower-severity vulnerabilities are as follows:\nAn app may be able to break out of its sandbox(CVE-2023-23532)\nA user may gain access to protected parts of the file system(CVE-2023-23527)\nAn app may be able to access user-sensitive data(CVE-2023-27931)\nAn archive may be able to bypass Gatekeeper(CVE-2023-27951)\nImporting a maliciously crafted calendar invitation may exfiltrate user information(CVE-2023-27961)\nA sandboxed app may be able to determine which app is currently using the camera(CVE-2023-23543)\nProcessing a maliciously crafted image may result in disclosure of process memory(CVE-2023-23534)\nAn app may be able to read arbitrary files(CVE-2023-27955)\nMultiple issues in curl(CVE-2022-43551, CVE-2022-43552)\nA user in a privileged network position may be able to cause a denial-of-service(CVE-2023-28180)\nAn app may be able to execute arbitrary code with kernel privileges(CVE-2023-27965)\nAn app may be able to access user-sensitive data(CVE-2023-28190)\nAn app may be able to read sensitive location information(CVE-2023-23537)\nProcessing a maliciously crafted image may result in disclosure of process memory(CVE-2023-27956)\nA file from an iCloud shared-by-me folder may be able to bypass Gatekeeper(CVE-2023-23526)\nAn app may be able to access information about a user's contacts(CVE-2023-27928)\nProcessing a maliciously crafted image may result in disclosure of process memory(CVE-2023-23535)\nProcessing a maliciously crafted image may result in disclosure of process memory(CVE-2023-27929)\nAn app may be able to disclose kernel memory(CVE-2023-27941)\nAn app may be able to disclose kernel memory(CVE-2023-28200)\nFiles downloaded from the internet may not have the quarantine flag applied(CVE-2023-27943)\nA user in a privileged network position may be able to spoof a VPN server that is configured with EAP-only authentication on a device(CVE-2023-28182)\nAn app may be able to modify protected parts of the file system(CVE-2023-23538, CVE-2023-27962)\nPhotos belonging to the Hidden Photos Album could be viewed without authentication through Visual Lookup(CVE-2023-23523)\nAn app may be able to access user-sensitive data(CVE-2023-27942)\nAn app may bypass Gatekeeper checks(CVE-2023-27952)\nAn app may be able to modify protected parts of the file system(CVE-2023-23533)\nAn app may be able to bypass Privacy preferences(CVE-2023-28178)\nA shortcut may be able to use sensitive data with certain actions without prompting the user(CVE-2023-27963)\nAn app may be able to access user-sensitive data(CVE-2023-23542)\nAn app may be able to read sensitive location information(CVE-2023-28192)\nAn app may be able to access user-sensitive data(CVE-2023-27931)\nMultiple issues in Vim(CVE-2023-0049, CVE-2023-0051, CVE-2023-0054, CVE-2023-0288, CVE-2023-0433, CVE-2023-0512)\nProcessing maliciously crafted web content may bypass Same Origin Policy(CVE-2023-27932)\nA website may be able to track sensitive user information(CVE-2023-27954)\nAn app may be able to break out of its sandbox(CVE-2023-27944)\nProcessing a maliciously crafted Bluetooth packet may result in disclosure of process memory  (CVE-2023-23528)\nAn app may be able to access information about a user's contacts(CVE-2023-23541)\nA user in a privileged network position may be able to cause a denial-of-service(CVE-2023-23494)\nAn app may be able to unexpectedly create a bookmark on the Home Screen(CVE-2023-28194)\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\nApply the stable channel update provided by Apple to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1 : Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.2 : Establish and Maintain a Remediation Process: Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.\no   Safeguard 7.6 : Perform Automated Vulnerability Scans of Externally-Exposed Enterprise Assets: Perform automated vulnerability scans of externally-exposed enterprise assets using a SCAP-compliant vulnerability scanning tool. Perform scans on a monthly, or more frequent, basis.\no   Safeguard 7.7 : Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\no   Safeguard 16.13 Conduct Application Penetration Testing: Conduct application penetration testing. For critical applications, authenticated penetration testing is better suited to finding business logic vulnerabilities than code scanning and automated security testing. Penetration testing relies on the skill of the tester to manually manipulate an application as an authenticated and unauthenticated user.\no   Safeguard 18.1 : Establish and Maintain a Penetration Testing Program: Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include scope, such as network, web application, Application Programming Interface (API), hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; point of contact information; remediation, such as how findings will be routed internally; and retrospective requirements.\no   Safeguard 18.2 : Perform Periodic External Penetration Tests: Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.\no   Safeguard 18.3 : Remediate Penetration Test Findings: Remediate penetration test findings based on the enterprise’s policy for remediation scope and prioritization.\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content)\no   Safeguard 2.3: Address Unauthorized Software: Ensure that unauthorized software is either removed from use on enterprise assets or receives a documented exception. Review monthly, or more frequently.\no   Safeguard 2.7: Allowlist Authorized Scripts: Use technical controls, such as digital signatures and version control, to ensure that only authorized scripts, such as specific .ps1, .py, etc., files, are allowed to execute. Block unauthorized scripts from executing. Reassessbi-annually, or more frequently.\no   Safeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\no   Safeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (Mitigation M1050 : Exploit Protection)\no   Safeguard 10.5: Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\nTrain users to be aware of access or manipulation attempts by an adversary to reduce the risk of successful spearphishing, social engineering, and other techniques that involve user interaction. (M1017: User Training)\no   Safeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 14.6: Train Workforce Members on Recognizing and Reporting Security Incidents: Train workforce members to be able to recognize a potential incident and be able to report such an incident.\nREFERENCES:Applehttps://support.apple.com/en-us/HT213670https://support.apple.com/en-us/HT213671https://support.apple.com/en-us/HT213672https://support.apple.com/en-us/HT213673https://support.apple.com/en-us/HT213674https://support.apple.com/en-us/HT213675https://support.apple.com/en-us/HT213676https://support.apple.com/en-us/HT213677https://support.apple.com/en-us/HT213678CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-26702https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-43551https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-43552https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-0049https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-0051https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-0054https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-0288https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-0433https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-0512https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23494https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23514https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23523https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23525https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23526https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23527https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23528https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23529https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23532https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23533https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23534https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23535https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23537https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23538https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23540https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23541https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23542https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23543https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27928https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27929https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27931https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27932https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27933https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27934https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27935https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27936https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27937https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27941https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27942https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27943https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27944https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27946https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27949https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27951https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27952https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27953https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27954https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27955https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27956https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27957https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27958https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27959https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27961https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27962https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27963https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27965https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27968https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27969https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-27970https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28178https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28180https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28181https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28182https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28190https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28192https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28194https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28200Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Advisory09.03.20242024-094: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreWhite Paper08.29.2024The CIS Security Operations Center (SOC): The Key to Growing Your SLTT's Cyber MaturityRead MoreAdvisory08.24.20242024-093: Multiple Vulnerabilities in SolarWinds Web Help Desk Could Allow for Remote Code ExecutionRead MoreBlog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead More",
  "cves": [
    "CVE-2023-23494",
    "CVE-2023-27952",
    "CVE-2023-27929",
    "CVE-2023-23514",
    "CVE-2023-27970",
    "CVE-2023-23527",
    "CVE-2023-28200",
    "CVE-2023-0288",
    "CVE-2023-23540",
    "CVE-2023-28190",
    "CVE-2023-23537",
    "CVE-2023-28194",
    "CVE-2023-27957",
    "CVE-2023-0054",
    "CVE-2023-28178",
    "CVE-2022-43551",
    "CVE-2023-27934",
    "CVE-2023-27946",
    "CVE-2023-23534",
    "CVE-2023-27951",
    "CVE-2023-27932",
    "CVE-2023-27953",
    "CVE-2023-23529",
    "CVE-2023-27959",
    "CVE-2023-27968",
    "CVE-2023-28192",
    "CVE-2023-23526",
    "CVE-2023-27944",
    "CVE-2023-27963",
    "CVE-2023-27933",
    "CVE-2023-27949",
    "CVE-2023-0433",
    "CVE-2023-0049",
    "CVE-2023-0512",
    "CVE-2023-23532",
    "CVE-2023-23541",
    "CVE-2022-26702",
    "CVE-2023-28180",
    "CVE-2023-27965",
    "CVE-2023-23533",
    "CVE-2023-27935",
    "CVE-2023-27969",
    "CVE-2023-27962",
    "CVE-2023-27928",
    "CVE-2023-27931",
    "CVE-2023-27956",
    "CVE-2023-27936",
    "CVE-2023-27954",
    "CVE-2023-28182",
    "CVE-2023-23525",
    "CVE-2023-23542",
    "CVE-2023-23528",
    "CVE-2023-23543",
    "CVE-2023-23535",
    "CVE-2023-27942",
    "CVE-2022-43552",
    "CVE-2023-27937",
    "CVE-2023-27961",
    "CVE-2023-0051",
    "CVE-2023-23538",
    "CVE-2023-28181",
    "CVE-2023-27941",
    "CVE-2023-27943",
    "CVE-2023-23523",
    "CVE-2023-27955",
    "CVE-2023-27958"
  ],
  "techniques": [
    "T1203",
    "T2136"
  ],
  "title": "Multiple Vulnerabilities in Apple Products Could Allow for Arbitrary Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}