{
  "id": "8de06beb2f369809f38403f80510d36d1ef8365542f942e080f5609cde79a660",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionMultiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionMS-ISAC ADVISORY NUMBER:2023-027DATE(S) ISSUED:03/08/2023OVERVIEW:Multiple vulnerabilities have been discovered in Google Chrome, the most severe of which could allow for arbitrary code execution. Google Chrome is a web browser used to access the internet. Successful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.THREAT INTELLIGENCE:There are currently no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:Google Chrome versions prior to 111.0.5563.64/.65 for WindowsGoogle Chrome versions prior to 111.0.5563.64 for Mac and LinuxRISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Google Chrome, the most severe of which could allow for arbitrary code execution. Details of these vulnerabilities are as follows:\nTactic: Initial Access (TA0001):\nTechnique: Drive-By Compromise (T1189):\n\nHeap buffer overflow in UMA. (CVE-2023-1220)\nUse after free in Core. (CVE-2023-1227)\nHeap buffer overflow in Metrics. (CVE-2023-1219)\nHeap buffer overflow in Web Audio API. (CVE-2023-1222)\nStack buffer overflow in Crash reporting. (CVE-2023-1217)\nType Confusion in V8. (CVE-2023-1214)\nUse after free in Swiftshader. (CVE-2023-1213)\nType Confusion in CSS. (CVE-2023-1215)\nUse after free in DevTools. (CVE-2023-1216)\nUse after free in WebRTC. (CVE-2023-1218)\nDetails of lower-severity vulnerabilities are as follows:\nInsufficient policy enforcement in Extensions API. (CVE-2023-1221)\nInsufficient policy enforcement in Navigation. (CVE-2023-1225)\nInsufficient policy enforcement in Autofill. (CVE-2023-1223)\nInsufficient policy enforcement in Web Payments API. (CVE-2023-1224)\nInsufficient policy enforcement in Intents. (CVE-2023-1228)\nInsufficient policy enforcement in Web Payments API. (CVE-2023-1226)\nInappropriate implementation in Permission prompts. (CVE-2023-1229)\nInsufficient policy enforcement in Resource Timing. (CVE-2023-1232)\nInappropriate implementation in WebApp Installs. (CVE-2023-1230)\nInsufficient policy enforcement in Resource Timing. (CVE-2023-1233)\nInappropriate implementation in Autofill. (CVE-2023-1231)\nType Confusion in DevTools. (CVE-2023-1235)\nInappropriate implementation in Intents. (CVE-2023-1234)\nInappropriate implementation in Internals. (CVE-2023-1236)\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\nApply appropriate updates provided by Google to vulnerable systems immediately after appropriate testing. (M1051: Update Software) \nSafeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\nSafeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\nSafeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\nSafeguard 9.1: Ensure Use of Only Fully Supported Browsers and Email Clients: Ensure only fully supported browsers and email clients are allowed to execute in the enterprise, only using the latest version of browsers and email clients provided through the vendor.\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management) \nSafeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\nSafeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\nRestrict execution of code to a virtual environment on or in transit to an endpoint system. (M1048: Application Isolation and Sandboxing) \nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection) \nSafeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content) \nSafeguard 9.2: Use DNS Filtering Services: Use DNS filtering services on all enterprise assets to block access to known malicious domains.\nSafeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\nSafeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\nInform and educate users regarding the threats posed by hypertext links contained in emails or attachments especially from un-trusted sources. Remind users not to visit un-trusted websites or follow links provided by unknown or un-trusted sources. (M1017: User Training) \nSafeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\nSafeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\nREFERENCES:CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1213https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1214https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1215https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1216https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1217https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1218https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1219https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1220https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1221https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1222https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1223https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1224https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1225https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1226https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1227https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1228https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1229https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1230https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1231https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1232https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1233https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1234https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1235https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-1236Googlehttps://chromereleases.googleblog.com/2023/03/stable-channel-update-for-desktop.htmlGet Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Related ResourcesGoogle ChromeInformation HubAdvisories See All Advisories Advisory09.03.20242024-094: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreWhite Paper08.29.2024The CIS Security Operations Center (SOC): The Key to Growing Your SLTT's Cyber MaturityRead MoreAdvisory08.24.20242024-093: Multiple Vulnerabilities in SolarWinds Web Help Desk Could Allow for Remote Code ExecutionRead MoreBlog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead More",
  "cves": [
    "CVE-2023-1218",
    "CVE-2023-1222",
    "CVE-2023-1220",
    "CVE-2023-1236",
    "CVE-2023-1213",
    "CVE-2023-1219",
    "CVE-2023-1235",
    "CVE-2023-1228",
    "CVE-2023-1214",
    "CVE-2023-1232",
    "CVE-2023-1233",
    "CVE-2023-1230",
    "CVE-2023-1217",
    "CVE-2023-1231",
    "CVE-2023-1227",
    "CVE-2023-1221",
    "CVE-2023-1226",
    "CVE-2023-1229",
    "CVE-2023-1216",
    "CVE-2023-1225",
    "CVE-2023-1224",
    "CVE-2023-1223",
    "CVE-2023-1215",
    "CVE-2023-1234"
  ],
  "techniques": [
    "T1189"
  ],
  "title": "Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}