{
  "id": "7309bb4df16ccbfc670af3cf7890ff8640c344aeb45b833f26eec54358bc2122",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Siemens Ruggedcom Crossbow Could Allow for Arbitrary Code ExecutionMultiple Vulnerabilities in Siemens Ruggedcom Crossbow Could Allow for Arbitrary Code ExecutionMS-ISAC ADVISORY NUMBER:2024-055DATE(S) ISSUED:05/14/2024OVERVIEW:Multiple vulnerabilities have been discovered in Siemens Ruggedcom Crossbow, the most severe of which could allow for arbitrary code execution. Siemens Ruggedcom Crossbow Access Management solution designed to provide cybersecurity compliance for industrial control systems. Successful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged-on user. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.THREAT INTELLIGENCE:There are no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:Ruggedcom Crossbow prior to Version 5.5RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple Vulnerabilities have been discovered in Siemens Ruggedcom Crossbow, the most severe of which could allow for arbitrary code execution. Details of these vulnerabilities are as follows:\nTactic: Initial Access (TA0001):\n\nThe affected systems allow the upload of arbitrary files of any unauthenticated user. An attacker could leverage this vulnerability and achieve arbitrary code execution with system privileges.(CVE-2024-27939) \nThe affected systems allow any authenticated user to send arbitrary SQL commands to the SQL server. An attacker could use this vulnerability to compromise the whole database.(CVE-2024-27940) \nThe affected client systems do not properly sanitize input data before sending it to the SQL server. An attacker could use this vulnerability to compromise the whole database.(CVE-2024-27941) \nThe affected systems allow any unauthenticated client to disconnect any active user from the server. An attacker could use this vulnerability to prevent any user to perform actions in the system, causing a denial of service situation. (CVE-2024-27942) \nThe affected systems allow a privileged user to upload generic files to the root installation directory of the system. By replacing specific files, an attacker could tamper specific files or even achieve remote code execution. (CVE-2024-27943) \nThe affected systems allow a privileged user to upload firmware files to the root installation directory of the system. By replacing specific files, an attacker could tamper specific files or even achieve remote code execution. (CVE-2024-27944) \nThe bulk import feature of the affected systems allow a privileged user to upload files to the root installation directory of the system. By replacing specific files, an attacker could tamper specific files or even achieve remote code execution. (CVE-2024-27945)\nDownloading files overwrites files with the same name in the installation directory of the affected systems. The filename for the target file can be specified, thus arbitrary files can be overwritten by an attacker with the required privileges. (CVE-2024-27946) \nThe affected systems could allow log messages to be forwarded to a specific client under certain circumstances. An attacker could leverage this vulnerability to forward log messages to a specific compromised client.(CVE-2024-27947)\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply appropriate updates provided by Siemens to vulnerable systems immediately after appropriate testing. (M1051: Update Software) \n\n\nSafeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\n\n\nSafeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\n\n\nSafeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\n\n\nSafeguard 9.1: Ensure Use of Only Fully Supported Browsers and Email Clients: Ensure only fully supported browsers and email clients are allowed to execute in the enterprise, only using the latest version of browsers and email clients provided through the vendor.\n\n\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management) \n\n\nSafeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\n\n\nSafeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\n\n\nRestrict execution of code to a virtual environment on or in transit to an endpoint system. (M1048: Application Isolation and Sandboxing)\n\n\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection) \n\n\nSafeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\n\n\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content) \n\n\nSafeguard 9.2: Use DNS Filtering Services: Use DNS filtering services on all enterprise assets to block access to known malicious domains.\n\n\nSafeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\n\n\nSafeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\n\n\nInform and educate users regarding the threats posed by hypertext links contained in emails or attachments especially from un-trusted sources. Remind users not to visit un-trusted websites or follow links provided by unknown or un-trusted sources. (M1017: User Training) \n\n\nSafeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\n\n\nSafeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\n\nREFERENCES:CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27939https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27940https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27941https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27942https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27943https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27944https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27945https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27946https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27947Googlehttps://cert-portal.siemens.com/productcert/html/ssa-916916.htmlGet Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Blog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead MoreAdvisory08.13.20242024-091: Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code ExecutionRead MoreAdvisory08.13.20242024-090: Multiple Vulnerabilities in Ivanti Products Could Allow for Remote Code ExecutionRead MoreBlog Post08.09.2024Top 10 Malware Q2 2024Read More",
  "cves": [
    "CVE-2024-27944",
    "CVE-2024-27943",
    "CVE-2024-27940",
    "CVE-2024-27946",
    "CVE-2024-27941",
    "CVE-2024-27947",
    "CVE-2024-27942",
    "CVE-2024-27945",
    "CVE-2024-27939"
  ],
  "techniques": [],
  "title": "Multiple Vulnerabilities in Siemens Ruggedcom Crossbow Could Allow for Arbitrary Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}