{
  "id": "b30a98f0d1f06049deaabc49dee6d771c5d9baf9f7a3f03cd4b60c9491e158a2",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Ivanti Avalanche Could Allow for Remote Code ExecutionMultiple Vulnerabilities in Ivanti Avalanche Could Allow for Remote Code ExecutionMS-ISAC ADVISORY NUMBER:2024-041DATE(S) ISSUED:04/17/2024OVERVIEW:Multiple vulnerabilities have been discovered in Ivanti Avalanche, the most severe of which could allow for remote code execution. Ivanti Avalanche is a mobile device management system. Network security features allow one to manage wireless settings (including encryption and authentication), and apply those settings on a schedule throughout the network. Successful exploitation could allow for remote code execution in the context of the system. Depending on the privileges associated with the system, an attacker could then install programs; view, change, or delete data.THREAT INTELLIGENCE:THREAT INTELLIGENCE:\nThere are currently no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:Ivanti Avalanche versions prior to 6.4.3RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Ivanti Avalanche, the most severe of which could allow for remote code execution. Details of these vulnerabilities are as follows:\nTactic: Initial Access (TA0001):\nTechnique: Exploit Public-Facing Application (T1190):\n\nA Heap Overflow vulnerability in WLInfoRailService before 6.4.3 allows a remote unauthenticated attacker to execute arbitrary commands. (CVE-2024-22061, CVE-2024-24996, CVE-2024-29204)\nAn out-of-bounds Read vulnerability in WLAvalancheService component of Ivanti Avalanche before 6.4.3 allows an authenticated remote attacker to perform denial of service attacks. In certain conditions this could also lead to remote code execution. (CVE-2024-23532)\nAn Unrestricted File-upload vulnerability in web component of Ivanti Avalanche before 6.4.3 allows a remote authenticated attacker to execute arbitrary commands as SYSTEM. (CVE-2024-23534)\nA Path Traversal vulnerability in web component of Ivanti Avalanche before 6.4.3 allows a remote authenticated attacker to execute arbitrary commands as SYSTEM. (CVE-2024-23535, CVE-2024-24992, CVE-2024-24994, CVE-2024-24997, CVE-2024-24998, CVE-2024-24999, CVE-2024-25000, CVE-2024-27976)\nA Race Condition (TOCTOU) vulnerability in web component of Ivanti Avalanche before 6.4.3 allows a remote authenticated attacker to execute arbitrary commands as SYSTEM. (CVE-2024-24993, CVE-2024-24995)\nAn Use-after-free vulnerability in WLAvalancheService component of Ivanti Avalanche before 6.4.3 allows a remote authenticated attacker to execute arbitrary commands as SYSTEM. (CVE-2024-27975)\n\nDetails of lower severity vulnerabilities:\n\nAn out-of-bounds read vulnerability in WLAvalancheService component of Ivanti Avalanche before 6.4.3, in certain conditions can allow an unauthenticated remote attacker to read sensitive information in memory. (CVE-2024-23526, CVE-2024-23527, CVE-2024-23528, CVE-2024-23529, CVE-2024-23530, CVE-2024-23533)\nAn Integer Overflow vulnerability in WLInfoRailService component of Ivanti Avalanche before 6.4.3 allows an unauthenticated remote attacker to perform denial of service attacks. In certain rare conditions this could also lead to reading content from memory. (CVE-2024-23531)\nA Null Pointer Dereference vulnerability in WLAvalancheService component of Ivanti Avalanche before 6.4.3 allows an authenticated remote attacker to perform denial of service attacks. (CVE-2024-24991, CVE-2024-27978)\nA Path Traversal vulnerability in web component of Ivanti Avalanche before 6.4.3 allows a remote authenticated attacker to delete specific type of files and/or cause denial of service. (CVE-2024-27984)\nSuccessful exploitation could allow for remote code execution in the context of the system. Depending on the privileges associated with the system, an attacker could then install programs; view, change, or delete data.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\nApply appropriate updates provided by Ivanti to vulnerable systems immediately after appropriate testing. (M1051: Update Software) \nSafeguard 7.1 : Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\nSafeguard 7.2: Establish and Maintain a Remediation Process: Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.\nSafeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\nSafeguard 7.5 : Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\nSafeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\nSafeguard 12.1: Ensure Network Infrastructure is Up-to-Date: Ensure network infrastructure is kept up-to-date. Example implementations include running the latest stable release of software and/or using currently supported network-as-a-service (NaaS) offerings. Review software versions monthly, or more frequently, to verify software support.\nSafeguard 18.1: Establish and Maintain a Penetration Testing Program: Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include scope, such as network, web application, Application Programming Interface (API), hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; point of contact information; remediation, such as how findings will be routed internally; and retrospective requirements.\nSafeguard 18.2: Perform Periodic External Penetration Tests: Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.\nSafeguard 18.3: Remediate Penetration Test Findings: Remediate penetration test findings based on the enterprise’s policy for remediation scope and prioritization.\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management) \nSafeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\nSafeguard 5.5: Establish and Maintain an Inventory of Service Accounts: Establish and maintain an inventory of service accounts. The inventory, at a minimum, must contain department owner, review date, and purpose. Perform service account reviews to validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently.\nVulnerability scanning is used to find potentially exploitable software vulnerabilities to remediate them. (M1016: Vulnerability Scanning) \nSafeguard 16.13: Conduct Application Penetration Testing: Conduct application penetration testing. For critical applications, authenticated penetration testing is better suited to finding business logic vulnerabilities than code scanning and automated security testing. Penetration testing relies on the skill of the tester to manually manipulate an application as an authenticated and unauthenticated user.\nArchitect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. Configure separate virtual private cloud (VPC) instances to isolate critical cloud systems. (M1030: Network Segmentation) \nSafeguard 12.2: Establish and Maintain a Secure Network Architecture: Establish and maintain a secure network architecture. A secure network architecture must address segmentation, least privilege, and availability, at a minimum.\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection) \nSafeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\nREFERENCES:CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-22061https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23526https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23527https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23528https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23529https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23530https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23531https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23533https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23532https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23534https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23535https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24991https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24992https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24993https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24994https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24995https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24996https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24997https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24998https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24999https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-25000https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27975https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27976https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27977https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27978https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27984https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-29204Ivantihttps://forums.ivanti.com/s/article/Avalanche-6-4-3-Security-Hardening-and-CVEs-addressed?language=en_USGet Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Advisory09.03.20242024-094: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreWhite Paper08.29.2024The CIS Security Operations Center (SOC): The Key to Growing Your SLTT's Cyber MaturityRead MoreAdvisory08.24.20242024-093: Multiple Vulnerabilities in SolarWinds Web Help Desk Could Allow for Remote Code ExecutionRead MoreBlog Post08.14.2024The Chinese Communist Party (CCP): A Quest for Data ControlRead More",
  "cves": [
    "CVE-2024-24994",
    "CVE-2024-23533",
    "CVE-2024-22061",
    "CVE-2024-24997",
    "CVE-2024-24993",
    "CVE-2024-29204",
    "CVE-2024-23527",
    "CVE-2024-24998",
    "CVE-2024-27978",
    "CVE-2024-27976",
    "CVE-2024-24999",
    "CVE-2024-23535",
    "CVE-2024-27975",
    "CVE-2024-23531",
    "CVE-2024-23528",
    "CVE-2024-23530",
    "CVE-2024-25000",
    "CVE-2024-23529",
    "CVE-2024-24995",
    "CVE-2024-27977",
    "CVE-2024-24992",
    "CVE-2024-24996",
    "CVE-2024-23532",
    "CVE-2024-23534",
    "CVE-2024-27984",
    "CVE-2024-24991",
    "CVE-2024-23526"
  ],
  "techniques": [
    "T1190"
  ],
  "title": "Multiple Vulnerabilities in Ivanti Avalanche Could Allow for Remote Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}