{
  "id": "7649b84511c4cdc72d080bb251c4f6c62be2917a57c1b15982b94bc8f2823160",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Progress MOVEit Transfer Could Allow for Unauthorized Database AccessMultiple Vulnerabilities in Progress MOVEit Transfer Could Allow for Unauthorized Database AccessMS-ISAC ADVISORY NUMBER:2023-073DATE(S) ISSUED:07/07/2023OVERVIEW:Multiple vulnerabilities have been discovered in Progress Moveit Transfer, which could allow for unauthorized database access. MOVEit Transfer is a managed file transfer software that allows the enterprise to securely transfer files between business partners and customers using SFTP, SCP, and HTTP-based uploads. If successfully exploited, an attacker could gain unauthorized access to the database, potentially compromising confidential information, user credentials, and other sensitive data. This unauthorized access could also result in unauthorized modifications and disclosure of the database content.THREAT INTELLIGENCE:There are currently no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:MOVEit Transfer versions before 2020.1.11 (12.1.11)MOVEit Transfer versions before 2021.0.9 (13.0.9)MOVEit Transfer versions before 2021.1.7 (13.1.7)MOVEit Transfer versions before 2022.0.7 (14.0.7)MOVEit Transfer versions before 2022.1.8 (14.1.8)MOVEit Transfer versions before 2023.0.4 (15.0.4)RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Progress MOVEit Transfer, the most severe of which could allow for unauthorized database access. Details of the vulnerabilities are as follows: \nTactic: Initial Access (TA0001):\n**Technique**: *Exploit Public-Facing Application* (T1190):\n\nSQL injection vulnerabilities have been identified in the MOVEit Transfer web application that could allow an unauthenticated attacker to gain unauthorized access to the MOVEit Transfer database. An attacker could submit a crafted payload to a MOVEit Transfer application endpoint which could result in modification and disclosure of MOVEit database content. (CVE-2023-36934, CVE-2023-36932)\nA vulnerability has been identified in the MOVEit Transfer web application that could allow an attacker to invoke a method that leads to an unhandled exception, causing the MOVEit Transfer application to abruptly terminate. This can occur when triggering a specific workflow within the application. (CVE-2023-36933)\n\nSuccessful exploitation of the most severe of these vulnerabilities could allow attackers to gain unauthorized access to the database, potentially compromising confidential information, user credentials, and other sensitive data. This unauthorized access could also result in unauthorized modifications and disclosure of the database content.RECOMMENDATIONS:In addition to Progress remediation recommendations, we recommend the following actions be taken:\n\nApply appropriate patches and workarounds provided by Progress to vulnerable systems, immediately after appropriate testing. (M1051: Update Software) o Safeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no Safeguard 7.2: Establish and Maintain a Remediation Process: Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.\no Safeguard 7.3: Perform Automated Operating System Patch Management: Perform operating system updates on enterprise assets through automated patch management on a monthly, or more frequent, basis\no Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\no Safeguard 7.5: Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\no Safeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\no Safeguard 12.1: Ensure Network Infrastructure is Up-to-Date: Ensure network infrastructure is kept up-to-date. Example implementations include running the latest stable release of software and/or using currently supported network-as-a-service (NaaS) offerings. Review software versions monthly, or more frequently, to verify software support.\no Safeguard 18.1: Establish and Maintain a Penetration Testing Program: Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include scope, such as network, web application, Application Programming Interface (API), hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; point of contact information; remediation, such as how findings will be routed internally; and retrospective requirements.\no Safeguard 18.2: Perform Periodic External Penetration Tests: Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.\no Safeguard 18.3: Remediate Penetration Test Findings: Remediate penetration test findings based on the enterprise’s policy for remediation scope and prioritization.\nVulnerability scanning is used to find potentially exploitable software vulnerabilities to remediate them. (M1016: Vulnerability Scanning)\no Safeguard 16.13: Conduct Application Penetration Testing: Conduct application penetration testing. For critical applications, authenticated penetration testing is better suited to finding business logic vulnerabilities than code scanning and automated security testing.Penetration testing relies on the skill of the tester to manually manipulate an application as an authenticated and unauthenticated user.\nArchitect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. Configure separate virtual private cloud (VPC) instances to isolate critical cloud systems. (M1030: Network Segmentation)\no Safeguard 12.2: Establish and Maintain a Secure Network Architecture: Establish and maintain a secure network architecture. A secure network architecture must address segmentation, least privilege, and availability, at a minimum.\nRestrict execution of code to a virtual environment on or in transit to an endpoint system. (M1048: Application Isolation and Sandboxing)\no Safeguard 16.8: Separate Production and Non-Production Systems: Maintain separate environments for production and non-production systems.\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection) \n\nSafeguard 10.5: Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Apple® System Integrity Protection (SIP) and Gatekeeper™.REFERENCES:CVEhttps://nvd.nist.gov/vuln/detail/CVE-2023-36932https://nvd.nist.gov/vuln/detail/CVE-2023-36933https://nvd.nist.gov/vuln/detail/CVE-2023-36934Progresshttps://community.progress.com/s/article/MOVEit-Transfer-2020-1-Service-Pack-July-2023Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Advisory09.27.20242024-106: Multiple Vulnerabilities in PHP Could Allow for Remote Code ExecutionRead MoreAdvisory09.27.20242024-105: Multiple Vulnerabilities in Foxit PDF Reader and Editor Could Allow for Arbitrary Code ExecutionRead MorePress Release09.19.2024CIS Releases Results of 18 Month Study of U.S. Tribal Organization CybersecurityRead MoreWhite Paper09.18.2024DMARC Guide: Microsoft 365 and Google WorkspaceRead More",
  "cves": [
    "CVE-2023-36932",
    "CVE-2023-36934",
    "CVE-2023-36933"
  ],
  "techniques": [
    "T1190"
  ],
  "title": "Multiple Vulnerabilities in Progress MOVEit Transfer Could Allow for Unauthorized Database Access",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}