{
  "id": "ec43073ac285a8a1f90e2e7be8425371d1ba9ecb76ffca1d3c05e040d328aa08",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code Execution.Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code Execution.MS-ISAC ADVISORY NUMBER:2023-019DATE(S) ISSUED:02/14/2023OVERVIEW:Multiple vulnerabilities have been discovered in Adobe products, the most severe of which could allow for arbitrary code execution. \n\nAdobe After Effects is a digital visual effects, motion graphics, and compositing application\nAdobe Connect is a suite of software for remote training, web conferencing, presentation, and desktop sharing.\nAdobe FrameMaker is a document processor designed for writing and editing large or complex documents, including structured documents.\nAdobe Bridge is a free digital asset management app.\nAdobe Photoshop is a raster graphics editor\nAdobe InDesign is a desktop publishing and page layout designing software.\nAdobe Premiere Rush is a free mobile and desktop video editing software.\nAdobe Animate is a multimedia authoring and computer animation program.\nAdobe Substance 3D Stager is a state-of-the-art staging tool to create 3D scenes with real-time 3D visualization and high-quality renders.\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights\nTHREAT INTELLIGENCE:There are currently no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:Adobe After Effects 23.1 and earlier versions for Windows and macOSAdobe After Effects 22.6.3 and earlier versions for Windows and macOSAdobe Connect 11.4.5  and earlier versions  Adobe FrameMaker 2020 Release Update 4 and earlier for WindowsAdobe FrameMaker 2022 Release for WindowsAdobe Bridge 12.0.3 and earlier versions for Windows  and macOSAdobe Bridge 13.0.1 and earlier versions for Windows  and macOSAdobe Photoshop 2022 23.5.3 and earlier versions for Windows and macOSAdobe Photoshop 2023 24.1 and earlier versions for Windows and macOSAdobe InDesign ID18.1 and earlier version for Windows and macOSAdobe InDesign ID17.4 and earlier version for Windows and macOSAdobe Premiere Rush 2.6 and earlier versions for WindowsAdobe Animate 2022 22.0.8 and earlier versions for Windows and macOSAdobe Animate 2023 23.0.0 and earlier versions for Windows and macOSAdobe Substance 3D Stager 1.3.2 and earlier versions for Windows and macOSRISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Adobe Products, the most severe of which could allow for arbitrary code execution. Details of these vulnerabilities are as follows\nTactic: Execution (TA0002):\nTechnique: Exploitation for Client Execution (T1203):\nAdobe After Effects:\n\nOut-of-bounds Read which could result in Memory Leak. (CVE-2023-22233)\nOut-of-bounds Write which could result in Arbitrary code execution. (CVE-2023-22237, CVE-2023-22238)\nImproper Input Validation which could result in Arbitrary code execution. (CVE-2023-22239)\nAdobe Connect:\nImproper Access Control which could result in Security feature bypass. (CVE-2023-22232)\nAdobe FrameMaker:\nUse After Free which could result in a Memory leak. (CVE-2023-21584)\nOut-of-bounds Write which could result in Arbitrary code execution. (CVE-2023-21619, CVE-2023-21622)\nImproper Input Validation which could result in Arbitrary code execution. (CVE-2023-21621)\nOut-of-bounds Read which could result in Memory Leak. (CVE-2023-21620)\nAdobe Bridge:\nOut-of-bounds Read which could result in Memory Leak. (CVE-2023-21583, CVE-2023-22231)\nStack-based Buffer Overflow which could result in Arbitrary code execution. (CVE-2023-22226)\nOut-of-bounds Write which could result in Arbitrary code execution. (CVE-2023-22227, CVE-2023-22229, CVE-2023-22230)\nImproper Input Validation which could result in Arbitrary code execution. (CVE-2023-22228)\nAdobe Photoshop:\nImproper Input Validation which could result in Arbitrary code execution. (CVE-2023-21574)\nOut-of-bounds Write which could result in Arbitrary code execution. (CVE-2023-21575, CVE-2023-21576)\nOut-of-bounds Read which could result in Memory Leak. (CVE-2023-21577)\nOut-of-bounds Read which could result in Arbitrary code execution. (CVE-2023-21578)\nAdobe InDesign:\nNULL Pointer Dereference which could result in Application denial-of-service. (CVE-2023-21593)\nAdobe Premiere Rush:\nStack-based Buffer Overflow which could allow for Arbitrary code execution. (CVE-2023-22234)\nUse After Free which could allow for Arbitrary code execution. (CVE-2023-22244)\nAdobe Animate:\nHeap-based Buffer Overflow which could allow for Arbitrary code execution. (CVE-2023-22236)\nStack-based Buffer Overflow which could allow for Arbitrary code execution. (CVE-2023-22243)\nUse After Free which could allow for Arbitrary code execution. (CVE-2023-22246)\nAdobe Substance 3D Stager:\nOut-of-bounds Read which could result in Memory Leak.\nStack-based Buffer Overflow which could allow for Arbitrary code execution.\nAccess of Memory Location After End of Buffer which could allow for Arbitrary code execution.\nOut-of-bounds Read which could result in Arbitrary code execution.\nOut-of-bounds Write which could result in Arbitrary code execution.\nUse After Free which could allow for Arbitrary code execution.\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\nApply the stable channel update provided by Adobe to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1 : Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\no   Safeguard 7.5 : Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection)\no   Safeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content)\no   Safeguard 9.2: Use DNS Filtering Services: Use DNS filtering services on all enterprise assets to block access to known malicious domains.\no   Safeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\no   Safeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\nRemind users not to visit un-trusted websites or follow links provided by unknown or un-trusted sources. Inform and educate users regarding the threats posed by hypertext links contained in emails or attachments especially from un-trusted sources. (M1017: User Training)\no   Safeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\nREFERENCES:ADOBEhttps://helpx.adobe.com/security.htmlAdobehttps://helpx.adobe.com/security/products/after_effects/apsb23-02.htmlhttps://helpx.adobe.com/security/products/connect/apsb23-05.htmlhttps://helpx.adobe.com/security/products/framemaker/apsb23-06.htmlhttps://helpx.adobe.com/security/products/bridge/apsb23-09.htmlhttps://helpx.adobe.com/security/products/photoshop/apsb23-11.htmlhttps://helpx.adobe.com/security/products/indesign/apsb23-12.htmlhttps://helpx.adobe.com/security/products/premiere_rush/apsb23-14.htmlhttps://helpx.adobe.com/security/products/animate/apsb23-15.htmlhttps://helpx.adobe.com/security/products/substance3d_stager/apsb23-16.htmlCVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22233https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22237https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22238https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22239https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22232https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21584https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21619https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21620https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21621https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21622https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21583https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22226https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22227https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22228https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22229https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22230https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22231https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21574https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21575https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21576https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21577https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21578https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21593https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22234https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22244https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22236https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22243https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22246Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Blog Post08.09.2024Top 10 Malware Q2 2024Read MoreAdvisory08.07.20242024-088: Multiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationRead MoreAdvisory08.07.20242024-087: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreBlog Post07.26.2024CrowdStrike Falcon Outage Exploited for Social EngineeringRead More",
  "cves": [
    "CVE-2023-22232",
    "CVE-2023-21576",
    "CVE-2023-21574",
    "CVE-2023-22244",
    "CVE-2023-22239",
    "CVE-2023-22238",
    "CVE-2023-21584",
    "CVE-2023-21619",
    "CVE-2023-22230",
    "CVE-2023-21578",
    "CVE-2023-21583",
    "CVE-2023-21593",
    "CVE-2023-21575",
    "CVE-2023-22231",
    "CVE-2023-22227",
    "CVE-2023-22233",
    "CVE-2023-22234",
    "CVE-2023-22243",
    "CVE-2023-22246",
    "CVE-2023-22228",
    "CVE-2023-22226",
    "CVE-2023-22236",
    "CVE-2023-21620",
    "CVE-2023-21577",
    "CVE-2023-21621",
    "CVE-2023-22237",
    "CVE-2023-21622",
    "CVE-2023-22229"
  ],
  "techniques": [
    "T1203"
  ],
  "title": "Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code Execution.",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}