{
  "id": "b18fd28a4fdb756496f08d281ccf64be59da0e3ef8acb98002610f45f2007396",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code ExecutionMultiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code ExecutionMS-ISAC ADVISORY NUMBER:2023-039DATE(S) ISSUED:04/12/2023OVERVIEW:Multiple vulnerabilities have been discovered in Adobe products, the most severe of which could allow for arbitrary code execution. \n\nAdobe Acrobat and Adobe Reader are used to view, create, print, and manage PDF files\n\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.THREAT INTELLIGENCE:There are no reports that these vulnerabilities are being exploited in the wild.SYSTEMS AFFECTED:Acrobat DC (continuous) 23.001.20093 and earlier versions for Windows and macOSAcrobat Reader DC (continuous) 23.001.20093 and earlier versions for Windows and macOSAcrobat 2020 (classic 2020) 20.005.30441 and earlier versions for Windows and macOSAcrobat Reader 2020 (classic 2020) 20.005.30441 and earlier versions for Windows and macOSRISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Adobe Products, the most severe of which could allow for arbitrary code execution. Details of these vulnerabilities are as follows\nTactic: Execution (TA0002):\nTechnique: Exploitation for Client Execution (T1203):\nAdobe Acrobat and Reader\n\nOut-of-bounds Write which could result in arbitrary code execution. (CVE-2023-26395)\nImproper Input Validation which could result in arbitrary code execution. (CVE-2023-26405, CVE-2023-26407)\nUse After Free which could result in arbitrary code execution. (CVE-2023-26417, CVE-2023-26418, CVE-2023-26419, CVE-2023-26420, CVE-2023-26422, CVE-2023-26423, CVE-2023-26424)\nInteger Underflow (Wrap or Wraparound) which could result in arbitrary code execution. (CVE-2023-26421)\nOut-of-bounds Read which could result in arbitrary code execution. (CVE-2023-26425)\n\nDetails of lower severity vulnerabilities in Adobe Acrobat and Reader are as follows:\n\nA Violation of Secure Design Principles that could cause privilege escalation. (CVE-2023-26396)\nAn Out-of-bounds Read that could cause memory leak. (CVE-2023-26397)\nImproper Access Control that could cause a security feature bypass. (CVE-2023-26406, CVE-2023-26408)\n\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.RECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply the stable channel update provided by Adobe to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1 : Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\no   Safeguard 7.5 : Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\n\n\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\n\n\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection)\no   Safeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\n\n\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content)\no   Safeguard 9.2: Use DNS Filtering Services: Use DNS filtering services on all enterprise assets to block access to known malicious domains.\no   Safeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\no   Safeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\n\n\nRemind users not to visit un-trusted websites or follow links provided by unknown or un-trusted sources. Inform and educate users regarding the threats posed by hypertext links contained in emails or attachments especially from un-trusted sources. (M1017: User Training)\no   Safeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\n\nREFERENCES:ADOBEhttps://helpx.adobe.com/security.htmlAdobehttps://helpx.adobe.com/security/products/acrobat/apsb23-24.htmlCVEhttp://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26395http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26396http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26397http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26405http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26406http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26407http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26408http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26417http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26418http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26419http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26420http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26421http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26422http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26423http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26424http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-26425Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Blog Post08.09.2024Top 10 Malware Q2 2024Read MoreAdvisory08.07.20242024-088: Multiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationRead MoreAdvisory08.07.20242024-087: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreBlog Post07.26.2024CrowdStrike Falcon Outage Exploited for Social EngineeringRead More",
  "cves": [
    "CVE-2023-26421",
    "CVE-2023-26418",
    "CVE-2023-26417",
    "CVE-2023-26419",
    "CVE-2023-26424",
    "CVE-2023-26407",
    "CVE-2023-26405",
    "CVE-2023-26395",
    "CVE-2023-26422",
    "CVE-2023-26425",
    "CVE-2023-26420",
    "CVE-2023-26397",
    "CVE-2023-26396",
    "CVE-2023-26406",
    "CVE-2023-26408",
    "CVE-2023-26423"
  ],
  "techniques": [
    "T1203"
  ],
  "title": "Multiple Vulnerabilities in Adobe Products Could Allow for Arbitrary Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}