{
  "id": "f4944046e62600bb101a05341a5b76aa4b63e63f41b90237a26812d4dacf6599",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Fortinet Products Could Allow for Arbitrary Code ExecutionMultiple Vulnerabilities in Fortinet Products Could Allow for Arbitrary Code ExecutionMS-ISAC ADVISORY NUMBER:2023-028DATE(S) ISSUED:03/08/2023OVERVIEW:Multiple vulnerabilities have been discovered in Fortinet Products, the most severe of which could allow for arbitrary code execution. Fortinet has several products that are able to deliver high-performance network security solutions that protect your network, users, and data from continually evolving threats.\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the affected service account. Depending on the privileges associated with the service account an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Service accounts that are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.THREAT INTELLIGENCE:There are currently no reports of these vulnerabilities being exploited in the wild.\nMarch 14th – UPDATED THREAT INTELLEGENCE:\nMultiple news outlets are reporting government entities and large organizations have been targeted by an unknown threat actor by exploiting a security flaw in Fortinet FortiOS software to result in data loss and OS and file corruption. This is specifically related to a zero-day flaw (CVE-2022-41328), a medium security path traversal bug in FortiOS that could lead to arbitrary code execution.SYSTEMS AFFECTED:FortiAnalyzer version prior to 7.2.2FortiAuthenticator version prior to 6.5.0FortiDeceptor version prior to 3.2.0FortiMail version prior to 6.4.1FortiManager version prior to 6.0.5FortiPortal version prior to 6.0.10FortiSwitch version prior to 7.0.5FortiNAC version prior to 9.4.2FortiOS version prior to 7.2.4FortiProxy version prior to 7.2.2FortiRecorder version prior to 7.0.0FortiSOAR version prior to 7.3.2FortiWeb version prior to 7.2.0RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Fortinet Products, the most severe of which could allow for arbitrary code execution. Details of these vulnerabilities are as follows:\nTactic: Initial Access  (TA0001):\nTechnique: Exploit Public Facing Application (T1190):\n\nCVE-2023-25610 – FortiOS / FortiProxy – Heap buffer underflow in administrative interface: administrative interface may allow a remote unauthenticated attacker to execute arbitrary code on the device and/or perform a DoS on the GUI\nCVE-2022-39951 - FortiWeb - command injection in webserver: An improper neutralization of special elements used in an OS command vulnerability in FortiWeb may allow authenticated users to execute unauthorized code or commands via specifically crafted HTTP requests.\nCVE-2022-39953 - FortiNAC - Multiple privilege escalation via sudo command: An improper privilege management vulnerability in FortiNAC may allow a low privilege local user with shell access to execute arbitrary commands as root.\nCVE-2022-40676 - FortiNAC - Multiple Reflected XSS: An improper neutralization of input during web page generation in FortiNAC may allow an authenticated user to perform an XSS attack via crafted HTTP requests.\nCVE-2023-25605 - FortiSOAR - Improper Authorization in request headers: An improper access control vulnerability in FortiSOAR's playbook component may allow an attacker authenticated on the administrative interface to perform unauthorized actions via crafted HTTP requests.\nCVE-2022-42476 - FortiOS / FortiProxy - Path traversal vulnerability allows VDOM escaping: A relative path traversal vulnerability in FortiOS and FortiProxy may allow privileged VDOM administrators to escalate their privileges to super admin of the box via crafted CLI requests.\n\nDetails of lower-severity vulnerabilities are as follows:\n\nCVE-2023-25611 - FortiAnalyzer - CSV injection in macro name\nCVE-2023-23776 - FortiAnalyzer -- the log-fetch client request password is shown in clear text in the heartbeat response\nCVE-2022-29056 - FortiAuthenticator, FortiDeceptor & FortiMail - Improper restriction over excessive authentication attempts\nCVE-2022-27490 - FortiManager, FortiAnalyzer, FortiPortal & FortiSwitch - Information disclosure through diagnose debug commands\nCVE-2022-45861 - FortiOS & FortiProxy - Access of NULL pointer in SSLVPNd\nCVE-2022-41328 - FortiOS - Path traversal in execute command\nCVE-2022-41329 - FortiOS / FortiProxy - Unauthenticated access to static files containing logging information\nCVE-2022-41333 - FortiRecorder - DoS in login authentication mechanism\nCVE-2022-22297 - FortiWeb and FortiRecorder - Arbitrary file read through command line pipe\n\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the affected service account. Depending on the privileges associated with the service account an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Service accounts that are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.RECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply appropriate updates provided by FortiNet to vulnerable systems immediately after appropriate testing. (M1051: Update Software) \n\n\nSafeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\n\n\nSafeguard 7.2: Establish and Maintain a Remediation Process: Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.\n\n\nSafeguard 7.3: Perform Automated Operating System Patch Management: Perform operating system updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\n\n\nSafeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\n\n\nSafeguard 7.6: Perform Automated Vulnerability Scans of Externally-Exposed Enterprise Assets: Perform automated vulnerability scans of externally-exposed enterprise assets using a SCAP-compliant vulnerability scanning tool. Perform scans on a monthly, or more frequent, basis.\n\n\nSafeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\n\n\nSafeguard 12.1: Ensure Network Infrastructure is Up-to-Date: Ensure network infrastructure is kept up-to-date. Example implementations include running the latest stable release of software and/or using currently supported network-as-a-service (NaaS) offerings. Review software versions monthly, or more frequently, to verify software support.\n\n\nSafeguard 18.1: Establish and Maintain a Penetration Testing Program: Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include scope, such as network, web application, Application Programming Interface (API), hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; point of contact information; remediation, such as how findings will be routed internally; and retrospective requirements.\n\n\nSafeguard 18.2: Perform Periodic External Penetration Tests: Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.\n\n\nSafeguard 18.3: Remediate Penetration Test Findings: Remediate penetration test findings based on the enterprise’s policy for remediation scope and prioritization.\n\n\nVulnerability scanning is used to find potentially exploitable software vulnerabilities to remediate them. (M1016: Vulnerability Scanning)\n\n\nSafeguard 16.13: Conduct Application Penetration Testing: Conduct application penetration testing. For critical applications, authenticated penetration testing is better suited to finding business logic vulnerabilities than code scanning and automated security testing.Penetration testing relies on the skill of the tester to manually manipulate an application as an authenticated and unauthenticated user.\n\n\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management) \n\n\nSafeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\n\n\nSafeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\n\n\nSafeguard 5.5: Establish and Maintain an Inventory of Service Accounts: Establish and maintain an inventory of service accounts. The inventory, at a minimum, must contain department owner, review date, and purpose. Perform service account reviews to validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently.\n\n\nSafeguard 6.8: Define and Maintain Role-Based Access Control: Define and maintain role-based access control, through determining and documenting the access rights necessary for each role within the enterprise to successfully carry out its assigned duties. Perform access control reviews of enterprise assets to validate that all privileges are authorized, on a recurring schedule at a minimum annually, or more frequently.\n\n\nArchitect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. Configure separate virtual private cloud (VPC) instances to isolate critical cloud systems. (M1030: Network Segmentation)\n\n\nSafeguard 12.2: Establish and Maintain a Secure Network Architecture: Establish and maintain a secure network architecture. A secure network architecture must address segmentation, least privilege, and availability, at a minimum.\n\n\nRestrict execution of code to a virtual environment on or in transit to an endpoint system. (M1048: Application Isolation and Sandboxing) \n\n\nSafeguard 16.8: Separate Production and Non-Production Systems: Maintain separate environments for production and non-production systems.\n\n\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection) \n\n\nSafeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\n\n\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content) \n\n\nSafeguard 9.2: Use DNS Filtering Services: Use DNS filtering services on all enterprise assets to block access to known malicious domains.\n\n\nSafeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\n\n\nSafeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\n\n\nInform and educate users regarding the threats posed by hypertext links contained in emails or attachments especially from un-trusted sources. Remind users not to visit un-trusted websites or follow links provided by unknown or un-trusted sources. (M1017: User Training) \n\n\nSafeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\n\n\nSafeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\n\nREFERENCES:CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-22297https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-27490https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-29056https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-39951https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-39953https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-40676https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-41328https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-41329https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-41333https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-42476https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-45861https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23776https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25605https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25610https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25611Fortinethttps://www.fortiguard.com/psirt?date=03-2023UPDATED BleepingComputerhttps://www.bleepingcomputer.com/news/security/fortinet-new-fortios-bug-used-as-zero-day-to-attack-govt-networks/Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Blog Post08.09.2024Top 10 Malware Q2 2024Read MoreAdvisory08.07.20242024-088: Multiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationRead MoreAdvisory08.07.20242024-087: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreBlog Post07.26.2024CrowdStrike Falcon Outage Exploited for Social EngineeringRead More",
  "cves": [
    "CVE-2022-39951",
    "CVE-2022-29056",
    "CVE-2023-25605",
    "CVE-2022-40676",
    "CVE-2023-25611",
    "CVE-2022-27490",
    "CVE-2022-22297",
    "CVE-2022-39953",
    "CVE-2022-45861",
    "CVE-2022-41328",
    "CVE-2022-42476",
    "CVE-2022-41329",
    "CVE-2023-25610",
    "CVE-2022-41333",
    "CVE-2023-23776"
  ],
  "techniques": [
    "T1190"
  ],
  "title": "Multiple Vulnerabilities in Fortinet Products Could Allow for Arbitrary Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}