{
  "id": "efe454bbb932873524eddae8ba1348d4842d51d5fbdbd8ff7d3783c2162cb2b1",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationMultiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationMS-ISAC ADVISORY NUMBER:2023-130DATE(S) ISSUED:11/07/2023OVERVIEW:Multiple vulnerabilities have been discovered in Google Android OS, the most severe of which could allow for privilege escalation. Android is an operating system developed by Google for mobile devices, including, but not limited to, smartphones, tablets, and watches. Successful exploitation of the most severe of these vulnerabilities could allow for privilege escalation. Depending on the privileges associated with the exploited component, an attacker could then install programs; view, change, or delete data; or create new accounts with full rights.THREAT INTELLIGENCE:There are currently no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:Android OS patch levels prior to 2023-11-05RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Google Android OS, the most severe of which could allow for privilege escalation in the context of the affected component. Following the MITRE ATT&CK framework, exploitation of these vulnerabilities can be classified as follows:\nTactic: Privilege Escalation (TA0004):\nTechnique: Exploitation for Privilege Escalation (T1068):\n\nMultiple vulnerabilities in Framework that could allow for escalation of privilege. (CVE-2023-40106, CVE-2023-40107, CVE-2023-40109, CVE-2023-40110, CVE-2023-40111, CVE-2023-40114)\nMultiple vulnerabilities in System that could allow for escalation of privilege. (CVE-2023-40100, CVE-2023-40115)\nDetails of lower-severity vulnerabilities are as follows:\nA vulnerability in System that could allow for information disclosure. (CVE-2023-40113)\nMultiple vulnerabilities in Framework that could allow for information disclosure. (CVE-2023-40105, CVE-2023-40124)\nMultiple vulnerabilities in System that could allow for information disclosure. (CVE-2023-40104, CVE-2023-40112)\nMultiple vulnerabilities in System that could allow for denial of service. (CVE-2023-21103, CVE-2023-21111)\nMultiple vulnerabilities in Project Mainline components. (CVE-2023-40100, CVE-2023-40115)\nA vulnerability in Arm components. (CVE-2023-28469)\nA vulnerability in MediaTek components. (CVE-2023-32832, CVE-2023-32834, CVE-2023-32835, CVE-2023-32836, CVE-2023-32837, CVE-2023-20702)\nMultiple vulnerabilities in Qualcomm components. (CVE-2023-33031, CVE-2023-33055, CVE-2023-33059, CVE-2023-33074)\nMultiple vulnerabilities in Qualcomm closed-source components. (CVE-2023-21671, CVE-2023-22388, CVE-2023-28574, CVE-2023-33045, CVE-2023-24852, CVE-2023-28545, CVE-2023-28556, CVE-2023-33047, CVE-2023-33048, CVE-2023-33056, CVE-2023-33061)\nSuccessful exploitation of the most severe of these vulnerabilities could allow for privilege escalation. Depending on the privileges associated with the exploited component, an attacker could then install programs; view, change, or delete data; or create new accounts with full rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\nApply appropriate updates and patches provided by Google to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\no   Safeguard 7.5: Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection) \nSafeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\nRestrict execution of code to a virtual environment on or in transit to an endpoint system. (M1048: Application Isolation and Sandboxing)\no   Safeguard 16.8: Separate Production and Non-Production Systems: Maintain separate environments for production and non-production systems\nREFERENCES:CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-20702https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21103https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21111https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-21671https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-22388https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-24852https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28469https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28545https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28556https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-28574https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-32832https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-32834https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-32835https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-32836https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-32837https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33031https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33045https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33047https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33048https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33055https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33056https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33059https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33061https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-33074https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40100https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40100https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40104https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40105https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40106https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40107https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40109https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40110https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40111https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40112https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40113https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40114https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40115https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40115https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40124Googlehttps://source.android.com/docs/security/bulletin/2023-11-01#2023-11-05-security-patch-level-vulnerability-detailsGet Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Blog Post08.09.2024Top 10 Malware Q2 2024Read MoreAdvisory08.07.20242024-088: Multiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationRead MoreAdvisory08.07.20242024-087: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreBlog Post07.26.2024CrowdStrike Falcon Outage Exploited for Social EngineeringRead More",
  "cves": [
    "CVE-2023-33045",
    "CVE-2023-33061",
    "CVE-2023-21111",
    "CVE-2023-32835",
    "CVE-2023-33047",
    "CVE-2023-33059",
    "CVE-2023-40106",
    "CVE-2023-32837",
    "CVE-2023-21671",
    "CVE-2023-33048",
    "CVE-2023-40109",
    "CVE-2023-32832",
    "CVE-2023-33074",
    "CVE-2023-33055",
    "CVE-2023-28469",
    "CVE-2023-40105",
    "CVE-2023-20702",
    "CVE-2023-40104",
    "CVE-2023-33031",
    "CVE-2023-28574",
    "CVE-2023-40112",
    "CVE-2023-40111",
    "CVE-2023-32836",
    "CVE-2023-32834",
    "CVE-2023-28556",
    "CVE-2023-40110",
    "CVE-2023-40107",
    "CVE-2023-40115",
    "CVE-2023-33056",
    "CVE-2023-28545",
    "CVE-2023-21103",
    "CVE-2023-40113",
    "CVE-2023-40100",
    "CVE-2023-24852",
    "CVE-2023-22388",
    "CVE-2023-40124",
    "CVE-2023-40114"
  ],
  "techniques": [
    "T1068"
  ],
  "title": "Multiple Vulnerabilities in Google Android OS Could Allow for Privilege Escalation",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}