{
  "id": "a47a5d45c2695024d6528103066ca5dfec81a128627b186df97a25c1120fc022",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Mozilla Firefox and Firefox ESR Could Allow for Arbitrary Code ExecutionMultiple Vulnerabilities in Mozilla Firefox and Firefox ESR Could Allow for Arbitrary Code ExecutionMS-ISAC ADVISORY NUMBER:2023-017DATE(S) ISSUED:02/14/2023OVERVIEW:Multiple vulnerabilities have been discovered in Mozilla Firefox and Firefox Extended Support Release (ESR), the most severe of which could allow for arbitrary code execution. \n\nMozilla Firefox is a web browser used to access the Internet. \nMozilla Firefox ESR is a version of the web browser that is intended to be deployed in large organizations. \n\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.THREAT INTELLIGENCE:There are currently no reports of these vulnerabilities being exploited in the wild.SYSTEMS AFFECTED:Mozilla Firefox ESR versions prior to 102.8Mozilla Firefox versions prior to 110RISK:Government:Large and medium government entitiesHIGHSmall governmentHIGHBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Mozilla Firefox and Firefox Extended Support Release (ESR), the most severe of which could allow for arbitrary code execution. Details of these vulnerabilities are as follows:\nTactic: Initial Access (TA0001):\nTechnique: Drive-by Compromise (T1189):\n\nCVE-2023-25745: Memory safety bugs fixed in Firefox 110\nCVE-2023-25744: Memory safety bugs fixed in Firefox 110 and Firefox ESR 102.8\nCVE-2023-25739: Use-after-free in mozilla::dom::ScriptLoadContext::~ScriptLoadContext\nAdditional lower priority vulnerabilities include:\nCVE-2023-25743: Fullscreen notification not shown in Firefox Focus\nCVE-2023-25742: Web Crypto ImportKey crashes tab\nCVE-2023-25741: Same-origin policy leak via image drag and drop\nCVE-2023-25740: Opening local .scf files could cause unexpected network loads\nCVE-2023-25738: Printing on Windows could potentially crash Firefox with some device drivers\nCVE-2023-25737: Invalid downcast in SVGUtils::SetupStrokeGeometry\nCVE-2023-25736: Invalid downcast in GetTableSelectionMode\nCVE-2023-25735: Potential use-after-free from compartment mismatch in SpiderMonkey\nCVE-2023-25734: Opening local .url files could cause unexpected network loads\nCVE-2023-25733: Possible null pointer dereference in TaskbarPreviewCallback\nCVE-2023-25732: Out of bounds memory write from EncodeInputStream\nCVE-2023-25731: Prototype pollution when rendering URLPreview\nCVE-2023-25730: Screen hijack via browser fullscreen mode\nCVE-2023-25729: Extensions could have opened external schemes without user knowledge\nCVE-2023-25728: Content security policy leak in violation reports using iframes\nCVE-2023-0767: Arbitrary memory write via PKCS 12 in NSS\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\nApply appropriate updates provided by Mozilla to vulnerable systems immediately after appropriate testing. (M1051: Update Software) \nSafeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\nSafeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\nSafeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\nSafeguard 9.1: Ensure Use of Only Fully Supported Browsers and Email Clients: Ensure only fully supported browsers and email clients are allowed to execute in the enterprise, only using the latest version of browsers and email clients provided through the vendor.\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management) \nSafeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\nSafeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection)\no   Safeguard 10.5: Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\nRestrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc. (M1021: Restrict Web-Based Content)\no   Safeguard 9.2: Use DNS Filtering Services: Use DNS filtering services on all enterprise assets to block access to known malicious domains.\no   Safeguard 9.3: Maintain and Enforce Network-Based URL Filters: Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.\no   Safeguard 9.6: Block Unnecessary File Types: Block unnecessary file types attempting to enter the enterprise’s email gateway.\nUse capabilities to prevent suspicious behavior patterns from occurring on endpoint systems. This could include suspicious process, file, API call, etc. behavior. (M1040: Behavior Prevention on Endpoint) \nSafeguard 13.2 : Deploy a Host-Based Intrusion Detection Solution: Deploy a host-based intrusion detection solution on enterprise assets, where appropriate and/or supported.\nSafeguard 13.7 : Deploy a Host-Based Intrusion Prevention Solution: Deploy a host-based intrusion prevention solution on enterprise assets, where appropriate and/or supported. Example implementations include use of an Endpoint Detection and Response (EDR) client or host-based IPS agent.\nBlocking DNS traffic from servers outside of a configured allow-list. (M1037: Filter Network Traffic) \nSafeguard 4.9: Configure Trusted DNS Servers on Enterprise Assets: Configure trusted DNS servers on enterprise assets. Example implementations include: configuring assets to use enterprise-controlled DNS servers and/or reputable externally accessible DNS servers.\nInform and educate users regarding the threats posed by hypertext links contained in emails or attachments especially from un-trusted sources. Remind users not to visit un-trusted websites or follow links provided by unknown or un-trusted sources. (M1017: User Training) \nSafeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\nSafeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\nREFERENCES:CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25745https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25744https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25743https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25742https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25741https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25740https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25739https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25738https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25737https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25736https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25735https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25734https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25733https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25732https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25731https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25730https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25729https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25728https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-0767Mozillahttps://www.mozilla.org/en-US/security/advisories/mfsa2023-06/https://www.mozilla.org/en-US/security/advisories/mfsa2023-05/Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Blog Post08.09.2024Top 10 Malware Q2 2024Read MoreAdvisory08.07.20242024-088: Multiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationRead MoreAdvisory08.07.20242024-087: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreBlog Post07.26.2024CrowdStrike Falcon Outage Exploited for Social EngineeringRead More",
  "cves": [
    "CVE-2023-25734",
    "CVE-2023-25742",
    "CVE-2023-25739",
    "CVE-2023-25731",
    "CVE-2023-25732",
    "CVE-2023-25735",
    "CVE-2023-25744",
    "CVE-2023-25738",
    "CVE-2023-25740",
    "CVE-2023-25741",
    "CVE-2023-25745",
    "CVE-2023-25729",
    "CVE-2023-25737",
    "CVE-2023-25730",
    "CVE-2023-25743",
    "CVE-2023-25736",
    "CVE-2023-25733",
    "CVE-2023-25728",
    "CVE-2023-0767"
  ],
  "techniques": [
    "T1189"
  ],
  "title": "Multiple Vulnerabilities in Mozilla Firefox and Firefox ESR Could Allow for Arbitrary Code Execution",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}