{
  "id": "bd155d741638f5bf283162d63a180b535772863192b457b709b1e7790ad324fc",
  "markdown": "HomeCIS AdvisoriesMultiple Vulnerabilities in Progress WS_FTP Server Could Allow for Remote Command Execution.Multiple Vulnerabilities in Progress WS_FTP Server Could Allow for Remote Command Execution.MS-ISAC ADVISORY NUMBER:2023-116DATE(S) ISSUED:10/05/2023OVERVIEW:Multiple vulnerabilities in Progress WS_FTP Server have been discovered, the most severe of which could allow for remote command execution. Progress WS_FTP Server is used is to securely store, share and transfer information between systems, applications, groups and individuals. Successful exploitation of the most severe of these vulnerabilities could allow for remote command execution in the context of the service account. Depending on the privileges associated with the service account, an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Service accounts that are configured to have fewer user rights on the system could be less impacted than those that operate with administrative user rights.THREAT INTELLIGENCE:There are reports that proof-of-concept exploit code is publicly available for CVE-2023-40044 and there has been widespread exploitation of the vulnerability observed in the wild.SYSTEMS AFFECTED:FTP Server versions prior to 8.7.4 and 8.8.2RISK:Government:Large and medium government entitiesHIGHSmall governmentMEDIUMBusinesses:Large and medium business entitiesHIGHSmall business entitiesMEDIUMHome Users:LOWTECHNICAL SUMMARY:Multiple vulnerabilities have been discovered in Progress WS_FTP Server, the most severe of which could allow for remote command execution. Details of these vulnerabilities are as follows\nTactic: Initial Access (TA0001):\nTechnique: Exploit Public-Facing Application (T1190):\n\n.NET deserialization vulnerability in the Ad Hoc Transfer module, which could result in remote command execution. (CVE-2023-40044)\nDirectory traversal vulnerability, which could result in the ability to perform file operations. (CVE-2023-42657)\n\nDetails of lower priority vulnerability include: \n\nReflected cross-site scripting (XSS) vulnerability, which could result in execution of malicious JavaScript. (CVE-2023-40045)\nSQL injection vulnerability, which could result in the execution of SQL statements. (CVE-2023-40046)\nStored cross-site scripting (XSS) vulnerability, which could result in execution of malicious JavaScript. (CVE-2023-40047)\nCross-site request forgery (CSRF) Vulnerability. (CVE-2023-40048)\nReflected cross-site scripting (XSS) vulnerability, which could result in execution of malicious code and commands. (CVE-2022-27665)\nEnumeration of files under the 'WebServiceHost' directory vulnerability. (CVE-2023-40049)\nSuccessful exploitation of the most severe of these vulnerabilities could allow for arbitrary code execution in the context of the logged on user. Depending on the privileges associated with the user an attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than those who operate with administrative user rights.\nRECOMMENDATIONS:We recommend the following actions be taken:\n\n\nApply appropriate updates provided by Progress to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1 : Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.2: Establish and Maintain a Remediation Process: Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\no   Safeguard 7.5 : Perform Automated Vulnerability Scans of Internal Enterprise Assets: Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.\no   Safeguard 7.7: Remediate Detected Vulnerabilities: Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.\no   Safeguard 12.1: Ensure Network Infrastructure is Up-to-Date: Ensure network infrastructure is kept up-to-date. Example implementations include running the latest stable release of software and/or using currently supported network-as-a-service (NaaS) offerings. Review software versions monthly, or more frequently, to verify software support.\no   Safeguard 18.1: Establish and Maintain a Penetration Testing Program: Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include scope, such as network, web application, Application Programming Interface (API), hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; point of contact information; remediation, such as how findings will be routed internally; and retrospective requirements.\no   Safeguard 18.2: Perform Periodic External Penetration Tests: Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.\no   Safeguard 18.3: Remediate Penetration Test Findings: Remediate penetration test findings based on the enterprise’s policy for remediation scope and prioritization.\n\n\nVulnerability scanning is used to find potentially exploitable software vulnerabilities to remediate them. (M1016: Vulnerability Scanning)\no   Safeguard 16.13: Conduct Application Penetration Testing: Conduct application penetration testing. For critical applications, authenticated penetration testing is better suited to finding business logic vulnerabilities than code scanning and automated security testing. Penetration testing relies on the skill of the tester to manually manipulate an application as an authenticated and unauthenticated user.\n\n\nApply the Principle of Least Privilege to all systems and services. Run all software as a non-privileged user (one without administrative privileges) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\no   Safeguard 5.5: Establish and Maintain an Inventory of Service Accounts: Establish and maintain an inventory of service accounts. The inventory, at a minimum, must contain department owner, review date, and purpose. Perform service account reviews to validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently.\n\n\nArchitect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. Configure separate virtual private cloud (VPC) instances to isolate critical cloud systems. (M1030: Network Segmentation)\no   Safeguard 12.2: Establish and Maintain a Secure Network Architecture: Establish and maintain a secure network architecture. A secure network architecture must address segmentation, least privilege, and availability, at a minimum.\n\n\nUse capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring. (M1050: Exploit Protection)\no   Safeguard 10.5:  Enable Anti-Exploitation Features: Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft® Data Execution Prevention (DEP), Windows® Defender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and Gatekeeper™.\n\nREFERENCES:CVEhttps://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-27665https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40044https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40045https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40046https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40047https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40048https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-40049https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-42657Progresshttps://community.progress.com/s/article/WS-FTP-Server-Critical-Vulnerability-September-2023https://packetstormsecurity.com/files/174917/Progress-Software-WS_FTP-Unauthenticated-Remote-Code-Execution.htmlRapid7https://www.rapid7.com/blog/post/2023/09/29/etr-critical-vulnerabilities-in-ws_ftp-server/Get Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Information HubAdvisories See All Advisories Advisory09.27.20242024-106: Multiple Vulnerabilities in PHP Could Allow for Remote Code ExecutionRead MoreAdvisory09.27.20242024-105: Multiple Vulnerabilities in Foxit PDF Reader and Editor Could Allow for Arbitrary Code ExecutionRead MorePress Release09.19.2024CIS Releases Results of 18 Month Study of U.S. Tribal Organization CybersecurityRead MoreWhite Paper09.18.2024DMARC Guide: Microsoft 365 and Google WorkspaceRead More",
  "cves": [
    "CVE-2023-42657",
    "CVE-2023-40045",
    "CVE-2022-27665",
    "CVE-2023-40048",
    "CVE-2023-40049",
    "CVE-2023-40047",
    "CVE-2023-40044",
    "CVE-2023-40046"
  ],
  "techniques": [
    "T1190"
  ],
  "title": "Multiple Vulnerabilities in Progress WS_FTP Server Could Allow for Remote Command Execution.",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}