{
  "id": "da413863c3582982153b95b074b744f78f675f960329292a1737bee8e7caf41a",
  "markdown": "HomeCIS AdvisoriesOracle Quarterly Critical Patches Issued April 18, 2023Oracle Quarterly Critical Patches Issued April 18, 2023MS-ISAC ADVISORY NUMBER:2023-042DATE(S) ISSUED:04/18/2023OVERVIEW:Multiple vulnerabilities have been discovered in Oracle products, which could allow for remote code execution.SYSTEMS AFFECTED:JD Edwards Enterprise-One Orchestrator, versions prior to 9.2.7.3JD Edwards Enterprise-One Tools, versions prior to 9.2.7.3JD Edwards World Security, version A9.4Management Cloud Engine, version 22.1.0.0.0My-SQL Cluster, versions 7.5.29 and prior, 7.6.25 and prior, 8.0.32 and priorMy-SQL Connectors, versions 8.0.32 and priorMy-SQL Enterprise Monitor, versions 8.0.33 and priorMy-SQL Server, versions 5.7.41 and prior, 8.0.32 and priorMy-SQL Workbench, versions 8.0.32 and priorOracle Access Manager, version 12.2.1.4.0Oracle Agile PLM, version 9.3.6Oracle Application Testing Suite, version 13.3.0.1Oracle Argus Insight, versions prior to 8.2.3Oracle Argus Safety, versions prior to 8.2.3Oracle BI Publisher, versions 6.4.0.0.0, 12.2.1.4.0Oracle Banking APIs, versions 18.2, 18.3, 19.1, 19.2, 21.1, 22.1, 22.2Oracle Banking Corporate Lending Process Management, versions 14.414.7Oracle Banking Corporate Lending, versions 14.014.3, 14.514.7Oracle Banking Digital Experience, versions 18.2, 18.3, 19.1, 19.2, 21.1, 22.1, 22.2Oracle Banking Payments, versions 14.5, 14.6, 14.7Oracle Banking Trade Finance, versions 14.5, 14.6, 14.7Oracle Banking Treasury Management, versions 14.5, 14.6, 14.7Oracle Banking Virtual Account Management, versions 14.5, 14.6, 14.7Oracle Big Data Spatial and Graph, versions prior to 23.1Oracle Blockchain Platform, versions prior to 21.1.3Oracle Business Intelligence Enterprise Edition, versions 5.9.0.0.0, 6.4.0.0.0, 12.2.1.4.0Oracle Business Process Management Suite, version 12.2.1.4.0Oracle Clinical Remote Data Capture, version 5.4.0.2Oracle Coherence, versions 12.2.1.4.0, 14.1.1.0.0Oracle Commerce Guided Search, version 11.3.2Oracle Commerce Platform, versions 11.3.0, 11.3.1, 11.3.2Oracle Communications Cloud Native Configuration Console, versions 22.4.1, 23.1.0Oracle Communications Cloud Native Core Automated Test Suite, versions 22.3.1, 22.4.0Oracle Communications Cloud Native Core Binding Support Function, versions 22.4.022.4.4, 23.1.023.1.1Oracle Communications Cloud Native Core Console, versions 22.3.0, 22.4.0Oracle Communications Cloud Native Core Network Exposure Function, versions 22.4.2, 23.1.0Oracle Communications Cloud Native Core Network Function Cloud Native Environment, version 22.4.0Oracle Communications Cloud Native Core Network Repository Function, version 23.1.0Oracle Communications Cloud Native Core Policy, versions 22.4.022.4.4, 23.1.023.1.1Oracle Communications Cloud Native Core Security Edge Protection Proxy, versions 22.4.0, 22.4.1, 22.4.2, 23.1.0Oracle Communications Cloud Native Core Service Communication Proxy, versions 22.3.0, 22.4.0Oracle Communications Cloud Native Core Unified Data Repository, versions 22.4.1, 23.1.0Oracle Communications Convergent Charging Controller, versions 6.0.1.0.0, 12.0.1.0.012.0.6.0.0Oracle Communications Core Session Manager, versions 8.45, 9.15Oracle Communications Diameter Signaling Router, version 8.6.0.0Oracle Communications Element Manager, versions 9.0.0, 9.0.1Oracle Communications IP Service Activator, versions 7.4.0, 7.5.0Oracle Communications Network Charging and Control, versions 6.0.1.0.0, 12.0.1.0.012.0.6.0.0Oracle Communications Operations Monitor, version 5.0Oracle Communications Order and Service Management, version 7.4.1Oracle Communications Policy Management, version 12.6.0.0.0Oracle Communications Services Gatekeeper, version 7.0.0.0.0Oracle Communications Session Border Controller, versions 9.0, 9.1Oracle Communications Session Report Manager, versions 9.0.0, 9.0.1Oracle Communications Session Router, versions 9.0, 9.1Oracle Communications Subscriber-Aware Load Balancer, versions 9.0, 9.1Oracle Communications Unified Assurance, versions 5.5.05.5.10, 6.0.06.0.2Oracle Communications Unified Inventory Management, versions 7.4.0, 7.4.1, 7.4.2, 7.5.0Oracle Communications User Data Repository, version 12.6.1.0.0Oracle Data Integrator, version 12.2.1.4.0Oracle Database Server, versions 19c, 21cOracle Documaker, versions 12.6.0.0.0, 12.6.2.0.012.6.4.0.0, 12.7.0.0.0, 12.7.1.0.0Oracle EBusiness Suite, versions 12.2.312.2.12Oracle Enterprise Communications Broker, versions 3.3, 4.0Oracle Enterprise Manager Ops Center, version 12.4.0.0Oracle Enterprise Session Router, version 9.1Oracle Essbase, version 21.4Oracle FLEXCUBE Core Banking, versions 11.6, 11.7, 11.8, 11.10, 11.11Oracle FLEXCUBE Universal Banking, versions 14.014.3, 14.514.7Oracle Financial Services Analytical Applications Infrastructure, versions 8.0.7.0, 8.0.8.0, 8.0.9.0, 8.1.0.0, 8.1.1.0, 8.1.2.0, 8.1.2.1, 8.1.2.2Oracle Financial Services Analytical Applications Reconciliation Framework, versions 8.0.7.1.2, 8.1.1.1.7Oracle Financial Services Asset Liability Management, version 8.0.7.8.0Oracle Financial Services Balance Computation Engine, version 8.1.1.1.1Oracle Financial Services Balance Sheet Planning, version 8.0.8.1.4Oracle Financial Services Behavior Detection Platform, versions 8.0.8.1, 8.1.1.1, 8.1.2.3, 8.1.2.4Oracle Financial Services Compliance Studio, version 8.1.2.4Oracle Financial Services Crime and Compliance Management Studio, version 8.0.8.3.5Oracle Financial Services Currency Transaction Reporting, versions 8.0.8.1.0, 8.1.1.1.0, 8.1.2.3.0, 8.1.2.4.1Oracle Financial Services Data Governance for US Regulatory Reporting, versions 8.1.2.0, 8.1.2.1Oracle Financial Services Data Integration Hub, versions 8.0.7.3.1, 8.1.0.1.4, 8.1.2.2.1Oracle Financial Services Deposit Insurance Calculations for Liquidity Risk Management, versions 8.0.7.3.1, 8.0.8.3.1Oracle Financial Services Enterprise Case Management, versions 8.0.8.2, 8.1.1.1, 8.1.2.3, 8.1.2.4Oracle Financial Services Enterprise Financial Performance Analytics, version 8.0.7.8.1Oracle Financial Services Funds Transfer Pricing, version 8.0.7.8.1Oracle Financial Services Institutional Performance Analytics, version 8.0.7.8.1Oracle Financial Services Liquidity Risk Measurement and Management, versions 8.0.7.3.1, 8.0.8.3.1Oracle Financial Services Loan Loss Forecasting and Provisioning, versions 8.0.7.8.1, 8.0.8.2.1Oracle Financial Services Model Management and Governance, versions 8.1.0.0, 8.1.2.0Oracle Financial Services Profitability Management, version 8.0.7.8.1Oracle Financial Services Regulatory Reporting with Agile-REPORTER, version 8.1.1.2.0Oracle Financial Services Regulatory Reporting, versions 8.0.8.1, 8.1.1.1, 8.1.2.3, 8.1.2.4Oracle Financial Services Retail Performance Analytics, version 8.0.7.8.1Oracle Financial Services Revenue Management and Billing, versions 2.7, 2.7.1, 2.8, 2.9, 2.9.1, 3.0, 3.1, 3.2, 4.0Oracle Financial Services Trade-Based Anti Money Laundering Enterprise Edition, version 8.0.8.0.0Oracle Golden-Gate Studio, version [Fusion Middleware] 12.2.1.4.0Oracle Golden-Gate, versions prior to 19.1.0.0.230418, prior to 21.10.0.0.0Oracle Graal-VM Enterprise Edition, versions 20.3.8, 20.3.9, 21.3.4, 21.3.5, 22.3.0, 22.3.1Oracle Graph Server and Client, versions prior to 23.1.0, prior to 23.2.0Oracle HTTP Server, version 12.2.1.4.0Oracle Health Sciences In-Form, versions prior to 6.3.1.3, prior to 7.0.0.1Oracle Healthcare Foundation, versions 8.1.0, 8.1.1, 8.2.0, 8.2.1, 8.2.2Oracle Healthcare Master Person Index, versions 5.0.05.0.4Oracle Healthcare Translational Research, versions 4.1.0, 4.1.1Oracle Hospitality OPERA 5 Property Services, version 5.6Oracle Hyperion Financial Reporting, version 11.2.12Oracle Hyperion Infrastructure Technology, version 11.2.12Oracle Identity Manager, version 12.2.1.4.0Oracle Insurance Policy Administration Operational Data Store for Life and Annuity, version 1.0.1.8Oracle JDeveloper, version 12.2.1.4.0Oracle Java SE, versions 8u361, 8u361perf, 11.0.18, 17.0.6, 20Oracle Managed File Transfer, version 12.2.1.4.0Oracle Middleware Common Libraries and Tools, version 12.2.1.4.0Oracle No-SQL Database, versions prior to 19.5.32Oracle Outside In Technology, version 8.5.6Oracle REST Data Services, versions prior to 23.1.0Oracle Retail Customer Management and Segmentation Foundation, versions 18.0.0.12, 19.0.0.6Oracle Retail Fiscal Management, version 14.2Oracle Retail Invoice Matching, versions 15.0.3, 16.0.3Oracle Retail Merchandising System, versions 15.0.3.1, 16.0.2, 16.0.3Oracle Retail Predictive Application Server, versions 15.0.3, 16.0.3Oracle Retail Price Management, versions 14.1.3.2, 15.0.3.1, 16.0.3Oracle Retail Sales Audit, version 15.0.3.1Oracle Retail Xstore Office Cloud Service, versions 18.0.5, 19.0.4, 20.0.3, 21.0.2Oracle Retail Xstore Point of Service, versions 17.0.6, 18.0.5, 19.0.4, 20.0.3, 21.0.2Oracle SDWAN Aware, version 9.0.1.6.0Oracle SDWAN Edge, versions 9.1.1.3.0, 9.1.1.4.0Oracle SOA Suite, version 12.2.1.4.0Oracle SQL Developer, versions prior to 22.4.0, prior to 23.1.0Oracle Solaris, versions 10, 11Oracle Times-Ten In-Memory Database, versions prior to 22.1.1.7.0Oracle Utilities Application Framework, versions 4.2.0.3.0, 4.3.0.1.04.3.0.6.0, 4.4.0.0.0, 4.4.0.2.0, 4.4.0.3.0, 4.5.0.0.0Oracle Utilities Network Management System, versions 2.3.0.2, 2.4.0.1, 2.5.0.0, 2.5.0.1, 2.5.0.2Oracle VM Virtual-Box, versions prior to 6.1.44, prior to 7.0.8Oracle Web-Center Portal, version 12.2.1.4.0Oracle Web-Center Sites, version 12.2.1.4.0Oracle Web-Logic Server, versions 12.2.1.3.0, 12.2.1.4.0, 14.1.1.0.0Oracle i-Learning, version 6.3.1People-Soft Enterprise HCM Human Resources, version 9.2People-Soft Enterprise People-Tools, versions 8.58, 8.59, 8.60Primavera P6 Enterprise Project Portfolio Management, versions 18.8.018.8.26, 19.12.019.12.21, 20.12.020.12.18, 21.12.021.12.12, 22.12.022.12.3Primavera Unifier, versions 18.8.018.8.18, 19.12.019.12.16, 20.12.020.12.16, 21.12.021.12.14, 22.12.022.12.3Siebel Applications, versions 21.10 and prior, 22.10 and prior, 23.3 and priorRISK:Government:Large and medium government entitiesHIGHSmall governmentHIGHBusinesses:Large and medium business entitiesN/ASmall business entitiesHIGHHome Users:LOWRECOMMENDATIONS:We recommend the following actions be taken:\n\nApply appropriate patches or appropriate mitigations provided by Oracle to vulnerable systems immediately after appropriate testing. (M1051: Update Software)\no   Safeguard 7.1: Establish and Maintain a Vulnerability Management Process: Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 7.4: Perform Automated Application Patch Management: Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.\nApply the Principle of Least Privilege to all systems and services, and run all software as a non-privileged user (one without administrative rights) to diminish the effects of a successful attack. (M1026: Privileged Account Management)\no   Safeguard 4.7: Manage Default Accounts on Enterprise Assets and Software: Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.\no   Safeguard 5.4: Restrict Administrator Privileges to Dedicated Administrator Accounts: Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user’s primary, non-privileged account.\nRemind all users not to visit untrusted websites or follow links/open files provided by unknown or untrusted sources. (M1017: User Training)\no   Safeguard 14.1: Establish and Maintain a Security Awareness Program: Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise’s workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.\no   Safeguard 14.2: Train Workforce Members to Recognize Social Engineering Attacks: Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.\nUse capabilities to prevent suspicious behavior patterns from occurring on endpoint systems. This could include suspicious process, file, API call, etc. behavior. (M1040 : Behavior Prevention on Endpoint)\no   Safeguard 13.2 : Deploy a Host-Based Intrusion Detection Solution: Deploy a host-based intrusion detection solution on enterprise assets, where appropriate and/or supported.\nSafeguard 13.7 : Deploy a Host-Based Intrusion Prevention Solution: Deploy a host-based intrusion prevention solution on enterprise assets, where appropriate and/or supported. Example implementations include use of an Endpoint Detection and Response (EDR) client or host-based IPS agent.\nREFERENCES:Oraclehttps://www.oracle.com/security-alerts/cpuapr2023.htmlGet Email Updates When Cyber Threats Like This Arise Subscribe to Advisories Related ResourcesOracle LinuxOracle DatabaseOracle SolarisOracle MySQLOracle Cloud InfrastructureInformation HubAdvisories See All Advisories Blog Post08.09.2024Top 10 Malware Q2 2024Read MoreAdvisory08.07.20242024-088: Multiple Vulnerabilities in Google Android OS Could Allow for Privilege EscalationRead MoreAdvisory08.07.20242024-087: Multiple Vulnerabilities in Google Chrome Could Allow for Arbitrary Code ExecutionRead MoreBlog Post07.26.2024CrowdStrike Falcon Outage Exploited for Social EngineeringRead More",
  "cves": [],
  "techniques": [],
  "title": "Oracle Quarterly Critical Patches Issued April 18, 2023",
  "source": "cis",
  "advisory": "cybersecurity-alerts"
}