{
  "markdown": "\n\nSummary\n\nNote: This alert does not apply to federally certified voting systems running Windows 7. Microsoft will continue to provide free security updates to those systems through the 2020 election. See Microsoft’s article, Extending free Windows 7 security updates to voting systems, for more information.\nOn January 14, 2020, Microsoft will end extended support for their Windows 7 and Windows Server 2008 R2 operating systems.[1] After this date, these products will no longer receive free technical support, or software and security updates.\nOrganizations that have regulatory obligations may find that they are unable to satisfy compliance requirements while running Windows 7 and Windows Server 2008 R2.\n\nTechnical Details\n\nAll software products have a lifecycle. “End of support” refers to the date when the software vendor will no longer provide automatic fixes, updates, or online technical assistance. [2]\nFor more information on end of support for Microsoft products see the Microsoft End of Support FAQ.\nSystems running Windows 7 and Windows Server 2008 R2 will continue to work at their current capacity even after support ends on January 14, 2020. However, using unsupported software may increase the likelihood of malware and other security threats. Mission and business functions supported by systems running Windows 7 and Windows Server 2008 R2 could experience negative consequences resulting from unpatched vulnerabilities and software bugs. These negative consequences could include the loss of confidentiality, integrity, and availability of data, system resources, and business assets.\n\nMitigations\n\nThe Cybersecurity and Infrastructure Security Agency (CISA) encourages users and organizations to:\n\nUpgrade to a newer operating system.\nIdentify affected devices to determine breadth of the problem and assess risk of not upgrading. \nEstablish and execute a plan to systematically migrate to currently supported operating systems or employ a cloud-based service. \nContact the operating system vendor to explore opportunities for fee-for-service maintenance, if unable to upgrade.   \n\n\nReferences\n\n[1] Microsoft End of Support FAQ\n[2] Microsoft Windows Lifecyle Fact Sheet\n[3] Microsoft Windows Upgrade and Migration Considerations\n[4] ComputerWorld: Leaving Windows 7? Here are Some non-Windows Options\n[5] CISA Analysis Report AR19-133A: Microsoft Office 365 Security Observations\n\nRevisions\n\nOctober 17, 2019:  Initial version|October 18, 2019:  Added note\n",
  "cves": [],
  "techniques": [],
  "advisory": "aa19-290a",
  "title": "Microsoft Ending Support for Windows 7 and Windows Server 2008 R2 | CISA",
  "source": "cybersecurity-advisories",
  "id": "1560bef34afcca6eed9db08de8f8efa77942ea3b6672e17d3bfbc416d7849324"
}