{
  "markdown": "\n\nSummary\n\nOn July 13, 2020 EST, SAP released a security update to address a critical vulnerability, CVE-2020-6287, affecting the SAP NetWeaver Application Server (AS) Java component LM Configuration Wizard. An unauthenticated attacker can exploit this vulnerability through the Hypertext Transfer Protocol (HTTP) to take control of trusted SAP applications.\nDue to the criticality of this vulnerability, the attack surface this vulnerability represents, and the importance of SAP’s business applications, the Cybersecurity and Infrastructure Security Agency (CISA) strongly recommends organizations immediately apply patches. CISA recommends organizations prioritize patching internet-facing systems, and then internal systems.\nOrganizations that are unable to immediately patch should mitigate the vulnerability by disabling the LM Configuration Wizard service (see SAP Security Note #2939665). Should these options be unavailable or if the actions will take more than 24 hours to complete, CISA strongly recommends closely monitoring your SAP NetWeaver AS for anomalous activity.\nCISA is unaware of any active exploitation of these vulnerabilities at the time of this report. However, because patches have been publicly released, the underlying vulnerabilities could be reverse-engineered to create exploits that target unpatched systems.\n \n\nTechnical Details\n\nAffected Systems\nThis vulnerability is present by default in SAP applications running on top of SAP NetWeaver AS Java 7.3 and any newer versions (up to SAP NetWeaver 7.5). Potentially vulnerable SAP business solutions include any SAP Java-based solutions such as (but not limited to):\n\nSAP Enterprise Resource Planning,\nSAP Product Lifecycle Management,\nSAP Customer Relationship Management,\nSAP Supply Chain Management,\nSAP Supplier Relationship Management,\nSAP NetWeaver Business Warehouse,\nSAP Business Intelligence,\nSAP NetWeaver Mobile Infrastructure,\nSAP Enterprise Portal,\nSAP Process Orchestration/Process Integration),\nSAP Solution Manager,\nSAP NetWeaver Development Infrastructure,\nSAP Central Process Scheduling,\nSAP NetWeaver Composition Environment, and\nSAP Landscape Manager.\n\nAttack Surface\nThe vulnerability was identified in a component that is part of the SAP NetWeaver AS Java. This technology stack is part of the SAP Solution Manager, which is a support and system management suite.\nThe SAP NetWeaver AS for Java technology supports the SAP Portal component, which may therefore be affected by this vulnerability and is typically exposed to the internet. Passive analysis of internet-facing applications indicates that a number of such applications are connected to the internet and could be affected by this vulnerability.\n\nDescription\nOn July 13, 2020 EST, SAP released the patch for a critical vulnerability, CVE-2020-6287, affecting its NetWeaver AS for Java component. This vulnerability can lead to compromise of vulnerable SAP installations, including the modification or extraction of highly sensitive information, as well as the disruption of critical business processes. A remote, unauthenticated attacker can exploit this vulnerability through an HTTP interface, which is typically exposed to end users and, in many cases, exposed to the internet.\nThe vulnerability is introduced due to the lack of authentication in a web component of the SAP NetWeaver AS for Java allowing for several high-privileged activities on the SAP system.\n\nImpact\nIf successfully exploited, a remote, unauthenticated attacker can obtain unrestricted access to SAP systems through the creation of high-privileged users and the execution of arbitrary operating system commands with the privileges of the SAP service user account (<sid>adm), which has unrestricted access to the SAP database and is able to perform application maintenance activities, such as shutting down federated SAP applications. The confidentiality, integrity, and availability of the data and processes hosted by the SAP application are at risk by this vulnerability.\n \n\nMitigations\n\nCISA strongly recommends organizations review SAP Security Note #2934135 for more information and apply critical patches as soon as possible. CISA recommends prioritizing patching over application of individual mitigations. When patching, external facing systems should be urgently addressed, followed by internal systems.\nPatched versions of the affected components are available at the SAP One Support Launchpad.\nAdditional Recommendations\nCISA encourages users and administrators of SAP products to:\n\nScan SAP systems for all known vulnerabilities, such as missing security patches, dangerous system configurations, and vulnerabilities in SAP custom code.\nApply missing security patches immediately and institutionalize security patching as part of a periodic process\nEnsure secure configuration of your SAP landscape\nIdentify and analyze the security settings of SAP interfaces between systems and applications to understand risks posed by these trust relationships.\nAnalyze systems for malicious or excessive user authorizations.\nMonitor systems for indicators of compromise resulting from the exploitation of vulnerabilities.\nMonitor systems for suspicious user behavior, including both privileged and non-privileged users.\nApply threat intelligence on new vulnerabilities to improve the security posture against advanced targeted attacks.\nDefine comprehensive security baselines for systems and continuously monitor for compliance violations and remediate detected deviations.\n\nThese recommendations apply to SAP systems in public, private, and hybrid cloud environments.\nSee the Onapsis report on the “RECON” SAP Vulnerability for more information.\nACKNOWLEDGEMENTS\nSAP and Onapsis contributed to this Alert.\n\nReferences\n\n[1] Onapsis Threat Report \n[2] CVE-2020-6287\n[3] SAP Security Note\n[4] SAP Trust Center\n[5] SAP Monthly Security Patch Day Blog\n\nRevisions\n\nJuly, 13 2020: Initial Version\n",
  "cves": [
    "CVE-2020-6287"
  ],
  "techniques": [],
  "advisory": "aa20-195a",
  "title": "Critical Vulnerability in SAP NetWeaver AS Java | CISA",
  "source": "cybersecurity-advisories",
  "id": "22233d756492d7ecbd0a2c5be40c706d26e88bfef95c77c7736c8b5990d0756e"
}