{
  "markdown": "\n\nSummary\n\nThis Alert uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework. See the ATT&CK for Enterprise framework for all referenced threat actor techniques.\nThe Cybersecurity and Infrastructure Security Agency (CISA) has observed cyber actors using emails containing a Microsoft Word document with a malicious Visual Basic Application (VBA) macro code to deploy KONNI malware. KONNI is a remote administration tool (RAT) used by malicious cyber actors to steal files, capture keystrokes, take screenshots, and execute arbitrary code on infected hosts.\n\nTechnical Details\n\nKONNI malware is often delivered via phishing emails as a Microsoft Word document with a malicious VBA macro code (Phishing: Spearphising Attachment [T1566.001]). The malicious code can change the font color from light grey to black (to fool the user to enable content), check if the Windows operating system is a 32-bit or 64-bit version, and construct and execute the command line to download additional files (Command and Scripting Interpreter: Windows Command Shell [T1059.003]).\nOnce the VBA macro constructs the command line, it uses the certificate database tool CertUtil to download remote files from a given Uniform Resource Locator. It also incorporates a built-in function to decode base64-encoded files. The Command Prompt silently copies certutil.exe into a temp directory and renames it to evade detection.\nThe cyber actor then downloads a text file from a remote resource containing a base64-encoded string that is decoded by CertUtil and saved as a batch (.BAT) file. Finally, the cyber actor deletes the text file from the temp directory and executes the .BAT file.\nMITRE ATT&CK Techniques\nAccording to MITRE, KONNI uses the ATT&CK techniques listed in table 1.\nTable 1: KONNI ATT&CK techniques\n\n\n\nTechnique\nUse\n\n\n\n\n\nSystem Network Configuration Discovery [T1016]\n\n\nKONNI can collect the Internet Protocol address from the victim’s machine.\n\n\n\n\nSystem Owner/User Discovery [T1033]\n\n\nKONNI can collect the username from the victim’s machine.\n\n\n\n\nMasquerading: Match Legitimate Name or Location [T1036.005]\n\n\nKONNI creates a shortcut called Anti virus service.lnk in an apparent attempt to masquerade as a legitimate file.\n\n\n\n\nExfiltration Over Alternative Protocol: Exfiltration Over Unencrypted/Obfuscated Non-C2 Protocol [T1048.003]\n\n\nKONNI has used File Transfer Protocol to exfiltrate reconnaissance data out.\n\n\n\n\nInput Capture: Keylogging  [T1056.001]\n\n\nKONNI has the capability to perform keylogging.\n\n\n\n\nProcess Discovery [T1057]\n\n\nKONNI has used tasklist.exe to get a snapshot of the current processes’ state of the target machine.\n\n\n\n\nCommand and Scripting Interpreter: PowerShell [T1059.001]\n\n\nKONNI used PowerShell to download and execute a specific 64-bit version of the malware.\n\n\n\n\nCommand and Scripting Interpreter: Windows Command Shell  [T1059.003]\n\n\nKONNI has used cmd.exe to execute arbitrary commands on the infected host across different stages of the infection change.\n\n\n\n\nIndicator Removal on Host: File Deletion [T1070.004]\n\n\nKONNI can delete files.\n\n\n\n\nApplication Layer Protocol: Web Protocols [T1071.001]\n\n\nKONNI has used Hypertext Transfer Protocol for command and control.\n\n\n\n\nSystem Information Discovery [T1082]\n\n\nKONNI can gather the operating system version, architecture information, connected drives, hostname, and computer name from the victim’s machine and has used systeminfo.exe to get a snapshot of the current system state of the target machine.\n\n\n\n\nFile and Directory Discovery [T1083]\n\n\nA version of KONNI searches for filenames created with a previous version of the malware, suggesting different versions targeted the same victims and the versions may work together.\n\n\n\n\nIngress Tool Transfer [T1105]\n\n\nKONNI can download files and execute them on the victim’s machine.\n\n\n\n\nModify Registry [T1112]\n\n\nKONNI has modified registry keys of ComSysApp service and Svchost on the machine to gain persistence.\n\n\n\n\nScreen Capture [T1113]\n\n\nKONNI can take screenshots of the victim’s machine.\n\n\n\n\nClipboard Data [T1115]\n\n\nKONNI had a feature to steal data from the clipboard.\n\n\n\n\nData Encoding: Standard Encoding [T1132.001]\n\n\nKONNI has used a custom base64 key to encode stolen data before exfiltration.\n\n\n\n\nAccess Token Manipulation: Create Process with Token [T1134.002]\n\n\nKONNI has duplicated the token of a high integrity process to spawn an instance of cmd.exe under an impersonated user.\n\n\n\n\nDeobfuscate/Decode Files or Information [T1140]\n\n\nKONNI has used CertUtil to download and decode base64 encoded strings.\n\n\n\n\nSigned Binary Proxy Execution: Rundll32 [T1218.011]\n\n\nKONNI has used Rundll32 to execute its loader for privilege escalation purposes.\n\n\n\n\nEvent Triggered Execution: Component Object Model Hijacking [T1546.015]\n\n\nKONNI has modified ComSysApp service to load the malicious DLL payload.\n\n\n\n\nBoot or Logon Autostart Execution: Registry Run Keys / Startup Folder [T1547.001]\n\n\nA version of KONNI drops a Windows shortcut into the Startup folder to establish persistence.\n\n\n\n\nBoot or Logon Autostart Execution: Shortcut Modification [T1547.009]\n\n\nA version of KONNI drops a Windows shortcut on the victim’s machine to establish persistence.\n\n\n\n\nAbuse Elevation Control Mechanism: Bypass User Access Control [T1548.002]\n\n\nKONNI bypassed User Account Control with the \"AlwaysNotify\" settings.\n\n\n\n\nCredentials from Password Stores: Credentials from Web Browsers [T1555.003]\n\n\nKONNI can steal profiles (containing credential information) from Firefox, Chrome, and Opera.\n\n\n\n\nDetection\nSignatures\nCISA developed the following Snort signatures for use in detecting KONNI malware exploits.\nalert tcp any any -> any $HTTP_PORTS (msg:\"HTTP URI contains '/weget/*.php' (KONNI)\"; sid:1; rev:1; flow:established,to_server; content:\"/weget/\"; http_uri; depth:7; offset:0; fast_pattern; content:\".php\"; http_uri; distance:0; within:12; content:!\"Referrer|3a 20|\"; http_header; classtype:http-uri; priority:2; metadata:service http;)\nalert tcp any any -> any $HTTP_PORTS (msg:\"KONNI:HTTP header contains 'User-Agent|3a 20|HTTP|0d 0a|'\"; sid:1; rev:1; flow:established,to_server; content:\"User-Agent|3a 20|HTTP|0d 0a|\"; http_header; fast_pattern:only; content:\"POST\"; nocase; http_method; classtype:http-header; priority:2; metadata:service http;)\nalert tcp any any -> any $HTTP_PORTS (msg:\"KONNI:HTTP URI contains '/weget/(upload|uploadtm|download)'\"; sid:1; rev:1; flow:established,to_server; content:\"/weget/\"; http_uri; fast_pattern:only; pcre:\"/^\\/weget\\x2f(?:upload|uploadtm|download)\\.php/iU\"; content:\"POST\"; http_method; classtype:http-uri; priority:2; reference:url,blog.talosintelligence.com/2017/07/konni-references-north-korean-missile-capabilities.html; metadata:service http;)\n\nMitigations\n\nCISA recommends that users and administrators consider using the following best practices to strengthen the security posture of their organization's systems. Any configuration changes should be reviewed by system owners and administrators prior to implementation to avoid unwanted impacts.\n\nMaintain up-to-date antivirus signatures and engines. See Protecting Against Malicious Code.\nKeep operating system patches up to date. See Understanding Patches and Software Updates.\nDisable file and printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nRestrict users' ability (permissions) to install and run unwanted software applications. Do not add users to the local administrators’ group unless required.\nEnforce a strong password policy. See Choosing and Protecting Passwords.\nExercise caution when opening email attachments, even if the attachment is expected and the sender appears to be known. See Using Caution with Email Attachments.\nEnable a personal firewall on agency workstations, configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious email attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to sites with unfavorable content.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs).\n Scan all software downloaded from the internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate access control lists.\nVisit the MITRE ATT&CK Techniques pages (linked in table 1 above) for additional mitigation and detection strategies.\n\nFor additional information on malware incident prevention and handling, see the National Institute of Standards and Technology Special Publication 800-83, \"Guide to Malware Incident Prevention and Handling for Desktops and Laptops.\"\nResources\n\nd-hunter – A Look Into KONNI 2019 Campaign\nMITRE ATT&CK – KONNI \nMITRE ATT&CK for Enterprise\n\n\nRevisions\n\nAugust 14, 2020: Initial Version\n",
  "cves": [],
  "techniques": [
    "T1059.001",
    "T1070.004",
    "T1218.011",
    "T1132.001",
    "T1134.002",
    "T1555.003",
    "T1566.001",
    "T1547.009",
    "T1056.001",
    "T1048.003",
    "T1547.001",
    "T1071.001",
    "T1546.015",
    "T1059.003",
    "T1036.005",
    "T1548.002"
  ],
  "advisory": "aa20-227a",
  "title": "Phishing Emails Used to Deploy KONNI Malware | CISA",
  "source": "cybersecurity-advisories",
  "id": "96a34ac59de437ac3b1fd1c443f6e8d3a5409f3c5f3c6275d384468827d35ce2"
}