{
  "markdown": "\n\nSummary\n\nThis joint cybersecurity advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework. See the ATT&CK for Enterprise framework for all referenced threat actor techniques.\nNote: the analysis in this joint cybersecurity advisory is ongoing, and the information provided should not be considered comprehensive. The Cybersecurity and Infrastructure Security Agency (CISA) will update this advisory as new information is available.\nThis joint cybersecurity advisory was written by CISA with contributions from the Federal Bureau of Investigation (FBI). \nCISA has recently observed advanced persistent threat (APT) actors exploiting multiple legacy vulnerabilities in combination with a newer privilege escalation vulnerability—CVE-2020-1472—in Windows Netlogon. The commonly used tactic, known as vulnerability chaining, exploits multiple vulnerabilities in the course of a single intrusion to compromise a network or application. \nThis recent malicious activity has often, but not exclusively, been directed at federal and state, local, tribal, and territorial (SLTT) government networks. Although it does not appear these targets are being selected because of their proximity to elections information, there may be some risk to elections information housed on government networks.\nCISA is aware of some instances where this activity resulted in unauthorized access to elections support systems; however, CISA has no evidence to date that integrity of elections data has been compromised. There are steps that election officials, their supporting SLTT IT staff, and vendors can take to help defend against this malicious cyber activity.\nSome common tactics, techniques, and procedures (TTPs) used by APT actors include leveraging legacy network access and virtual private network (VPN) vulnerabilities in association with the recent critical CVE-2020-1472 Netlogon vulnerability. CISA is aware of multiple cases where the Fortinet FortiOS Secure Socket Layer (SSL) VPN vulnerability CVE-2018-13379 has been exploited to gain access to networks. To a lesser extent, CISA has also observed threat actors exploiting the MobileIron vulnerability CVE-2020-15505. While these exploits have been observed recently, this activity is ongoing and still unfolding.\nAfter gaining initial access, the actors exploit CVE-2020-1472 to compromise all Active Directory (AD) identity services. Actors have then been observed using legitimate remote access tools, such as VPN and Remote Desktop Protocol (RDP), to access the environment with the compromised credentials. Observed activity targets multiple sectors and is not limited to SLTT entities.\nCISA recommends network staff and administrators review internet-facing infrastructure for these and similar vulnerabilities that have or could be exploited to a similar effect, including Juniper CVE-2020-1631, Pulse Secure CVE-2019-11510, Citrix NetScaler CVE-2019-19781, and Palo Alto Networks CVE-2020-2021 (this list is not considered exhaustive).\nClick here for a PDF version of this report.\n\nTechnical Details\n\nInitial Access\nAPT threat actors are actively leveraging legacy vulnerabilities in internet-facing infrastructure (Exploit Public-Facing Application [T1190], External Remote Services [T1133]) to gain initial access into systems. The APT actors appear to have predominately gained initial access via the Fortinet FortiOS VPN vulnerability CVE-2018-13379.\nAlthough not observed in this campaign, other vulnerabilities, listed below, could be used to gain network access (as analysis is evolving, these listed vulnerabilities should not be considered comprehensive). As a best practice, it is critical to patch all known vulnerabilities within internet-facing infrastructure.\n\nCitrix NetScaler CVE-2019-19781\nMobileIron CVE-2020-15505\nPulse Secure CVE-2019-11510\nPalo Alto Networks CVE-2020-2021\nF5 BIG-IP CVE-2020-5902\n\nFortinet FortiOS SSL VPN CVE-2018-13379\nCVE-2018-13379 is a path traversal vulnerability in the FortiOS SSL VPN web portal. An unauthenticated attacker could exploit this vulnerability to download FortiOS system files through specially crafted HTTP resource requests.[1]\nMobileIron Core & Connector Vulnerability CVE-2020-15505\nCVE-2020-15505 is a remote code execution vulnerability in MobileIron Core & Connector versions 10.3 and earlier.[2] This vulnerability allows an external attacker, with no privileges, to execute code of their choice on the vulnerable system. As mobile device management (MDM) systems are critical to configuration management for external devices, they are usually highly permissioned and make a valuable target for threat actors.\nPrivilege Escalation\nPost initial access, the APT actors use multiple techniques to expand access to the environment. The actors are leveraging CVE-2020-1472 in Windows Netlogon to escalate privileges and obtain access to Windows AD servers. Actors are also leveraging the opensource tools such as Mimikatz and the CrackMapExec tool to obtain valid account credentials from AD servers (Valid Accounts [T1078]).\nMicrosoft Netlogon Remote Protocol Vulnerability: CVE-2020-1472\nCVE-2020-1472 is a vulnerability in Microsoft Windows Netlogon Remote Protocol (MS-NRPC), a core authentication component of Active Directory.[3] This vulnerability could allow an unauthenticated attacker with network access to a domain controller to completely compromise all AD identity services (Valid Accounts: Domain Accounts [T1078.002]). Malicious actors can leverage this vulnerability to compromise other devices on the network (Lateral Movement [TA0008]).\nPersistence\nOnce system access has been achieved, the APT actors use abuse of legitimate credentials (Valid Accounts [T1078]) to log in via VPN or remote access services (External Remote Services [T1133]) to maintain persistence.\n\nMitigations\n\nOrganizations with externally facing infrastructure devices that have the vulnerabilities listed in this joint cybersecurity advisory, or other vulnerabilities, should move forward with an “assume breach” mentality. As initial exploitation and escalation may be the only observable exploitation activity, most mitigations will need to focus on more traditional network hygiene and user management activities.\nKeep Systems Up to Date\nPatch systems and equipment promptly and diligently. Establishing and consistently maintaining a thorough patching cycle continues to be the best defense against adversary TTPs. See table 1 for patch information on CVEs mentioned in this report.\nTable 1: Patch information for CVEs\n\n\n\nVulnerability\nVulnerable Products\nPatch Information\n\n\n\n\nCVE-2018-13379\n\n\nFortiOS 6.0: 6.0.0 to 6.0.4\nFortiOS 5.6: 5.6.3 to 5.6.7\nFortiOS 5.4: 5.4.6 to 5.4.12\n\n\n\n\nFortinet Security Advisory: FG-IR-18-384\n\n\n\n\nCVE-2019-19781\n\n\nCitrix Application Delivery Controller\nCitrix Gateway\nCitrix SDWAN WANOP\n\n\n\n\nCitrix blog post: firmware updates for Citrix ADC and Citrix Gateway versions 11.1 and 12.0  \nCitrix blog post: security updates for Citrix SD-WAN WANOP release 10.2.6 and 11.0.3\nCitrix blog post: firmware updates for Citrix ADC and Citrix Gateway versions 12.1 and 13.0\nCitrix blog post: firmware updates for Citrix ADC and Citrix Gateway version 10.5\n\n\n\n\nCVE-2020-5902\n\n\nBig-IP devices (LTM, AAM, Advanced WAF, AFM, Analytics, APM, ASM, DDHD, DNS, FPS, GTM, Link Controller, PEM, SSLO, CGNAT)\n\n\n\n\nF5 Security Advisory: K52145254: TMUI RCE vulnerability CVE-2020-5902\n\n\n\n\nCVE-2019-11510\n\n\nPulse Connect Secure 9.0R1 - 9.0R3.3, 8.3R1 - 8.3R7, 8.2R1 - 8.2R12, 8.1R1 - 8.1R15\nPulse Policy Secure 9.0R1 - 9.0R3.1, 5.4R1 - 5.4R7, 5.3R1 - 5.3R12, 5.2R1 - 5.2R12, 5.1R1 - 5.1R15\n\n\n\n\nPulse Secure Out-of-Cycle Advisory: Multiple vulnerabilities resolved in Pulse Connect Secure / Pulse Policy Secure 9.0RX\n\n\n\n\nCVE-2020-15505\n\n\nMobileIron Core & Connector versions 10.3.0.3 and earlier, 10.4.0.0, 10.4.0.1, 10.4.0.2, 10.4.0.3, 10.5.1.0, 10.5.2.0 and 10.6.0.0  \nSentry versions 9.7.2 and earlier, and 9.8.0;  \nMonitor and Reporting Database (RDB) version 2.0.0.1 and earlier\n\n\n\n\nMobileIron Blog: MobileIron Security Updates Available\n\n\n\n\nCVE-2020-1631\n\n\nJunos OS 12.3, 12.3X48, 14.1X53, 15.1, 15.1X49, 15.1X53, 17.2, 17.3, 17.4, 18.1, 18.2, 18.3, 18.4, 19.1, 19.2, 19.3, 19.4, 20.1\n\n\n\n\nJuniper Security Advisory JSA11021\n\n\n\n\nCVE-2020-2021\n\n\nPAN-OS 9.1 versions earlier than PAN-OS 9.1.3; PAN-OS 9.0 versions earlier than PAN-OS 9.0.9; PAN-OS 8.1 versions earlier than PAN-OS 8.1.15, and all versions of PAN-OS 8.0 (EOL)\n\n\n\n\nPalo Alto Networks Security Advisory for CVE-2020-2021\n\n\n\n\nCVE-2020-1472\n\n\nWindows Server 2008 R2 for x64-based Systems Service Pack 1\nWindows Server 2008 R2 for x64-based Systems Service Pack 1 (Server Core installation)\nWindows Server 2012\nWindows Server 2012 (Server Core installation)\nWindows Server 2012 R2\nWindows Server 2016\nWindows Server 2019\nWindows Server 2019 (Server Core installation)\nWindows Server, version 1903  (Server Core installation)\nWindows Server, version 1909  (Server Core installation)\nWindows Server, version 2004   (Server Core installation)\n\n\n\n\nMicrosoft Security Advisory for CVE-2020-1472\n\n\n\n\n\nComprehensive Account Resets\nIf there is an observation of CVE-2020-1472 Netlogon activity or other indications of valid credential abuse detected, it should be assumed the APT actors have compromised AD administrative accounts, the AD forest should not be fully trusted, and, therefore, a new forest should be deployed. Existing hosts from the old compromised forest cannot be migrated in without being rebuilt and rejoined to the new domain, but migration may be done through “creative destruction,” wherein as endpoints in the legacy forest are decommissioned, new ones can be built in the new forest. This will need to be completed on on-premise as well as Azure-hosted AD instances.\nNote that fully resetting an AD forest is difficult and complex; it is best done with the assistance of personnel who have successfully completed the task previously.\nIt is critical to perform a full password reset on all user and computer accounts in the AD forest. Use the following steps as a guide.\n\nCreate a temporary administrator account, and use this account only for all administrative actions\nReset the Kerberos Ticket Granting Ticket (krbtgt) password [4]; this must be completed before any additional actions (a second reset will take place in step 5)\nWait for the krbtgt reset to propagate to all domain controllers (time may vary)\nReset all account passwords (passwords should be 15 characters or more and randomly assigned):\n\nUser accounts (forced reset with no legacy password reuse)\nLocal accounts on hosts (including local accounts not covered by Local Administrator Password Solution [LAPS])\nService accounts\nDirectory Services Restore Mode (DSRM) account\nDomain Controller machine account\nApplication passwords\n\n\nReset the krbtgt password again\nWait for the krbtgt reset to propagate to all domain controllers (time may vary)\nReboot domain controllers\nReboot all endpoints\n\nThe following accounts should be reset:\n\nAD Kerberos Authentication Master (2x)\nAll Active Directory Accounts\nAll Active Directory Admin Accounts\nAll Active Directory Service Accounts\nAll Active Directory User Accounts\nDSRM Account on Domain Controllers\nNon-AD Privileged Application Accounts\nNon-AD Unprivileged Application Accounts\nNon-Windows Privileged Accounts\nNon-Windows User Accounts\nWindows Computer Accounts\nWindows Local Admin\n\nCVE-2020-1472\nTo secure your organization’s Netlogon channel connections:\n\nUpdate all Domain Controllers and Read Only Domain Controllers. On August 11, 2020, Microsoft released software updates to mitigate CVE-2020-1472. Applying this update to domain controllers is currently the only mitigation to this vulnerability (aside from removing affected domain controllers from the network).\nMonitor for new events, and address non-compliant devices that are using vulnerable Netlogon secure channel connections.\nBlock public access to potentially vulnerable ports, such as 445 (Server Message Block [SMB]) and 135 (Remote Procedure Call [RPC]).\n\nTo protect your organization against this CVE, follow advice from Microsoft, including:\n\nUpdate your domain controllers with an update released August 11, 2020, or later.\nFind which devices are making vulnerable connections by monitoring event logs.\nAddress non-compliant devices making vulnerable connections.\nEnable enforcement mode to address CVE-2020-1472 in your environment.\n\nVPN Vulnerabilities\nImplement the following recommendations to secure your organization’s VPNs:\n\nUpdate VPNs, network infrastructure devices, and devices being used to remote into work environments with the latest software patches and security configurations. See CISA Tips Understanding Patches and Software Updates and Securing Network Infrastructure Devices. Wherever possible, enable automatic updates. See table 1 for patch information on VPN-related CVEs mentioned in this report.\nImplement multi-factor authentication (MFA) on all VPN connections to increase security. Physical security tokens are the most secure form of MFA, followed by authenticator app-based MFA. SMS and email-based MFA should only be used when no other forms are available. If MFA is not implemented, require teleworkers to use strong passwords. See CISA Tips Choosing and Protecting Passwords and Supplementing Passwords for more information.\n\nDiscontinue unused VPN servers. Reduce your organization’s attack surface by discontinuing unused VPN servers, which may act as a point of entry for attackers. To protect your organization against VPN vulnerabilities:\n\nAudit configuration and patch management programs.\nMonitor network traffic for unexpected and unapproved protocols, especially outbound to the internet (e.g., Secure Shell [SSH], SMB, RDP).\nImplement MFA, especially for privileged accounts.\nUse separate administrative accounts on separate administration workstations.\nKeep software up to date. Enable automatic updates, if available. \n\nHow to uncover and mitigate malicious activity\n\nCollect and remove for further analysis:\n\nRelevant artifacts, logs, and data.\n\n\nImplement mitigation steps that avoid tipping off the adversary that their presence in the network has been discovered.\nConsider soliciting incident response support from a third-party IT security organization to:\n\nProvide subject matter expertise and technical support to the incident response.\nEnsure that the actor is eradicated from the network.\nAvoid residual issues that could result in follow-up compromises once the incident is closed.\n\n\n\nResources\n\nCISA VPN-Related Guidance\nCISA Infographic: Risk Vulnerability And Assessment (RVA) Mapped to the MITRE ATT&CK FRAMEWORK\nNational Security Agency InfoSheet: Configuring IPsec Virtual Private Networks\nCISA Joint Advisory: AA20-245A: Technical Approaches to Uncovering and Remediating Malicious Activity\nCISA Activity Alert: AA20-073A: Enterprise VPN Security\nCISA Activity Alert: AA20-031A: Detecting Citrix CVE-2019-19781\nCISA Activity Alert: AA20-010A: Continued Exploitation of Pulse Secure VPN Vulnerability\nCybersecurity Alerts and Advisories: Subscriptions to CISA Alerts and MS-ISAC Advisories\n\n\nContact Information\n\nRecipients of this report are encouraged to contribute any additional information that they may have related to this threat.\nFor any questions related to this report or to report an intrusion and request resources for incident response or technical assistance, please contact:\n\nCISA (888-282-0870 or Central@cisa.dhs.gov), or\nThe FBI through the FBI Cyber Division (855-292-3937 or CyWatch@fbi.gov) or a local field office\n\n \nDISCLAIMER\n \n\nThis information is provided \"as is\" for informational purposes only. The United States Government does not provide any warranties of any kind regarding this information. In no event shall the United States Government or its contractors or subcontractors be liable for any damages, including but not limited to, direct, indirect, special or consequential damages, arising out of, resulting from, or in any way connected with this information, whether or not based upon warranty, contract, tort, or otherwise, whether or not arising out of negligence, and whether or not injury was sustained from, or arose out of the results of, or reliance upon the information.\nThe United States Government does not endorse any commercial product or service, including any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply their endorsement, recommendation, or favoring by the United States Government.\n\n \n\nReferences\n\n[1]  Fortinet Advisory: FG-IR-18-384 \n[2] MobileIron Blog: MobileIron Security Updates Available\n[3] Microsoft Security Advisory for CVE-2020-1472\n[4] Microsoft: AD Forest Recovery - Resetting the krbtgt password\n\nRevisions\n\nOctober 9, 2020: Initial Version|October 11, 2020: Updated Summary|October 12, 2020: Added Additional Links\n",
  "cves": [
    "CVE-2019-19781",
    "CVE-2020-15505",
    "CVE-2020-5902",
    "CVE-2020-1472",
    "CVE-2019-11510",
    "CVE-2020-2021",
    "CVE-2018-13379",
    "CVE-2020-1631"
  ],
  "techniques": [
    "T1078.002"
  ],
  "advisory": "aa20-283a",
  "title": "APT Actors Chaining Vulnerabilities Against SLTT, Critical Infrastructure, and Elections Organizations | CISA",
  "source": "cybersecurity-advisories",
  "id": "54fb1b2afa724ce632d4c71fad3b59f0ebe3c5c558d65647f8adad97760083dd"
}