{"markdown": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n COVID\\-19 Exploited by Malicious Cyber Actors \\| CISA\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Skip to main content](#main) \n\n\n\n\n\n\n\n\n\n\n\n\n![U.S. flag](/profiles/cisad8_gov/themes/custom/gesso/dist/images/us_flag_small.png)\n\n\n\n An official website of the United States government\n \n\n\n\n Here’s how you know\n \n\n\n\n\n\n Here’s how you know\n \n\n\n\n\n\n\n![Dot gov](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-dot-gov.svg)\n\n\n**Official websites use .gov** \n  \n\n A\n **.gov** \n website belongs to an official government organization in the United States.\n \n\n\n\n\n\n![HTTPS](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-https.svg)\n\n\n**Secure .gov websites use HTTPS** \n  \n\n A\n **lock** \n (\n \n\n\n Lock\n \n\n A locked padlock\n \n\n\n\n\n ) or\n **https://** \n means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo Americas Cyber Defense Agency](/sites/default/files/images/SVG/header_logo_tagline_update.svg)](/)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo](/sites/default/files/images/SVG/mobile_logo_wordmark.svg)](/)\n\n\n\n\n\n\n\n\n\n\n Search\n \n\n\n\n\n\n\n\n\n\n Menu\n \n\n\n\n\n\n\n\n\n\n\n\n\n![America's Cyber Defense Agency](/sites/default/files/images/SVG/header_tagline_mobile_update.svg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Close\n \n\n\n\n\n* Topics\n \n\n\n\n[Topics](/topics) \n\n\n\n\n[Cybersecurity Best Practices](/topics/cybersecurity-best-practices)\n\n\n\n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories)\n\n\n\n\n[Critical Infrastructure Security and Resilience](/topics/critical-infrastructure-security-and-resilience)\n\n\n\n\n[Election Security](/topics/election-security)\n\n\n\n\n[Emergency Communications](/topics/emergency-communications)\n\n\n\n\n[Industrial Control Systems](/topics/industrial-control-systems)\n\n\n\n\n[Information and Communications Technology Supply Chain Security](/topics/information-communications-technology-supply-chain-security)\n\n\n\n\n[Partnerships and Collaboration](/topics/partnerships-and-collaboration)\n\n\n\n\n[Physical Security](/topics/physical-security)\n\n\n\n\n[Risk Management](/topics/risk-management)\n\n\n\n\n\n[How can we help?](/audiences) \n\n\n[Government](/topics/government) \n[Educational Institutions](/topics/educational-institutions) \n[Industry](/topics/industry) \n[State, Local, Tribal, and Territorial](/topics/state-local-tribal-and-territorial) \n[Individuals and Families](/topics/individuals-and-families) \n[Small and Medium Businesses](/topics/small-and-medium-businesses) \n[Find Help Locally](/audiences/find-help-locally) \n[Faith\\-Based Community](/audiences/faith-based-community) \n[Executives](/audiences/executives) \n[High\\-Risk Communities](/audiences/high-risk-communities)\n* [Spotlight](/spotlight)\n* Resources \\& Tools\n \n\n\n\n[Resources \\& Tools](/resources-tools) \n\n\n\n\n[All Resources \\& Tools](/resources-tools/all-resources-tools)\n\n\n\n\n[Services](/resources-tools/services)\n\n\n\n\n[Programs](/resources-tools/programs)\n\n\n\n\n[Resources](/resources-tools/resources)\n\n\n\n\n[Training](/resources-tools/training)\n\n\n\n\n[Groups](/resources-tools/groups)\n* News \\& Events\n \n\n\n\n[News \\& Events](/news-events) \n\n\n\n\n[News](/news-events/news)\n\n\n\n\n[Events](/news-events/events)\n\n\n\n\n[Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)\n\n\n\n\n[Directives](/news-events/directives)\n\n\n\n\n[Request a CISA Speaker](/news-events/request-speaker)\n\n\n\n\n[Congressional Testimony](/news-events/congressional-testimony)\n\n\n\n\n[CISA Conferences](/cisa-conferences)\n\n\n\n\n[CISA Live!](/cisa-live)\n* Careers\n \n\n\n\n[Careers](/careers) \n\n\n\n\n[Benefits \\& Perks](/careers/benefits-perks)\n\n\n\n\n[HireVue Applicant Reasonable Accommodations Process](/careers/hirevue-applicant-reasonable-accommodations-process)\n\n\n\n\n[Hiring](/general-recruitment-and-hiring-faqs)\n\n\n\n\n[Resume \\& Application Tips](/careers/resume-application-tips)\n\n\n\n\n[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)\n\n\n\n\n[Veteran and Military Spouses](/careers/veteran-and-military-spouse-employment-opportunities)\n\n\n\n\n[Work @ CISA](/careers/work-cisa)\n* About\n \n\n\n\n[About](/about) \n\n\n\n\n[Culture](/about/culture)\n\n\n\n\n[Divisions \\& Offices](/about/divisions-offices)\n\n\n\n\n[Regions](/about/regions)\n\n\n\n\n[Leadership](/about/leadership)\n\n\n\n\n[Doing Business with CISA](/doing-business-cisa)\n\n\n\n\n[Site Links](/site-links)\n\n\n\n\n[Reporting Employee and Contractor Misconduct](/reporting-employee-and-contractor-misconduct)\n\n\n\n\n[CISA GitHub](/cisa-github)\n\n\n\n\n[CISA Central](/cisa-central)\n\n\n\n\n[2023 Year In Review](/about/2023YIR)\n\n\n\n\n[Contact Us](/about/contact-us)\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Breadcrumb\n \n1. [Home](/)\n2. [News \\& Events](/news-events)\n3. [Cybersecurity Advisories](/news-events/cybersecurity-advisories)\n4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94)\n\n\n\n\n\n\n\n\n Share:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Cybersecurity Advisory\n \nCOVID\\-19 Exploited by Malicious Cyber Actors\n=============================================\n\n\n\n\n\n Last Revised\n \n\n\n April 08, 2020\n \n\n\n\n\n Alert Code\n \n\n AA20\\-099A\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n### Summary\n\n\n\n\n**This is a joint alert from the United States Department of Homeland Security (DHS) Cybersecurity and Infrastructure Security Agency (CISA) and the United Kingdom’s National Cyber Security Centre (NCSC).** \n\n\n\n\n This alert provides information on exploitation by cybercriminal and advanced persistent threat (APT) groups of the current coronavirus disease 2019 (COVID\\-19\\) global pandemic. It includes a non\\-exhaustive list of indicators of compromise (IOCs) for detection as well as mitigation advice.\n \n\n\n\n Both CISA and NCSC are seeing a growing use of COVID\\-19\\-related themes by malicious cyber actors. At the same time, the surge in teleworking has increased the use of potentially vulnerable services, such as virtual private networks (VPNs), amplifying the threat to individuals and organizations.\n \n\n\n\n APT groups and cybercriminals are targeting individuals, small and medium enterprises, and large organizations with COVID\\-19\\-related scams and phishing emails. This alert provides an overview of COVID\\-19\\-related malicious cyber activity and offers practical advice that individuals and organizations can follow to reduce the risk of being impacted. The IOCs provided within the accompanying .csv and .stix files of this alert are based on analysis from CISA, NCSC, and industry.\n \n\n\n\n**Note:** \n this is a fast\\-moving situation and this alert does not seek to catalogue all COVID\\-19\\-related malicious cyber activity. Individuals and organizations should remain alert to increased activity relating to COVID\\-19 and take proactive steps to protect themselves.\n \n\n\n\n### Technical Details\n\n\n\nSummary of Attacks\n------------------\n\n\n\n APT groups are using the COVID\\-19 pandemic as part of their cyber operations. These cyber threat actors will often masquerade as trusted entities. Their activity includes using coronavirus\\-themed phishing messages or malicious applications, often masquerading as trusted entities that may have been previously compromised. Their goals and targets are consistent with long\\-standing priorities such as espionage and “hack\\-and\\-leak” operations.\n \n\n\n\n Cybercriminals are using the pandemic for commercial gain, deploying a variety of ransomware and other malware.\n \n\n\n\n Both APT groups and cybercriminals are likely to continue to exploit the COVID\\-19 pandemic over the coming weeks and months. Threats observed include:\n \n\n\n* Phishing, using the subject of coronavirus or COVID\\-19 as a lure,\n* Malware distribution, using coronavirus\\- or COVID\\-19\\- themed lures,\n* Registration of new domain names containing wording related to coronavirus or COVID\\-19, and\n* Attacks against newly—and often rapidly—deployed remote access and teleworking infrastructure.\n\n\n\n Malicious cyber actors rely on basic social engineering methods to entice a user to carry out a specific action. These actors are taking advantage of human traits such as curiosity and concern around the coronavirus pandemic in order to persuade potential victims to:\n \n\n\n* Click on a link or download an app that may lead to a phishing website, or the downloading of malware, including ransomware.\n\t+ For example, a malicious Android app purports to provide a real\\-time coronavirus outbreak tracker but instead attempts to trick the user into providing administrative access to install \"CovidLock\" ransomware on their device.\n\t [\\[1]](https://www.techrepublic.com/article/covidlock-ransomware-exploits-coronavirus-with-malicious-android-app/)\n* Open a file (such as an email attachment) that contains malware.\n\t+ For example, email subject lines contain COVID\\-19\\-related phrases such as “Coronavirus Update” or “2019\\-nCov: Coronavirus outbreak in your city (Emergency)”\n\n\n\n To create the impression of authenticity, malicious cyber actors may spoof sender information in an email to make it appear to come from a trustworthy source, such as the World Health Organization (WHO) or an individual with “Dr.” in their title. In several examples, actors send phishing emails that contain links to a fake email login page. Other emails purport to be from an organization’s human resources (HR) department and advise the employee to open the attachment.\n \n\n\n\n Malicious file attachments containing malware payloads may be named with coronavirus\\- or COVID\\-19\\-related themes, such as “President discusses budget savings due to coronavirus with Cabinet.rtf.”\n \n\n\n\n**Note:** \n a non\\-exhaustive list of IOCs related to this activity is provided within the accompanying .csv and .stix files of this alert.\n \n\n\nPhishing\n--------\n\n\n\n CISA and NCSC have both observed a large volume of phishing campaigns that use the social engineering techniques described above.\n \n\n\n\n Examples of phishing email subject lines include:\n \n\n\n* 2020 Coronavirus Updates,\n* Coronavirus Updates,\n* 2019\\-nCov: New confirmed cases in your City, and\n* 2019\\-nCov: Coronavirus outbreak in your city (Emergency).\n\n\n\n These emails contain a call to action, encouraging the victim to visit a website that malicious cyber actors use for stealing valuable data, such as usernames and passwords, credit card information, and other personal information.\n \n\n\nSMS Phishing\n------------\n\n\n\n Most phishing attempts come by email but NCSC has observed some attempts to carry out phishing by other means, including text messages (SMS).\n \n\n\n\n Historically, SMS phishing has often used financial incentives—including government payments and rebates (such as a tax rebate)—as part of the lure. Coronavirus\\-related phishing continues this financial theme, particularly in light of the economic impact of the epidemic and governments’ employment and financial support packages. For example, a series of SMS messages uses a UK government\\-themed lure to harvest email, address, name, and banking information. These SMS messages—purporting to be from “COVID” and “UKGOV” (see figure 1\\)—include a link directly to the phishing site (see figure 2\\).\n \n\n\n\n![]()\n\n\n\n##### Figure 1: UK government\\-themed SMS phishing\n\n\n\n\n\n\n\n![]()\n\n\n\n##### Figure 2: UK government\\-themed phishing page\n\n\n\n As this example demonstrates, malicious messages can arrive by methods other than email. In addition to SMS, possible channels include WhatsApp and other messaging services. Malicious cyber actors are likely to continue using financial themes in their phishing campaigns. Specifically, it is likely that they will use new government aid packages responding to COVID\\-19 as themes in phishing campaigns.\n \n\n\nPhishing for credential theft\n-----------------------------\n\n\n\n A number of actors have used COVID\\-19\\-related phishing to steal user credentials. These emails include previously mentioned COVID\\-19 social engineering techniques, sometimes complemented with urgent language to enhance the lure.\n \n\n\n\n If the user clicks on the hyperlink, a spoofed login webpage appears that includes a password entry form. These spoofed login pages may relate to a wide array of online services including—but not limited to—email services provided by Google or Microsoft, or services accessed via government websites.\n \n\n\n\n To further entice the recipient, the websites will often contain COVID\\-19\\-related wording within the URL (e.g., “corona\\-virus\\-business\\-update,” “covid19\\-advisory,” or “cov19esupport”). These spoofed pages are designed to look legitimate or accurately impersonate well\\-known websites. Often the only way to notice malicious intent is through examining the website URL. In some circumstances, malicious cyber actors specifically customize these spoofed login webpages for the intended victim.\n \n\n\n\n If the victim enters their password on the spoofed page, the attackers will be able to access the victim’s online accounts, such as their email inbox. This access can then be used to acquire personal or sensitive information, or to further disseminate phishing emails, using the victim’s address book.\n \n\n\nPhishing for malware deployment\n-------------------------------\n\n\n\n A number of threat actors have used COVID\\-19\\-related lures to deploy malware. In most cases, actors craft an email that persuades the victim to open an attachment or download a malicious file from a linked website. When the victim opens the attachment, the malware is executed, compromising the victim’s device.\n \n\n\n\n For example, NCSC has observed various email messages that deploy the “Agent Tesla” keylogger malware. The email appears to be sent from Dr. Tedros Adhanom Ghebreyesus, Director\\-General of WHO. This email campaign began on Thursday, March 19, 2020\\. Another similar campaign offers thermometers and face masks to fight the epidemic. The email purports to attach images of these medical products but instead contains a loader for Agent Tesla.\n \n\n\n\n In other campaigns, emails include a Microsoft Excel attachment (e.g., “8651 8\\-14\\-18\\.xls”) or contain URLs linking to a landing page that contains a button that—if clicked—redirects to download an Excel spreadsheet, such as \"EMR Letter.xls”. In both cases, the Excel file contains macros that, if enabled, execute an embedded dynamic\\-link library (DLL) to install the “Get2 loader\" malware. Get2 loader has been observed loading the “GraceWire” Trojan.\n \n\n\n\n The \"TrickBot\" malware has been used in a variety of COVID\\-19\\-related campaigns. In one example, emails target Italian users with a document purporting to be information related to COVID\\-19 (see figure 3\\). The document contains a malicious macro that downloads a batch file (BAT), which launches JavaScript, which—in turn—pulls down the TrickBot binary, executing it on the system.\n \n\n\n\n![]()\n\n\n\n##### Figure 3: Email containing malicious macro targeting Italian users\n [\\[2]](https://www.bleepingcomputer.com/news/security/trickbot-malware-targets-italy-in-fake-who-coronavirus-emails/)\n\n\n\n In many cases, Trojans—such as Trickbot or GraceWire—will download further malicious files, such as Remote Access Trojans (RATs), desktop\\-sharing clients, and ransomware. In order to maximize the likelihood of payment, cybercriminals will often deploy ransomware at a time when organizations are under increased pressure. Hospitals and health organizations in the United States,\n [\\[3]](https://securityboulevard.com/2020/03/maze-ransomware-continues-to-hit-healthcare-units-amid-coronavirus-covid-19-outbreak/) \n Spain,\n [\\[4]](https://www.computing.co.uk/news/4012969/hospitals-coronavirus-ransomware) \n and across Europe\n [\\[5]](https://www.bleepingcomputer.com/news/security/covid-19-testing-center-hit-by-cyberattack/) \n have all been recently affected by ransomware incidents.\n \n\n\n\n As always, individuals and organizations should be on the lookout for new and evolving lures. Both CISA\n [\\[6]](https://www.us-cert.gov/ncas/tips/ST18-271) \n ,\n [\\[7]](https://www.us-cert.gov/Ransomware) \n and NCSC\n [\\[8]](https://www.ncsc.gov.uk/guidance/mitigating-malware-and-ransomware-attacks) \n provide guidance on mitigating malware and ransomware attacks.\n \n\n\nExploitation of new teleworking infrastructure\n----------------------------------------------\n\n\n\n Many organizations have rapidly deployed new networks, including VPNs and related IT infrastructure, to shift their entire workforce to teleworking.\n \n\n\n\n Malicious cyber actors are taking advantage of this mass move to telework by exploiting a variety of publicly known vulnerabilities in VPNs and other remote working tools and software. In several examples, CISA and NCSC have observed actors scanning for publicly known vulnerabilities in Citrix. Citrix vulnerability, CVE\\-2019\\-19781, and its exploitation have been widely reported since early January 2020\\. Both CISA\n [\\[9]](https://www.us-cert.gov/ncas/alerts/aa20-031a) \n and NCSC\n [\\[10]](https://www.ncsc.gov.uk/news/citrix-alert) \n provide guidance on CVE\\-2019\\-19781 and continue to investigate multiple instances of this vulnerability's exploitation.\n \n\n\n\n Similarly, known vulnerabilities affecting VPN products from Pulse Secure, Fortinet, and Palo Alto continue to be exploited. CISA provides guidance on the Pulse Secure vulnerability\n [\\[11]](https://www.us-cert.gov/ncas/alerts/aa20-010a) \n and NCSC provides guidance on the vulnerabilities in Pulse Secure, Fortinet, and Palo Alto.\n [\\[12]](https://www.ncsc.gov.uk/news/alert-vpn-vulnerabilities) \n\n\n\n\n Malicious cyber actors are also seeking to exploit the increased use of popular communications platforms—such as Zoom or Microsoft Teams—by sending phishing emails that include malicious files with names such as “zoom\\-us\\-zoom\\_\\#\\#\\#\\#\\#\\#\\#\\#\\#\\#.exe” and “microsoft\\-teams\\_V\\#mu\\#D\\_\\#\\#\\#\\#\\#\\#\\#\\#\\#\\#.exe” (\\# representing various digits that have been reported online).\n [\\[13]](https://blog.checkpoint.com/2020/03/30/covid-19-impact-cyber-criminals-target-zoom-domains/) \n CISA and NCSC have also observed phishing websites for popular communications platforms. In addition, attackers have been able to hijack teleconferences and online classrooms that have been set up without security controls (e.g., passwords) or with unpatched versions of the communications platform software.\n [\\[14]](https://www.fbi.gov/contact-us/field-offices/boston/news/press-releases/fbi-warns-of-teleconferencing-and-online-classroom-hijacking-during-covid-19-pandemic) \n\n\n\n\n The surge in teleworking has also led to an increase in the use of Microsoft’s Remote Desktop Protocol (RDP). Attacks on unsecured RDP endpoints (i.e., exposed to the internet) are widely reported online,\n [\\[15]](https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/) \n and recent analysis\n [\\[16]](https://blog.reposify.com/127-increase-in-exposed-rdps-due-to-surge-in-remote-work) \n has identified a 127% increase in exposed RDP endpoints. The increase in RDP use could potentially make IT systems—without the right security measures in place—more vulnerable to attack.\n [\\[17]](https://www.us-cert.gov/ncas/tips/ST18-001) \n\n\n\nIndicators of compromise\n------------------------\n\n\n\n CISA and NCSC are working with law enforcement and industry partners to disrupt or prevent these malicious cyber activities and have published a non\\-exhaustive list of COVID\\-19\\-related IOCs via the following links:\n \n\n\n* [AA20\\-099A\\_WHITE.csv](https://www.us-cert.gov/sites/default/files/publications/AA20-099A_WHITE.csv)\n* [A20\\-099A\\_WHITE.stix](https://www.us-cert.gov/sites/default/files/publications/AA20-099A_WHITE.stix.xml)\n\n\n\n In addition, there are a number of useful publicly available resources that provide details of COVID\\-19\\-related malicious cyber activity:\n \n\n\n* Recorded Futures’ report,\n [*Capitalizing on Coronavirus Panic, Threat Actors Target Victims Worldwide*](https://go.recordedfuture.com/hubfs/reports/cta-2020-0312-2.pdf)\n* DomainTools’\n [*Free COVID\\-19 Threat List \\- Domain Risk Assessments for Coronavirus Threats*](https://www.domaintools.com/resources/blog/free-covid-19-threat-list-domain-risk-assessments-for-coronavirus-threats)\n* GitHub list of\n [IOCs used COVID\\-19\\-related cyberattack campaigns](https://github.com/parthdmaniar/coronavirus-covid-19-SARS-CoV-2-IoCs) \n gathered by GitHub user Parth D. Maniar\n* GitHub list of\n [Malware, spam, and phishing IOCs that involve the use of COVID\\-19 or coronavirus](https://github.com/sophoslabs/covid-iocs) \n gathered by SophosLabs\n* Reddit master thread to collect\n [intelligence relevant to COVID\\-19 malicious cyber threat actor campaigns](https://www.reddit.com\\r\\blueteamsec\\comments\\fiy0i8\\master_thread_covid19corona_threat_actor_campaigns\\)\n* Tweet regarding the MISP project’s dedicated\n [\\#COVID2019 MISP instance](https://twitter.com/MISPProject/status/1239864641993551873) \n to share COVID\\-related cyber threat information\n\n\n\n\n\n\n\n### Mitigations\n\n\n\n\n Malicious cyber actors are continually adjusting their tactics to take advantage of new situations, and the COVID\\-19 pandemic is no exception. Malicious cyber actors are using the high appetite for COVID\\-19\\-related information as an opportunity to deliver malware and ransomware, and to steal user credentials. Individuals and organizations should remain vigilant. For information regarding the COVID\\-19 pandemic, use trusted resources, such as the Centers for Disease Control and Prevention (CDC)’s\n [COVID\\-19 Situation Summary](https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/summary.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Fcoronavirus%2F2019-ncov%2Fsummary.html) \n .\n \n\n\n\n Following the CISA and NCSC advice set out below will help mitigate the risk to individuals and organizations from malicious cyber activity related to both COVID\\-19 and other themes:\n \n\n\n* [CISA guidance for defending against COVID\\-19 cyber scams](https://www.us-cert.gov/ncas/current-activity/2020/03/06/defending-against-covid-19-cyber-scams)\n* [CISA Insights: Risk Management for Novel Coronavirus (COVID\\-19\\)](https://www.cisa.gov/sites/default/files/publications/20_0318_cisa_insights_coronavirus.pdf) \n , which provides guidance for executives regarding physical, supply chain, and cybersecurity issues related to COVID\\-19\n* [CISA Alert: Enterprise VPN Security](https://www.us-cert.gov/ncas/alerts/aa20-073a)\n* [CISA webpage providing a repository of the agency’s COVID\\-19 guidance](https://www.cisa.gov/coronavirus)\n* [NCSC guidance to help spot, understand, and deal with suspicious messages and emails](https://www.ncsc.gov.uk/guidance/suspicious-email-actions)\n* [NCSC phishing guidance for organizations and cyber security professionals](https://www.ncsc.gov.uk/guidance/phishing)\n* [NCSC guidance on mitigating malware and ransomware attacks](https://www.ncsc.gov.uk/guidance/mitigating-malware-and-ransomware-attacks)\n* [NCSC guidance on home working](https://www.ncsc.gov.uk/guidance/home-working)\n* [NCSC guidance on end user device security](https://www.ncsc.gov.uk/collection/end-user-device-security/eud-overview/vpns)\n\n\nPhishing guidance for individuals\n---------------------------------\n\n\n\n The NCSC’s\n [suspicious email guidance](https://www.ncsc.gov.uk/guidance/suspicious-email-actions) \n explains what to do if you've already clicked on a potentially malicious email, attachment, or link. It provides advice on who to contact if your account or device has been compromised and some of the mitigation steps you can take, such as changing your passwords. It also offers NCSC's top tips for spotting a phishing email:\n \n\n\n* **Authority** \n – Is the sender claiming to be from someone official (e.g., your bank or doctor, a lawyer, a government agency)? Criminals often pretend to be important people or organizations to trick you into doing what they want.\n* **Urgency** \n – Are you told you have a limited time to respond (e.g., in 24 hours or immediately)? Criminals often threaten you with fines or other negative consequences.\n* **Emotion** \n – Does the message make you panic, fearful, hopeful, or curious? Criminals often use threatening language, make false claims of support, or attempt to tease you into wanting to find out more.\n* **Scarcity** \n – Is the message offering something in short supply (e.g., concert tickets, money, or a cure for medical conditions)? Fear of missing out on a good deal or opportunity can make you respond quickly.\n\n\nPhishing guidance for organizations and cybersecurity professionals\n-------------------------------------------------------------------\n\n\n\n Organizational defenses against phishing often rely exclusively on users being able to spot phishing emails. However, organizations that widen their defenses to include more technical measures can improve resilience against phishing attacks.\n \n\n\n\n In addition to educating users on defending against these attacks, organizations should consider NCSC’s guidance that splits mitigations into four layers, on which to build defenses:\n \n\n\n1. Make it difficult for attackers to reach your users.\n2. Help users identify and report suspected phishing emails (see CISA Tips,\n [Using Caution with Email Attachments](https://www.us-cert.gov/ncas/tips/ST04-010) \n and\n [Avoiding Social Engineering and Phishing Scams](https://www.us-cert.gov/ncas/tips/ST04-014) \n ).\n3. Protect your organization from the effects of undetected phishing emails.\n4. Respond quickly to incidents.\n\n\n\n CISA and NCSC also recommend organizations plan for a percentage of phishing attacks to be successful. Planning for these incidents will help minimize the damage caused.\n \n\n\nCommunications platforms guidance for individuals and organizations\n-------------------------------------------------------------------\n\n\n\n Due to COVID\\-19, an increasing number of individuals and organizations are turning to communications platforms—such as Zoom and Microsoft Teams— for online meetings. In turn, malicious cyber actors are hijacking online meetings that are not secured with passwords or that use unpatched software.\n \n\n\n\n**Tips for defending against online meeting hijacking** \n (Source:\n [FBI Warns of Teleconferencing and Online Classroom Hijacking During COVID\\-19 Pandemic](https://www.fbi.gov/contact-us/field-offices/boston/news/press-releases/fbi-warns-of-teleconferencing-and-online-classroom-hijacking-during-covid-19-pandemic) \n , FBI press release, March 30, 2020\\):\n \n\n\n* Do not make meetings public. Instead, require a meeting password or use the waiting room feature and control the admittance of guests.\n* Do not share a link to a meeting on an unrestricted publicly available social media post. Provide the link directly to specific people.\n* Manage screensharing options. Change screensharing to “Host Only.”\n* Ensure users are using the updated version of remote access/meeting applications.\n* Ensure telework policies address requirements for physical and information security.\n\n\nDisclaimers\n-----------\n\n\n\n*This report draws on information derived from CISA, NCSC, and industry sources. Any findings and recommendations made have not been provided with the intention of avoiding all risks and following the recommendations will not remove all such risk. Ownership of information risks remains with the relevant system owner at all times.* \n\n\n\n\n*CISA does not endorse any commercial product or service, including any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply their endorsement, recommendation, or favoring by CISA.* \n\n\n\n\n### References\n\n\n\n\n[\\[1] CovidLock ransomware exploits coronavirus with malicious Android app. TechRepublic.com. March 17, 2020\\.](https://www.techrepublic.com/article/covidlock-ransomware-exploits-coronavirus-with-malicious-android-app/) \n\n\n[\\[2] TrickBot Malware Targets Italy in Fake WHO Coronavirus Emails. Bleeping Computer. March 6, 2020\\.](https://www.bleepingcomputer.com/news/security/trickbot-malware-targets-italy-in-fake-who-coronavirus-emails/) \n\n\n[\\[3] Maze Ransomware Continues to Hit Healthcare Units amid Coronavirus (COVID\\-19\\) Outbreak. Security Boulevard. March 19, 2020\\.](https://securityboulevard.com/2020/03/maze-ransomware-continues-to-hit-healthcare-units-amid-coronavirus-covid-19-outbreak/) \n\n\n[\\[4] Spanish hospitals targeted with coronavirus\\-themed phishing lures in Netwalker ransomware attacks. Computing.co.uk. March 24, 2020\\.](https://www.computing.co.uk/news/4012969/hospitals-coronavirus-ransomware) \n\n\n[\\[5] COVID\\-19 Testing Center Hit By Cyberattack. Bleeping Computer. March 14, 2020\\.](https://www.bleepingcomputer.com/news/security/covid-19-testing-center-hit-by-cyberattack/) \n\n\n[\\[6] CISA Tip: Protecting Against Malicious Code](https://www.us-cert.gov/ncas/tips/ST18-271) \n\n\n[\\[7] CISA Ransomware webpage](https://www.us-cert.gov/Ransomware) \n\n\n[\\[8] NCSC Guidance: Mitigating malware and ransomware attacks](https://www.ncsc.gov.uk/guidance/mitigating-malware-and-ransomware-attacks) \n\n\n[\\[9] CISA Alert: Detecting Citrix CVE\\-2019\\-19781](https://www.us-cert.gov/ncas/alerts/aa20-031a) \n\n\n[\\[10] NCSC Alert: Actors exploiting Citrix products vulnerability](https://www.ncsc.gov.uk/news/citrix-alert) \n\n\n[\\[11] CISA Alert: Continued Exploitation of Pulse Secure VPN Vulnerability](https://www.us-cert.gov/ncas/alerts/aa20-010a) \n\n\n[\\[12] NCSC Alert: Vulnerabilities exploited in VPN products used worldwide](https://www.ncsc.gov.uk/news/alert-vpn-vulnerabilities) \n\n\n[\\[13] COVID\\-19 Impact: Cyber Criminals Target Zoom Domains. Check Point blog. March 30, 2020\\.](https://blog.checkpoint.com/2020/03/30/covid-19-impact-cyber-criminals-target-zoom-domains/) \n\n\n[\\[14] FBI Press Release: FBI Warns of Teleconferencing and Online Classroom Hijacking During COVID\\-19 Pandemic](https://www.fbi.gov/contact-us/field-offices/boston/news/press-releases/fbi-warns-of-teleconferencing-and-online-classroom-hijacking-during-covid-19-pandemic) \n\n\n[\\[15] Microsoft Security blog: Human\\-operated ransomware attacks: A preventable disaster. March 5, 2020\\.](https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/) \n\n\n[\\[16] Reposify blog: 127% increase in exposed RDPs due to surge in remote work. March 30\\. 2020\\.](https://blog.reposify.com/127-increase-in-exposed-rdps-due-to-surge-in-remote-work) \n\n\n[\\[17] CISA Tip: Securing Network Infrastructure Devices](https://www.us-cert.gov/ncas/tips/ST18-001) \n\n\n### Revisions\n\n\n\n\n April 8, 2020: Initial Version\n \n\n\n\n\n\n\n\n\n\n\n This product is provided subject to this\n [Notification](/notification \"Follow link\") \n and this\n [Privacy \\& Use](/privacy-policy \"Follow link\") \n policy.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease share your thoughts\n--------------------------\n\n\n\n We recently updated our anonymous\n [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa20-099a) \n ; we’d welcome your feedback.\n \n\n\n\n\n\n\n\n\n\n\n\n\nRelated Advisories\n------------------\n\n\n\n\n\n\n\n\n\n\n Jul 11, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-193A\n \n\n### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a)\n\n\n\n\n\n\n\n\n\n\n\n Jul 08, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-190A\n \n\n### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a)\n\n\n\n\n\n\n\n\n\n\n\n May 10, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-131A\n \n\n### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a)\n\n\n\n\n\n\n\n\n\n\n\n Apr 18, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-109A\n \n\n### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Return to top](#) \n\n\n\n\n* [Topics](/topics)\n* [Spotlight](/spotlight)\n* [Resources \\& Tools](/resources-tools)\n* [News \\& Events](/news-events)\n* [Careers](/careers)\n* [About](/about)\n\n\n\n\n\n\n\n\n[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")\n\n\n* [Facebook](https://www.facebook.com/CISA)\n* [Twitter](https://twitter.com/CISAgov)\n* [LinkedIn](https://www.linkedin.com/company/cybersecurity-and-infrastructure-security-agency)\n* [YouTube](https://www.youtube.com/@cisagov)\n* [Instagram](https://www.instagram.com/cisagov)\n* [RSS](/subscribe-updates-cisa)\n\n\n\n\n CISA Central\n \n[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) \n[SayCISA@cisa.gov](mailto:SayCISA@cisa.gov) \n\n\n\n\n\n\n\n\n\n\n\n DHS Seal\n \n\n\n CISA.gov\n \n\n An official website of the U.S. Department of Homeland Security\n \n\n\n* [About CISA](/about \"About CISA\")\n* [Budget and Performance](https://www.dhs.gov/performance-financial-reports \"Budget and Performance\")\n* [DHS.gov](https://www.dhs.gov \"Department of Homeland Security\")\n* [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")\n* [FOIA Requests](https://www.dhs.gov/foia \"FOIA Requests\")\n* [No FEAR Act](/no-fear-act \"No FEAR Act Reporting\")\n* [Office of Inspector General](https://www.oig.dhs.gov/ \"Office of Inspector General\")\n* [Privacy Policy](/privacy-policy \"Privacy Policy\")\n* [Subscribe](https://public.govdelivery.com/accounts/USDHSCISA/subscriber/new?topic_id=USDHSCISA_138 \"Subscribe to Email Updates\")\n* [The White House](https://www.whitehouse.gov/ \"The White House\")\n* [USA.gov](https://www.usa.gov/ \"USA.gov\")\n* [Website Feedback](/forms/feedback \"Website Feedback\")\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "cves": ["CVE-2019-19781"], "techniques": [], "advisory": "aa20-099a", "title": "COVID-19 Exploited by Malicious Cyber Actors | CISA", "source": "cybersecurity-advisories", "id": "08a342ce4c002dacdae43b2556ab4b0ec418a17b6468c7a92990fb68f6383879"}