{"markdown": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Guidance on the North Korean Cyber Threat \\| CISA\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Skip to main content](#main) \n\n\n\n\n\n\n\n\n\n\n\n\n![U.S. flag](/profiles/cisad8_gov/themes/custom/gesso/dist/images/us_flag_small.png)\n\n\n\n An official website of the United States government\n \n\n\n\n Here’s how you know\n \n\n\n\n\n\n Here’s how you know\n \n\n\n\n\n\n\n![Dot gov](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-dot-gov.svg)\n\n\n**Official websites use .gov** \n  \n\n A\n **.gov** \n website belongs to an official government organization in the United States.\n \n\n\n\n\n\n![HTTPS](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-https.svg)\n\n\n**Secure .gov websites use HTTPS** \n  \n\n A\n **lock** \n (\n \n\n\n Lock\n \n\n A locked padlock\n \n\n\n\n\n ) or\n **https://** \n means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo Americas Cyber Defense Agency](/sites/default/files/images/SVG/header_logo_tagline_update.svg)](/)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo](/sites/default/files/images/SVG/mobile_logo_wordmark.svg)](/)\n\n\n\n\n\n\n\n\n\n\n Search\n \n\n\n\n\n\n\n\n\n\n Menu\n \n\n\n\n\n\n\n\n\n\n\n\n\n![America's Cyber Defense Agency](/sites/default/files/images/SVG/header_tagline_mobile_update.svg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Close\n \n\n\n\n\n* Topics\n \n\n\n\n[Topics](/topics) \n\n\n\n\n[Cybersecurity Best Practices](/topics/cybersecurity-best-practices)\n\n\n\n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories)\n\n\n\n\n[Critical Infrastructure Security and Resilience](/topics/critical-infrastructure-security-and-resilience)\n\n\n\n\n[Election Security](/topics/election-security)\n\n\n\n\n[Emergency Communications](/topics/emergency-communications)\n\n\n\n\n[Industrial Control Systems](/topics/industrial-control-systems)\n\n\n\n\n[Information and Communications Technology Supply Chain Security](/topics/information-communications-technology-supply-chain-security)\n\n\n\n\n[Partnerships and Collaboration](/topics/partnerships-and-collaboration)\n\n\n\n\n[Physical Security](/topics/physical-security)\n\n\n\n\n[Risk Management](/topics/risk-management)\n\n\n\n\n\n[How can we help?](/audiences) \n\n\n[Government](/topics/government) \n[Educational Institutions](/topics/educational-institutions) \n[Industry](/topics/industry) \n[State, Local, Tribal, and Territorial](/topics/state-local-tribal-and-territorial) \n[Individuals and Families](/topics/individuals-and-families) \n[Small and Medium Businesses](/topics/small-and-medium-businesses) \n[Find Help Locally](/audiences/find-help-locally) \n[Faith\\-Based Community](/audiences/faith-based-community) \n[Executives](/audiences/executives) \n[High\\-Risk Communities](/audiences/high-risk-communities)\n* [Spotlight](/spotlight)\n* Resources \\& Tools\n \n\n\n\n[Resources \\& Tools](/resources-tools) \n\n\n\n\n[All Resources \\& Tools](/resources-tools/all-resources-tools)\n\n\n\n\n[Services](/resources-tools/services)\n\n\n\n\n[Programs](/resources-tools/programs)\n\n\n\n\n[Resources](/resources-tools/resources)\n\n\n\n\n[Training](/resources-tools/training)\n\n\n\n\n[Groups](/resources-tools/groups)\n* News \\& Events\n \n\n\n\n[News \\& Events](/news-events) \n\n\n\n\n[News](/news-events/news)\n\n\n\n\n[Events](/news-events/events)\n\n\n\n\n[Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)\n\n\n\n\n[Directives](/news-events/directives)\n\n\n\n\n[Request a CISA Speaker](/news-events/request-speaker)\n\n\n\n\n[Congressional Testimony](/news-events/congressional-testimony)\n\n\n\n\n[CISA Conferences](/cisa-conferences)\n\n\n\n\n[CISA Live!](/cisa-live)\n* Careers\n \n\n\n\n[Careers](/careers) \n\n\n\n\n[Benefits \\& Perks](/careers/benefits-perks)\n\n\n\n\n[HireVue Applicant Reasonable Accommodations Process](/careers/hirevue-applicant-reasonable-accommodations-process)\n\n\n\n\n[Hiring](/general-recruitment-and-hiring-faqs)\n\n\n\n\n[Resume \\& Application Tips](/careers/resume-application-tips)\n\n\n\n\n[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)\n\n\n\n\n[Veteran and Military Spouses](/careers/veteran-and-military-spouse-employment-opportunities)\n\n\n\n\n[Work @ CISA](/careers/work-cisa)\n* About\n \n\n\n\n[About](/about) \n\n\n\n\n[Culture](/about/culture)\n\n\n\n\n[Divisions \\& Offices](/about/divisions-offices)\n\n\n\n\n[Regions](/about/regions)\n\n\n\n\n[Leadership](/about/leadership)\n\n\n\n\n[Doing Business with CISA](/doing-business-cisa)\n\n\n\n\n[Site Links](/site-links)\n\n\n\n\n[Reporting Employee and Contractor Misconduct](/reporting-employee-and-contractor-misconduct)\n\n\n\n\n[CISA GitHub](/cisa-github)\n\n\n\n\n[CISA Central](/cisa-central)\n\n\n\n\n[2023 Year In Review](/about/2023YIR)\n\n\n\n\n[Contact Us](/about/contact-us)\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Breadcrumb\n \n1. [Home](/)\n2. [News \\& Events](/news-events)\n3. [Cybersecurity Advisories](/news-events/cybersecurity-advisories)\n4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94)\n\n\n\n\n\n\n\n\n Share:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Cybersecurity Advisory\n \nGuidance on the North Korean Cyber Threat\n=========================================\n\n\n\n\n\n Last Revised\n \n\n\n June 23, 2020\n \n\n\n\n\n Alert Code\n \n\n AA20\\-106A\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n### Summary\n\n\n\n\n The U.S. Departments of State, the Treasury, and Homeland Security, and the Federal Bureau of Investigation are issuing this advisory as a comprehensive resource on the North Korean cyber threat for the international community, network defenders, and the public. The advisory highlights the cyber threat posed by North Korea – formally known as the Democratic People’s Republic of Korea (DPRK) – and provides recommended steps to mitigate the threat. In particular, Annex 1 lists U.S. government resources related to DPRK cyber threats and Annex 2 includes a link to the UN 1718 Sanctions Committee (DPRK) Panel of Experts reports.\n \n\n\n\n The DPRK’s malicious cyber activities threaten the United States and the broader international community and, in particular, pose a significant threat to the integrity and stability of the international financial system. Under the pressure of robust U.S. and UN sanctions, the DPRK has increasingly relied on illicit activities – including cybercrime – to generate revenue for its weapons of mass destruction and ballistic missile programs. In particular, the United States is deeply concerned about North Korea’s malicious cyber activities, which the U.S. government refers to as HIDDEN COBRA. The DPRK has the capability to conduct disruptive or destructive cyber activities affecting U.S. critical infrastructure. The DPRK also uses cyber capabilities to steal from financial institutions, and has demonstrated a pattern of disruptive and harmful cyber activity that is wholly inconsistent with the growing international consensus on what constitutes responsible State behavior in cyberspace.\n \n\n\n\n The United States works closely with like\\-minded countries to focus attention on and condemn the DPRK’s disruptive, destructive, or otherwise destabilizing behavior in cyberspace. For example, in December 2017, Australia, Canada, New Zealand, the United States, and the United Kingdom publicly attributed the WannaCry 2\\.0 ransomware attack to the DPRK and denounced the DPRK’s harmful and irresponsible cyber activity. Denmark and Japan issued supporting statements for the joint denunciation of the destructive WannaCry 2\\.0 ransomware attack, which affected hundreds of thousands of computers around the world in May 2017\\.\n \n\n\n\n It is vital for the international community, network defenders, and the public to stay vigilant and to work together to mitigate the cyber threat posed by North Korea.\n \n\n\n\n[Click here](https://www.us-cert.gov/sites/default/files/2020-04/DPRK_Cyber_Threat_Advisory_04152020_S508C.pdf) \n for an English PDF version of this report.\n \n\n\n\n Click the following links for PDF versions of this report in\n [Arabic](https://www.us-cert.gov/sites/default/files/publications/DPRK_Cyber_Advisory_ARA_S508C.pdf) \n ,\n [French](https://www.us-cert.gov/sites/default/files/publications/DPRK_Cyber_Advisory_FRE_S508C.pdf) \n ,\n [Japanese](//www.us-cert.gov/sites/default/files/publications/DPRK_Cyber_Advisory_JPN_S508C.pdf) \n ,\n [Korean](https://www.us-cert.gov/sites/default/files/publications/DPRK_Cyber_Advisory_KOR_S508C.pdf) \n ,\n [Portuguese](https://www.us-cert.gov/sites/default/files/publications/DPRK_Cyber_Advisory_POR_S508C.pdf) \n ,\n [Spanish](https://www.us-cert.gov/sites/default/files/publications/DPRK_Cyber_Advisory_SPA_S508C.pdf) \n , and\n [traditional Chinese](https://www.us-cert.gov/sites/default/files/publications/DPRK_Cyber_Advisory_TRAD CHN_S508C.pdf) \n , and\n [Vietnamese](/sites/default/files/publications/DPRK_Cyber_Advisory_VIE_S508C.pdf) \n .\n \n\n\n\n### Technical Details\n\n\n\n#### DPRK’s Malicious Cyber Activities Targeting the Financial Sector\n\n\n\n Many DPRK cyber actors are subordinate to UN\\- and U.S.\\-designated entities, such as the Reconnaissance General Bureau. DPRK state\\-sponsored cyber actors primarily consist of hackers, cryptologists, and software developers who conduct espionage, cyber\\-enabled theft targeting financial institutions and digital currency exchanges, and politically\\-motivated operations against foreign media companies. They develop and deploy a wide range of malware tools around the world to enable these activities and have grown increasingly sophisticated. Common tactics to raise revenue illicitly by DPRK state\\-sponsored cyber actors include, but are not limited to:\n \n\n\n\n***Cyber\\-Enabled Financial Theft and Money Laundering.***\n The UN Security Council 1718 Committee Panel of Experts’ 2019 mid\\-term report (2019 POE mid\\-term report) states that the DPRK is increasingly able to generate revenue notwithstanding UN Security Council sanctions by using malicious cyber activities to steal from financial institutions through increasingly sophisticated tools and tactics. The 2019 POE mid\\-term report notes that, in some cases, these malicious cyber activities have also extended to laundering funds through multiple jurisdictions. The 2019 POE mid\\-term report mentions that it was investigating dozens of suspected DPRK cyber\\-enabled heists and that, as of late 2019, the DPRK has attempted to steal as much as $2 billion through these illicit cyber activities. Allegations in a March 2020 Department of Justice forfeiture complaint are consistent with portions of the POE’s findings. Specifically, the forfeiture complaint alleged how North Korean cyber actors used North Korean infrastructure in furtherance of their conspiracy to hack digital currency exchanges, steal hundreds of millions of dollars in digital currency, and launder the funds.\n \n\n\n\n***Extortion Campaigns.***\n DPRK cyber actors have also conducted extortion campaigns against third\\-country entities by compromising an entity’s network and threatening to shut it down unless the entity pays a ransom. In some instances, DPRK cyber actors have demanded payment from victims under the guise of long\\-term paid consulting arrangements in order to ensure that no such future malicious cyber activity takes place. DPRK cyber actors have also been paid to hack websites and extort targets for third\\-party clients.\n \n\n\n\n***Cryptojacking.***\n The 2019 POE mid\\-term report states that the POE is also investigating the DPRK’s use of “cryptojacking,” a scheme to compromise a victim machine and steal its computing resources to mine digital currency. The POE has identified several incidents in which computers infected with cryptojacking malware sent the mined assets – much of it anonymity\\-enhanced digital currency (sometimes also referred to as “privacy coins”) – to servers located in the DPRK, including at Kim Il Sung University in Pyongyang.\n \n\n\n\n These activities highlight the DPRK’s use of cyber\\-enabled means to generate revenue while mitigating the impact of sanctions and show that any country can be exposed to and exploited by the DPRK. According to the 2019 POE mid\\-term report, the POE is also investigating such activities as attempted violations of UN Security Council sanctions on the DPRK.\n \n\n\n#### Cyber Operations Publicly Attributed to DPRK by U.S. Government\n\n\n\n The DPRK has repeatedly targeted U.S. and other government and military networks, as well as networks related to private entities and critical infrastructure, to steal data and conduct disruptive and destructive cyber activities. To date, the U.S. government has publicly attributed the following cyber incidents to DPRK state\\-sponsored cyber actors and co\\-conspirators:\n \n\n\n* **Sony Pictures.** \n In November 2014, DPRK state\\-sponsored cyber actors allegedly launched a cyber attack on Sony Pictures Entertainment (SPE) in retaliation for the 2014 film “The Interview.” DPRK cyber actors hacked into SPE’s network to steal confidential data, threatened SPE executives and employees, and damaged thousands of computers.\n\t+ FBI’s Update on Sony Investigation (Dec. 19, 2014\\)\n\t [https://www.fbi.gov/news/pressrel/press\\-releases/update\\-on\\-sony\\-investigation](https://www.fbi.gov/news/pressrel/press-releases/update-on-sony-investigation)\n\t+ DOJ’s Criminal Complaint of a North Korean Regime\\-Backed Programmer (Sept. 6, 2018\\)\n\t [https://www.justice.gov/opa/pr/north\\-korean\\-regime\\-backed\\-programmer\\-charged\\-conspiracy\\-conduct\\-multiple\\-cyber\\-attacks\\-and](https://www.justice.gov/opa/pr/north-korean-regime-backed-programmer-charged-conspiracy-conduct-multiple-cyber-attacks-and)\n* **Bangladesh Bank Heist.** \n In February 2016, DPRK state\\-sponsored cyber actors allegedly attempted to steal at least $1 billion from financial institutions across the world and allegedly stole $81 million from the Bangladesh Bank through unauthorized transactions on the Society for Worldwide Interbank Financial Telecommunication (SWIFT) network. According to the complaint, DPRK cyber actors accessed the Bangladesh Bank’s computer terminals that interfaced with the SWIFT network after compromising the bank’s computer network via spear phishing emails targeting bank employees. DPRK cyber actors then sent fraudulently authenticated SWIFT messages directing the Federal Reserve Bank of New York to transfer funds out of the Bangladesh Bank’s Federal Reserve account to accounts controlled by the conspirators.\n\t+ DOJ’s Criminal Complaint of a North Korean Regime\\-Backed Programmer (Sept. 6, 2018\\)\n\t [https://www.justice.gov/opa/pr/north\\-korean\\-regime\\-backed\\-programmer\\-charged\\-conspiracy\\-conduct\\-multiple\\-cyber\\-attacks\\-and](https://www.justice.gov/opa/pr/north-korean-regime-backed-programmer-charged-conspiracy-conduct-multiple-cyber-attacks-and)\n* **WannaCry 2\\.0\\.** \n DPRK state\\-sponsored cyber actors developed the ransomware known as WannaCry 2\\.0, as well as two prior versions of the ransomware. In May 2017, WannaCry 2\\.0 ransomware infected hundreds of thousands of computers in hospitals, schools, businesses, and homes in over 150 countries.  WannaCry 2\\.0 ransomware encrypts an infected computer’s data and allows the cyber actors to demand ransom payments in the Bitcoin digital currency. The Department of the Treasury designated one North Korean computer programmer for his part in the WannaCry 2\\.0 conspiracy, as well as his role in the Sony Pictures cyber attack and Bangladesh Bank heist, and additionally designated the organization he worked for.\n\t+ CISA’s Technical Alert: Indicators Associated with WannaCry Ransomware (May 12, 2017\\)\n\t [https://www.us\\-cert.gov/ncas/alerts/TA17\\-132A](https://www.us-cert.gov/ncas/alerts/TA17-132A)\n\t+ White House Press Briefing on the Attribution of WannaCry Ransomware (Dec. 19, 2017\\)\n\t [https://www.whitehouse.gov/briefings\\-statements/press\\-briefing\\-on\\-the\\-attribution\\-of\\-the\\-wannacry\\-malware\\-attack\\-to\\-north\\-korea\\-121917/](https://www.whitehouse.gov/briefings-statements/press-briefing-on-the-attribution-of-the-wannacry-malware-attack-to-north-korea-121917/)\n\t+ DOJ’s Criminal Complaint of a North Korean Regime\\-Backed Programmer (Sept. 6, 2018\\)\n\t [https://www.justice.gov/opa/pr/north\\-korean\\-regime\\-backed\\-programmer\\-charged\\-conspiracy\\-conduct\\-multiple\\-cyber\\-attacks\\-and](https://www.justice.gov/opa/pr/north-korean-regime-backed-programmer-charged-conspiracy-conduct-multiple-cyber-attacks-and)\n\t+ Treasury Targets North Korea for Multiple Cyber\\-Attacks (Sept. 6, 2018\\)\n\t [https://home.treasury.gov/news/press\\-releases/sm473](https://home.treasury.gov/news/press-releases/sm473)\n* **FASTCash Campaign.** \n Since late 2016, DPRK state\\-sponsored cyber actors have employed a fraudulent ATM cash withdrawal scheme known as “FASTCash” to steal tens of millions of dollars from ATMs in Asia and Africa.  FASTCash schemes remotely compromise payment switch application servers within banks to facilitate fraudulent transactions. In one incident in 2017, DPRK cyber actors enabled the withdrawal of cash simultaneously from ATMs located in more than 30 different countries. In another incident in 2018, DPRK cyber actors enabled cash to be simultaneously withdrawn from ATMs in 23 different countries.\n\t+ CISA’s Alert on FASTCash Campaign (Oct. 2, 2018\\)\n\t [https://www.us\\-cert.gov/ncas/alerts/TA18\\-275A](https://www.us-cert.gov/ncas/alerts/TA18-275A)\n\t+ CISA’s Malware Analysis Report: FASTCash\\-Related Malware (Oct. 2, 2018\\)\n\t [https://www.us\\-cert.gov/ncas/analysis\\-reports/AR18\\-275A](https://www.us-cert.gov/ncas/analysis-reports/AR18-275A)\n* **Digital Currency Exchange Hack.** \n As detailed in allegations set forth in a Department of Justice complaint for forfeiture in rem, in April 2018, DPRK state\\-sponsored cyber actors hacked into a digital currency exchange and stole nearly $250 million worth of digital currency. The complaint further described how the stolen assets were laundered through hundreds of automated digital currency transactions, to obfuscate the origins of the funds, in an attempt to prevent law enforcement from tracing the assets. Two Chinese nationals are alleged in the complaint to have subsequently laundered the assets on behalf of the North Korean group, receiving approximately $91 million from DPRK\\-controlled accounts, as well as an additional $9\\.5 million from a hack of another exchange. In March 2020, the Department of the Treasury designated the two individuals under cyber and DPRK sanctions authorities, concurrent with a Department of Justice announcement that the individuals had been previously indicted on money laundering and unlicensed money transmitting charges and that 113 digital currency accounts were subject to forfeiture.\n\t+ Treasury’s Sanctions against Individuals Laundering Cryptocurrency for Lazarus Group (March 2, 2020\\)\n\t [https://home.treasury.gov/news/press\\-releases/sm924](https://home.treasury.gov/news/press-releases/sm924)\n\t+ DOJ’s Indictment of Two Chinese Nationals Charged with Laundering Cryptocurrency from Exchange Hack and Civil Forfeiture Complaint (March 2, 2020\\)\n\t [https://www.justice.gov/opa/pr/two\\-chinese\\-nationals\\-charged\\-laundering\\-over\\-100\\-million\\-cryptocurrency\\-exchange\\-hack](https://www.justice.gov/opa/pr/two-chinese-nationals-charged-laundering-over-100-million-cryptocurrency-exchange-hack)\n\n\n\n### Mitigations\n\n\n\n#### Measures to Counter the DPRK Cyber Threat\n\n\n\n North Korea targets cyber\\-enabled infrastructure globally to generate revenue for its regime priorities, including its weapons of mass destruction programs. We strongly urge governments, industry, civil society, and individuals to take all relevant actions below to protect themselves from and counter the DPRK cyber threat:\n \n\n\n* **Raise Awareness of the DPRK Cyber Threat.** \n Highlighting the gravity, scope, and variety of malicious cyber activities carried out by the DPRK will raise general awareness across the public and private sectors of the threat and promote adoption and implementation of appropriate preventive and risk mitigation measures.\n* **Share Technical Information of the DPRK Cyber Threat.** \n Information sharing at both the national and international levels to detect and defend against the DPRK cyber threat will enable enhanced cybersecurity of networks and systems.  Best practices should be shared with governments and the private sector.  Under the provisions of the Cybersecurity Information Sharing Act of 2015 (6 U.S.C. §§ 1501–1510\\), non\\-federal entities may share cyber threat indicators and defensive measures related to HIDDEN COBRA with federal and non\\-federal entities.\n* **Implement and Promote Cybersecurity Best Practices.** \n Adopting measures – both technical and behavioral – to enhance cybersecurity will make U.S. and global cyber infrastructure more secure and resilient. Financial institutions, including money services businesses, should take independent steps to protect against malicious DPRK cyber activities. Such steps may include, but are not limited to, sharing threat information through government and/or industry channels, segmenting networks to minimize risks, maintaining regular backup copies of data, undertaking awareness training on common social engineering tactics, implementing policies governing information sharing and network access, and developing cyber incident response plans. The Department of Energy’s Cybersecurity Capability Maturity Model and the National Institute of Standards and Technology’s Cybersecurity Framework provide guidance on developing and implementing robust cybersecurity practices. As shown in Annex I, the Cybersecurity and Infrastructure Security Agency (CISA) provides extensive resources, including technical alerts and malware analysis reports, to enable network defenders to identify and reduce exposure to malicious cyber activities.\n* **Notify Law Enforcement.** \n If an organization suspects that it has been the victim of malicious cyber activity, emanating from the DPRK or otherwise, it is critical to notify law enforcement in a timely fashion.  This not only can expedite the investigation, but also, in the event of a financial crime, can increase the chances of recovering any stolen assets.\n   \n\n  \n\n U.S. law enforcement has seized millions of dollars’ worth of digital currency stolen by North Korean cyber actors.  All types of financial institutions, including money services businesses, are encouraged to cooperate on the front end by complying with U.S. law enforcement requests for information regarding these cyber threats, and on the back end by identifying forfeitable assets upon receipt of a request from U.S. law enforcement or U.S. court orders, and by cooperating with U.S. law enforcement to support the seizure of such assets.\n* **Strengthen Anti\\-Money Laundering (AML) / Countering the Financing of Terrorism (CFT) / Counter\\-Proliferation Financing (CPF) Compliance** \n .  Countries should swiftly and effectively implement the Financial Action Task Force (FATF) standards on AML/CFT/CPF.  This includes ensuring financial institutions and other covered entities employ risk mitigation measures in line with the FATF standards and FATF public statements and guidance.  Specifically, the FATF has called for all countries to apply countermeasures to protect the international financial system from the ongoing money laundering, terrorist financing, and proliferation financing risks emanating from the DPRK.\n [\\[1]](https://www.fatf-gafi.org/publications/high-risk-and-other-monitored-jurisdictions/documents/call-for-action-february-2020.html) \n This includes advising all financial institutions and other covered entities to give special attention to business relationships and transactions with the DPRK, including DPRK companies, financial institutions, and those acting on their behalf.  In line with UN Security Council Resolution 2270 Operative Paragraph 33, Member States should close existing branches, subsidiaries, and representative offices of DPRK banks within their territories and terminate correspondent relationships with DPRK banks.\n   \n\n\n Further, in June 2019, FATF amended its standards to require all countries regulate and supervise digital asset service providers, including digital currency exchanges, and mitigate against risks when engaging in digital currency transactions. Digital asset service providers should remain alert to changes in customers’ activities, as their business may be used to facilitate money laundering, terrorist financing, and proliferation financing. The United States is particularly concerned about platforms that provide anonymous payment and account service functionality without transaction monitoring, suspicious activity reporting, and customer due diligence, among other obligations.\n   \n\n  \n\n U.S. financial institutions, including foreign\\-located digital asset service providers doing business in whole or substantial part in the United States, and other covered businesses and persons should ensure that they comply with their regulatory obligations under the Bank Secrecy Act (as implemented through the Department of the Treasury’s Financial Crimes Enforcement Network (FinCEN) regulations in 31 CFR Chapter X).  For financial institutions, these obligations include  developing and maintaining effective anti\\-money laundering programs that are reasonably designed to prevent the money services business from being used to facilitate money laundering and the financing of terrorist activities, as well as identifying and reporting suspicious transactions, including those conducted, affected, or facilitated by cyber events or illicit finance involving digital assets, in suspicious activity reporting to FinCEN.\n\n\n#### International Cooperation\n\n\n\n To counter the DPRK’s malicious cyber activities, the United States regularly engages with countries around the world to raise awareness of the DPRK cyber threat by sharing information and evidence via diplomatic, military, law enforcement and judicial, network defense, and other channels.  To hamper the DPRK’s efforts to steal funds through cyber means and to defend against the DPRK’s malicious cyber activities, the United States strongly urges countries to strengthen network defense, shutter DPRK joint ventures in third countries, and expel foreign\\-located North Korean information technology (IT) workers in a manner consistent with applicable international law.  A 2017 UN Security Council resolution required all Member States to repatriate DPRK nationals earning income abroad, including IT workers, by December 22, 2019\\.  The United States also seeks to enhance the capacity of foreign governments and the private sector to understand, identify, defend against, investigate, prosecute, and respond to DPRK cyber threats and participate in international efforts to help ensure the stability of cyberspace.\n \n\n\n### Consequences of Engaging in Prohibited or Sanctionable Conduct\n\n\n\n Individuals and entities engaged in or supporting DPRK cyber\\-related activity, including processing related financial transactions, should be aware of the potential consequences of engaging in prohibited or sanctionable conduct.\n \n\n\n\n The Department of the Treasury’s Office of Foreign Assets Control (OFAC) has the authority to impose sanctions on any person determined to have, among other things:\n \n\n\n* Engaged in significant activities undermining cybersecurity on behalf of the Government of North Korea or the Workers’ Party of Korea;\n* Operated in the information technology (IT) industry in North Korea;\n* Engaged in certain other malicious cyber\\-enabled activities; or\n* Engaged in at least one significant importation from or exportation to North Korea of any goods, services, or technology.\n\n\n\n Additionally, if the Secretary of the Treasury, in consultation with the Secretary of State, determines that a foreign financial institution has knowingly conducted or facilitated significant trade with North Korea, or knowingly conducted or facilitated a significant transaction on behalf of a person designated under a North Korea\\-related Executive Order, or under Executive Order 13382 (Weapons of Mass Destruction Proliferators and Their Supporters) for North Korea\\-related activity, that institution may, among other potential restrictions, lose the ability to maintain a correspondent or payable\\-through account in the United States.\n \n\n\n\n OFAC investigates apparent violations of its sanctions regulations and exercises enforcement authority, as outlined in the Economic Sanctions Enforcement Guidelines, 31 C.F.R. part 501, appendix A. Persons who violate the North Korea Sanctions Regulations, 31 C.F.R. part 510, may face civil monetary penalties of up to the greater of the applicable statutory maximum penalty or twice the value of the underlying transaction.\n \n\n\n\n The 2019 POE mid\\-term report notes the DPRK’s use, and attempted use, of cyber\\-enabled means to steal funds from banks and digital currency exchanges could violate multiple UN Security Council resolutions (UNSCRs) (i.e., UNSCR 1718 operative paragraph (OP) 8(d); UNSCR 2094, OPs 8 and 11; and UNSCR 2270, OP 32\\). The DPRK\\-related UNSCRs also provide various mechanisms for encouraging compliance with DPRK\\-related sanctions imposed by the UN. For example, the UN Security Council 1718 Committee may impose targeted sanctions (i.e., an asset freeze and, for individuals, a travel ban) on any individual or entity who engages in a business transaction with UN\\-designated entities or sanctions evasion.\n \n\n\n\n The Department of Justice criminally prosecutes willful violations of applicable sanctions laws, such as the International Emergency Economic Powers Act, 50 U.S.C. §§ 1701 et seq.  Persons who willfully violate such laws may face up to 20 years of imprisonment, fines of up to $1 million or totaling twice the gross gain, whichever is greater, and forfeiture of all funds involved in such transactions. The Department of Justice also criminally prosecutes willful violations of the Bank Secrecy Act (BSA), 31 U.S.C. §§ 5318 and 5322, which requires financial institutions to, among other things, maintain effective anti\\-money laundering programs and file certain reports with FinCEN. Persons violating the BSA may face up to 5 years imprisonment, a fine of up to $250,000, and potential forfeiture of property involved in the violations. Where appropriate, the Department of Justice will also criminally prosecute corporations and other entities that violate these statutes. The Department of Justice also works with foreign partners to share evidence in support of each other’s criminal investigations and prosecutions.\n \n\n\n\n Pursuant to 31 U.S. Code § 5318(k), the Secretary of the Treasury or the Attorney General may subpoena a foreign financial institution that maintains a correspondent bank account in the United States for records stored overseas. Where the Secretary of the Treasury or Attorney General provides written notice to a U.S. financial institution that a foreign financial institutions has failed to comply with such a subpoena, the U.S. financial institution must terminate the correspondent banking relationship within ten business days. Failure to do so may subject the U.S. financial institutions to daily civil penalties.\n \n\n\n### DPRK Rewards for Justice\n\n\n\n If you have information about illicit DPRK activities in cyberspace, including past or ongoing operations, providing such information through the Department of State’s Rewards for Justice program could make you eligible to receive an award of up to $5 million. For further details, please visit\n [www.rewardsforjustice.net](http://www.rewardsforjustice.net) \n .\n \n\n\n### ANNEX I: USG Public Information on and Resources to Counter the DPRK Cyber Threat\n\n\n\n**Office of the Director of National Intelligence Annual Worldwide Threat Assessments of the U.S. Intelligence Community.** \n In 2019, the U.S. Intelligence Community assessed that the DPRK poses a significant cyber threat to financial institutions, remains a cyber espionage threat, and retains the ability to conduct disruptive cyber attacks. The DPRK continues to use cyber capabilities to steal from financial institutions to generate revenue. Pyongyang’s cybercrime operations include attempts to steal more than $1\\.1 billion from financial institutions across the world – including a successful cyber heist of an estimated $81 million from Bangladesh Bank. The report can be found at\n [https://www.dni.gov/files/ODNI/documents/2019\\-ATA\\-SFR\\-\\-\\-SSCI.pdf](https://www.dni.gov/files/ODNI/documents/2019-ATA-SFR---SSCI.pdf) \n .\n \n\n\n\n**Cybersecurity and Infrastructure Security Agency (CISA) Technical Reports.** \n The U.S. government refers to the malicious cyber activities by the DPRK as HIDDEN COBRA. HIDDEN COBRA reports provide technical details on the tools and infrastructure used by DPRK cyber actors. These reports enable network defenders to identify and reduce exposure to the DPRK’s malicious cyber activities. CISA’s website contains the latest updates on these persistent threats:\n [https://www.us\\-cert.gov/northkorea](https://www.us-cert.gov/northkorea) \n .\n \n\n\n\n Additionally, CISA provides extensive cybersecurity and infrastructure security knowledge and practices to its stakeholders, shares that knowledge to enable better risk management, and puts it into practice to protect the nation’s critical functions. Below are the links to CISA’s resources:\n \n\n\n* Protecting Critical Infrastructure:\n [https://www.cisa.gov/protecting\\-critical\\-infrastructure](https://www.cisa.gov/protecting-critical-infrastructure)\n* Cyber Safety:\n [https://www.cisa.gov/cyber\\-safety](https://www.cisa.gov/cyber-safety)\n* Detection and Prevention:\n [https://www.cisa.gov/detection\\-and\\-prevention](https://www.cisa.gov/detection-and-prevention)\n* Information Sharing:\n [https://www.cisa.gov/information\\-sharing\\-and\\-awareness](https://www.cisa.gov/information-sharing-and-awareness)\n* CISA Insights:\n <https://www.cisa.gov/insights>\n* Combating Cyber Crime:\n [https://www.cisa.gov/combating\\-cyber\\-crime](https://www.cisa.gov/combating-cyber-crime)\n* Cyber Essentials:\n [https://www.cisa.gov/cyber\\-essentials](https://www.cisa.gov/cyber-essentials)\n* Tips:\n [https://www.us\\-cert.gov/ncas/tips](https://www.us-cert.gov/ncas/tips)\n* National Cyber Awareness System:\n [https://www.us\\-cert.gov/ncas](https://www.us-cert.gov/ncas)\n* Industrial Control Systems Advisories:\n [https://www.us\\-cert.gov/ics](https://www.us-cert.gov/ics)\n* Report Incidents, Phishing, Malware, and Vulnerabilities:\n [https://www.us\\-cert.gov/report](https://www.us-cert.gov/report)\n\n\n\n**FBI PIN and FLASH Reports.** \n FBI Private Industry Notifications (PIN) provide current information that will enhance the private sector’s awareness of a potential cyber threat. FBI Liaison Alert System (FLASH) reports contain critical information collected by the FBI for use by specific private sector partners. They are intended to provide recipients with actionable intelligence that help cybersecurity professionals and system administrators to guard against the persistent malicious actions of cyber criminals. If you identify any suspicious activity within your enterprise or have related information, please contact FBI CYWATCH immediately. For DPRK\\-related cyber threat PIN or FLASH reports, contact\n [cywatch@fbi.gov](mailto:cywatch@fbi.gov) \n .\n \n\n\n* FBI Cyber Division:\n <https://www.fbi.gov/investigate/cyber>\n\n\n\n**FBI Legal Attaché Program** \n : The FBI Legal Attaché’s core mission is to establish and maintain liaison with principal law enforcement and security services in designated foreign countries.\n \n\n\n* [https://www.fbi.gov/contact\\-us/legal\\-attache\\-offices](https://www.fbi.gov/contact-us/legal-attache-offices)\n\n\n\n**U.S. Cyber Command Malware Information Release.** \n The Department of Defense’s cyber forces actively seek out DPRK malicious cyber activities, including DPRK malware that exploits financial institutions, conducts espionage, and enables  malicious cyber activities against the U.S. and its partners. U.S. Cyber Command periodically releases malware information, identifying vulnerabilities for industry and government to defend their infrastructure and networks against DPRK illicit activities. Malware information to bolster cybersecurity can be found at the following Twitter accounts: @US\\_CYBERCOM and @CNMF\\_VirusAlert.\n \n\n\n\n**U.S. Department of the Treasury Sanctions Information and Illicit Finance Advisories.\n *The Office of Foreign Assets Control’s***\n***(OFAC’s)***\n online Resource Center provides a wealth of information regarding DPRK sanctions and sanctions with respect to malicious cyber\\-enabled activities, including sanctions advisories, relevant statutes, Executive Orders, rules, and regulations relating to DPRK and cyber\\-related sanctions. OFAC has also published several frequently asked questions (FAQs) relating to DPRK sanctions, cyber\\-related sanctions, and digital currency. For questions or concerns related to OFAC sanctions regulations and requirements, please contact OFAC’s Compliance Hotline at 1\\-800\\-540\\-6322 or\n [OFAC\\_Feedback@treasury.gov](mailto:OFAC_Feedback@treasury.gov) \n .\n \n\n\n* DPRK Sanctions\n\t+ [https://www.treasury.gov/resource\\-center/sanctions/Programs/pages/nkorea.aspx](https://www.treasury.gov/resource-center/sanctions/Programs/pages/nkorea.aspx)\n\t+ FAQs \\-\n\t [https://www.treasury.gov/resource\\-center/faqs/Sanctions/Pages/faq\\_other.aspx\\#nk](https://www.treasury.gov/resource-center/faqs/Sanctions/Pages/faq_other.aspx#nk)\n* Malicious Cyber Activities Sanctions\n\t+ [https://www.treasury.gov/resource\\-center/sanctions/Programs/pages/cyber.aspx](https://www.treasury.gov/resource-center/sanctions/Programs/pages/cyber.aspx)\n\t+ FAQs \\-\n\t [https://www.treasury.gov/resource\\-center/faqs/Sanctions/Pages/faq\\_other.aspx\\#cyber](https://www.treasury.gov/resource-center/faqs/Sanctions/Pages/faq_other.aspx#cyber)\n\t+ FAQs on Virtual Currency \\-\n\t [https://www.treasury.gov/resource\\-center/faqs/Sanctions/Pages/faq\\_compliance.aspx\\#vc\\_faqs](https://www.treasury.gov/resource-center/faqs/Sanctions/Pages/faq_compliance.aspx#vc_faqs)\n\n\n\n***Financial Crimes Enforcement Network (FinCEN)***\n has issued an advisory on North Korea’s use of the international financial system (\n [https://www.fincen.gov/resources/advisories/fincen\\-advisory\\-fin\\-2017\\-a008](https://www.fincen.gov/resources/advisories/fincen-advisory-fin-2017-a008) \n ). FinCEN also issued specific advisories to financial institutions with suspicious activity reporting obligations that provide guidance on when and how to report cybercrime and/or digital currency\\-related criminal activity:\n \n\n\n* Cybercrime\n\t+ [https://www.fincen.gov/resources/advisories/fincen\\-advisory\\-fin\\-2016\\-a005](https://www.fincen.gov/resources/advisories/fincen-advisory-fin-2016-a005)\n* Illicit digital currency activity\n\t+ [https://www.fincen.gov/resources/advisories/fincen\\-advisory\\-fin\\-2019\\-a003](https://www.fincen.gov/resources/advisories/fincen-advisory-fin-2019-a003)\n* Businesses e\\-mail compromise\n\t+ [https://www.fincen.gov/resources/advisories/fincen\\-advisory\\-fin\\-2019\\-a005](https://www.fincen.gov/resources/advisories/fincen-advisory-fin-2019-a005)\n\t+ [https://www.fincen.gov/resources/advisories/fincen\\-advisory\\-fin\\-2016\\-a003](https://www.fincen.gov/resources/advisories/fincen-advisory-fin-2016-a003)\n\n\n\n***Federal Financial Institutions Examination Council (FFIEC)***\n developed the Cybersecurity Assessment Tool to help financial institutions identify their risks and determine their cybersecurity preparedness. The assessment tool can be found at\n <https://www.ffiec.gov/cyberassessmenttool.htm>\n .\n \n\n\n### ANNEX II: UN Panel of Experts Reports on the DPRK Cyber Threat\n\n\n\n UN 1718 Sanctions Committee (DPRK) Panel of Experts Reports. The UN Security Council 1718 Sanctions Committee on the DPRK is supported by a Panel of Experts, who “gather, examine, and analyze information” from UN Member States, relevant UN bodies, and other parties on the implementation of the measures outlined in the UN Security Council Resolutions against North Korea. The Panel also makes recommendations on how to improve sanctions implementation by providing both a Midterm and a Final Report to the 1718 Committee. These reports can be found at\n <https://www.un.org/securitycouncil/sanctions/1718/panel_experts/reports>\n .\n \n\n\n\n### References\n\n\n\n\n[\\[1] FATF Call to Action on North Korea](https://www.fatf-gafi.org/publications/high-risk-and-other-monitored-jurisdictions/documents/call-for-action-february-2020.html) \n\n\n### Revisions\n\n\n\n\n April 15, 2020: Initial Version\\|April 30, 2020: Added PDF versions of this report in Arabic, French, Japanese, Korean, Portuguese, Spanish, and traditional Chinese.\\|June 16, 2020: Added PDF version of this report in Vietnamese.\n \n\n\n\n\n\n\n\n\n\n\n This product is provided subject to this\n [Notification](/notification \"Follow link\") \n and this\n [Privacy \\& Use](/privacy-policy \"Follow link\") \n policy.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease share your thoughts\n--------------------------\n\n\n\n We recently updated our anonymous\n [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa20-106a) \n ; we’d welcome your feedback.\n \n\n\n\n\n\n\n\n\n\n\n\n\nRelated Advisories\n------------------\n\n\n\n\n\n\n\n\n\n\n Jul 11, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-193A\n \n\n### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a)\n\n\n\n\n\n\n\n\n\n\n\n Jul 08, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-190A\n \n\n### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a)\n\n\n\n\n\n\n\n\n\n\n\n May 10, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-131A\n \n\n### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a)\n\n\n\n\n\n\n\n\n\n\n\n Apr 18, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-109A\n \n\n### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Return to top](#) \n\n\n\n\n* [Topics](/topics)\n* [Spotlight](/spotlight)\n* [Resources \\& Tools](/resources-tools)\n* [News \\& Events](/news-events)\n* [Careers](/careers)\n* [About](/about)\n\n\n\n\n\n\n\n\n[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")\n\n\n* [Facebook](https://www.facebook.com/CISA)\n* [Twitter](https://twitter.com/CISAgov)\n* [LinkedIn](https://www.linkedin.com/company/cybersecurity-and-infrastructure-security-agency)\n* [YouTube](https://www.youtube.com/@cisagov)\n* [Instagram](https://www.instagram.com/cisagov)\n* [RSS](/subscribe-updates-cisa)\n\n\n\n\n CISA Central\n \n[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) \n[SayCISA@cisa.gov](mailto:SayCISA@cisa.gov) \n\n\n\n\n\n\n\n\n\n\n\n DHS Seal\n \n\n\n CISA.gov\n \n\n An official website of the U.S. Department of Homeland Security\n \n\n\n* [About CISA](/about \"About CISA\")\n* [Budget and Performance](https://www.dhs.gov/performance-financial-reports \"Budget and Performance\")\n* [DHS.gov](https://www.dhs.gov \"Department of Homeland Security\")\n* [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")\n* [FOIA Requests](https://www.dhs.gov/foia \"FOIA Requests\")\n* [No FEAR Act](/no-fear-act \"No FEAR Act Reporting\")\n* [Office of Inspector General](https://www.oig.dhs.gov/ \"Office of Inspector General\")\n* [Privacy Policy](/privacy-policy \"Privacy Policy\")\n* [Subscribe](https://public.govdelivery.com/accounts/USDHSCISA/subscriber/new?topic_id=USDHSCISA_138 \"Subscribe to Email Updates\")\n* [The White House](https://www.whitehouse.gov/ \"The White House\")\n* [USA.gov](https://www.usa.gov/ \"USA.gov\")\n* [Website Feedback](/forms/feedback \"Website Feedback\")\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "cves": [], "techniques": [], "advisory": "aa20-106a", "title": "Guidance on the North Korean Cyber Threat | CISA", "source": "cybersecurity-advisories", "id": "b0ebb50bbb086f58fdc25bf26ec66ee9ccab1e924d2f24ae5956b58c74c6db12"}