{
  "markdown": "\n\nSummary\n\nThis Alert uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework. See the ATT&CK for Enterprise framework for all referenced threat actor techniques.\nThis product was written by the Cybersecurity and Infrastructure Security Agency (CISA) and the Multi-State Information Sharing & Analysis Center (MS-ISAC).\nEmotet—a sophisticated Trojan commonly functioning as a downloader or dropper of other malware—resurged in July 2020, after a dormant period that began in February. Since August, CISA and MS-ISAC have seen a significant increase in malicious cyber actors targeting state and local governments with Emotet phishing emails. This increase has rendered Emotet one of the most prevalent ongoing threats.\nTo secure against Emotet, CISA and MS-ISAC recommend implementing the mitigation measures described in this Alert, which include applying protocols that block suspicious attachments, using antivirus software, and blocking suspicious IPs.\n\nTechnical Details\n\nEmotet is an advanced Trojan primarily spread via phishing email attachments and links that, once clicked, launch the payload (Phishing: Spearphishing Attachment [T1566.001], Phishing: Spearphishing Link [T1566.002]).The malware then attempts to proliferate within a network by brute forcing user credentials and writing to shared drives (Brute Force: Password Guessing [T1110.001], Valid Accounts: Local Accounts [T1078.003], Remote Services: SMB/Windows Admin Shares [T1021.002]).\nEmotet is difficult to combat because of its “worm-like” features that enable network-wide infections. Additionally, Emotet uses modular Dynamic Link Libraries to continuously evolve and update its capabilities.\nSince July 2020, CISA has seen increased activity involving Emotet-associated indicators. During that time, CISA’s EINSTEIN Intrusion Detection System, which protects federal, civilian executive branch networks, has detected roughly 16,000 alerts related to Emotet activity. CISA observed Emotet being executed in phases during possible targeted campaigns. Emotet used compromised Word documents (.doc) attached to phishing emails as initial insertion vectors. Possible command and control network traffic involved HTTP POST requests to Uniform Resource Identifiers consisting of nonsensical random length alphabetical directories to known Emotet-related domains or IPs with the following user agent string (Application Layer Protocol: Web Protocols [T1071.001]).\nMozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; WOW64; Trident/7.0; SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; Media Center PC 6.0; .NET4.0C; .NET4.0E; InfoPath.3; .NET CLR\nTraffic to known Emotet-related domains or IPs occurred most commonly over ports 80, 8080, and 443. In one instance, traffic from an Emotet-related IP attempted to connect to a suspected compromised site over port 445, possibly indicating the use of Server Message Block exploitation frameworks along with Emotet (Exploitation of Remote Services [T1210]). Figure 1 lays out Emotet’s use of enterprise techniques.\n \n​\nFigure 1: MITRE ATT&CK enterprise techniques used by Emotet\n \nTimeline of Activity\nThe following timeline identifies key Emotet activity observed in 2020.\n\nFebruary: Cybercriminals targeted non-U.S. countries using COVID-19-themed phishing emails to lure victims to download Emotet.[1]\n\n\nJuly: Researchers spotted emails with previously used Emotet URLs, particularly those used in the February campaign, targeting U.S. businesses with COVID-19-themed lures.[2]\n\n\nAugust:\n\nSecurity researchers observed a 1,000 percent increase in downloads of the Emotet loader. Following this change, antivirus software firms adjusted their detection heuristics to compensate, leading to decreases in observed loader downloads.[3]  \nProofpoint researchers noted mostly minimal changes in most tactics and tools previously used with Emotet. Significant changes included:\n\nEmotet delivering Qbot affiliate partner01 as the primary payload and\nThe Emotet mail sending module’s ability to deliver benign and malicious attachments.[4]\n\n\nCISA and MS-ISAC observed increased attacks in the United States, particularly cyber actors using Emotet to target state and local governments.\n\n\n\n\nSeptember:\n\nCyber agencies and researchers alerted the public of surges of Emotet, including compromises in Canada, France, Japan, New Zealand, Italy, and the Netherlands. Emotet botnets were observed dropping Trickbot to deliver ransomware payloads against some victims and Qakbot Trojans to steal banking credentials and data from other targets.[5],[6],[7],[8]\nSecurity researchers from Microsoft identified a pivot in tactics from the Emotet campaign. The new tactics include attaching password-protected archive files (e.g., Zip files) to emails to bypass email security gateways. These email messages purport to deliver documents created on mobile devices to lure targeted users into enabling macros to “view” the documents—an action which actually enables the delivery of malware.[9]\nPalo Alto Networks reported cyber actors using thread hijacking to spread Emotet. This attack technique involves stealing an existing email chain from an infected host to reply to the chain—using a spoofed identity—and attaching a malicious document to trick recipients into opening the file.[10]\n\n\n\nMITRE ATT&CK Techniques\nAccording to MITRE, Emotet uses the ATT&CK techniques listed in table 1.\nTable 1: Common exploit tools\n\n\n\n\nTechnique\n\nUse\n\n\n\n\n\nOS Credential Dumping: LSASS Memory [T1003.001]\n\n\nEmotet has been observed dropping password grabber modules including Mimikatz.\n\n\n\n\nRemote Services: SMB/Windows Admin Shares [T1021.002]\n\n\nEmotet leverages the Admin$ share for lateral movement once the local admin password has been brute forced.\n\n\n\n\nObfuscated Files or Information [T1027]\n\n\nEmotet has obfuscated macros within malicious documents to hide the URLs hosting the malware, cmd.exe arguments, and PowerShell scripts.\n\n\n\n\nObfuscated Files or Information: Software Packing [T1027.002]\n\n\nEmotet has used custom packers to protect its payloads.\n\n\n\n\nNetwork Sniffing [T1040]\n\n\nEmotet has been observed to hook network APIs to monitor network traffic.\n\n\n\n\nExfiltration Over C2 Channel [T1041]\n\n\nEmotet has been seen exfiltrating system information stored within cookies sent within a HTTP GET request back to its command and control (C2) servers.\n\n\n\n\nWindows Management Instrumentation [T1047]\n\n\nEmotet has used WMI to execute powershell.exe.\n\n\n\n\nProcess Injection: Dynamic-link Library Injection [T1055.001]\n\n\nEmotet has been observed injecting in to Explorer.exe and other processes.\n\n\n\n\nProcess Discovery [T1057]\n\n\nEmotet has been observed enumerating local processes.\n\n\n\n\nCommand and Scripting Interpreter: PowerShell [T1059.001]\n\n\nEmotet has used Powershell to retrieve the malicious payload and download additional resources like Mimikatz.\n\n\n\n\nCommand and Scripting Interpreter: Windows Command Shell [T1059.003]\n\n\nEmotet has used cmd.exe to run a PowerShell script.\n\n\n\n\nCommand and Scripting Interpreter: Visual Basic [T1059.005]\n\n\nEmotet has sent Microsoft Word documents with embedded macros that will invoke scripts to download additional payloads.\n\n\n\n\nValid Accounts: Local Accounts [T1078.003]\n\n\nEmotet can brute force a local admin password, then use it to facilitate lateral movement.\n\n\n\n\nAccount Discovery: Email Account [T1087.003]\n\n\nEmotet has been observed leveraging a module that can scrape email addresses from Outlook.\n\n\n\n\nBrute Force: Password Guessing [T1110.001]\n\n\nEmotet has been observed using a hard-coded list of passwords to brute force user accounts.\n\n\n\n\nEmail Collection: Local Email Collection [T1114.001]\n\n\nEmotet has been observed leveraging a module that scrapes email data from Outlook.\n\n\n\n\nUser Execution: Malicious Link [T1204.001]\n\n\nEmotet has relied upon users clicking on a malicious link delivered through spearphishing.\n\n\n\n\nUser Execution: Malicious File [T1204.002]\n\n\nEmotet has relied upon users clicking on a malicious attachment delivered through spearphishing.\n\n\n\n\nExploitation of Remote Services [T1210]\n\n\nEmotet has been seen exploiting SMB via a vulnerability exploit like ETERNALBLUE (MS17-010) to achieve lateral movement and propagation.\n\n\n\n\nCreate or Modify System Process: Windows Service [T1543.003]\n\n\nEmotet has been observed creating new services to maintain persistence.\n\n\n\n\nBoot or Logon Autostart Execution: Registry Run Keys / Startup Folder [T1547.001]\n\n\nEmotet has been observed adding the downloaded payload to the HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run key to maintain persistence.\n\n\n\n\nScheduled Task/Job: Scheduled Task [T1053.005]\n\n\nEmotet has maintained persistence through a scheduled task.\n\n\n\n\nUnsecured Credentials: Credentials In Files [T1552.001]\n\n\nEmotet has been observed leveraging a module that retrieves passwords stored on a system for the current logged-on user.\n\n\n\n\nCredentials from Password Stores: Credentials from Web Browsers [T1555.003]\n\n\nEmotet has been observed dropping browser password grabber modules.\n\n\n\n\nArchive Collected Data [T1560]\n\n\nEmotet has been observed encrypting the data it collects before sending it to the C2 server.\n\n\n\n\nPhishing: Spearphishing Attachment [T1566.001]\n\n\nEmotet has been delivered by phishing emails containing attachments.\n\n\n\n\nPhishing: Spearphishing Link [T1566.002]\n\n\nEmotet has been delivered by phishing emails containing links.\n\n\n\n\nNon-Standard Port [T1571]\n\n\nEmotet has used HTTP over ports such as 20, 22, 7080, and 50000, in addition to using ports commonly associated with HTTP/Hypertext Transfer Protocol Secure.\n\n\n\n\nEncrypted Channel: Asymmetric Cryptography [T1573.002]\n\n\nEmotet is known to use RSA keys for encrypting C2 traffic.\n\n\n\n\nDetection\nSignatures\nMS-ISAC developed the following Snort signature for use in detecting network activity associated with Emotet activity.\nalert tcp $HOME_NET any -> $EXTERNAL_NET 443 (msg:\"[CIS] Emotet C2 Traffic Using Form Data to Send Passwords\"; content:\"POST\"; http_method; content:\"Content-Type|3a 20|multipart/form-data|3b 20|boundary=\"; http_header; fast_pattern; content:\"Content-Disposition|3a 20|form-data|3b 20|name=|22|\"; http_client_body; content:!\"------WebKitFormBoundary\"; http_client_body; content:!\"Cookie|3a|\"; pcre:\"/:?(chrome|firefox|safari|opera|ie|edge) passwords/i\"; reference:url,cofense.com/flash-bulletin-emotet-epoch-1-changes-c2-communication/; sid:1; rev:2;)\nCISA developed the following Snort signatures for use in detecting network activity associated with Emotet activity. Note: Uniform Resource Identifiers should contain a random length alphabetical multiple directory string, and activity will likely be over ports 80, 8080, or 443.\nalert tcp any any -> any $HTTP_PORTS (msg:\"EMOTET:HTTP URI GET contains '/wp-content/###/'\"; sid:00000000; rev:1; flow:established,to_server; content:\"/wp-content/\"; http_uri; content:\"/\"; http_uri; distance:0; within:4; content:\"GET\"; nocase; http_method; urilen:<17; classtype:http-uri; content:\"Connection|3a 20|Keep-Alive|0d 0a|\"; http_header; metadata:service http;)\nalert tcp any any -> any $HTTP_PORTS (msg:\"EMOTET:HTTP URI GET contains '/wp-admin/###/'\"; sid:00000000; rev:1; flow:established,to_server; content:\"/wp-admin/\"; http_uri; content:\"/\"; http_uri; distance:0; within:4; content:\"GET\"; nocase; http_method; urilen:<15; content:\"Connection|3a 20|Keep-Alive|0d 0a|\"; http_header; classtype:http-uri; metadata:service http;)\n\nMitigations\n\nCISA and MS-ISAC recommend that network defenders—in federal, state, local, tribal, territorial governments, and the private sector—consider applying the following best practices to strengthen the security posture of their organization's systems. System owners and administrators should review any configuration changes prior to implementation to avoid unwanted impacts.\n\nBlock email attachments commonly associated with malware (e.g.,.dll and .exe).\nBlock email attachments that cannot be scanned by antivirus software (e.g., .zip files).\nImplement Group Policy Object and firewall rules.\nImplement an antivirus program and a formalized patch management process.\nImplement filters at the email gateway, and block suspicious IP addresses at the firewall.\nAdhere to the principle of least privilege.\nImplement a Domain-Based Message Authentication, Reporting & Conformance validation system.\nSegment and segregate networks and functions.\nLimit unnecessary lateral communications.\nDisable file and printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nEnforce multi-factor authentication.\nExercise caution when opening email attachments, even if the attachment is expected and the sender appears to be known. See Using Caution with Email Attachments.\nEnable a firewall on agency workstations, configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious email attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to suspicious or risky sites.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs).\nScan all software downloaded from the internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate access control lists.\nVisit the MITRE ATT&CK Techniques pages (linked in table 1 above) for additional mitigation and detection strategies.\nSee CISA’s Alert on Technical Approaches to Uncovering and Remediating Malicious Activity for more information on addressing potential incidents and applying best practice incident response procedures.\nSee the joint CISA and MS-ISAC Ransomware Guide on how to be proactive and prevent ransomware attacks from happening and for a detailed approach on how to respond to an attack and best resolve the cyber incident.\n\nFor additional information on malware incident prevention and handling, see the National Institute of Standards and Technology Special Publication 800-83, Guide to Malware Incident Prevention and Handling for Desktops and Laptops.\nResources\n\nMS-ISAC Security Event Primer – Emotet\nCISA Alert TA18-201A – Emotet Malware\nMITRE ATT&CK – Emotet\nMITRE ATT&CK for Enterprise\n\n\nReferences\n\n[1] Bleeping Computer: Emotet Malware Strikes U.S. Businesses with COVID-19 Spam\n[2] IBID\n[3] Security Lab: Emotet Update Increases Downloads\n[4] Proofpoint: A Comprehensive Look at Emotet’s Summer 2020 Return\n[5] ZDNet: France, Japan, New Zealand Warn of Sudden Strike in Emotet Attacks\n[6] Bleeping Computer: France Warns of Emotet Attacking Companies, Administration\n[7] ESET: Emotet Strikes Quebec’s Department of Justice: An ESET Analysis\n[8] ZDNet: Microsoft, Italy, and the Netherlands Warn of Increased Emotet Activity\n[9] Bleeping Computer: Emotet Double Blunder: Fake ‘Windows 10 Mobile’ and Outdated Messages\n[10] Palo Alto Networks: Case Study: Emotet Thread Hijacking, an Email Attack Technique\n\nRevisions\n\nOctober 6, 2020: Initial Version\n",
  "cves": [],
  "techniques": [
    "T1204.002",
    "T1059.005",
    "T1552.001",
    "T1055.001",
    "T1053.005",
    "T1566.002",
    "T1566.001",
    "T1547.001",
    "T1573.002",
    "T1027.002",
    "T1059.001",
    "T1114.001",
    "T1071.001",
    "T1110.001",
    "T1087.003",
    "T1021.002",
    "T1555.003",
    "T1003.001",
    "T1204.001",
    "T1059.003",
    "T1543.003",
    "T1078.003"
  ],
  "advisory": "aa20-280a",
  "title": "Emotet Malware | CISA",
  "source": "cybersecurity-advisories",
  "id": "99b91bed8e87460690b73b00028c54caa16b307f97aaa81c6f5f195fe1a34d33"
}