{
  "markdown": "\n\nSummary\n\nUnpatched Pulse Secure VPN servers continue to be an attractive target for malicious actors. Affected organizations that have not applied the software patch to fix an arbitrary file reading vulnerability, known as CVE-2019-11510, can become compromised in an attack. [1]\nAlthough Pulse Secure [2] disclosed the vulnerability and provided software patches for the various affected products in April 2019, the Cybersecurity and Infrastructure Security Agency (CISA) continues to observe wide exploitation of CVE-2019-11510. [3] [4] [5]\nCISA expects to see continued attacks exploiting unpatched Pulse Secure VPN environments and strongly urges users and administrators to upgrade to the corresponding fixes. [6]\nTimelines of Specific Events\n\nApril 24, 2019 – Pulse Secure releases initial advisory and software updates addressing multiple vulnerabilities.\nMay 28, 2019 – Large commercial vendors get reports of vulnerable VPN through HackerOne.\nJuly 31, 2019 – Full use of exploit demonstrated using the admin session hash to get complete shell.\nAugust 8, 2019 – Meh Chang and Orange Tsai demonstrate the VPN issues across multiple vendors (Pulse Secure) with detailed attack on active VPN exploitation.\nAugust 24, 2019 – Bad Packets identifies over 14,500 vulnerable VPN servers globally still unpatched and in need of an upgrade.\nOctober 7, 2019 – The National Security Agency (NSA) produces a Cybersecurity Advisory on Pulse Secure and other VPN products being targeted actively by advanced persistent threat actors.\nOctober 16, 2019 – The CERT Coordination Center (CERT/CC) releases Vulnerability Note VU#927237: Pulse Secure VPN contains multiple vulnerabilities.\nJanuary 2020 – Media reports cybercriminals now targeting unpatched Pulse Secure VPN servers to install REvil (Sodinokibi) ransomware.   \n\n\nTechnical Details\n\nImpact\nA remote, unauthenticated attacker may be able to compromise a vulnerable VPN server. The attacker may be able to gain access to all active users and their plain-text credentials. It may also be possible for the attacker to execute arbitrary commands on each VPN client as it successfully connects to the VPN server.\nAffected versions:\n\nPulse Connect Secure 9.0R1 - 9.0R3.3\nPulse Connect Secure 8.3R1 - 8.3R7\nPulse Connect Secure 8.2R1 - 8.2R12\nPulse Connect Secure 8.1R1 - 8.1R15\nPulse Policy Secure 9.0R1 - 9.0R3.1\nPulse Policy Secure 5.4R1 - 5.4R7\nPulse Policy Secure 5.3R1 - 5.3R12\nPulse Policy Secure 5.2R1 - 5.2R12\nPulse Policy Secure 5.1R1 - 5.1R15\n\n\nMitigations\n\nThis vulnerability has no viable workarounds except for applying the patches provided by the vendor and performing required system updates.\nCISA strongly urges users and administrators to upgrade to the corresponding fixes. [7]\n\nReferences\n\n[1] NIST NVD CVE-2019-11510 \n[2] Pulse Secure Advisory SA44101\n[3] CERT/CC Vulnerability Note VU#927237\n[4] CISA Current Activity Vulnerabilities in Multiple VPN Applications \n[5] CISA Current Activity Multiple Vulnerabilities in Pulse Secure VPN\n[6] Pulse Secure Advisory SA44101\n[7] Pulse Secure Advisory SA44101\n\nRevisions\n\nJanuary 10, 2020: Initial Version|April 15, 2020: Revised to correct type of vulnerability\n",
  "cves": [
    "CVE-2019-11510"
  ],
  "techniques": [],
  "advisory": "aa20-010a",
  "title": "Continued Exploitation of Pulse Secure VPN Vulnerability | CISA",
  "source": "cybersecurity-advisories",
  "id": "11b05bbca2637d575a194d8c73610174b9a2647c5d8f7d4736c789c9b7613bf5"
}