{
  "markdown": "\n\nSummary\n\nThis Alert uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework. See the ATT&CK for Enterprise frameworks for all referenced threat actor techniques.\nThis product was written by the Cybersecurity and Infrastructure Security Agency (CISA) with contributions by the Multi-State Information Sharing & Analysis Center (MS-ISAC).\nCISA has observed a notable increase in the use of LokiBot malware by malicious cyber actors since July 2020. Throughout this period, CISA’s EINSTEIN Intrusion Detection System, which protects federal, civilian executive branch networks, has detected persistent malicious LokiBot activity. LokiBot uses a credential- and information-stealing malware, often sent as a malicious attachment and known for being simple, yet effective, making it an attractive tool for a broad range of cyber actors across a wide variety of data compromise use cases.\n\nTechnical Details\n\nLokiBot—also known as Lokibot, Loki PWS, and Loki-bot—employs Trojan malware to steal sensitive information such as usernames, passwords, cryptocurrency wallets, and other credentials.\n\nThe malware steals credentials through the use of a keylogger to monitor browser and desktop activity (Credentials from Password Stores [T1555]).\n\n(Credentials from Password Stores: Credentials from Web Browsers [T1555.003])\n(Input Capture: Keylogging [T1056.001])\n\n\nLokiBot can also create a backdoor into infected systems to allow an attacker to install additional payloads (Event Triggered Execution: Accessibility Features [T1546.008]).\nMalicious cyber actors typically use LokiBot to target Windows and Android operating systems and distribute the malware via email, malicious websites, text, and other private messages (User Execution: Malicious File [T1204.002]). See figure 1 for enterprise techniques used by LokiBot.\n\n​\nFigure 1: MITRE ATT&CK enterprise techniques used by LokiBot\nSince LokiBot was first reported in 2015, cyber actors have used it across a range of targeted applications, including the following.\n\nFebruary 2020: Trend Micro identified cyber actors using LokiBot to impersonate a launcher for Fortnite—a popular video game.[1]\nAugust 2019: FortiGuard SE researchers discovered a malspam campaign distributing LokiBot information-stealing payloads in spearphishing attack on a U.S. manufacturing company.[2]\nAugust 2019: Trend Micro researchers reported LokiBot malware source code being hidden in image files spread as attachments in phishing emails.[3]\nJune 2019: Netskope uncovered LokiBot being distributed in a malspam campaign using ISO image file attachments.[4]\nApril 2019: Netskope uncovered a phishing campaign using malicious email attachments with LokiBot malware to create backdoors onto infected Windows systems and steal sensitive information.[5]\nFebruary 2018: Trend Micro discovered CVE-2017-11882 being exploited in an attack using Windows Installer service to deliver LokiBot malware.[6]\nOctober 2017: SfyLabs identified cyber actors using LokiBot as an Android banking trojan that turns into ransomware.[7]\nMay 2017: Fortinet reported malicious actors using a PDF file to spread a new LokiBot variant capable of stealing credentials from more than 100 different software tools.[8]\nMarch 2017: Check Point discovered LokiBot malware found pre-installed on Android devices.[9]\nDecember 2016: Dr.Web researchers identified a new LokiBot variant targeting Android core libraries.[10]\nFebruary 2016: Researchers discovered the LokiBot Android Trojan infecting the core Android operating system processes.[11]\n\nMITRE ATT&CK Techniques\nAccording to MITRE, LokiBot uses the ATT&CK techniques listed in table 1.\nTable 1: LokiBot ATT&CK techniques \n\n\n\n\nTechnique\n\n\nUse\n\n\n\n\n\n\nSystem Network Configuration Discovery [T1016]\n\n\nLokiBot has the ability to discover the domain name of the infected host.\n\n\n\n\nObfuscated Files or Information [T1027]\n\n\nLokiBot has obfuscated strings with base64 encoding.\n\n\n\n\nObfuscated Files or Information: Software Packing [T1027.002]\n\n\nLokiBot has used several packing methods for obfuscation.\n\n\n\n\nSystem Owner/User Discovery [T1033]\n\n\nLokiBot has the ability to discover the username on the infected host.\n\n\n\n\nExfiltration Over C2 Channel [T1041]\n\n\nLokiBot has the ability to initiate contact with command and control to exfiltrate stolen data.\n\n\n\n\nProcess Injection: Process Hollowing [T1055.012]\n\n\nLokiBot has used process hollowing to inject into legitimate Windows process vbc.exe.\n\n\n\n\nInput Capture: Keylogging [T1056.001]\n\n\nLokiBot has the ability to capture input on the compromised host via keylogging.\n\n\n\n\nApplication Layer Protocol: Web Protocols [T1071.001]\n\n\nLokiBot has used Hypertext Transfer Protocol for command and control.\n\n\n\n\nSystem Information Discovery [T1082]\n\n\nLokiBot has the ability to discover the computer name and Windows product name/version.\n\n\n\n\nUser Execution: Malicious File [T1204.002]\n\n\nLokiBot has been executed through malicious documents contained in spearphishing emails.\n\n\n\n\nCredentials from Password Stores [T1555]\n\n\nLokiBot has stolen credentials from multiple applications and data sources including Windows operating system credentials, email clients, File Transfer Protocol, and Secure File Transfer Protocol clients.\n\n\n\n\nCredentials from Password Stores: Credentials from Web Browsers [T1555.003]\n\n\nLokiBot has demonstrated the ability to steal credentials from multiple applications and data sources including Safari and Chromium and Mozilla Firefox-based web browsers.\n\n\n\n\nHide Artifacts: Hidden Files and Directories [T1564.001]\n\n\nLokiBot has the ability to copy itself to a hidden file and directory.\n\n\n\n\nDetection\nSignatures\nCISA developed the following Snort signature for use in detecting network activity associated with LokiBot activity.\nalert tcp any any -> any $HTTP_PORTS (msg:\"Lokibot:HTTP URI POST contains '/*/fre.php' post-infection\"; flow:established,to_server; flowbits:isnotset,.tagged; content:\"/fre.php\"; http_uri; fast_pattern:only; urilen:<50,norm; content:\"POST\"; nocase; http_method; pcre:\"/\\/(?:alien|loky\\d|donep|jemp|lokey|new2|loki|Charles|sev7n|dbwork|scroll\\/NW|wrk|job|five\\d?|donemy|animation\\dkc|love|Masky|v\\d|lifetn|Ben)\\/fre\\.php$/iU\"; flowbits:set,.tagged;classtype:http-uri; metadata:service http; metadata:pattern HTTP-P001,)\n\nMitigations\n\nCISA and MS-ISAC recommend that federal, state, local, tribal, territorial government, private sector users, and network administrators consider applying the following best practices to strengthen the security posture of their organization's systems. System owners and administrators should review any configuration changes prior to implementation to avoid unwanted impacts.\n\nMaintain up-to-date antivirus signatures and engines. See Protecting Against Malicious Code.\nKeep operating system patches up to date. See Understanding Patches and Software Updates.\nDisable file and printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nEnforce multi-factor authentication. See Supplementing Passwords for more information.\nRestrict users' ability (permissions) to install and run unwanted software applications. Do not add users to the local administrators’ group unless required.\nEnforce a strong password policy. See Choosing and Protecting Passwords.\nExercise caution when opening email attachments, even if the attachment is expected and the sender appears to be known. See Using Caution with Email Attachments.\nEnable a personal firewall on agency workstations, configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious email attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to sites with unfavorable content.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs).\nScan all software downloaded from the internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate access control lists.\nVisit the MITRE ATT&CK Techniques pages (linked in table 1 above) for additional mitigation and detection strategies.\n\nFor additional information on malware incident prevention and handling, see the National Institute of Standards and Technology Special Publication 800-83, Guide to Malware Incident Prevention and Handling for Desktops and Laptops.\nResources\nCenter for Internet Security Security Event Primer – Malware: https://www.cisecurity.org/white-papers/security-event-primer-malware/\nMITRE ATT&CK – LokiBot: https://attack.mitre.org/software/S0447/\nMITRE ATT&CK for Enterprise: https://attack.mitre.org/matrices/enterprise/\n\nReferences\n\n[1] Trend Micro: LokiBot Impersonates Popular Game Launcher and Drops Compiled C# Code File \n[2] Fortinet: Newly Discovered Infostealer Attack Uses LokiBot \n[3] ZDNet: LokiBot Malware Now Hides its Source Code in Image Files\n[4] SecurityWeek: LokiBot and NanoCore Malware Distributed in ISO Image Files\n[5] Netskope: LokiBot & NanoCore being distributed via ISO disk image files \n[6] Trend Micro: Attack Using Windows Installer Leads to LokiBot\n[7] BleepingComputer: LokiBot Android Banking Trojan Turns Into Ransomware When You Try to Remove It\n[8] Fortinet: New Loki Variant Being Spread via PDF File\n[9] Check Point: Preinstalled Malware Targeting Mobile Users\n[10] BleepingComputer: Loki Trojan Infects Android Libraries and System Process to Get Root Privileges\n[11] New Jersey Cybersecurity & Communications Integration Cell: LokiBot  \n\nRevisions\n\nSeptember 22, 2020: Initial Version|September 23, 2020: Added hyperlink to MS-ISAC\n",
  "cves": [
    "CVE-2017-11882"
  ],
  "techniques": [
    "T1204.002",
    "T1546.008",
    "T1055.012",
    "T1555.003",
    "T1056.001",
    "T1071.001",
    "T1027.002",
    "T1564.001"
  ],
  "advisory": "aa20-266a",
  "title": "LokiBot Malware | CISA",
  "source": "cybersecurity-advisories",
  "id": "2e0dd381636726c4f1513f3247281c05b59e78fc88988f5a01471f468e86a8fa"
}