{
  "markdown": "\n\nSummary\n\nAs organizations prepare for possible impacts of Coronavirus Disease 2019 (COVID-19), many may consider alternate workplace options for their employees. Remote work options—or telework—require an enterprise virtual private network (VPN) solution to connect employees to an organization’s information technology (IT) network. As organizations elect to implement telework, the Cybersecurity and Infrastructure Security Agency (CISA) encourages organizations to adopt a heightened state of cybersecurity.\n\nTechnical Details\n\nThe following are cybersecurity considerations regarding telework.\n\nAs organizations use VPNs for telework, more vulnerabilities are being found and targeted by malicious cyber actors.\nAs VPNs are 24/7, organizations are less likely to keep them updated with the latest security updates and patches.\nMalicious cyber actors may increase phishing emails targeting teleworkers to steal their usernames and passwords.\nOrganizations that do not use multi-factor authentication (MFA) for remote access are more susceptible to phishing attacks.\nOrganizations may have a limited number of VPN connections, after which point no other employee can telework. With decreased availability, critical business operations may suffer, including IT security personnel’s ability to perform cybersecurity tasks.\n\n\nMitigations\n\nCISA encourages organizations to review the following recommendations when considering alternate workplace options.\n\nUpdate VPNs, network infrastructure devices, and devices being used to remote into work environments with the latest software patches and security configurations. See CISA Tips Understanding Patches and Securing Network Infrastructure Devices.\nAlert employees to an expected increase in phishing attempts. See CISA Tip Avoiding Social Engineering and Phishing Attacks.\nEnsure IT security personnel are prepared to ramp up the following remote access cybersecurity tasks: log review, attack detection, and incident response and recovery. Per the National Institute of Standards and Technology (NIST) Special Publication 800-46 v.2, Guide to Enterprise Telework, Remote Access, and Bring Your Own Device (BYOD) Security, these tasks should be documented in the configuration management policy.\nImplement MFA on all VPN connections to increase security. If MFA is not implemented, require teleworkers to use strong passwords. (See CISA Tips Choosing and Protecting Passwords and Supplementing Passwords for more information.)\nEnsure IT security personnel test VPN limitations to prepare for mass usage and, if possible, implement modifications—such as rate limiting—to prioritize users that will require higher bandwidths.\nContact CISA to report incidents, phishing, malware, and other cybersecurity concerns.\n\n\nReferences\n\nNIST Special Publication 800-46 v.2, Guide to Enterprise Telework, Remote Access, and Bring Your Own Device (BYOD) Security\nCISA Cyber Essentials\nCERT/CC: VPN - A Gateway for Vulnerabilities\nNational Security Agency Cybersecurity Advisory: Mitigating Recent VPN Vulnerabilities\nCISA Insights: Risk Management for Novel Coronavirus (COVID-19)\nTelework.gov Guidance\n\nRevisions\n\nMarch 13, 2020: Initial Version\n",
  "cves": [],
  "techniques": [],
  "advisory": "aa20-073a",
  "title": "Enterprise VPN Security | CISA",
  "source": "cybersecurity-advisories",
  "id": "30c4eb674f492bc54a54a7d4063e71f141d5a3334add3cef33e2e8eadb86c615"
}