{
  "markdown": "\n\nSummary\n\nNote: As of January 24, 2020, Citrix has released all expected updates in response to CVE-2019-19781.[1] \nOn January 19, 2020, Citrix released firmware updates for Citrix Application Delivery Controller (ADC) and Citrix Gateway versions 11.1 and 12.0.\nOn January 22, 2020, Citrix released security updates for vulnerable SD-WAN WANOP appliances.\nOn January 23, 2020, Citrix released firmware updates for Citrix ADC and Gateway versions 12.1 and 13.0.\nOn January 24, 2020, Citrix released firmware updates for Citrix ADC and Gateway version 10.5.\nA remote, unauthenticated attacker could exploit CVE-2019-19781 to perform arbitrary code execution.[2] This vulnerability has been detected in exploits in the wild.[3]\nThe Cybersecurity and Infrastructure Agency (CISA) strongly recommends that all users and administrators upgrade their vulnerable appliances as soon as possible.\nTimeline of Specific Events\n\nDecember 17, 2019 – Citrix released Security Bulletin CTX267027 with mitigations steps.\nJanuary 8, 2020 – The CERT Coordination Center (CERT/CC) released Vulnerability Note VU#619785: Citrix Application Delivery Controller and Citrix Gateway Web Server Vulnerability,[4] and CISA releases a Current Activity entry.[5]\nJanuary 10, 2020 – The National Security Agency (NSA) released a Cybersecurity Advisory on CVE-2019-19781.[6]\nJanuary 11, 2020 – Citrix released blog post on CVE-2019-19781 with timeline for fixes.[7]\nJanuary 13, 2020 – CISA released a Current Activity entry describing their utility that enables users and administrators to test whether their Citrix ADC and Citrix Gateway firmware is susceptible to the CVE-2019-19781 vulnerability.[8] \nJanuary 16, 2020 – Citrix announced that Citrix SD-WAN WANOP appliance is also vulnerable to CVE-2019-19781.\nJanuary 19, 2020 – Citrix released firmware updates for Citrix ADC and Citrix Gateway versions 11.1 and 12.0 and blog post on accelerated schedule for fixes.[9]\nJanuary 22, 2020 – Citrix released security updates for Citrix SD-WAN WANOP release 10.2.6 and 11.0.3.[10]\nJanuary 22, 2020 – Citrix and FireEye Mandiant released an indicator of compromise (IOC) scanning tool for CVE-2019-19781.[11]\nJanuary 23, 2020 – Citrix released firmware updates for Citrix ADC and Citrix Gateway versions 12.1 and 13.0.[12]\nJanuary 24, 2020 – Citrix released firmware updates for Citrix ADC and Citrix Gateway version 10.5.\n\n\nTechnical Details\n\nImpact\nOn December 17, 2019, Citrix reported vulnerability CVE-2019-19781. A remote, unauthenticated attacker could exploit this vulnerability to perform arbitrary code execution. This vulnerability has been detected in exploits in the wild.\nThe vulnerability affects the following appliances:\n\nCitrix NetScaler ADC and NetScaler Gateway version 10.5 – all supported builds before 10.5.70.12\nCitrix ADC and NetScaler Gateway version 11.1 – all supported builds before 11.1.63.15\nCitrix ADC and NetScaler Gateway version 12.0 – all supported builds before 12.0.63.13\nCitrix ADC and NetScaler Gateway version 12.1 – all supported builds before 12.1.55.18\nCitrix ADC and Citrix Gateway version 13.0 – all supported builds before 13.0.47.24\nCitrix SD-WAN WANOP appliance models 4000-WO, 4100-WO, 5000-WO, and 5100-WO – all supported software release builds before 10.2.6b and 11.0.3b. (Citrix SD-WAN WANOP is vulnerable because it packages Citrix ADC as a load balancer).\n\nDetection Measures\nCitrix and FireEye Mandiant released an IOC scanning tool for CVE-2019-19781 on January 22, 2020. The tool aids customers with detecting potential IOCs based on known attacks and exploits.[13]\nSee the National Security Agency’s Cybersecurity Advisory on CVE-2019-19781 for other detection measures.[14]\nCISA released a utility that enables users and administrators to detect whether their Citrix ADC and Citrix Gateway firmware is susceptible to CVE-2019-19781.[15] CISA encourages administrators to visit CISA’s GitHub page to download and run the tool.\n\nMitigations\n\nCISA strongly recommends users and administrators update Citrix ADC, Citrix Gateway, and Citrix SD-WAN WANOP as soon as possible.\nThe fixed builds can be downloaded from Citrix Downloads pages for Citrix ADC, Citrix Gateway, and Citrix SD-WAN.\nUntil the appropriate update is implemented, users and administrators should apply Citrix’s interim mitigation steps for CVE-2019-19781.[16] Verify the successful application of the above mitigations by using the tool in CTX269180 – CVE-2019-19781 – Verification ToolTest. Note: these mitigation steps apply to Citrix ADC and SD-WAN WANOP deployments.[17]\nRefer to table 1 for Citrix’s fix schedule.[18]\nTable 1. Fix schedule for Citrix appliances vulnerable to CVE-2019-19781\n\n\n\nVulnerable Appliance\nFirmware Update\nRelease Date\n\n\nCitrix ADC and Citrix Gateway version 10.5\nRefresh Build 10.5.70.12\nJanuary 24, 2020\n\n\nCitrix ADC and Citrix Gateway version 11.1\nRefresh Build 11.1.63.15\nJanuary 19, 2020\n\n\nCitrix ADC and Citrix Gateway version 12.0\nRefresh Build 12.0.63.13\nJanuary 19, 2020\n\n\nCitrix ADC and Citrix Gateway version 12.1\nRefresh Build 12.1.55.18\nJanuary 23, 2020\n\n\nCitrix ADC and Citrix Gateway version 13.0\nRefresh Build 13.0.47.24\nJanuary 23, 2020\n\n\nCitrix SD-WAN WANOP Release 10.2.6\nBuild 10.2.6b\nJanuary 22, 2020\n\n\nCitrix SD-WAN WANOP Release 11.0.3\nBuild 11.0.3b\nJanuary 22, 2020\n\n\n\n \nAdministrators should review NSA’s Citrix Advisory for other mitigations, such as applying the following defense-in-depth strategy:\n“Consider deploying a VPN capability using standardized protocols, preferably ones listed on the National Information Assurance Partnership (NIAP) Product Compliant List (PCL), in front of publicly accessible Citrix ADC and Citrix Gateway appliances to require user authentication for the VPN before being able to reach these appliances. Use of a proprietary SSLVPN/TLSVPN is discouraged.”\n\nReferences\n\n[1] Citrix blog: Citrix releases final fixes for CVE-2019-19781\n[2] Citrix Security Bulletin CTX267027, Vulnerability in Citrix Application Delivery Controller and Citrix Gateway \n[3] United Kingdom National Cyber Secrity Centre (NCSC) Alert: Actors exploiting Citrix products vulnerability \n[4] CERT/CC Vulnerability Note VU#619785 \n[5] CISA Current Activity: Citrix Application Delivery Controller and Citrix Gateway Vulnerability \n[6] NSA Cybersecurity Advisory: Mitigate CVE-2019-19781: Critical Vulnerability in Citrix Application Delivery Controller (ADC) and Citrix Gateway \n[7] Citrix blog: Citrix provides update on Citrix ADC, Citrix Gateway vulnerability \n[8] CISA Current Activity: CISA Releases Test for Citrix ADC and Gateway Vulnerability GitHub: CISAgov – check-cve-2019-19781 \n[9] Citrix Blog: Vulnerability Update: First permanent fixes available, timeline accelerated \n[10] Citrix Blog: Update on CVE-2019-19781: Fixes now available for Citrix SD-WAN WANOP\n[11] Citrix Blog: Citrix and FireEye Mandiant share forensic tool for CVE-2019-19781\n[12] Citrix Blog: Fixes now available for Citrix ADC, Citrix Gateway versions 12.1 and 13.0\n[13] Citrix Blog: Citrix and FireEye Mandiant share forensic tool for CVE-2019-19781\n[14] NSA Cybersecurity Advisory: Mitigate CVE-2019-19781: Critical Vulnerability in Citrix Application Delivery Controller (ADC) and Citrix Gateway \n[15] CISA Current Activity: CISA Releases Test for Citrix ADC and Gateway Vulnerability GitHub: CISAgov – check-cve-2019-19781 \n[16] Citrix Security Bulletin CTX267679, Mitigation Steps for CVE-2019-19781 \n[17] Citrix Security Bulletin CTX267027, Vulnerability in Citrix Application Delivery Controller and Citrix Gateway \n[18] Citrix Security Bulletin CTX267027, Vulnerability in Citrix Application Delivery Controller and Citrix Gateway \n\nRevisions\n\nJanuary 20, 2020: Initial Version|January 23, 2020: Updated with information about Citrix releasing fixes for SD-WAN WANOP appliances and an IOC scanning tool|January 24, 2020: Updated with information about Citrix releasing fixes for Citrix ADC and Gateway versions 10.5, 12.1, and 13.0|January 27, 2020: Updated vulnernable versions of ADC and Gateway version 10.5\n",
  "cves": [
    "CVE-2019-19781"
  ],
  "techniques": [],
  "advisory": "aa20-020a",
  "title": "Critical Vulnerability in Citrix Application Delivery Controller, Gateway, and SD-WAN WANOP | CISA",
  "source": "cybersecurity-advisories",
  "id": "6248f2ce2cae1fbf2d6f58faba3d9cec2324e4027bd8b3942775bfe0616643ee"
}