{
  "markdown": "\n\nSummary\n\nThe Cybersecurity and Infrastructure Security Agency (CISA) is currently tracking an unknown malicious cyber actor who is spoofing the Small Business Administration (SBA) COVID-19 loan relief webpage via phishing emails. These emails include a malicious link to the spoofed SBA website that the cyber actor is using for malicious re-directs and credential stealing.\n\nTechnical Details\n\nCISA analysts observed an unknown malicious cyber actor sending a phishing email to various Federal Civilian Executive Branch and state, local, tribal, and territorial government recipients. The phishing email contains:\n\nA subject line, SBA Application – Review and Proceed\nA sender, marked as disastercustomerservice@sba[.]gov\nText in the email body urging the recipient to click on a hyperlink to address:\nhxxps://leanproconsulting[.]com.br/gov/covid19relief/sba.gov\nThe domain resolves to IP address: 162.214.104[.]246\n\nFigure 1 is a screenshot of the webpage arrived at by clicking on the hyperlink.\n​\nFigure 1: Webpage arrived at via malicious hyperlink.\n \n\nMitigations\n\nCISA recommends using the following best practices to strengthen the security posture of an organization's systems. System owners and administrators should review any configuration change prior to implementation to avoid unwanted impacts.\n\nInclude warning banners for all emails external to the organization.\nMaintain up-to-date antivirus signatures and engines. See Protecting Against Malicious Code.\nEnsure systems have the latest security updates. See Understanding Patches and Software Updates.\nDisable file and printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nRestrict users' permissions to install and run unwanted software applications. Do not add users to the local administrators’ group unless required.\nEnforce a strong password policy. See Choosing and Protecting Passwords.\nExercise caution when opening email attachments, even if the attachment is expected and the sender appears to be known. See Using Caution with Email Attachments.\nEnable a personal firewall on agency workstations that is configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious email attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to sites with unfavorable content.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs).\nScan all software downloaded from the internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate Access Control Lists (ACLs). Sign up to receive CISA’s alerts on security topics and threats.\nSign up for CISA’s free vulnerability scanning and testing services to help organizations secure internet-facing systems from weak configuration and known vulnerabilities. Email vulnerability@cisa.dhs.gov to sign up. See https://www.cisa.gov/cyber-resource-hub for more information about vulnerability scanning and other CISA cybersecurity assessment services.\n\nResources\n\nCISA Binding Operational Directive 18-01\nCISA Insights: Enhance Email and Web Security\nCISA Tip: Using Caution with Email Attachments\nCISA Alert (AA20-099A): COVID-19 Exploited by Malicious Cyber Actors\nCISA Tip: Avoiding Social Engineering and Phishing Attacks\nVirusTotal\n\n\n\nRevisions\n\nAugust 12, 2020: Initial Version|August 14, 2020: Removed some IOCs\n",
  "cves": [],
  "techniques": [],
  "advisory": "aa20-225a",
  "title": "Malicious Cyber Actor Spoofing COVID-19 Loan Relief Webpage via Phishing Emails | CISA",
  "source": "cybersecurity-advisories",
  "id": "2798a768a90e1f1b56d3912122d32269b3d49f343cc24edcff35152301b858dd"
}