{
  "markdown": "\n\nSummary\n\nThis Alert uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework. See the ATT&CK for Enterprise framework for all referenced threat actor techniques.\nThis product was written by the Cybersecurity and Infrastructure Security Agency (CISA) with contributions from the Federal Bureau of Investigation (FBI). CISA and FBI are aware of an Iran-based malicious cyber actor targeting several U.S. federal agencies and other U.S.-based networks. Analysis of the threat actor’s indicators of compromise (IOCs) and tactics, techniques, and procedures (TTPs) indicates a correlation with the group known by the names, Pioneer Kitten and UNC757. This threat actor has been observed exploiting several publicly known Common Vulnerabilities and Exposures (CVEs) dealing with Pulse Secure virtual private network (VPN), Citrix NetScaler, and F5 vulnerabilities. This threat actor used these vulnerabilities to gain initial access to targeted networks and then maintained access within the successfully exploited networks for several months using multiple means of persistence.\nThis Advisory provides the threat actor’s TTPs, IOCs, and exploited CVEs to help administrators and network defenders identify a potential compromise of their network and protect their organization from future attacks.\nClick here for a PDF version of this report.\n\nTechnical Details\n\nCISA and FBI are aware of a widespread campaign from an Iran-based malicious cyber actor targeting several industries mainly associated with information technology, government, healthcare, financial, insurance, and media sectors across the United States. The threat actor conducts mass-scanning and uses tools, such as Nmap, to identify open ports. Once the open ports are identified, the threat actor exploits CVEs related to VPN infrastructure to gain initial access to a targeted network. CISA and the FBI have observed the threat actor exploiting multiple CVEs, including CVE-2019-11510, CVE-2019-11539, CVE-2019-19781, and CVE-2020-5902.\nAfter gaining initial access to a targeted network, the threat actor obtains administrator-level credentials and installs web shells allowing further entrenchment. After establishing a foothold, the threat actor’s goals appear to be maintaining persistence and exfiltrating data. This threat actor has been observed selling access to compromised network infrastructure in an online hacker forum. Industry reporting indicates that the threat actor operates as a contractor supporting Iranian government interests, but the malicious activity appears to also serve the threat actor’s own financial interests. The FBI notes this threat actor has the capability, and likely the intent, to deploy ransomware on victim networks.\nCISA and FBI have observed this Iran-based threat actor relying on exploits of remote external services on internet-facing assets to gain initial access to victim networks. The threat actor also relies heavily on open-source and operating system (OS) tooling to conduct operations, such as ngrok; fast reverse proxy (FRP); Lightweight Directory Access Protocol (LDAP) directory browser; as well as web shells known as ChunkyTuna, Tiny, and China Chopper.\nTable 1 illustrates some of the common tools this threat actor has used.\nTable 1: Common exploit tools\n\n\n\n\nTool\n\n\nDetail\n\n\n\n\n\n\nChunkyTuna web shell\n\nChunkyTuna allows for chunked transfer encoding hypertext transfer protocol (HTTP) that tunnels Transmission Control Protocol (TCP) streams over HTTP. The web shell allows for reverse connections to a server with the intent to exfiltrate data.\n\n\n\nTiny web shell\n\nTiny uses Hypertext Preprocessor (PHP) to create a backdoor. It has the capability to allow a threat actor remote access to the system and can also tunnel or route traffic.\n\n\n\nChina Chopper web shell\n\nChina Chopper is a web shell hosted on a web server and is mainly used for web application attacks; it is configured in a client/server relationship. China Chopper contains security scanners and can be used to upload files and brute-force passwords.\n\n\nFRPC\nFRPC is a modified version of the open-source FRP tool. It allows a system—inside a router or firewall providing Network Address Translation—to provide network access to systems/operators located outside of the victim network. In this case, FRPC was used as reverse proxy, tunneling Remote Desktop Protocol (RDP) over Transport Layer Security (TLS), giving the threat actor primary persistence.\n\n\nChisel\nChisel is a fast TCP tunnel over HTTP and secured via Secure Shell (SSH). It is a single executable that includes both client and server. The tool is useful for passing through firewalls, but it can also be used to provide a secure form of communication to an endpoint on a victim network.\n\n\nngrok\nngrok is a tool used to expose a local port to the internet. Optionally, tunnels can be secured with TLS.\n\n\nNmap\nNmap is used for vulnerability scanning and network discovery.\n\n\nAngry IP Scanner\nAngry IP Scanner is a scanner that can ping a range of Internet Protocol (IP) addresses to check if they are active and can also resolve hostnames, scan ports, etc.\n\n\nDrupwn\nDrupwn is a Python-based tool used to scan for vulnerabilities and exploit CVEs in Drupal devices.\n\n\n\n\nNotable means of detecting this threat actor:\n\nCISA and the FBI note that this group makes significant use of ngrok, which may appear as TCP port 443 connections to external cloud-based infrastructure.\nThe threat actor uses FRPC over port 7557.\nMalware Analysis Report MAR-10297887-1.v1 details some of the tools this threat actor used against some victims.\n\nThe following file paths can be used to detect Tiny web shell, ChunkyTuna web shell, or Chisel if a network has been compromised by this attacker exploiting CVE-2019-19781.\n\nTiny web shell\n\n       /netscaler/ns_gui/admin_ui/rdx/core/css/images/css.php\n       /netscaler/ns_gui/vpn/images/vpn_ns_gui.php\n       /var/vpn/themes/imgs/tiny.php\n\nChunkyTuna web shell\n\n       /var/vpn/themes/imgs/debug.php\n       /var/vpn/themes/imgs/include.php\n       /var/vpn/themes/imgs/whatfile\n\nChisel\n\n       /var/nstmp/chisel\nMITRE ATT&CK Framework\nInitial Access\nAs indicated in table 2, the threat actor primarily gained initial access by using the publicly available exploit for CVE-2019-19781. From there, the threat actor used the Citrix environment to establish a presence on an internal network server.\nTable 2: Initial access techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1190\n\nExploit Public-Facing Application\nThe threat actor primarily gained initial access by compromising a Citrix NetScaler remote access server using a publicly available exploit for CVE-2019-19781. The threat actor also exploited CVE-2019-11510, CVE-2019-11539, and CVE-2020-5902.\n\n\n\nExecution\nAfter gaining initial access, the threat actor began executing scripts, as shown in table 3.\nTable 3: Execution techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1059.001\n\nCommand and Scripting Interpreter: PowerShell\nA PowerShell script (keethief and kee.ps1) was used to access KeePass data.\n\n\n\nT1059.003\n\nCommand and Scripting Interpreter: Windows Command Shell\ncmd.exe was launched via sticky keys that was likely used as a password changing mechanism.\n\n\n\nPersistence\nCISA observed the threat actor using the techniques identified in table 4 to establish persistence.\nTable 4: Persistence techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1053.003\n\nScheduled Task/Job: Cron\nThe threat actor loaded a series of scripts to cron and ran them for various purposes (mainly to access NetScaler web forms).\n\n\n\nT1053.005\n\nScheduled Task/Job: Scheduled Task\nThe threat actor installed and used FRPC (frpc.exe) on both NetScaler and internal devices. The task was named lpupdate and the binary was named svchost, which was the reverse proxy. The threat actor executed this command daily.\n\n\n\nT1505.003\n\nServer Software Component: Web Shell\nThe threat actor used several web shells on existing web servers. Both NetScaler and web servers called out for ChunkyTuna.\n\n\n\nT1546.008\n\nEvent Triggered Execution: Accessibility Features\nThe threat actor used sticky keys (sethc.exe) to launch cmd.exe.\n\n\n\nPrivilege Escalation\nCISA observed no evidence of direct privilege escalation. The threat actor attained domain administrator credentials on the NetScaler device via exploit and continued to expand credential access on the network.\nDefense Evasion\nCISA observed the threat actor using the techniques identified in table 5 to evade detection.\nTable 5: Defensive evasion techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1027.002\n\nObfuscated Files or Information: Software Packing\nThe threat actor used base64 encoding for payloads on NetScaler during initial access, making the pre-compiled payloads easier to avoid detection.\n\n\n\nT1027.004\n\nObfuscated Files or Information: Compile After Delivery\nThe threat actor used base64 encoding schemes on distributed (uncompiled) scripts and files to avoid detection.\n\n\n\nT1036.004\n\nMasquerading: Masquerade Task or Service\nThe threat actor used FRPC (frpc.exe) daily as reverse proxy, tunneling RDP over TLS. The FRPC (frpc.exe) task name was lpupdate and ran out of Input Method Editor (IME) directory. In other events, the threat actor has been observed hiding activity via ngrok.\n\n\n\nT1036.005\n\nMasquerading: Match Legitimate Name or Location\nThe FRPC (frpc.exe) binary name was svchost, and the configuration file was dllhost.dll, attempting to masquerade as a legitimate Dynamic Link Library.\n\n\n\nT1070.004\n\nIndicator Removal on Host: File Deletion\nTo minimize their footprint, the threat actor ran ./httpd-nscache_clean every 30 minutes, which cleaned up files on the NetScaler device.\n\n\n\nCredential Access\nCISA observed the threat actor using the techniques identified in table 6 to further their credential access.\nTable 6: Credential access techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1003.001\n\nOS Credential Dumping: LSASS Memory\nThe threat actor used procdump to dump process memory from the Local Security Authority Subsystem Service (LSASS).\n\n\n\nT1003.003\n\nOS Credential Dumping: Windows NT Directory Services (NTDS)\nThe threat actor used Volume Shadow Copy to access credential information from the NTDS file.\n\n\n\nT1552.001\n\nUnsecured Credentials: Credentials in Files\nThe threat actor accessed files containing valid credentials.\n\n\n\nT1555\n\nCredentials from Password Stores\nThe threat actor accessed a KeePass database multiple times and used kee.ps1 PowerShell script.\n\n\n\nT1558\n\nSteal or Forge Kerberos Tickets\nThe threat actor conducted a directory traversal attack by creating files and exfiltrating a Kerberos ticket on a NetScaler device. The threat actor was then able to gain access to a domain account.\n\n\n\nDiscovery\nCISA observed the threat actor using the techniques identified in table 7 to learn more about the victim environments.\nTable 7: Discovery techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1018\n\nRemote System Discovery\nThe threat actor used Angry IP Scanner to detect remote systems.\n\n\n\nT1083\n\nFile and Directory Discovery\nThe threat actor used WizTree to obtain network files and directory listings.\n\n\n\nT1087\n\nAccount Discovery\nThe threat actor accessed ntuser.dat and UserClass.dat and used Softerra LDAP Browser to browse documentation for service accounts.\n\n\n\nT1217\n\nBrowser Bookmark Discovery\nThe threat actor used Google Chrome bookmarks to find internal resources and assets.\n\n\n\nLateral Movement\nCISA also observed the threat actor using open-source tools such as Plink and TightVNC for lateral movement. CISA observed the threat actor using the techniques identified in table 8 for lateral movement within the victim environment.\nTable 8: Lateral movement techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1021\n\nRemote Services\nThe threat actor used RDP with valid account credentials for lateral movement in the environment.\n\n\n\nT1021.001\n\nRemote Services: Remote Desktop Protocol\nThe threat actor used RDP to log in and then conduct lateral movement.\n\n\n\nT1021.002\n\nRemote Services: SMB/Windows Admin Shares\nThe threat actor used PsExec. and PSEXECSVC pervasively on several hosts. The threat actor was also observed using a valid account to access SMB shares.\n\n\n\nT1021.004\n\nRemote Services: SSH\nThe threat actor used Plink and PuTTY for lateral movement. Artifacts of Plink were used for encrypted sessions in the system registry hive. \n\n\n\nT1021.005\n\nRemote Services: Virtual Network Computing (VNC)\nThe threat actor installed TightVNC server and client pervasively on compromised servers and endpoints in the network environment as lateral movement tool.\n\n\n\nT1563.002\n\nRemote Service Session Hijacking: RDP Hijacking\nThe threat actor likely hijacked a legitimate RDP session to move laterally within the network environment.\n\n\n\nCollection\nCISA observed the threat actor using the techniques identified in table 9 for collection within the victim environment.\nTable 9: Collection techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1005\n\nData from Local System\nThe threat actor searched local system sources to accessed sensitive documents.\n\n\n\nT1039\n\nData from Network Shared Drive\nThe threat actor searched network shares to access sensitive documents.\n\n\n\nT1213\n\nData from Information Repositories\nThe threat actor accessed victim security/IT monitoring environments, Microsoft Teams, etc., to mine valuable information.\n\n\n\nT1530\n\nData from Cloud Storage Object\nThe threat actor obtained files from the victim cloud storage instances.\n\n\n\nT1560.001\n\nArchive Collected Data: Archive via Utility\nThe threat actor used 7-Zip to archive data.\n\n\n\nCommand and Control\nCISA observed the threat actor using the techniques identified in table 10 for command and control (C2).\nTable 10: Command and control techniques\n\n\n\n\nID\n\n\nTechnique/Sub-Technique\n\n\nContext\n\n\n\n\n\n\nT1071.001\n\nApplication Layer Protocol: Web Protocols\nThe threat actor used various web mechanisms and protocols, including the web shells listed in table 1.\n\n\n\nT1105\n\nIngress Tool Transfer\nThe threat actor downloaded tools such as PsExec directly to endpoints and downloaded web shells and scripts to NetScaler in base64-encoded schemes.\n\n\n\nT1572\n\nProtocol Tunneling\nThe threat actor used FRPC.exe to tunnel RDP over port 443. The threat actor has also been observed using ngrok for tunneling.\n\n\n\nExfiltration\nCISA currently has no evidence of data exfiltration from this threat actor but assesses that it was likely due to the use of 7-Zip and viewing of sensitive documents.\n\nMitigations\n\nRecommendations\nCISA and FBI recommend implementing the following recommendations.\n\nIf your organization has not patched for the Citrix CVE-2019-19781 vulnerability, and a compromise is suspected, follow the recommendations in CISA Alert AA20-031A.\nThis threat actor has been observed targeting other CVEs mentioned in this report; follow the recommendations in the CISA resources provided below.\nIf using Windows Active Directory and compromise is suspected, conduct remediation of the compromised Windows Active Directory forest.\n\nIf compromised, rebuild/reimage compromised NetScaler devices.\n\n\nRoutinely audit configuration and patch management programs.\nMonitor network traffic for unexpected and unapproved protocols, especially outbound to the internet (e.g., SSH, SMB, RDP).\nImplement multi-factor authentication, especially for privileged accounts.\nUse separate administrative accounts on separate administration workstations.\nImplement the principle of least privilege on data access.\nSecure RDP and other remote access solutions using multifactor authentication and “jump boxes” for access.\nDeploy endpoint defense tools on all endpoints; ensure they work and are up to date.\nKeep software up to date.\n\n\nContact Information\n\nTo report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local FBI field office at www.fbi.gov/contact-us/field, or the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by e-mail at CyWatch@fbi.gov. When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. To request incident response resources or technical assistance related to these threats, contact CISA at central@cisa.dhs.gov.\nResources\nCISA Alert AA20-031A: Detecting Citrix CVE-2019-19781\nCISA Alert AA20-073A: Enterprise VPN Security\nCISA Alert AA20-107A: Continued Threat Actor Exploitation Post Pulse Secure VPN Patching\nCISA Alert AA20-206A: Threat Actor Exploitation of F5 BIG-IP CVE-2020-5902\nCISA Security Tip: Securing Network Infrastructure Devices\n\nRevisions\n\nSeptember 15, 2020: Initial Version\n",
  "cves": [
    "CVE-2019-19781",
    "CVE-2020-5902",
    "CVE-2019-11510",
    "CVE-2019-11539"
  ],
  "techniques": [
    "T1021.001",
    "T1245",
    "T1071",
    "T1021.002",
    "T1027.002",
    "T1027.004",
    "T1546",
    "T1505",
    "T1552",
    "T1505.003",
    "T1021",
    "T1059.001",
    "T1572",
    "T1563.002",
    "T1003.001",
    "T1560.001",
    "T1217",
    "T1053.005",
    "T1053.003",
    "T1053",
    "T1552.001",
    "T1036.005",
    "T1005",
    "T1027",
    "T1560",
    "T1071.001",
    "T1059",
    "T1036.004",
    "T1563",
    "T1530",
    "T1021.004",
    "T1003",
    "T1083",
    "T1039",
    "T1087",
    "T1546.008",
    "T1105",
    "T1190",
    "T1070",
    "T1003.003",
    "T1021.005",
    "T1036",
    "T1213",
    "T1558",
    "T1059.003",
    "T1018",
    "T1555",
    "T1070.004"
  ],
  "advisory": "aa20-259a",
  "title": "Iran-Based Threat Actor Exploits VPN Vulnerabilities | CISA",
  "source": "cybersecurity-advisories",
  "id": "62cb29b8f1b91d762915d0d4478a011048f2c13cbbbf27ee6a5da9a2349ac289"
}