{"markdown": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Technical Approaches to Uncovering and Remediating Malicious Activity \\| CISA\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Skip to main content](#main) \n\n\n\n\n\n\n\n\n\n\n\n\n![U.S. flag](/profiles/cisad8_gov/themes/custom/gesso/dist/images/us_flag_small.png)\n\n\n\n An official website of the United States government\n \n\n\n\n Here’s how you know\n \n\n\n\n\n\n Here’s how you know\n \n\n\n\n\n\n\n![Dot gov](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-dot-gov.svg)\n\n\n**Official websites use .gov** \n  \n\n A\n **.gov** \n website belongs to an official government organization in the United States.\n \n\n\n\n\n\n![HTTPS](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-https.svg)\n\n\n**Secure .gov websites use HTTPS** \n  \n\n A\n **lock** \n (\n \n\n\n Lock\n \n\n A locked padlock\n \n\n\n\n\n ) or\n **https://** \n means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo Americas Cyber Defense Agency](/sites/default/files/images/SVG/header_logo_tagline_update.svg)](/)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo](/sites/default/files/images/SVG/mobile_logo_wordmark.svg)](/)\n\n\n\n\n\n\n\n\n\n\n Search\n \n\n\n\n\n\n\n\n\n\n Menu\n \n\n\n\n\n\n\n\n\n\n\n\n\n![America's Cyber Defense Agency](/sites/default/files/images/SVG/header_tagline_mobile_update.svg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Close\n \n\n\n\n\n* Topics\n \n\n\n\n[Topics](/topics) \n\n\n\n\n[Cybersecurity Best Practices](/topics/cybersecurity-best-practices)\n\n\n\n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories)\n\n\n\n\n[Critical Infrastructure Security and Resilience](/topics/critical-infrastructure-security-and-resilience)\n\n\n\n\n[Election Security](/topics/election-security)\n\n\n\n\n[Emergency Communications](/topics/emergency-communications)\n\n\n\n\n[Industrial Control Systems](/topics/industrial-control-systems)\n\n\n\n\n[Information and Communications Technology Supply Chain Security](/topics/information-communications-technology-supply-chain-security)\n\n\n\n\n[Partnerships and Collaboration](/topics/partnerships-and-collaboration)\n\n\n\n\n[Physical Security](/topics/physical-security)\n\n\n\n\n[Risk Management](/topics/risk-management)\n\n\n\n\n\n[How can we help?](/audiences) \n\n\n[Government](/topics/government) \n[Educational Institutions](/topics/educational-institutions) \n[Industry](/topics/industry) \n[State, Local, Tribal, and Territorial](/topics/state-local-tribal-and-territorial) \n[Individuals and Families](/topics/individuals-and-families) \n[Small and Medium Businesses](/topics/small-and-medium-businesses) \n[Find Help Locally](/audiences/find-help-locally) \n[Faith\\-Based Community](/audiences/faith-based-community) \n[Executives](/audiences/executives) \n[High\\-Risk Communities](/audiences/high-risk-communities)\n* [Spotlight](/spotlight)\n* Resources \\& Tools\n \n\n\n\n[Resources \\& Tools](/resources-tools) \n\n\n\n\n[All Resources \\& Tools](/resources-tools/all-resources-tools)\n\n\n\n\n[Services](/resources-tools/services)\n\n\n\n\n[Programs](/resources-tools/programs)\n\n\n\n\n[Resources](/resources-tools/resources)\n\n\n\n\n[Training](/resources-tools/training)\n\n\n\n\n[Groups](/resources-tools/groups)\n* News \\& Events\n \n\n\n\n[News \\& Events](/news-events) \n\n\n\n\n[News](/news-events/news)\n\n\n\n\n[Events](/news-events/events)\n\n\n\n\n[Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)\n\n\n\n\n[Directives](/news-events/directives)\n\n\n\n\n[Request a CISA Speaker](/news-events/request-speaker)\n\n\n\n\n[Congressional Testimony](/news-events/congressional-testimony)\n\n\n\n\n[CISA Conferences](/cisa-conferences)\n\n\n\n\n[CISA Live!](/cisa-live)\n* Careers\n \n\n\n\n[Careers](/careers) \n\n\n\n\n[Benefits \\& Perks](/careers/benefits-perks)\n\n\n\n\n[HireVue Applicant Reasonable Accommodations Process](/careers/hirevue-applicant-reasonable-accommodations-process)\n\n\n\n\n[Hiring](/general-recruitment-and-hiring-faqs)\n\n\n\n\n[Resume \\& Application Tips](/careers/resume-application-tips)\n\n\n\n\n[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)\n\n\n\n\n[Veteran and Military Spouses](/careers/veteran-and-military-spouse-employment-opportunities)\n\n\n\n\n[Work @ CISA](/careers/work-cisa)\n* About\n \n\n\n\n[About](/about) \n\n\n\n\n[Culture](/about/culture)\n\n\n\n\n[Divisions \\& Offices](/about/divisions-offices)\n\n\n\n\n[Regions](/about/regions)\n\n\n\n\n[Leadership](/about/leadership)\n\n\n\n\n[Doing Business with CISA](/doing-business-cisa)\n\n\n\n\n[Site Links](/site-links)\n\n\n\n\n[Reporting Employee and Contractor Misconduct](/reporting-employee-and-contractor-misconduct)\n\n\n\n\n[CISA GitHub](/cisa-github)\n\n\n\n\n[CISA Central](/cisa-central)\n\n\n\n\n[2023 Year In Review](/about/2023YIR)\n\n\n\n\n[Contact Us](/about/contact-us)\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Breadcrumb\n \n1. [Home](/)\n2. [News \\& Events](/news-events)\n3. [Cybersecurity Advisories](/news-events/cybersecurity-advisories)\n4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94)\n\n\n\n\n\n\n\n\n Share:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Cybersecurity Advisory\n \nTechnical Approaches to Uncovering and Remediating Malicious Activity\n=====================================================================\n\n\n\n\n\n Last Revised\n \n\n\n September 24, 2020\n \n\n\n\n\n Alert Code\n \n\n AA20\\-245A\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n### Summary\n\n\n\n\n This joint advisory is the result of a collaborative research effort by the cybersecurity authorities of five nations: Australia,\\[\n [1](https://www.cyber.gov.au/) \n ] Canada,\\[\n [2](https://www.cyber.gc.ca/en/) \n ] New Zealand,\\[\n [3](https://www.ncsc.govt.nz/) \n ]\\[\n [4](https://www.cert.govt.nz/) \n ] the United Kingdom,\\[\n [5](https://www.ncsc.gov.uk/) \n ] and the United States.\\[\n [6](https://www.cisa.gov/) \n ] It highlights technical approaches to uncovering malicious activity and includes mitigation steps according to best practices. The purpose of this report is to enhance incident response among partners and network administrators along with serving as a playbook for incident investigation.\n \n\n\n#### **Key Takeaways**\n\n\n\n When addressing potential incidents and applying best practice incident response procedures:\n \n\n\n* First, collect and remove for further analysis:\n\t+ Relevant artifacts,\n\t+ Logs, and\n\t+ Data.\n* Next, implement mitigation steps that avoid tipping off the adversary that their presence in the network has been discovered.\n* Finally, consider soliciting incident response support from a third\\-party IT security organization to:\n\t+ Provide subject matter expertise and technical support to the incident response,\n\t+ Ensure that the actor is eradicated from the network, and\n\t+ Avoid residual issues that could result in follow\\-up compromises once the incident is closed.\n\n\n\n[Click here](/sites/default/files/publications/AA20-245A-Joint_CSA-Technical_Approaches_to_Uncovering_Malicious_Activity_508.pdf) \n for a PDF version of this report.\n \n\n\n\n### Technical Details\n\n\n\n\n The incident response process requires a variety of technical approaches to uncover malicious activity. Incident responders should consider the following activities.\n \n\n\n* **Indicators of Compromise (IOC) Search** \n – Collect known\\-bad indicators of compromise from a broad variety of sources, and search for those indicators in network and host artifacts. Assess results for further indications of malicious activity to eliminate false positives.\n* **Frequency Analysis** \n – Leverage large datasets to calculate normal traffic patterns in both network and host systems. Use these predictive algorithms to identify activity that is inconsistent with normal patterns. Variables often considered include timing, source location, destination location, port utilization, protocol adherence, file location, integrity via hash, file size, naming convention, and other attributes.\n* **Pattern Analysis** \n – Analyze data to identify repeating patterns that are indicative of either automated mechanisms (e.g., malware, scripts) or routine human threat actor activity. Filter out the data containing normal activity and evaluate the remaining data to identify suspicious or malicious activity.\n* **Anomaly Detection** \n – Conduct an analyst review (based on the team’s knowledge of, and experience with, system administration) of collected artifacts to identify errors. Review unique values for various datasets and research associated data, where appropriate, to find anomalous activity that could be indicative of threat actor activity.\n\n\n### Recommended Artifact and Information Collection\n\n\n\n When hunting and/or investigating a network, it is important to review a broad variety of artifacts to identify any suspicious activity that may be related to the incident. Consider collecting and reviewing the following artifacts throughout the investigation.\n \n\n\n#### **Host\\-Based Artifacts**\n\n\n* Running Processes\n* Running Services\n* Parent\\-Child Process Trees\n* Integrity Hash of Background Executables\n* Installed Applications\n* Local and Domain Users\n* Unusual Authentications\n* Non\\-Standard Formatted Usernames\n* Listening Ports and Associated Services\n* Domain Name System (DNS) Resolution Settings and Static Routes\n* Established and Recent Network Connections\n* Run Key and other AutoRun Persistence\n* Scheduled Tasks\n* Artifacts of Execution (Prefetch and Shimcache)\n* Event logs\n* Anti\\-virus detections\n\n\n#### **Information to Review for Host Analysis**\n\n\n* Identify any process that is not signed and is connecting to the internet looking for beaconing or significant data transfers.\n* Collect all PowerShell command line requests looking for Base64\\-encoded commands to help identify malicious fileless attacks.\n* Look for excessive\n `.RAR` \n ,\n `7zip` \n , or\n `WinZip` \n processes, especially with suspicious file names, to help discover exfiltration staging (suspicious file names include naming conventions such as,\n `1.zip` \n ,\n `2.zip` \n , etc.).\n* Collect all user logins and look for outlier behavior, such as a time of login that is out of the ordinary for the user or a login from an Internet Protocol (IP) address not normally used by the user.\n* On Linux/Unix operating systems (OSs) and services, collect all\n `cron` \n and\n `systemd /etc/passwd` \n files looking for unusual accounts and log files, such as accounts that appear to be\n `system / proc` \n users but have an interactive shell such as\n `/bin/bash` \n rather than\n `/bin/false/nologin`\n* On Microsoft OSs, collect Scheduled Tasks, Group Policy Objects (GPO), and Windows Management Instrumentation (WMI) database storage on hosts of interest looking for malicious persistence.\n* Use the Microsoft Windows Sysinternals Autoruns tool, which allows IT security practitioners to view—and, if needed, easily disable—most programs that automatically load onto the system.\n* Check the Windows registry and Volume Shadow Copy Service for evidence of intrusion.\n* Consider blocking script files like\n `.js` \n ,\n `.vbs` \n ,\n `.zip` \n ,\n `.7z` \n ,\n `.sfx` \n and even Microsoft Office documents or PDFs.\n* Collect any scripts or binary ELF files from\n `/dev/shm/tmp` \n and\n `/var/tmp` \n .\n* Kernel modules listed (lsmod) for signs of a rootkit; dmesg command output can show signs of rootkit loading and device attachment amongst other things.\n* Archive contents of\n `/var/log` \n for all hosts.\n* Archive output from journald. These logs are pretty much the same as /var/log; however, they provide some integrity checking and are not as easy to modify. This will eventually replace the /var/log contents for some aspects of the system. Check for additional Secure Shell (SSH) keys added to user’s\n `authorized_keys` \n .\n\n\n#### **Network\\-Based Artifacts**\n\n\n* Anomalous DNS traffic and activity, unexpected DNS resolution servers, unauthorized DNS zone transfers, data exfiltration through DNS, and changes to host files\n* Remote Desktop Protocol (RDP), virtual private network (VPN) sessions, SSH terminal connections, and other remote abilities to evaluate for inbound connections, unapproved third\\-party tools, cleartext information, and unauthorized lateral movement\n* Uniform Resource Identifier (URI) strings, user agent strings, and proxy enforcement actions for abusive, suspicious, or malicious website access\n* Hypertext Transfer Protocol Secure/Secure Sockets Layer (HTTPS/SSL)\n* Unauthorized connections to known threat indicators\n* Telnet\n* Internet Relay Chat (IRC)\n* File Transfer Protocol (FTP)\n\n\n#### **Information to Review for Network Analysis**\n\n\n* Look for new connections on previously unused ports.\n* Look for traffic patterns related to time, frequency, and byte count of the connections.\n* Preserve proxy logs. Add in the URI parameters to the event log if possible.\n* Disable LLMNR on the corporate network; if unable to disable, collect LLMNR (UDP port 5355\\) and NetBIOS\\-NS (UDP port 137\\).\n* Review changes to routing tables, such as weighting, static entries, gateways, and peer relationships.\n\n\n### Common Mistakes in Incident Handling\n\n\n\n After determining that a system or multiple systems may be compromised, system administrators and/or system owners are often tempted to take immediate actions. Although well intentioned to limit the damage of the compromise, some of those actions have the adverse effect of:\n \n\n\n1. Modifying volatile data that could give a sense of what has been done; and\n2. Tipping the threat actor that the victim organization is aware of the compromise and forcing the actor to either hide their tracks or take more damaging actions (like detonating ransomware).\n\n\n\n Below—and partially listed in figure 1—are actions to avoid taking and some of the consequence of taking such actions.\n \n\n\n* **Mitigating the affected systems before responders can protect and recover data** \n\t+ This can cause the loss of volatile data such as memory and other host\\-based artifacts.\n\t+ The adversary may notice and change their tactics, techniques, and procedures.\n* **Touching adversary infrastructure (Pinging, NSlookup, Browsing, etc.)** \n\t+ These actions can tip off the adversary that they have been detected.\n* **Preemptively blocking adversary infrastructure** \n\t+ Network infrastructure is fairly inexpensive. An adversary can easily change to new command and control infrastructure, and you will lose visibility of their activity.\n* **Preemptive credential resets** \n\t+ Adversary likely has multiple credentials, or worse, has access to your entire Active Directory.\n\t+ Adversary will use other credentials, create new credentials, or forge tickets.\n* **Failure to preserve or collect log data that could be critical to identifying access to the compromised systems** \n\t+ If critical log types are not collected, or are not retained for a sufficient length of time, key information about the incident may not be determinable. Retain log data for at least one year.\n* **Communicating over the same network as the incident response is being conducted (ensure all communications are held out\\-of\\-band)**\n* **Only fixing the symptoms, not the root cause** \n\t+ Playing “whack\\-a\\-mole” by blocking an IP address—without taking steps to determine what the binary is and how it got there—leaves the adversary an opportunity to change tactics and retain access to the network.\n\n\n\n![]()\n\n\n\n\n Figure 1: Common missteps to be avoided when responding to an incident\n \n\n\n\n### Mitigations\n\n\n\n\n The following recommendations and best practices may be helpful during the investigation and remediation process.\n **Note:** \n Although this guidance provides best practices to mitigate common attack vectors, organizations should tailor mitigations to their network.\n \n\n\n#### **General Mitigation Guidance**\n\n\n##### **Restrict or Discontinue Use of FTP and Telnet Services**\n\n\n\n The FTP and Telnet protocols transmit credentials in cleartext, which are susceptible to being intercepted. To mitigate this risk, discontinue FTP and Telnet services by moving to more secure file storage/file transfer and remote access services.\n \n\n\n* Evaluate business needs and justifications to host files on alternative Secure File Transfer Protocol (SFTP) or HTTPS\\-based public sites.\n* Use Secure Shell (SSH) for access to remote devices and servers.\n\n\n##### **Restrict or Discontinue Use of Non\\-approved VPN Services**\n\n\n* Investigate the business needs and justification for allowing traffic from non\\-approved VPN services.\n* Identify such services across the enterprise and develop measures to add the application and browser plugins that enable non\\-approved VPN services to the denylist.\n* Enhance endpoint monitoring to obtain visibility on devices with non\\-approved VPN services running. Enhanced endpoint monitoring and detection capabilities would enable an organization’s IT security personnel to manage approved software as well as identify and remove any instances of unapproved software.\n\n\n##### **Shut down or Decommission Unused Services and Systems**\n\n\n* Cyber actors regularly identify servers that are out of date or end of life (EOL) to gain access to a network and perform malicious activities. These present easy and safe locations to maintain persistence on a network.\n* Often these services and servers are systems that have begun decommissioning, but the final stage has not been completed by shutting down the system. This means they are still running and vulnerable to compromise.\n* Ensuring that decommissioning of systems has been completed or taking appropriate action to remove them from the network limits their susceptibility and reduces the investigative surface to be analyzed.\n\n\n##### **Quarantine and Reimage Compromised Hosts**\n\n\n\n**Note:** \n proceed with caution to avoid the adverse effects detailed in the Common Mistakes in Incident Handling section above.\n \n\n\n* Reimage or remove any compromised systems found on the network.\n* Monitor and educate users to be cautious of any downloads from third\\-party sites or vendors.\n* Block the known bad domains and add a web content filtering capability to block malicious sites by category to prevent future compromise.\n* Sanitize removable media and investigate network shares accessible by users.\n* Improve existing network\\-based malware detection tools with sandboxing capabilities.\n\n\n##### **Disable Unnecessary Ports, Protocols, and Services**\n\n\n* Identify and disable ports, protocols, and services not needed for official business to prevent would\\-be attackers from moving laterally to exploit vulnerabilities. This includes external communications as well as communications between networks.\n* Document allowed ports and protocols at the enterprise level.\n* Restrict inbound and outbound access to ports and protocols not justified for business use.\n* Restrict allowed access list to assets justified by business use.\n* Enable a firewall log for inbound and outbound network traffic as well as allowed and denied traffic.\n\n\n##### **Restrict or Disable Interactive Login for Service Accounts**\n\n\n\n Service accounts are privileged accounts dedicated to certain services to perform activities related to the service or application without being tied to a single domain user. Given that services tend to be privileged accounts and thereby have administrative privileges, they are often a target for attackers aiming to obtain credentials. Interactive login to a service account not directly tied to an end\\-user account makes it difficult to identify accountability during cyber incidents.\n \n\n\n* Audit the Active Directory (AD) to identify and document active service accounts.\n* Restrict use of service accounts using AD group policy.\n* Disallow interactive login by adding service account to a group of non\\-interactive login users.\n* Continuously monitor service account activities by enhancing logging.\n* Rotate service accounts and apply password best practices without service, degradation, or disruption.\n\n\n##### **Disable Unnecessary Remote Network Administration Tools**\n\n\n* If an attacker (or malware) gains access to a remote user’s computer, steals authentication data (login/password), hijacks an active remote administration session, or successfully attacks a vulnerability in the remote administration tool’s software, the attacker (or malware) will gain unrestricted control of the enterprise network environment. Attackers can use compromised hosts as a relay server for reverse connections, which could enable them to connect to these remote administration tools from anywhere.\n* Remove all remote administration tools that are not required for day\\-to\\-day IT operations. Closely monitor and log events for each remote\\-control session required by department IT operations.\n\n\n##### **Manage Unsecure Remote Desktop Services**\n\n\n\n Allowing unrestricted RDP access can increase opportunities for malicious activity such as on path and Pass\\-the\\-Hash (PtH) attacks.\n \n\n\n* Implement secure remote desktop gateway solutions.\n* Restrict RDP service trust across multiple network zones.\n* Implement privileged account monitoring and short time password lease for RDP service use.\n* Implement enhanced and continuous monitoring of RDP services by enabling logging and ensure RDP logins are captured in the logs.\n\n\n##### **Credential Reset and Access Policy Review**\n\n\n\n Credential resets need to be done to strategically ensure that all the compromised accounts and devices are included and to reduce the likelihood that the attacker is able to adapt in response to this.\n \n\n\n* Force password resets; revoke and issue new certificates for affected accounts/devices.\n* If it is suspected that the attacker has gained access to the Domain Controller, then the passwords for all local accounts—such as Guest, HelpAssistant, DefaultAccount, System, Administrator, and\n `kbrtgt` \n —should be reset. It is essential that the password for the\n `kbrtgt` \n account is reset as this account is responsible for handling Kerberos ticket requests as well as encrypting and signing them. The account should be reset twice (as the account has a two\\-password history).\n\t+ The first account reset for the\n\t `kbrtgt` \n\t needs to be allowed to replicate prior to the second reset to avoid any issues.\n* If it is suspected that the\n `ntds.dit` \n file has been exfiltrated, then all domain user passwords will need to be reset.\n* Review access policies to temporarily revoke privileges/access for affected accounts/devices. If it is necessary to not alert the attacker (e.g., for intelligence purposes), then privileges can be reduced for affected accounts/devices to “contain” them.\n\n\n##### **Patch Vulnerabilities**\n\n\n\n Attackers frequently exploit software or hardware vulnerabilities to gain access to a targeted system.\n \n\n\n* Known vulnerabilities in external facing devices and servers should be patched immediately, starting with the point of compromise, if known.\n\t+ Ensure external\\-facing devices have not been previously compromised while going through the patching process.\n* If the point of compromise (i.e., the specific software, device, server) is known, but how the software, device, or server was exploited is unknown, notify the vendor so they can begin analysis and develop a new patch.\n* Follow vendor remediation guidance including the installation of new patches as soon as they become available.\n\n\n#### **General Recommendations and Best Practices Prior to an Incident**\n\n\n\n Properly implemented defensive techniques and programs make it more difficult for a threat actor to gain access to a network and remain persistent yet undetected. When an effective defensive program is in place, attackers should encounter complex defensive barriers. Attacker activity should also trigger detection and prevention mechanisms that enable organizations to identify, contain, and respond to the intrusion quickly. There is no single technique, program, or set of defensive techniques or programs that will completely prevent all attacks. The network administrator should adopt and implement multiple defensive techniques and programs in a layered approach to provide a complex barrier to entry, increase the likelihood of detection, and decrease the likelihood of a successful attack. This layered mitigation approach is known as defense\\-in\\-depth.\n \n\n\n##### **User Education**\n\n\n\n End users are the frontline security of the organizations. Educating them in security principles as well as actions to take and not take during an incident will increase the organization’s resilience and might prevent easily avoidable compromises.\n \n\n\n* Educate users to be cautious of any downloads from third\\-party sites or vendors.\n* Train users on recognizing phishing emails. There are several systems and services (free and otherwise) that can be deployed or leveraged.\n* Train users on identifying which groups/individuals to contact when they suspect an incident.\n* Train users on the actions they can and cannot take if they suspect an incident and why (some users will attempt to remediate and might make things worst).\n\n\n##### **Allowlisting**\n\n\n* Enable application directory allowlisting through Microsoft Software Restriction Policy or AppLocker.\n* Use directory allowlisting rather than attempting to list every possible permutation of applications in a network environment. Safe defaults allow applications to run from\n `PROGRAMFILES` \n ,\n `PROGRAMFILES(X86)` \n , and\n `SYSTEM32` \n . Disallow all other locations unless an exception is granted.\n* Prevent the execution of unauthorized software by using application allowlisting as part of the OS installation and security hardening process.\n\n\n##### **Account Control**\n\n\n* Decrease a threat actor’s ability to access key network resources by implementing the principle of least privilege.\n* Limit the ability of a local administrator account to log in from a local interactive session (e.g., Deny access to this computer from the network) and prevent access via an RDP session.\n* Remove unnecessary accounts and groups; restrict root access.\n* Control and limit local administration; e.g. implementing Just Enough Administration (JEA), just\\-in\\-time (JIT) administration, or enforcing PowerShell Constrained Language mode via a User Mode Code Integrity (UMCI) policy.\n* Make use of the Protected Users Active Directory group in Windows domains to further secure privileged user accounts against pass\\-the\\-hash attacks.\n\n\n##### **Backups**\n\n\n* Identify what data is essential to keeping operations running; make regular backup copies.\n* Test that backups are working to ensure they can restore the data in the event of an incident.\n* Create offline backups to help recover from a ransomware attack or from disasters (fire, flooding, etc.).\n* Securely store offline backups at an offsite location. If feasible, choose an offsite location that is at a distance from the primary location that would be unaffected in the event of a regional natural disaster.\n\n\n##### **Workstation Management**\n\n\n* Create and deploy a secure system baseline image to all workstations.\n* Mitigate potential exploitation by threat actors by following a normal patching cycle for all OSs, applications, and software, with exceptions for emergency patches.\n* Apply asset and patch management processes.\n* Reduce the number of cached credentials to one (if a laptop) or zero (if a desktop or fixed asset).\n\n\n##### **Host\\-Based Intrusion Detection / Endpoint Detection and Response**\n\n\n* Configure and monitor workstation system logs through a host\\-based endpoint detection and response platform and firewall.\n* Deploy an anti\\-malware solution on workstations to prevent spyware, adware, and malware as part of the OS security baseline.\n\t+ Ensure that your anti\\-malware solution remains up to date.\n* Monitor antivirus scan results on a regular basis.\n\n\n##### **Server Management**\n\n\n* Create a secure system baseline image and deploy it to all servers.\n* Upgrade or decommission end\\-of\\-life non\\-Windows servers.\n* Upgrade or decommission servers running Windows Server 2003 or older versions.\n* Implement asset and patch management processes.\n* Audit for and disable unnecessary services.\n\n\n##### **Server Configuration and Logging**\n\n\n* Establish remote server logging and retention.\n* Reduce the number of cached credentials to zero.\n* Configure and monitor system logs via a centralized security information and event management (SIEM) appliance.\n* Add an explicit\n `DENY` \n for\n `%USERPROFILE%` \n .\n* Restrict egress web traffic from servers.\n* In Windows environments, use Restricted Admin mode or remote credential guard to further secure remote desktop sessions against pass\\-the\\-hash attacks.\n* Restrict anonymous shares.\n* Limit remote access by only using jump servers for such access.\n* On Linux, use SELINUX or AppArmor in enforcing mode and/or turn on audit logging.\n* Turn on bash shell logging; ship this and all logs to a remote server.\n* Do not allow users to use\n `su` \n . Use\n `Sudo -l` \n instead.\n* Configure automatic updates in yum or apt.\n* Mount\n `/var/tmp` \n and\n `/tmp` \n as\n `noexec` \n .\n\n\n##### **Change Control**\n\n\n* Create a change control process for all implemented changes.\n\n\n##### **Network Security**\n\n\n* Implement an intrusion detection system (IDS).\n\t+ Apply continuous monitoring.\n\t+ Send alerts to a SIEM tool.\n\t+ Monitor internal activity (this tool may use the same tap points as the netflow generation tools).\n* Employ netflow capture.\n\t+ Set a minimum retention period of 180 days.\n\t+ Capture netflow on all ingress and egress points of network segments, not just at the Managed Trusted Internet Protocol Services or Trusted Internet Connections locations.\n* Capture all network traffic\n\t+ Retain captured traffic for a minimum of 24 hours.\n\t+ Capture traffic on all ingress and egress points of the network.\n* Use VPN\n\t+ Maintain site\\-to\\-site VPN with customers and vendors.\n\t+ Authenticate users utilizing site\\-to\\-site VPNs.\n\t+ Use authentication, authorization, and accounting for controlling network access.\n\t+ Require smartcard authentication to an HTTPS page in order to control access. Authentication should also require explicit rostering of permitted smartcard distinguished names to enhance the security posture on both networks participating in the site\\-to\\-site VPN.\n* Establish appropriate secure tunneling protocol and encryption.\n* Strengthen router configuration (e.g., avoid enabling remote management over the internet and using default IP ranges, automatically log out after configuring routers, and use encryption.).\n* Turn off Wi\\-Fi protected setup, enforce the use of strong passwords, and keep router firmware up\\-to\\-date.\n* Improve firewall security (e.g., enable automatic updates, revise firewall rules as appropriate, implement allowlists, establish packet filtering, enforce the use of strong passwords, encrypt networks).\n\t+ Whenever possible, ensure access to network devices via external or untrusted networks (specifically the internet) is disabled.\n* Manage access to the internet (e.g., providing internet access from only devices/accounts that need it, proxying all connections, disabling internet access for privileged/administrator accounts, enabling policies that restrict internet access using a blocklist, a resource allowlist, content type, etc.)\n\t+ Conduct regular vulnerability scans of the internal and external networks and hosted content to identify and mitigate vulnerabilities.\n\t+ Define areas within the network that should be segmented to increase the visibility of lateral movement by a threat and increase the defense\\-in\\-depth posture.\n\t+ Develop a process to block traffic to IP addresses and domain names that have been identified as being used to aid previous attacks.\n* Evaluate and consider the security configurations of Microsoft Office 365 (O365\\) and other cloud collaboration service platforms prior to deployment.\n\t+ Use multi\\-factor authentication. This is the best mitigation technique to protect against credential theft for O365 administrators and users.\n\t+ Protect Global Admins from compromise and use the principle of “Least Privilege.”\n\t+ Enable unified audit logging in the Security and Compliance Center.\n\t+ Enable alerting capabilities.\n\t+ Integrate with organizational SIEM solutions.\n\t+ Disable legacy email protocols, if not required, or limit their use to specific users.\n\n\n##### **Network Infrastructure Recommendations**\n\n\n* Create a secure system baseline image and deploy it to all networking equipment (e.g., switches, routers, firewalls).\n* Remove unnecessary OS files from the internetwork operating system (IOS). This will limit the possible targets of persistence (i.e., files to embed malicious code) if the device is compromised and will align with National Security Agency Network Device Integrity best practices.\n* Remove vulnerable IOS OS files (i.e., older iterations) from the device’s boot variable (i.e., show boot or show bootvar).\n* Update to the latest available operating system for IOS devices.\n* On devices with a Secure Sockets Layer VPN enabled, routinely verify customized web objects against the organization’s known good files for such VPNs, to ensure the devices remain free of unauthorized modification.\n* Ensure that any incident response tools that point to external domains are either removed or updated to point to internal security tools. If this is not done and an external domain to which a tool points expires, a malicious threat actor may register it and start collecting telemetry from the infrastructure.\n\n\n##### **Host Recommendations**\n\n\n* Implement policies to block workstation\\-to\\-workstation RDP connections through a Group Policy Object on Windows, or by a similar mechanism.\n* Store system logs of mission critical systems for at least one year within a SIEM tool.\n* Review the configuration of application logs to verify that recorded fields will contribute to an incident response investigation.\n\n\n##### **User Management**\n\n\n* Reduce the number of domain and enterprise administrator accounts.\n* Create non\\-privileged accounts for privileged users and ensure they use the non\\- privileged accounts for all non\\-privileged access (e.g., web browsing, email access).\n* If possible, use technical methods to detect or prevent browsing by privileged accounts (authentication to web proxies would enable blocking of Domain Administrators).\n* Use two\\-factor authentication (e.g., security tokens for remote access and access to any sensitive data repositories).\n* If soft tokens are used, they should not exist on the same device that is requesting remote access (e.g., a laptop) and instead should be on a smartphone, token, or other out\\-of\\-band device.\n* Create privileged role tracking.\n* Create a change control process for all privilege escalations and role changes on user accounts.\n* Enable alerts on privilege escalations and role changes.\n* Log privileged user changes in the network environment and create an alert for unusual events.\n* Establish least privilege controls.\n* Implement a security\\-awareness training program.\n\n\n##### **Segregate Networks and Functions**\n\n\n\n Proper network segmentation is a very effective security mechanism to prevent an intruder from propagating exploits or laterally moving around an internal network. On a poorly segmented network, intruders are able to extend their impact to control critical devices or gain access to sensitive data and intellectual property. Security architects must consider the overall infrastructure layout, segmentation, and segregation. Segregation separates network segments based on role and functionality. A securely segregated network can contain malicious occurrences, reducing the impact from intruders, in the event that they have gained a foothold somewhere inside the network.\n \n\n\n###### **Physical Separation of Sensitive Information**\n\n\n\n Local Area Network (LAN) segments are separated by traditional network devices such as routers. Routers are placed between networks to create boundaries, increase the number of broadcast domains, and effectively filter users’ broadcast traffic. These boundaries can be used to contain security breaches by restricting traffic to separate segments and can even shut down segments of the network during an intrusion, restricting adversary access.\n \n\n\n\n Recommendations:\n \n\n\n* Implement Principles of Least Privilege and need\\-to\\-know when designing network segments.\n* Separate sensitive information and security requirements into network segments.\n* Apply security recommendations and secure configurations to all network segments and network layers.\n\n\n###### **Virtual Separation of Sensitive Information**\n\n\n\n As technologies change, new strategies are developed to improve IT efficiencies and network security controls. Virtual separation is the logical isolation of networks on the same physical network. The same physical segmentation design principles apply to virtual segmentation but no additional hardware is required. Existing technologies can be used to prevent an intruder from breaching other internal network segments.\n \n\n\n\n Recommendations:\n \n\n\n* Use Private Virtual LANs to isolate a user from the rest of the broadcast domains.\n* Use Virtual Routing and Forwarding (VRF) technology to segment network traffic over multiple routing tables simultaneously on a single router.\n* Use VPNs to securely extend a host/network by tunneling through public or private networks.\n\n\n#### **Additional Best Practices**\n\n\n* Implement a vulnerability assessment and remediation program.\n* Encrypt all sensitive data in transit and at rest.\n* Create an insider threat program.\n* Assign additional personnel to review logging and alerting data.\n* Complete independent security (not compliance) audits.\n* Create an information sharing program.\n* Complete and maintain network and system documentation to aid in timely incident response, including:\n\t+ Network diagrams,\n\t+ Asset owners,\n\t+ Type of asset, and\n\t+ An up\\-to\\-date incident response plan.\n\n\n### Resources\n\n\n* [CISA Insights](https://www.cisa.gov/insights)\n* [CISA Alert: Using Rigorous Credential Control to Mitigate Trusted Network Exploitation](https://www.us-cert.gov/ncas/alerts/TA18-276A)\n* [CISA Alert: Microsoft Office 365 Security Recommendations](https://us-cert.cisa.gov/ncas/alerts/aa20-120a)\n* [CISA Incident Handling Overview for Election Officials](https://www.cisa.gov/sites/default/files/publications/incident_handling_elections_final_508_0.pdf)\n* [Preparing for and Responding to Cyber Security Incidents (ACSC)](https://www.cyber.gov.au/acsc/view-all-content/publications/preparing-and-responding-cyber-security-incidents)\n* [Strategies to Mitigate Cyber Security Incidents (ACSC)](https://www.cyber.gov.au/acsc/view-all-content/publications/strategies-mitigate-cyber-security-incidents)\n* [Managing Cyber Security Incidents (ACSC)](https://www.cyber.gov.au/acsc/view-all-content/guidance/managing-cyber-security-incidents)\n* [Incident Management (UK NCSC)](https://www.ncsc.gov.uk/collection/incident-management)\n* [Incident Management: Be Resilient, Be Prepared (NZ NCSC)](https://www.ncsc.govt.nz/guidance/incident-management/)\n* [Canadian Centre for Cyber Security Publications](https://cyber.gc.ca/en/publications)\n* [Baseline Cyber Security Controls for Small and Medium Organizations (CCCS)](https://cyber.gc.ca/en/guidance/baseline-cyber-security-controls-small-and-medium-organizations)\n* [Guideline on Network Security Zones (CCCS)](https://cyber.gc.ca/en/guidance/1-introduction-itsg-22)\n* [Network Security Zoning \\- Design Considerations for Placement of Services within Zones (CCCS)](https://www.cyber.gc.ca/en/guidance/network-security-zoning-design-considerations-placement-services-within-zones-itsg-38)\n\n\n\n### References\n\n\n\n\n[\\[1] Australian Cyber Security Centre (ACSC)](https://www.cyber.gov.au/) \n\n\n[\\[2] Canadian Centre for Cyber Security (CCCS)](https://www.cyber.gc.ca/en/) \n\n\n[\\[3] New Zealand National Cyber Security Centre (NZ NCSC)](https://www.ncsc.govt.nz/) \n\n\n[\\[4] New Zealand CERT NZ](https://www.cert.govt.nz/) \n\n\n[\\[5] United Kingdom National Cyber Security Centre (UK NCSC)](https://www.ncsc.gov.uk/) \n\n\n[\\[6] United States Cybersecurity and Infrastructure Security Agency (CISA)](https://www.cisa.gov/) \n\n\n### Revisions\n\n\n\n\n September 1, 2020: Initial Version\\|September 2, 2020: Revised to remove typo and to reference CCCS\\|September 24, 2020: Updated link to new version of CISA Incident Handling Overview for Election Officials\n \n\n\n\n\n\n\n\n\n\n\n This product is provided subject to this\n [Notification](/notification \"Follow link\") \n and this\n [Privacy \\& Use](/privacy-policy \"Follow link\") \n policy.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease share your thoughts\n--------------------------\n\n\n\n We recently updated our anonymous\n [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa20-245a) \n ; we’d welcome your feedback.\n \n\n\n\n\n\n\n\n\n\n\n\n\nRelated Advisories\n------------------\n\n\n\n\n\n\n\n\n\n\n Jul 11, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-193A\n \n\n### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a)\n\n\n\n\n\n\n\n\n\n\n\n Jul 08, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-190A\n \n\n### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a)\n\n\n\n\n\n\n\n\n\n\n\n May 10, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-131A\n \n\n### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a)\n\n\n\n\n\n\n\n\n\n\n\n Apr 18, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-109A\n \n\n### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Return to top](#) \n\n\n\n\n* [Topics](/topics)\n* [Spotlight](/spotlight)\n* [Resources \\& Tools](/resources-tools)\n* [News \\& Events](/news-events)\n* [Careers](/careers)\n* [About](/about)\n\n\n\n\n\n\n\n\n[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")\n\n\n* [Facebook](https://www.facebook.com/CISA)\n* [Twitter](https://twitter.com/CISAgov)\n* [LinkedIn](https://www.linkedin.com/company/cybersecurity-and-infrastructure-security-agency)\n* [YouTube](https://www.youtube.com/@cisagov)\n* [Instagram](https://www.instagram.com/cisagov)\n* [RSS](/subscribe-updates-cisa)\n\n\n\n\n CISA Central\n \n[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) \n[SayCISA@cisa.gov](mailto:SayCISA@cisa.gov) \n\n\n\n\n\n\n\n\n\n\n\n DHS Seal\n \n\n\n CISA.gov\n \n\n An official website of the U.S. Department of Homeland Security\n \n\n\n* [About CISA](/about \"About CISA\")\n* [Budget and Performance](https://www.dhs.gov/performance-financial-reports \"Budget and Performance\")\n* [DHS.gov](https://www.dhs.gov \"Department of Homeland Security\")\n* [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")\n* [FOIA Requests](https://www.dhs.gov/foia \"FOIA Requests\")\n* [No FEAR Act](/no-fear-act \"No FEAR Act Reporting\")\n* [Office of Inspector General](https://www.oig.dhs.gov/ \"Office of Inspector General\")\n* [Privacy Policy](/privacy-policy \"Privacy Policy\")\n* [Subscribe](https://public.govdelivery.com/accounts/USDHSCISA/subscriber/new?topic_id=USDHSCISA_138 \"Subscribe to Email Updates\")\n* [The White House](https://www.whitehouse.gov/ \"The White House\")\n* [USA.gov](https://www.usa.gov/ \"USA.gov\")\n* [Website Feedback](/forms/feedback \"Website Feedback\")\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "cves": [], "techniques": [], "advisory": "aa20-245a", "title": "Technical Approaches to Uncovering and Remediating Malicious Activity | CISA", "source": "cybersecurity-advisories", "id": "ade90e4cab67f190383702ccc5c6a18d1c6233d445b47be4e96aa879c465d1c2"}