{
  "markdown": "\n\nSummary\n\nThis advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) version 7 framework. See the ATT&CK for Enterprise version 7 for all referenced threat actor tactics and techniques.\nThis joint cybersecurity advisory was coauthored by the Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), and the U.S. Cyber Command Cyber National Mission Force (CNMF). This advisory describes the tactics, techniques, and procedures (TTPs) used by North Korean advanced persistent threat (APT) group Kimsuky—against worldwide targets—to gain intelligence on various topics of interest to the North Korean government. The U.S. Government refers to malicious cyber activity by the North Korean government as HIDDEN COBRA. For more information on HIDDEN COBRA activity, visit https://www.us-cert.cisa.gov/northkorea.\nThis advisory describes known Kimsuky TTPs, as found in open-source and intelligence reporting through July 2020. The target audience for this advisory is commercial sector businesses desiring to protect their networks from North Korean APT activity.\nClick here for a PDF version of this report.\nKey Findings\nThis advisory’s key findings are:\n\nThe Kimsuky APT group has most likely been operating since 2012.\nKimsuky is most likely tasked by the North Korean regime with a global intelligence gathering mission.\nKimsuky employs common social engineering tactics, spearphishing, and watering hole attacks to exfiltrate desired information from victims.[1],[2]\nKimsuky is most likely to use spearphishing to gain initial access into victim hosts or networks.[3]\nKimsuky conducts its intelligence collection activities against individuals and organizations in South Korea, Japan, and the United States.\nKimsuky focuses its intelligence collection activities on foreign policy and national security issues related to the Korean peninsula, nuclear policy, and sanctions.\nKimsuky specifically targets:\n\n\nIndividuals identified as experts in various fields,\nThink tanks, and\nSouth Korean government entities.[4],[5],[6],[7],[8]\n\n\nCISA, FBI, and CNMF recommend individuals and organizations within this target profile increase their defenses and adopt a heightened state of awareness. Particularly important mitigations include safeguards against spearphishing, use of multi-factor authentication, and user awareness training.\n\n\nTechnical Details\n\nInitial Access\nKimsuky uses various spearphishing and social engineering methods to obtain Initial Access [TA0001] to victim networks.[9],[10],[11] Spearphishing—with a malicious attachment embedded in the email—is the most observed Kimsuky tactic (Phishing: Spearphishing Attachment [T1566.001]).[12],[13]\n\nThe APT group has used web hosting credentials—stolen from victims outside of their usual targets—to host their malicious scripts and tools. Kimsuky likely obtained the credentials from the victims via spearphishing and credential harvesting scripts. On the victim domains, they have created subdomains mimicking legitimate sites and services they are spoofing, such as Google or Yahoo mail.[14]\nKimsuky has also sent benign emails to targets, which were possibly intended to build trust in advance of a follow-on email with a malicious attachment or link.\n\nPosing as South Korean reporters, Kimsuky exchanged several benign interview-themed emails with their intended target to ostensibly arrange an interview date and possibly build rapport. The emails contained the subject line “Skype Interview requests of [Redacted TV Show] in Seoul,” and began with a request to have the recipient appear as a guest on the show. The APT group invited the targets to a Skype interview on the topic of inter-Korean issues and denuclearization negotiations on the Korean Peninsula.\nAfter a recipient agreed to an interview, Kimsuky sent a subsequent email with a malicious document, either as an attachment or as a Google Drive link within the body. The document usually contained a variant of BabyShark malware (see the Execution section for information on BabyShark). When the date of the interview drew near, Kimsuky sent an email canceling the interview.\n\n\nKimsuky tailors its spearphishing and social engineering approaches to use topics relevant to the target, such as COVID-19, the North Korean nuclear program, or media interviews.[15],[16],[17]\n\nKimsuky’s other methods for obtaining initial access include login-security-alert-themed phishing emails, watering hole attacks, distributing malware through torrent sharing sites, and directing victims to install malicious browser extensions (Phishing: Spearphising Link [T1566.002], Drive-by Compromise [T1189], Man-in-the-Browser [T1185]).[18]\nExecution\nAfter obtaining initial access, Kimsuky uses BabyShark malware and PowerShell or the Windows Command Shell for Execution [TA0002].\n\nBabyShark is Visual Basic Script (VBS)-based malware.\n\nFirst, the compromised host system uses the native Microsoft Windows utility, mshta.exe, to download and execute an HTML application (HTA) file from a remote system (Signed Binary Proxy Execution: Mshta [T1218.005]).\nThe HTA file then downloads, decodes, and executes the encoded BabyShark VBS file.\nThe script maintains Persistence [TA0003] by creating a Registry key that runs on startup (Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder [T1547.001]).\n It then collects system information (System Information Discovery [T1082]), sends it to the operator’s command control (C2) servers, and awaits further commands.[19],[20],[21],[22]\n\n\nOpen-source reporting indicates BabyShark is delivered via an email message containing a link or an attachment (see Initial Access section for more information) (Phishing: Spearphising Link [T1566.002], Phishing: Spearphishing Attachment [T1566.001]). Kimsuky tailors email phishing messages to match its targets’ interests. Observed targets have been U.S. think tanks and the global cryptocurrency industry.[23]\nKimsuky uses PowerShell to run executables from the internet without touching the physical hard disk on a computer by using the target’s memory (Command and Scripting Interpreter: PowerShell [T1059.001]). PowerShell commands/scripts can be executed without invoking powershell.exe through HTA files or mshta.exe.[24],[25],[26],[27]\n\nPersistence\nKimsuky has demonstrated the ability to establish Persistence [TA0003] through using malicious browser extensions, modifying system processes, manipulating the autostart execution, using Remote Desktop Protocol (RDP), and changing the default file association for an application. By using these methods, Kimsuky can gain login and password information and/or launch malware outside of some application allowlisting solutions.\n\nIn 2018, Kimsuky used an extension, which was available on the Google Chrome Web Store, to infect victims and steal passwords and cookies from their browsers (Man-in-the-Browser [T1185]). The extension’s reviews gave it a five-star rating, however the text of the reviews applied to other extensions or was negative. The reviews were likely left by compromised Google+ accounts.[28]\nKimsuky may install a new service that can execute at startup by using utilities to interact with services or by directly modifying the Registry keys (Boot or Logon Autostart Execution [T1547]). The service name may be disguised with the name from a related operating system function or by masquerading as benign software. Services may be created with administrator privileges but are executed under system privileges, so an adversary can also use a service to escalate privileges from Administrator to System. They can also directly start services through Service Execution.[29],[30]\nDuring the STOLEN PENCIL operation in May 2018, Kimsuky used the GREASE malware. GREASE is a tool capable of adding a Windows administrator account and enabling RDP while avoiding firewall rules (Remote Services: Remote Desktop Protocol [T1021.001]).[31]\nKimsuky uses a document stealer module that changes the default program associated with Hangul Word Processor (HWP) documents (.hwp files) in the Registry (Event Triggered Execution: Change Default File Association [T1546.001]). Kimsuky manipulates the default Registry setting to open a malicious program instead of the legitimate HWP program (HWP is a Korean word processor). The malware will read and email the content from HWP documents before the legitimate HWP program ultimately opens the document.[32] Kimsuky also targets Microsoft Office users by formatting their documents in a .docx file rather than .hwp and will tailor their macros accordingly.[33]\nKimsuky maintains access to compromised domains by uploading actor-modified versions of open-source Hypertext Processor (PHP)-based web shells; these web shells enable the APT actor to upload, download, and delete files and directories on the compromised domains (Server Software Component: Web Shell [T1505.003]). The actor often adds “Dinosaur” references within the modified web shell codes.[34]\n\nPrivilege Escalation\nKimsuky uses well-known methods for Privilege Escalation [TA0004]. These methods include placing scripts in the Startup folder, creating and running new services, changing default file associations, and injecting malicious code in explorer.exe.\n\nKimsuky has used Win7Elevate—an exploit from the Metasploit framework—to bypass the User Account Control to inject malicious code into explorer.exe (Process Injection [T1055]). This malicious code decrypts its spying library—a collection of keystroke logging and remote control access tools and remote control download and execution tools—from resources, regardless of the victim’s operating system. It then saves the decrypted file to a disk with a random but hardcoded name (e.g., dfe8b437dd7c417a6d.tmp) in the user’s temporary folder and loads this file as a library, ensuring the tools are then on the system even after a reboot. This allows for the escalation of privileges.[35]\nBefore the injection takes place, the malware sets the necessary privileges (see figure 1). The malware writes the path to its malicious Dynamic Link Library (DLL) and ensures the remote process is loaded by creating a remote thread within explorer.exe (Process Injection [T1055]).[36]\n\n\nFigure 1: Privileges set for the injection [37]\nDefense Evasion\nKimsuky uses well-known and widely available methods for Defense Evasion [TA0005] within a network. These methods include disabling security tools, deleting files, and using Metasploit.[38],[39]\n\nKimsuky’s malicious DLL runs at startup to zero (i.e., turn off) the Windows firewall Registry keys (see figure 2). This disables the Windows system firewall and turns off the Windows Security Center service, which prevents the service from alerting the user about the disabled firewall (see figure 2) (Impair Defenses: Disable or Modify System Firewall [T1562.004]).[40]\n\n\nFigure 2: Disabled firewall values in the Registry [41]\n\nKimsuky has used a keylogger that deletes exfiltrated data on disk after it is transmitted to its C2 server (Indicator Removal on Host: File Deletion [T1070.004]).[42]\nKimsuky has used mshta.exe, which is a utility that executes Microsoft HTAs. It can be used for proxy execution of malicious .hta files and JavaScript or VBS through a trusted windows utility (Signed Binary Proxy Execution: Mshta [T1218.005]). It can also be used to bypass application allow listing solutions (Abuse Elevation Control Mechanism: Bypass User Access Control [T1548.002]).[43],[44]\nWin7Elevate—which was noted above—is also used to evade traditional security measures. Win7Elevatve is a part of the Metasploit framework open-source code and is used to inject malicious code into explorer.exe (Process Injection [T1055]). The malicious code decrypts its spying library from resources, saves the decrypted file to disk with a random but hardcoded name in the victim's temporary folder, and loads the file as a library.[45],[46],[47]\n\nCredential Access\nKimsuky uses legitimate tools and network sniffers to harvest credentials from web browsers, files, and keyloggers (Credential Access [TA0006]). \n\nKimsuky uses memory dump programs instead of using well-known malicious software and performs the credential extraction offline. Kimsuky uses ProcDump, a Windows command line administration tool, also available for Linux, that allows a user to create crash dumps/core dumps of processes based upon certain criteria, such as high central processing unit (CPU) utilization (OS Credential Dumping [T1003]). ProcDump monitors for CPU spikes and generates a crash dump when a value is met; it passes information to a Word document saved on the computer. It can be used as a general process dump utility that actors can embed in other scripts, as seen by Kimsuky’s inclusion of ProcDump in the BabyShark malware.[48]\nAccording to open-source security researchers, Kimsuky abuses a Chrome extension to steal passwords and cookies from browsers (Man-in-the-Browser [T1185]).[49],[50] The spearphishing email directs a victim to a phishing site, where the victim is shown a benign PDF document but is not able to view it. The victim is then redirected to the official Chrome Web Store page to install a Chrome extension, which has the ability to steal cookies and site passwords and loads a JavaScript file, named jQuery.js, from a separate site (see figure 3).[51]\n\n\nFigure 3: JavaScript file, named jQuery.js [52]\n\nKimsuky also uses a PowerShell based keylogger, named MECHANICAL, and a network sniffing tool, named Nirsoft SniffPass (Input Capture: Keylogging [T1056.001], Network Sniffing [T1040]). MECHANICAL logs keystrokes to %userprofile%\\appdata\\roaming\\apach.{txt,log} and is also a \"cryptojacker,\" which is a tool that uses a victim’s computer to mine cryptocurrency. Nirsoft SniffPass is capable of obtaining passwords sent over non-secure protocols.[53]\nKimsuky used actor-modified versions of PHProxy, an open-source web proxy written in PHP, to examine web traffic between the victim and the website accessed by the victims and to collect any credentials entered by the victim.[54]\n\nDiscovery\nKimsuky enumerates system information and the file structure for victims’ computers and networks (Discovery [TA0007]). Kimsuky appears to rely on using the victim’s operating system command prompt to enumerate the file structure and system information (File and Directory Discovery [T1083]). The information is directed to C:\\WINDOWS\\msdatl3.inc, read by malware, and likely emailed to the malware’s command server.[55]\nCollection\nKimsuky collects data from the victim system through its HWP document malware and its keylogger (Collection [TA0009]). The HWP document malware changes the default program association in the Registry to open HWP documents (Event Triggered Execution: Change Default File Association [T1546.001]). When a user opens an HWP file, the Registry key change triggers the execution of malware that opens the HWP document and then sends a copy of the HWP document to an account under the adversary’s control. The malware then allows the user to open the file as normal without any indication to the user that anything has occurred. The keylogger intercepts keystrokes and writes them to C:\\Program Files\\Common Files\\System\\Ole DB\\msolui80.inc and records the active window name where the user pressed keys (Input Capture: Keylogging [T1056.001]). There is another keylogger variant that logs keystrokes into C:\\WINDOWS\\setup.log.[56]\nKimsuky has also used a Mac OS Python implant that gathers data from Mac OS systems and sends it to a C2 server (Command and Scripting Interpreter: Python [T1059.006]). The Python program downloads various implants based on C2 options specified after the filedown.php (see figure 4).\n\n\nFigure 4: Python Script targeting MacOS [57]\nCommand and Control\nKimsuky has used a modified TeamViewer client, version 5.0.9104, for Command and Control [TA0011] (Remote Access Software [T1219]). During the initial infection, the service “Remote Access Service” is created and adjusted to execute C:\\Windows\\System32\\vcmon.exe at system startup (Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder [T1547.001]). Every time vcmon.exe is executed, it disables the firewall by zeroing out Registry values (Impair Defenses: Disable or Modify System Firewall [T1562.004]). The program then modifies the TeamViewer Registry settings by changing the TeamViewer strings in TeamViewer components. The launcher then configures several Registry values, including SecurityPasswordAES, that control how the remote access tool will work. The SecurityPasswordAES Registry value represents a hash of the password used by a remote user to connect to TeamViewer Client (Use Alternate Authentication Material: Pass the Hash [T1550.002]). This way, the attackers set a pre-shared authentication value to have access to the TeamViewer Client. The attacker will then execute the TeamViewer client netsvcs.exe.[58]\nKimsuky has been using a consistent format. In the URL used recently—express[.]php?op=1—there appears to be an option range from 1 to 3.[59]\nExfiltration\nOpen-source reporting from cybersecurity companies describes two different methods Kimsuky has used to exfiltrate stolen data: via email or through an RC4 key generated as an MD5 hash or a randomly generated 117-bytes buffer (Exfiltration [TA0010]).\nThere was no indication that the actor destroyed computers during the observed exfiltrations, suggesting Kimsuky’s intention is to steal information, not to disrupt computer networks. Kimsuky’s preferred method for sending or receiving exfiltrated information is through email, with their malware on the victim machine encrypting the data before sending it to a C2 server (Archive Collected Data [T1560]).  Kimsuky also sets up auto-forward rules within a victim’s email account (Email Collection: Email Forwarding Rule [T1114.003]).\nKimsuky also uses an RC4 key generated as an MD5 hash or a randomly generated 117-bytes buffer to exfiltrate stolen data. The data is sent RSA-encrypted (Encrypted Channel: Symmetric Cryptography [T1573.001]). Kimsuky’s malware constructs an 1120-bit public key and uses it to encrypt the 117-bytes buffer. The resulting data file is saved in C:\\Program Files\\Common Files\\System\\Ole DB\\ (Data Staged: Local Data Staging [T1074.001]).[60]\n\nMitigations\n\nIndicators of Compromise\nKimsuky has used the domains listed in table 1 to carry out its objectives:\nFor a downloadable copy of IOCs, see AA20-301A.stix.\nTable 1: Domains used by Kimsuky\n\n\n\n\nlogin.bignaver[.]com\n\n\nnytimes.onekma[.]com\n\n\nwebuserinfo[.]com\n\n\n\n\nmember.navier.pe[.]hu\n\n\nnid.naver.onektx[.]com\n\n\npro-navor[.]com\n\n\n\n\ncloudnaver[.]com\n\n\nread.tongilmoney[.]com\n\n\nnaver[.]pw\n\n\n\n\nresetprofile[.]com\n\n\nnid.naver.unicrefia[.]com\n\n\ndaurn[.]org\n\n\n\n\nservicenidnaver[.]com\n\n\nmail.unifsc[[.]com \n\n\nnaver.com[.]de\n\n\n\n\naccount.daurn.pe[.]hu\n\n\nmember.daum.unikortv[.]com \n\n\nns.onekorea[.]me\n\n\n\n\nlogin.daum.unikortv[.]com \n\n\nsecuretymail[.]com\n\n\nriaver[.]site\n\n\n\n\naccount.daum.unikortv[.]com \n\n\nhelp-navers[.]com\n\n\nmailsnaver[.]com\n\n\n\n\ndaum.unikortv[.]com\n\n\nbeyondparallel.sslport[.]work\n\n\ncloudmail[.]cloud\n\n\n\nmember.daum.uniex[.]kr\n\ncomment.poulsen[.]work\n\n\nhelpnaver[.]com\n\n\n\n\njonga[.]ml\n\n\nimpression.poulsen[.]work\n\n\nview-naver[.]com\n\n\n\n\nmyaccounts.gmail.kr-infos[.]com\n\n\nstatement.poulsen[.]work\n\n\nview-hanmail[.]net\n\n\n\n\nnaver.hol[.]es\n\n\ndemand.poulsen[.]work\n\n\nlogin.daum.net-accounts[.]info\n\n\n\n\ndept-dr.lab.hol[.]es\n\n\nsankei.sslport[.]work\n\n\nread-hanmail[.]net\n\n\n\n\nDaurn.pe[.]hu\n\n\nsts.desk-top[.]work\n\n\nnet.tm[.]ro\n\n\n\n\nBigfile.pe[.]hu\n\n\nhogy.desk-top[.]work\n\n\ndaum.net[.]pl\n\n\n\n\nCdaum.pe[.]hu\n\n\nkooo[.]gq \n\n\nusernaver[.]com\n\n\n\n\neastsea.or[.]kr\n\n\ntiosuaking[.]com\n\n\nnaver.com[.]ec\n\n\n\n\nmyaccount.nkaac[.]net\n\n\nhelp.unikoreas[.]kr\n\n\nnaver.com[.]mx\n\n\n\n\nnaver.koreagov[.]com\n\n\nresultview[.]com\n\n\nnaver.com[.]se\n\n\n\n\nnaver.onegov[.]com\n\n\naccount.daum.unikftc[.]kr\n\n\nnaver.com[.]cm\n\n\n\n\nmember-authorize[.]com\n\n\nww-naver[.]com\n\n\nnid.naver.com[.]se\n\n\n\n\nnaver.unibok[.]kr\n\n\nvilene.desk-top[.]work\n\n\ncsnaver[.]com\n\n\n\n\nnid.naver.unibok[.]kr\n\n\namberalexander.ghtdev[.]com\n\n\nnidnaver[.]email\n\n\n\n\nread-naver[.]com\n\n\nnidnaver[.]net\n\n\ncooper[.]center\n\n\n\n\ndubai-1[.]com\n\n\ncoinone.co[.]in\n\n\nnidlogin.naver.corper[.]be\n\n\n\n\namberalexander.ghtdev[.]com\n\n\nnaver.com[.]pl\n\n\nnid.naver.corper[.]be\n\n\n\n\ngloole[.]net\n\n\nnaver[.]cx\n\n\nnaverdns[.]co\n\n\n\n\nsmtper[.]org\n\n\nsmtper[.]cz\n\n\nnaver.co[.]in\n\n\n\n\nlogin.daum.kcrct[.]ml\n\n\nmyetherwallet.com[.]mx\n\n\ndownloadman06[.]com\n\n\n\n\nlogin.outlook.kcrct[.]ml\n\n\nmyetherwallet.co[.]in \n\n\nloadmanager07[.]com\n\n\n\n\ntop.naver.onekda[.]com\n\n\ncom-download[.]work\n\n\ncom-option[.]work\n\n\n\n\ncom-sslnet[.]work\n\n\ncom-vps[.]work\n\n\ncom-ssl[.]work\n\n\n\n\ndesk-top[.]work\n\n\nintemet[.]work\n\n\njp-ssl[.]work\n\n\n\n\norg-vip[.]work\n\n\nsslport[.]work\n\n\nsslserver[.]work\n\n\n\n\nssltop[.]work\n\n\ntaplist[.]work\n\n\nvpstop[.]work\n\n\n\n\nwebmain[.]work\n\n\npreview.manage.org-view[.]work\n\n\nintranet.ohchr.account-protect[.]work\n\n\n\n\n \nTable 2: Redacted domains used by Kimsuky\n\n\n\n\n[REDACTED]/home/dwn[.]php?van=101\n\n\n[REDACTED]/home/dwn[.]php?v%20an=101\n\n\n[REDACTED]/home/dwn[.]php?van=102\n\n\n\n\n[REDACTED]/home/up[.]php?id=NQDPDE\n\n\n[REDACTED]/test/Update[.]php?wShell=201\n\n\n \n\n\n\n\n\nContact Information\n\nTo report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local FBI field office at www.fbi.gov/contact-us/field, or the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by e-mail at CyWatch@fbi.gov. When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. To request incident response resources or technical assistance related to these threats, contact CISA at Central@cisa.dhs.gov.\n \nDISCLAIMER\n \n\nThis information is provided \"as is\" for informational purposes only. The United States Government does not provide any warranties of any kind regarding this information. In no event shall the United States Government or its contractors or subcontractors be liable for any damages, including but not limited to, direct, indirect, special or consequential damages, arising out of, resulting from, or in any way connected with this information, whether or not based upon warranty, contract, tort, or otherwise, whether or not arising out of negligence, and whether or not injury was sustained from, or arose out of the results of, or reliance upon the information.\nThe United States Government does not endorse any commercial product or service, including any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply their endorsement, recommendation, or favoring by the United States Government.\n\n\nReferences\n\n[1] Netscout: Stolen Pencil Campaign Targets Academia \n[2] CYWARE Social: Babyshark malware continues to target nuclear and cryptocurrency industries\n[3] CYWARE Social: Babyshark malware continues to target nuclear and cryptocurrency industries\n[4] Netscout: Stolen Pencil Campaign Targets Academia \n[5] MITRE ATT&CK: Groups – Kimsuky\n[6] Securityweek.com: North Korean Suspected Cyber-espionage Attacks Against South Korea Entities\n[7] MITRE ATT&CK: Groups – Kimsuky\n[8] CrowdStrike: 2020 Global Threat Report\n[9] Malwarebytes: APTs and COVID-19: How advanced persistent threats use the coronavirus as a lure\n[10] PwC: Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 2\n[11] CrowdStrike: 2020 Global Threat Report\n[12] Netscout: Stolen Pencil Campaign Targets Academia \n[13] MITRE ATT&CK: Groups – Kimsuky\n\">[14] Private Sector Partner\n[15] CYWARE Social: Babyshark malware continues to target nuclear and cryptocurrency industries\n[16] Malwarebytes: APTs and COVID-19: How advanced persistent threats use the coronavirus as a lure\n[17] cyberscoop: North Korea could accelerate commercial espionage to meet Kim’s economic deadline \n[18] MITRE ATT&CK: Groups – Kimsuky\n[19] CYWARE Social: Babyshark malware continues to target nuclear and cryptocurrency industries\n[20] MITRE ATT&CK: Groups – Kimsuky\n[21] Palo Alto Networks Unit 42: New BabyShark Malware Targets U.S. National Security Think Tanks\n[22] Palo Alto Networks Unit 42: New BabyShark Malware Targets U.S. National Security Think Tanks\n[23] CYWARE Social: Babyshark malware continues to target nuclear and cryptocurrency industries\n[24] MITRE ATT&CK: Groups – Kimsuky\n[25] Palo Alto Networks Unit 42: BabyShark Malware Part Two – Attacks Continue Using KimJongRAT and PCRat \n[26] McAfee: What is mshta, how can it be used and how to protect against it\n[27] Palo Alto Networks Unit 42: New BabyShark Malware Targets U.S. National Security Think Tanks\n[28] Netscout: Stolen Pencil Campaign Targets Academia\n[29] MITRE ATT&CK: Groups – Kimsuky\n[30] Palo Alto Networks Unit 42: New BabyShark Malware Targets U.S. National Security Think Tanks\n[31] Netscout: Stolen Pencil Campaign Targets Academia \n[32] Securelist: The “Kimsuky” Operation: A North Korean APT?\n\">[33] Private Sector Partner\n\">[34] Private Sector Partner\n[35] Securelist: The “Kimsuky” Operation: A North Korean APT?\n[36] Yoroi: The North Korean Kimsuky APT Keeps Threatening South Korea Evolving its TTPs\n[37] Yoroi: The North Korean Kimsuky APT Keeps Threatening South Korea Evolving its TTPs\n[38] Securelist: The “Kimsuky” Operation: A North Korean APT?\n[39] MITRE ATT&CK: Groups – Kimsuky\n[40] Securelist: The “Kimsuky” Operation: A North Korean APT?\n[41] Securelist: The “Kimsuky” Operation: A North Korean APT?\n[42] Securelist: The “Kimsuky” Operation: A North Korean APT?\n[43] MITRE ATT&CK: Groups – Kimsuky\n[44] McAfee: What is mshta, how can it be used and how to protect against it\n[45] Securityweek.com: North Korean Suspected Cyber-espionage Attacks Against South Korea Entities\n[46] Securelist: The “Kimsuky” Operation: A North Korean APT?\n[47] MITRE ATT&CK: Groups – Kimsuky\n[48] Detecting credential theft through memory access modelling with Microsoft Defender ATP\n[49] MITRE ATT&CK: Groups – Kimsuky\n[50] ZDNet: Cyber-espionage-group-uses-chrome-extension-to-infect-victims\n[51] ZDNet: Cyber-espionage-group-uses-chrome-extension-to-infect-victims\n[52] Netscout: Stolen Pencil Campaign Targets Academia \n[53] Netscout: Stolen Pencil Campaign Targets Academia \n\">[54] Private Sector Partner\n[55] Securelist: The “Kimsuky” Operation: A North Korean APT? \n[56] Securelist: The “Kimsuky” Operation: A North Korean APT? \n\">[57] Private Sector Partner\n[58] Securelist: The “Kimsuky” Operation: A North Korean APT? \n\">[59] Private Sector Partner\n[60] Securelist: The “Kimsuky” Operation: A North Korean APT? \n\nRevisions\n\nOctober 27, 2020: Initial Version\n",
  "cves": [],
  "techniques": [
    "T1566.002",
    "T1218.005",
    "T1059.001",
    "T1573.001",
    "T1074.001",
    "T1505.003",
    "T1070.004",
    "T1059.006",
    "T1550.002",
    "T1021.001",
    "T1566.001",
    "T1114.003",
    "T1056.001",
    "T1547.001",
    "T1562.004",
    "T1546.001",
    "T1548.002"
  ],
  "advisory": "aa20-301a",
  "title": "North Korean Advanced Persistent Threat Focus: Kimsuky | CISA",
  "source": "cybersecurity-advisories",
  "id": "c907003d66efd9b2105c75f6035634f573b4f658625a901e2113464cd68d5c82"
}