{
  "markdown": "\n\nSummary\n\nOn August 17, 2021, BlackBerry publicly disclosed that its QNX Real Time Operating System (RTOS) is affected by a BadAlloc vulnerability—CVE-2021-22156. BadAlloc is a collection of vulnerabilities affecting multiple RTOSs and supporting libraries.[1] A remote attacker could exploit CVE-2021-22156 to cause a denial-of-service condition or execute arbitrary code on affected devices.[2] BlackBerry QNX RTOS is used in a wide range of products whose compromise could result in a malicious actor gaining control of highly sensitive systems,  increasing risk to the Nation’s critical functions. Note: at this time, CISA is not aware of active exploitation of this vulnerability.\nCISA strongly encourages critical infrastructure organizations and other organization developing, maintaining, supporting, or using affected QNX-based systems, to patch affected products as quickly as possible. Refer to the Mitigations section for more information about patching.\nClick here for a PDF version of this report.\n\nTechnical Details\n\nCVE-2021-22156 is an integer overflow vulnerability affecting the calloc() function in the C runtime library of multiple BlackBerry QNX products. Exploitation of this vulnerability could lead to a denial-of-service condition or arbitrary code execution in affected devices. To exploit this vulnerability, an attacker must have control over the parameters to a calloc() function call and the ability to control what memory is accessed after the allocation. An attacker with network access could remotely exploit this vulnerability if the vulnerable product is running and the affected device is exposed to the internet.[3]\nCVE-2021-22156 is part of a collection of integer overflow vulnerabilities, known as BadAlloc, which affect a wide range of industries using Internet of Things (IoT), and operational technology (OT)/industrial control systems (ICS) devices. See CISA ICS Advisory ICSA-21-119-04 and Microsoft’s BadAlloc blog post for more information.\nAll BlackBerry programs with dependency on the C runtime library are affected by this vulnerability (see table 1 for a list of affected BlackBerry QNX products). Because many affected devices include safety-critical devices, exploitation of this vulnerability could result in a malicious actor gaining control of sensitive systems, possibly leading to increased risk of damage to infrastructure or critical functions.\n\n\nTable 1: Affected BlackBerry QNX Products [4] \n\n\n\nProduct\nAffected Version\n\n\n QNX SDP\n 6.5.0SP1, 6.5.0,  6.4.1, 6.4.0\n\n\n QNX Momentics Development Suite\n 6.3.2\n\n\n QNX Momentics\n6.3.0SP3, 6.3.0SP2, 6.3.0SP1, 6.3.0, 6.2.1b, 6.2.1, 6.2.1A, 6.2.0\n\n\n QNX Realtime Platform\n 6.1.0a, 6.1.0, 6.0.0a, 6.0.0\n\n\n QNX Cross Development Kit\n 6.0.0, 6.1.0\n\n\n QNX Development Kit (Self-hosted)\n 6.0.0, 6.1.0\n\n\n QNX Neutrino RTOS Safe Kernel\n 1.0\n\n\n QNX Neutrino RTOS Certified Plus\n 1.0\n\n\n QNX Neutrino RTOS for Medical Devices\n 1.0, 1.1\n\n\n QNX OS for Automotive Safety\n 1.0\n\n\n QNX OS for Safety\n 1.0, 1.0.1\n\n\n QNX Neutrino Secure Kernel\n 6.4.0, 6.5.0\n\n\n QNX CAR Development Platform\n 2.0RR\n\n\n\n \n\nMitigations\n\nCISA strongly encourages critical infrastructure organizations and other organizations developing, maintaining, supporting, or using affected QNX-based systems to patch affected products as quickly as possible.\n\nManufacturers of products that incorporate vulnerable versions should contact BlackBerry to obtain the patch.\nManufacturers of products who develop unique versions of RTOS software should contact BlackBerry to obtain the patch code. Note: in some cases, manufacturers may need to develop and test their own software patches.\nEnd users of safety-critical systems should contact the manufacturer of their product to obtain a patch. If a patch is available, users should apply the patch as soon as possible. If a patch is not available, users should apply the manufacturer's recommended mitigation measures until the patch can be applied.\n\nNote: installation of software updates for RTOS frequently may require taking the device out of service or to an off-site location for physical replacement of integrated memory.\n\n\n\nCritical infrastructure organizations are encouraged to review the following guidance for additional information: \n\nU.S. Coast Guard Maritime Security Advisory: Maritime Cyber Alert 02-21\nU.S. Nuclear Regulatory Commission Security Advisory: Blackberry QNX Vulnerability\nJoint WaterISAC: U.S. Environmental Protection Agency Advisory - BadAlloc Vulnerability Impacting BlackBerry QNX RTOS\n\nResources\n\nCISA ICS Advisory: ICSA-21-119-04: Multiple RTOS\nBlackBerry: QNX-2021-001 Vulnerability in the C Runtime Library Impacts BlackBerry QNX Software Development Platform (SDP), QNX OS for Medical, and QNX OS for Safety\n\n\nReferences\n\n[1] BlackBerry: QNX-2021-001 Vulnerability in the C Runtime Library Impacts BlackBerry QNX Software Development Platform (SDP), QNX OS for Medical, and QNX OS for Safety\n[2] Ibid.\n[3] Ibid.\n[4] BlackBerry: QNX. Affected Product List \n\nRevisions\n\nInitial version: August 17, 2021|August 18, 2021: Added links to U.S. Coast Guard and U.S. Nuclear Regulatory Commission advisories.|August 23, 2021: Added additional resource for critical infrastructure organizations\n",
  "cves": [
    "CVE-2021-22156"
  ],
  "techniques": [],
  "advisory": "aa21-229a",
  "title": "BadAlloc Vulnerability Affecting BlackBerry QNX RTOS | CISA",
  "source": "cybersecurity-advisories",
  "id": "13929277fbce4a7e572f060474fd604ed050f9d5b9678aeafda1b3bdc253cfe5"
}