{
  "markdown": "\n\nSummary\n\nActions to Take Today to Protect Against Iranian State-Sponsored Malicious Cyber Activity\n• Immediately patch software affected by the following vulnerabilities: CVE-2021-34473, 2018-13379, 2020-12812, and 2019-5591.\n• Implement multi-factor authentication.\n• Use strong, unique passwords.v\nNote: this advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework, version 10. See the ATT&CK for Enterprise for all referenced threat actor tactics and techniques.\nThis joint cybersecurity advisory is the result of an analytic effort among the Federal Bureau of Investigation (FBI), the Cybersecurity and Infrastructure Security Agency (CISA), the Australian Cyber Security Centre (ACSC), and the United Kingdom’s National Cyber Security Centre (NCSC) to highlight ongoing malicious cyber activity by an advanced persistent threat (APT) group that FBI, CISA, ACSC, and NCSC assess is associated with the government of Iran. FBI and CISA have observed this Iranian government-sponsored APT group exploit Fortinet vulnerabilities since at least March 2021 and a Microsoft Exchange ProxyShell vulnerability since at least October 2021 to gain initial access to systems in advance of follow-on operations, which include deploying ransomware. ACSC is also aware this APT group has used the same Microsoft Exchange vulnerability in Australia.\nThe Iranian government-sponsored APT actors are actively targeting a broad range of victims across multiple U.S. critical infrastructure sectors, including the Transportation Sector and the Healthcare and Public Health Sector, as well as Australian organizations. FBI, CISA, ACSC, and NCSC assess the actors are focused on exploiting known vulnerabilities rather than targeting specific sectors. These Iranian government-sponsored APT actors can leverage this access for follow-on operations, such as data exfiltration or encryption, ransomware, and extortion.\nThis advisory provides observed tactics and techniques, as well as indicators of compromise (IOCs) that FBI, CISA, ACSC, and NCSC assess are likely associated with this Iranian government-sponsored APT activity.\nThe FBI, CISA, ACSC, and NCSC urge critical infrastructure organizations to apply the recommendations listed in the Mitigations section of this advisory to mitigate risk of compromise from Iranian government-sponsored cyber actors.\nFor a downloadable copy of IOCs, see AA21-321A.stix.\nFor more information on Iranian government-sponsored malicious cyber activity, see us-cert.cisa.gov/Iran.\nClick here for a PDF version of this report.\n\nTechnical Details\n\nThreat Actor Activity\nSince at least March 2021, the FBI and CISA have observed Iranian government-sponsored APT actors leverage Microsoft Exchange and Fortinet vulnerabilities to target a broad range of victims across multiple critical infrastructure sectors in furtherance of malicious activities. Observed activity includes the following.\n\nIn March 2021, the FBI and CISA observed these Iranian government-sponsored APT actors scanning devices on ports 4443, 8443, and 10443 for Fortinet FortiOS vulnerability CVE-2018-13379, and enumerating devices for FortiOS vulnerabilities CVE-2020-12812 and CVE-2019-5591. The Iranian Government-sponsored APT actors likely exploited these vulnerabilities to gain access to vulnerable networks. Note: for previous FBI and CISA reporting on this activity, refer to Joint Cybersecurity Advisory: APT Actors Exploit Vulnerabilities to Gain Initial Access for Future Attacks.\nIn May 2021, these Iranian government-sponsored APT actors exploited a Fortigate appliance to access a webserver hosting the domain for a U.S. municipal government. The actors likely created an account with the username elie to further enable malicious activity. Note: for previous FBI reporting on this activity, refer to FBI FLASH: APT Actors Exploiting Fortinet Vulnerabilities to Gain Initial Access for Malicious Activity.\nIn June 2021, these APT actors exploited a Fortigate appliance to access environmental control networks associated with a U.S.-based hospital specializing in healthcare for children. The Iranian government-sponsored APT actors likely leveraged a server assigned to IP addresses 91.214.124[.]143 and 162.55.137[.]20—which FBI and CISA judge are associated with Iranian government cyber activity—to further enable malicious activity against the hospital’s network. The APT actors accessed known user accounts at the hospital from IP address 154.16.192[.]70, which FBI and CISA judge is associated with government of Iran offensive cyber activity.\nAs of October 2021, these APT actors have leveraged a Microsoft Exchange ProxyShell vulnerability—CVE-2021-34473—to gain initial access to systems in advance of follow-on operations.\n\nACSC considers that this APT group has also used the same Microsoft Exchange vulnerability (CVE-2021-34473) in Australia.\nMITRE ATT&CK Tactics and Techniques\nFBI, CISA, ACSC, and NCSC assess the following tactics and techniques are associated with this activity.\nResource Development [TA0042]\nThe APT actors have used the following malicious and legitimate tools [T1588.001, T1588.002] for a variety of tactics across the enterprise spectrum.\n\nMimikatz for credential theft [TA0006]\nWinPEAS for privilege escalation [TA0004]\nSharpWMI (Windows Management Instrumentation)\nWinRAR for archiving collected data [TA0009, T1560.001]\nFileZilla for transferring files [TA0010]\n\nInitial Access [TA0001]\nThe Iranian government-sponsored APT actors gained initial access by exploiting vulnerabilities affecting Microsoft Exchange servers (CVE-2021-34473) and Fortinet devices (CVE-2018-13379, CVE-2020-12812, and CVE-2019-5591) [T1190].\nExecution [TA0002]\nThe Iranian government-sponsored APT actors may have made modifications to the Task Scheduler [T1053.005]. These modifications may display as unrecognized scheduled tasks or actions. Specifically, the below established tasks may be associated with this activity:\n\nSynchronizeTimeZone\nGoogleChangeManagement\nMicrosoftOutLookUpdater\nMicrosoftOutLookUpdateSchedule\n\nPersistence [TA0003]\nThe Iranian government-sponsored APT actors may have established new user accounts on domain controllers, servers, workstations, and active directories [T1136.001, T1136.002]. Some of these accounts appear to have been created to look similar to other existing accounts on the network, so specific account names may vary per organization. In addition to unrecognized user accounts or accounts established to masquerade as existing accounts, the following account usernames may be associated with this activity:\n\nSupport\nHelp\nelie\nWADGUtilityAccount\n\nExfiltration [TA0010]\nThe FBI and CISA observed outbound File Transfer Protocol (FTP) transfers over port 443.\nImpact [TA0040]\nThe APT actors forced BitLocker activation on host networks to encrypt data [T1486]. The corresponding threatening notes were either sent to the victim or left on the victim network as a .txt file. The ransom notes included ransom demands and the following contact information. \n\nsar_addr@protonmail[.]com\nWeAreHere@secmail[.]pro\nnosterrmann@mail[.]com\nnosterrmann@protonmail[.]com \n\nDetection\nThe FBI, CISA, ACSC, and NCSC recommend that organizations using Microsoft Exchange servers and Fortinet investigate potential suspicious activity in their networks. \n\nSearch for IOCs. Collect known-bad IOCs and search for them in network and host artifacts. Note: refer to Appendix A for IOCs.\nInvestigate exposed Microsoft Exchange servers (both patched and unpatched) for compromise. \nInvestigate changes to Remote Desktop Protocol (RDP), firewall, and Windows Remote Management (WinRM) configurations that may allow attackers to maintain persistent access. \nReview domain controllers, servers, workstations, and active directories for new or unrecognized user accounts.\nReview Task Scheduler for unrecognized scheduled tasks. Additionally, manually review operating-system defined or recognized scheduled tasks for unrecognized “actions” (for example, review the steps each scheduled task is expected to perform).\nReview antivirus logs for indications they were unexpectedly turned off.\nLook for WinRAR and FileZilla in unexpected locations. \n\nNote: for additional approaches on uncovering malicious cyber activity, see joint advisory Technical Approaches to Uncovering and Remediating Malicious Activity, authored by CISA and the cybersecurity authorities of Australia, Canada, New Zealand, and the United Kingdom. \n\nMitigations\n\nThe FBI, CISA, ACSC, and NCSC urge network defenders to apply the following mitigations to reduce the risk of compromise by this threat.\nPatch and Update Systems\n\nInstall updates/patch operating systems, software, and firmware as soon as updates/patches are released. \nImmediately patch software affected by vulnerabilities identified in this advisory: CVE-2021-34473, CVE-2018-13379, CVE-2020-12812, and CVE-2019-5591.\n\nEvaluate and Update Blocklists and Allowlists\n\nRegularly evaluate and update blocklists and allowlists.\nIf FortiOS is not used by your organization, add the key artifact files used by FortiOS to your organization’s execution blocklist. Any attempts to install or run this program and its associated files should be prevented.\n\nImplement and Enforce Backup and Restoration Policies and Procedures\n\nRegularly back up data, air gap, and password protect backup copies offline.\nEnsure copies of critical data are not accessible for modification or deletion from the system where the data resides. \nImplement a recovery plan to maintain and retain multiple copies of sensitive or proprietary data and servers in a physically separate, segmented, secure location (e.g., hard drive, storage device, the cloud). \n\nImplement Network Segmentation\n\nImplement network segmentation to restrict adversary’s lateral movement. \n\nSecure User Accounts\n\nAudit user accounts with administrative privileges and configure access controls under the principles of least privilege and separation of duties. \nRequire administrator credentials to install software. \n\nImplement Multi-Factor Authentication\n\nUse multifactor authentication where possible, particularly for webmail, virtual private networks (VPNs), and accounts that access critical systems. \n\nUse Strong Passwords\n\nRequire all accounts with password logins to have strong, unique passwords.\n\nSecure and Monitor RDP and other Potentially Risky Services\n\nIf you use RDP, restrict it to limit access to resources over internal networks.\nDisable unused remote access/RDP ports.\nMonitor remote access/RDP logs. \n\nUse Antivirus Programs\n\nInstall and regularly update antivirus and anti-malware software on all hosts. \n\nSecure Remote Access\n\nOnly use secure networks and avoid using public Wi-Fi networks. \nConsider installing and using a VPN for remote access.\n\nReduce Risk of Phishing\n\nConsider adding an email banner to emails received from outside your organization.\nDisable hyperlinks in received emails\n\nResources\n\nFor more information on Iranian government-sponsored malicious cyber activity, see us-cert.cisa.gov/Iran. \nFor information and resources on protecting against and responding to ransomware, refer to StopRansomware.gov, a centralized, whole-of-government webpage providing ransomware resources and alerts.\nThe joint advisory from the cybersecurity authorities of Australia, Canada, New Zealand, the United Kingdom, and the United States: Technical Approaches to Uncovering and Remediating Malicious Activity provides additional guidance when hunting or investigating a network and common mistakes to avoid in incident handling.\nCISA offers a range of no-cost cyber hygiene services to help critical infrastructure organizations assess, identify, and reduce their exposure to threats, including ransomware. By requesting these services, organizations of any size could find ways to reduce their risk and mitigate attack vectors.\nThe U.S. Department of State’s Rewards for Justice (RFJ) program offers a reward of up to $10 million for reports of foreign government malicious activity against U.S. critical infrastructure. See the RFJ website for more information and how to report information securely.\nACSC can provide tailored cyber security advice and assistance, reporting, and incident response support at cyber.gov.au and via 1300 292 371 (1300 CYBER1).\n\nAppendix A: Indicators of Compromise\nIP addresses and executables files are listed below. For a downloadable copy of IOCs, see AA21-321A.stix.\nIP Addresses\n\n91.214.124[.]143 \n162.55.137[.]20 \n154.16.192[.]70\n\nExecutable Files \nExecutable files observed in this activity are identified in table 1.\nTable 1: Executable Files \n\n\n\nFilename:\nMicrosoftOutLookUpdater[.]exe \n\n\n\n\nMD5:\n1444884faed804667d8c2bfa0d63ab13\n\n\nSHA-1:\n95E045446EFB8C9983EBFD85E39B4BE5D92C7A2A\n\n\nSHA-256:\nc51fe5073bd493c7e8d83365aace3f9911437a0f2ae80042ba01ea46b55d2624\n\n\nSHA-512:\n6451077B99C5F8ECC5C0CA88FE272156296BEB91218B39AE28A086DBA5E7E39813F044F9AF0FEDBB260941B1CD52FA237C098CBF4B2A822F08E3E98E934D0ECF\n\n\nFilename:\nMicrosoftOutlookUpdater.bat\n\n\nMD5:\n1A44368EB5BF68688BA4B4357BDC874F\n\n\nSHA-1\nFA36FEBFD5A5CA0B3A1B19005B952683A7188A13\n\n\nSHA-256\n3A08D0CB0FF4D95ED0896F22F4DA8755525C243C457BA6273E08453E0E3AC4C4\n\n\nSHA-512\n70AA89449EB5DA1D84B70D114EF9D24CB74751CE12D12C783251E51775C89FDCE61B4265B43B1D613114D6A85E9C75927B706F39C576DBB036079C7E8CAF28B2\n\n\nFilename:\nMicrosoftOutlookUpdater.xml\n\n\nMD5:\nAA40C49E309959FA04B7E5AC111BB770\n\n\nSHA-1\nF1D90E10E6E3654654E0A677763C9767C913F8F0\n\n\nSHA-256\n5C818FE43F05F4773AD20E0862280B0D5C66611BB12459A08442F55F148400A6\n\n\nSHA-512\nE55A86159F2E869DCDB64FDC730DA893718E20D65A04071770BD32CAE75FF8C34704BDF9F72EF055A3B362759EDE3682B3883C4D9BCF87013076638664E8078E\n\n\nFilename:\nGoogleChangeManagement.xml\n\n\nMD5:\nAF2D86042602CBBDCC7F1E8EFA6423F9\n\n\nSHA-1\nCDCD97F946B78831A9B88B0A5CD785288DC603C1\n\n\nSHA-256\n4C691CCD811B868D1934B4B8E9ED6D5DB85EF35504F85D860E8FD84C547EBF1D\n\n\nSHA-512\n6473DAC67B75194DEEAEF37103BBA17936F6C16FFCD2A7345A5A46756996FAD748A97F36F8FD4BE4E1F264ECE313773CC5596099D68E71344D8135F50E5D8971\n\n\nFilename:\nConnector3.exe\n\n\nMD5:\ne64064f76e59dea46a0768993697ef2f\n\n\nFilename:\nAudio.exe or frpc.exe\n\n\nMD5:\nb90f05b5e705e0b0cb47f51b985f84db\n\n\nSHA-1\n5bd0690247dc1e446916800af169270f100d089b\n\n\nSHA-256:\n28332bdbfaeb8333dad5ada3c10819a1a015db9106d5e8a74beaaf03797511aa\n\n\nVhash:\n017067555d5d15541az28!z\n\n\nAuthentihash:\ned463da90504f3adb43ab82044cddab8922ba029511da9ad5a52b8c20bda65ee\n\n\nImphash:\n93a138801d9601e4c36e6274c8b9d111\n\n\nSSDEEP:\n98304:MeOuFco2Aate8mjOaFEKC8KZ1F4ANWyJXf/X+g4:MeHFV2AatevjOaDC8KZ1xNWy93U\n\n\nNote:\n\nIdentical to “frpc.exe” available at:\nhttps://github[.]com/fatedier/frp/releases/download/v0.34.3/frp_0.34.3_windows_amd64.zip\n\n\n\nFilename:\nFrps.exe\n\n\nMD5:\n26f330dadcdd717ef575aa5bfcdbe76a\n\n\nSHA-1\nc4160aa55d092cf916a98f3b3ee8b940f2755053\n\n\nSHA-256:\nd7982ffe09f947e5b4237c9477af73a034114af03968e3c4ce462a029f072a5a\n\n\nVhash:\n017057555d6d141az25!z\n\n\nAuthentihash:\n40ed1568fef4c5f9d03c370b2b9b06a3d0bd32caca1850f509223b3cee2225ea\n\n\nImphash:\n91802a615b3a5c4bcc05bc5f66a5b219\n\n\nSSDEEP:\n196608:/qTLyGAlLrOt8enYfrhkhBnfY0NIPvoOQiE:GLHiLrSfY5voO\n\n\nNote:\n\nIdentical to “frps.exe” available at: \n\t\t\thttps://github[.]com/fatedier/frp/releases/download/v0.33.0/frp_0.33.0_windows_amd64.zip\n \n\n\n\n\n \nAPPENDIX B: MITRE ATT&CK TACTICS AND TECHNIQUES\nTable 2 identifies MITRE ATT&CK Tactics and techniques observed in this activity.\nTable 2: Observed Tactics and Techniques\n\n\n\nTactic\nTechnique\n\n\n\n\nResource Development [TA0042]\n\nObtain Capabilities: Malware [T1588.001]\n\n\n\n\nObtain Capabilities: Tool [T1588.002]\n\n\n\nInitial Access [TA0001]\n\nExploit Public-Facing Application [T1190]\n\n\n\n\nExecution [TA0002]\n\n\nScheduled Task/Job: Scheduled Task [T1053.005]\n\n\n\nPersistence [TA0003]\n\nCreate Account: Local Account [T1136.001]\n\n\n\nCreate Account: Domain Account [T1136.002]\n\n\nPrivilege Escalation [TA0004]\n \n\n\n\nCredential Access [TA0006]\n\n \n\n\nCollection [TA0009]\n\nArchive Collected Data: Archive via Utility [T1560.001]\n\n\n\nExfiltration [TA0010]\n \n\n\nImpact [TA0040]\nData Encrypted for Impact [T1486]\n\n\n\n\nContact Information\n\nTo report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local FBI field office at https://www.fbi.gov/contact-us/field-offices, or the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by e-mail at CyWatch@fbi.gov. When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. To request incident response resources or technical assistance related to these threats, contact CISA at Central@cisa.dhs.gov. Australian organizations can visit cyber.gov.au or call 1300 292 371 (1300 CYBER 1) to report cybersecurity incidents and access alerts and advisories.\n\nRevisions\n\nNovember 17, 2021: Initial Version|November 19, 2021: Added STIX files\n",
  "cves": [
    "CVE-2020-12812",
    "CVE-2018-13379",
    "CVE-2021-34473",
    "CVE-2019-5591"
  ],
  "techniques": [
    "T1588.002",
    "T1588.001",
    "T1560.001",
    "T1136.001",
    "T1136.002",
    "T1053.005"
  ],
  "advisory": "aa21-321a",
  "title": "Iranian Government-Sponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities in Furtherance of Malicious Activities | CISA",
  "source": "cybersecurity-advisories",
  "id": "d56c85ef5b82fb608f0e36d34ed71655a485adb66e2462171644f04138c70893"
}