{
  "markdown": "\n\nSummary\n\nThis Advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework. See the ATT&CK for Enterprise for all referenced threat actor tactics and techniques.\nThis joint advisory is the result of analytic efforts among the Federal Bureau of Investigation (FBI), the Cybersecurity and Infrastructure Security Agency (CISA), and the Department of Treasury (Treasury) to highlight the cyber threat to cryptocurrency posed by North Korea, formally known as the Democratic People’s Republic of Korea (DPRK), and provide mitigation recommendations. Working with U.S. government partners, FBI, CISA, and Treasury assess that Lazarus Group—which these agencies attribute to North Korean state-sponsored advanced persistent threat (APT) actors—is targeting individuals and companies, including cryptocurrency exchanges and financial service companies, through the dissemination of cryptocurrency trading applications that have been modified to include malware that facilitates theft of cryptocurrency.\nThese cyber actors have targeted organizations for cryptocurrency theft in over 30 countries during the past year alone. It is likely that these actors view modified cryptocurrency trading applications as a means to circumvent international sanctions on North Korea—the applications enable them to gain entry into companies that conduct cryptocurrency transactions and steal cryptocurrency from victim accounts. As highlighted in FASTCash 2.0: North Korea's BeagleBoyz Robbing Banks and Guidance on the North Korean Cyber Threat, North Korea’s state-sponsored cyber actors are targeting cryptocurrency exchanges and accounts to steal and launder hundreds of millions of dollars in cryptocurrency.[1][2][3] The U.S. Government refers to malicious cyber activity by the North Korean government as HIDDEN COBRA. For more information on HIDDEN COBRA activity, visit https://www.us-cert.cisa.gov/northkorea.\nThe U.S. Government has identified malware and indicators of compromise (IOCs) used by the North Korean government to facilitate cryptocurrency thefts; the cybersecurity community refers to this activity as “AppleJeus.” This report catalogues AppleJeus malware in detail. North Korea has used AppleJeus malware posing as cryptocurrency trading platforms since at least 2018. In most instances, the malicious application—seen on both Windows and Mac operating systems—appears to be from a legitimate cryptocurrency trading company, thus fooling individuals into downloading it as a third-party application from a website that seems legitimate. In addition to infecting victims through legitimate-looking websites, HIDDEN COBRA actors also use phishing, social networking, and social engineering techniques to lure users into downloading the malware.\nRefer to the following Malware Analysis Reports (MARs) for full technical details of AppleJeus malware and associated IOCs.\n\nMAR-10322463-1.v1: AppleJeus – Celas Trade Pro\nMAR-10322463-2.v1: AppleJeus – JMT Trading\nMAR-10322463-3.v1: AppleJeus – Union Crypto\nMAR-10322463-4.v1: AppleJeus – Kupay Wallet\nMAR-10322463-5.v1: AppleJeus – CoinGoTrade\nMAR-10322463-6.v1: AppleJeus – Dorusio\nMAR-10322463-7.v1: AppleJeus – Ants2Whale\n\nClick here for a PDF version of this report.\n\nTechnical Details\n\nThe North Korean government has used multiple versions of AppleJeus since the malware was initially discovered in 2018. This section outlines seven of the versions below. The MARs listed above provide further technical details of these versions. Initially, HIDDEN COBRA actors used websites that appeared to host legitimate cryptocurrency trading platforms to infect victims with AppleJeus; however, these actors are now also using other initial infection vectors, such as phishing, social networking, and social engineering techniques, to get users to download the malware.\nTargeted Nations\nHIDDEN COBRA actors have targeted institutions with AppleJeus malware in several sectors, including energy, finance, government, industry, technology, and telecommunications. Since January 2020, the threat actors have targeted these sectors in the following countries: Argentina, Australia, Belgium, Brazil, Canada, China, Denmark, Estonia, Germany, Hong Kong, Hungary, India, Ireland, Israel, Italy, Japan, Luxembourg, Malta, the Netherlands, New Zealand, Poland, Russia, Saudi Arabia, Singapore, Slovenia, South Korea, Spain, Sweden, Turkey, the United Kingdom, Ukraine, and the United States (figure 1).\n \n\n \nFigure 1: Countries targeted with AppleJeus by HIDDEN COBRA threat actors since 2020\nAppleJeus Versions Note\nThe version numbers used for headings in this document correspond to the order the AppleJeus campaigns were identified in open source or through other investigative means. These versions may or may not be in the correct order to develop or deploy the AppleJeus campaigns.\nAppleJeus Version 1: Celas Trade Pro\nIntroduction and Infrastructure\nIn August 2018, open-source reporting disclosed information about a trojanized version of a legitimate cryptocurrency trading application on an undisclosed victim’s computer. The malicious program, known as Celas Trade Pro, was a modified version of the benign Q.T. Bitcoin Trader application. This incident led to the victim company being infected with a Remote Administration Tool (RAT) known as FALLCHILL, which was attributed to North Korea (HIDDEN COBRA) by the U.S. Government. FALLCHILL is a fully functional RAT with multiple commands that the adversary can issue from a command and control (C2) server to infected systems via various proxies. FALLCHILL typically infects a system as a file dropped by other HIDDEN COBRA malware (Develop Capabilities: Malware [T1587.001]). Because of this, additional HIDDEN COBRA malware may be present on systems compromised with FALLCHILL.[4]\nFurther research revealed that a phishing email from a Celas LLC company (Phishing: Spearphishing Link [T1566.002]) recommended the trojanized cryptocurrency trading application to victims. The email provided a link to the Celas’ website, celasllc[.]com (Acquire Infrastructure: Domain [T1583.001]), where the victim could download a Windows or macOS version of the trojanized application.\nThe celasllc[.]com domain resolved to the following Internet Protocol (IP) addresses from May 29, 2018, to January 23, 2021.\n\n45.199.63[.]220\n107.187.66[.]103\n145.249.106[.]19\n175.29.32[.]160\n185.142.236[.]213\n185.181.104[.]82\n198.251.83[.]27\n208.91.197[.]46\n209.99.64[.]18\n\nThe celasllc[.]com domain had a valid Sectigo (previously known as Comodo) Secure Sockets Layer (SSL) certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak security verification level that does not require validation of the owner’s identity or the actual business’s existence.\nCelas Trade Pro Application Analysis\nWindows Program\nThe Windows version of the malicious Celas Trade Pro application is an MSI Installer (.msi). The MSI Installer installation package comprises a software component and an application programming interface (API) that Microsoft uses for the installation, maintenance, and removal of software. The installer looks legitimate and is signed by a valid Sectigo certificate that was purchased by the same user as the SSL certificate for celasllc[.]com (Obtain Capabilities: Code Signing Certificates [T1588.003]). The MSI Installer asks the victim for administrative privileges to run (User Execution: Malicious File [T1204.002]).\nOnce permission is granted, the threat actor is able to run the program with elevated privileges (Abuse Elevation Control Mechanism [T1548]) and MSI executes the following actions.\n\nInstalls CelasTradePro.exe in folder C:\\Program Files (x86)\\CelasTradePro\nInstalls Updater.exe in folder C:\\Program Files (x86)\\CelasTradePro\nRuns Updater.exe with the CheckUpdate parameters\n\nThe CelasTradePro.exe program asks for the user’s exchange and loads a legitimate-looking cryptocurrency trading platform—very similar to the benign Q.T. Bitcoin Trader—that exhibits no signs of malicious activity.\nThe Updater.exe program has the same program icon as CelasTradePro.exe. When run, it checks for the CheckUpdate parameter, collects the victim’s host information (System Owner/User Discovery [T1033]), encrypts the collected information with a hardcoded XOR encryption, and sends information to a C2 website (Exfiltration Over C2 Channel [T1041]).\nmacOS X Program\nThe macOS version of the malicious application is a DMG Installer that has a disk image format that Apple commonly uses to distribute software over the internet. The installer looks legitimate and has a valid digital signature from Sectigo (Obtain Capabilities: Digital Certificates [T1588.004]). It has very similar functionality to the Windows version. The installer executes the following actions.\n\nInstalls CelasTradePro in folder /Applications/CelasTradePro.app/Contents/MacOS/\nInstalls Updater in folder /Applications/CelasTradePro.app/Contents/MacOS\nExecutes a postinstall script\n\nMoves .com.celastradepro.plist to folder LaunchDaemons\nRuns Updater with the CheckUpdate parameter\n\n\n\nCelasTradePro asks for the user’s exchange and loads a legitimate-looking cryptocurrency trading platform—very similar to the benign Q.T. Bitcoin Trader—that exhibits no signs of malicious activity.\nUpdater checks for the CheckUpdate parameter and, when found, it collects the victim’s host information (System Owner/User Discovery [T1033]), encrypts the collected information with a hardcoded XOR key before exfiltration, and sends the encrypted information to a C2 website (Exfiltration Over C2 Channel [T1041]). This process helps the adversary obtain persistence on a victim’s network.\nThe postinstall script is a sequence of instructions that runs after successfully installing an application (Command and Scripting Interpreter: Unix Shell [T1059.004]). This script moves property list (plist) file .com.celastradepro.plist from the installer package to the LaunchDaemons folder (Scheduled Task/Job: Launchd [T1053.004]). The leading “.” makes it unlisted in the Finder app or default Terminal directory listing (Hide Artifacts: Hidden Files and Directories [T1564.001]). Once in the folder, this property list (plist) file will launch the Updater program with the CheckUpdate parameter on system load as Root for every user. Because the LaunchDaemon will not run automatically after the plist file is moved, the postinstall script launches the Updater program with the CheckUpdate parameter and runs it in the background (Create or Modify System Process: Launch Daemon [T1543.004]).\nPayload\nAfter a cybersecurity company published a report detailing the above programs and their malicious extras, the website was no longer accessible. Since this site was the C2 server, the payload cannot be confirmed. The cybersecurity company that published the report states the payload was an encrypted and obfuscated binary (Obfuscated Files or Information [T1027]), which eventually drops FALLCHILL onto the machine and installs it as a service (Create or Modify System Process: Windows Service [T1543.003]). FALLCHILL malware uses an RC4 encryption algorithm with a 16-byte key to protect its communications (Encrypted Channel: Symmetric Cryptography [T1573.001]). The key employed in these versions has also been used in a previous version of FALLCHILL.[5][6]\nFor more details on AppleJeus Version 1: Celas Trade Pro, see MAR-10322463-1.v1.\nAppleJeus Version 2: JMT Trading\nIntroduction and Infrastructure\nIn October 2019, a cybersecurity company identified a new version of the AppleJeus malware—JMT Trading—thanks to its many similarities to the original AppleJeus malware. Again, the malware was in the form of a cryptocurrency trading application, which a legitimate-looking company, called JMT Trading, marketed and distributed on their website, jmttrading[.]org (Acquire Infrastructure: Domain [T1583.001]). This website contained a “Download from GitHub” button, which linked to JMT Trading’s GitHub page (Acquire Infrastructure: Web Services [T1583.006]), where Windows and macOS X versions of the JMT Trader application were available for download (Develop Capabilities: Malware [T1587.001]). The GitHub page also included .zip and tar.gz files containing the source code.\nThe jmttrading[.]org domain resolved to the following IP addresses from October 15, 2016, to January 22, 2021.\n\n45.33.2[.]79\n45.33.23[.]183\n45.56.79[.]23\n45.79.19[.]196\n96.126.123[.]244\n146.112.61[.]107\n184.168.221[.]40\n184.168.221[.]57\n198.187.29[.]20\n198.54.117[.]197\n198.54.117[.]198\n198.54.117[.]199\n198.54.117[.]200\n198.58.118[.]167\n\nThe jmttrading[.]org domain had a valid Sectigo SSL certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak security verification level that does not require validation of the owner’s identity or the actual business’s existence. The current SSL certificate was issued by Let’s Encrypt.\nJMT Trading Application Analysis\nWindows Program\nThe Windows version of the malicious cryptocurrency application is an MSI Installer. The installer looks legitimate and has a valid digital signature from Sectigo (Obtain Capabilities: Digital Certificates [T1588.004]). The signature was signed with a code signing certificate purchased by the same user as the SSL certificate for jmttrading[.]org (Obtain Capabilities: Code Signing Certificates [T1588.003]). The MSI Installer asks the victim for administrative privileges to run (User Execution: Malicious File [T1204.002]).\nOnce permission is granted, the MSI executes the following actions.\n\nInstalls JMTTrader.exe in folder C:\\Program Files (x86)\\JMTTrader\nInstalls CrashReporter.exe in folder C:\\Users\\<username>\\AppData\\Roaming\\JMTTrader\nRuns CrashReporter.exe with the Maintain parameter\n\nThe JMTTrader.exe program asks for the user’s exchange and loads a legitimate-looking cryptocurrency trading platform—very similar to CelasTradePro.exe and the benign Q.T. Bitcoin Trader—that exhibits no signs of malicious activity.\nThe program CrashReporter.exe is heavily obfuscated with the ADVObfuscation library, renamed “snowman” (Obfuscated Files or Information [T1027]). When run, it checks for the Maintain parameter and collects the victim’s host information (System Owner/User Discovery [T1033]), encrypts the collected information with a hardcoded XOR key before exfiltration, and sends the encrypted information to a C2 website (Exfiltration Over C2 Channel [T1041]). The program also creates a scheduled SYSTEM task, named JMTCrashReporter, which runs CrashReporter.exe with the Maintain parameter at any user’s login (Scheduled Task/Job: Scheduled Task [T1053.005]).\nmacOS X Program\nThe macOS version of the malicious application is a DMG Installer. The installer looks legitimate and has very similar functionality to the Windows version, but it does not have a digital certificate and will warn the user of that before installation. The installer executes the following actions.\n\nInstalls JMTTrader in folder /Applications/JMTTrader.app/Contents/MacOS/\nInstalls .CrashReporter in folder /Applications/JMTTrader.app/Contents/Resources/\n\nNote: the leading “.” makes it unlisted in the Finder app or default Terminal directory listing.\n\n\nExecutes a postinstall script\n\nMoves .com.jmttrading.plist to folder LaunchDaemons\nChanges the file permissions on the plist\nRuns CrashReporter with the Maintain parameter\nMoves .CrashReporter to folder /Library/JMTTrader/CrashReporter\nMakes .CrashReporter executable\n\n\n\nThe JMTTrader program asks for the user’s exchange and loads a legitimate-looking cryptocurrency trading platform—very similar to CelasTradePro and the benign Q.T. Bitcoin Trader—that exhibits no signs of malicious activity.\nThe CrashReporter program checks for the Maintain parameter and is not obfuscated. This lack of obfuscation makes it easier to determine the program’s functionality in detail. When it finds the Maintain parameter, it collects the victim’s host information (System Owner/User Discovery [T1033]), encrypts the collected information with a hardcoded XOR key before exfiltration, and sends the encrypted information to a C2 website (Exfiltration Over C2 Channel [T1041]).\nThe postinstall script has similar functionality to the one used by CelasTradePro, but it has a few additional features (Command and Scripting Interpreter: Unix Shell [T1059.004]). It moves the property list (plist) file .com.jmttrading.plist from the Installer package to the LaunchDaemons folder (Scheduled Task/Job: Launchd [T1053.004]), but also changes the file permissions on the plist file. Once in the folder, this property list (plist) file will launch the CrashReporter program with the Maintain parameter on system load as Root for every user. Also, the postinstall script moves the .CrashReporter program to a new location /Library/JMTTrader/CrashReporter and makes it executable. Because the LaunchDaemon will not run automatically after the plist file is moved, the postinstall script launches CrashReporter with the Maintain parameter and runs it in the background (Create or Modify System Process: Launch Daemon [T1543.004]).\nPayload\nSoon after the cybersecurity company tweeted about JMT Trader on October 11, 2019, the files on GitHub were updated to clean, non-malicious installers. Then on October 13, 2019, a different cybersecurity company published an article detailing the macOS X JMT Trader, and soon after, the C2 beastgoc[.]com website went offline. There is not a confirmed sample of the payload to analyze at this point.\nFor more details on AppleJeus Version 2: JMT Trading, see MAR-10322463-2.v1.\nAppleJeus Version 3: Union Crypto\nIntroduction and Infrastructure\nIn December 2019, another version of the AppleJeus malware was identified on Twitter by a cybersecurity company based on many similarities to the original AppleJeus malware. Again, the malware was in the form of a cryptocurrency trading application, which was marketed and distributed by a legitimate-looking company, called Union Crypto, on their website, unioncrypto[.]vip (Acquire Infrastructure: Domain [T1583.001]). Although this website is no longer available, a cybersecurity researcher discovered a download link, https://www.unioncrypto[.]vip/download/W6c2dq8By7luMhCmya2v97YeN, recorded on VirusTotal for the macOS X version of UnionCryptoTrader. In contrast, open-source reporting stated that the Windows version might have been downloaded via instant messaging service Telegram, as it was found in a “Telegram Downloads” folder on an unnamed victim.[7]\nThe unioncrypto[.]vip domain resolved to the following IP addresses from June 5, 2019, to July 15, 2020.\n\n104.168.167[.]16\n198.54.117[.]197\n198.54.117[.]198\n198.54.117[.]199\n198.54.117[.]200\n\nThe domain unioncrypto[.]vip had a valid Sectigo SSL certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak security verification level that does not require validation of the owner’s identity or the actual business’s existence.\nUnion Crypto Trader Application Analysis\nWindows Program\nThe Windows version of the malicious cryptocurrency application is a Windows executable (.exe) (User Execution: Malicious File [T1204.002]), which acts as an installer that extracts a temporary MSI Installer.\nThe Windows program executes the following actions.\n\nExtracts UnionCryptoTrader.msi to folder C:\\Users\\<username>\\AppData\\Local\\Temp\\{82E4B719-90F74BD1-9CF1-56CD777E0C42}\nRuns UnionCryptoUpdater.msi\n\nInstalls UnionCryptoTrader.exe in folder C:\\Program Files\\UnionCryptoTrader\nInstalls UnionCryptoUpdater.exe in folder C:\\Users\\<username>\\AppData\\Local\\UnionCryptoTrader\n\n\nDeletes UnionCryptoUpdater.msi\nRuns UnionCryptoUpdater.exe\n\nThe program UnionCryptoTrader.exe loads a legitimate-looking cryptocurrency arbitrage application—defined as “the simultaneous buying and selling of securities, currency, or commodities in different markets or in derivative forms to take advantage of differing prices for the same asset”—which exhibits no signs of malicious activity. This application is very similar to another cryptocurrency arbitrage application known as Blackbird Bitcoin Arbitrage.[8]\nThe program UnionCryptoUpdater.exe first installs itself as a service (Create or Modify System Process: Windows Service [T1543.003]), which will automatically start when any user logs on (Boot or Logon Autostart Execution [T1547]). The service is installed with a description stating it “Automatically installs updates for Union Crypto Trader.” When launched, it collects the victim’s host information (System Owner/User Discovery [T1033]), combines the information in a string that is MD5 hashed and stored in the auth_signature variable before exfiltration, and sends it to a C2 website (Exfiltration Over C2 Channel [T1041]).\nmacOS X Program\nThe macOS version of the malicious application is a DMG Installer. The installer looks legitimate and has very similar functionality to the Windows version, but it does not have a digital certificate and will warn the user of that before installation. The installer executes the following actions.\n\nInstalls UnionCryptoTrader in folder /Applications/UnionCryptoTrader.app/Contents/MacOS/\nInstalls .unioncryptoupdater in folder /Applications/UnionCryptoTrader.app/Contents/Resources/\n\nNote: the leading “.” makes it unlisted in the Finder app or default Terminal directory listing\n\n\nExecutes a postinstall script\n\nMoves .vip.unioncrypto.plist to folder LaunchDaemons\nChanges the file permissions on the plist to Root\nRuns unioncryptoupdater\nMoves .unioncryptoupdater to folder /Library/UnionCrypto/unioncryptoupdater\nMakes .unioncryptoupdater executable\n\n\n\nThe UnionCryptoTrader program loads a legitimate-looking cryptocurrency arbitrage application, which exhibits no signs of malicious activity. The application is very similar to another cryptocurrency arbitrage application known as Blackbird Bitcoin Arbitrage.\nThe .unioncryptoupdater program is signed ad-hoc, meaning it is not signed with a valid code-signing identity. When launched, it collects the victim’s host information (System Owner/User Discovery [T1033]), combines the information in a string that is MD5 hashed and stored in the auth_signature variable before exfiltration, and sends it to a C2 website (Exfiltration Over C2 Channel [T1041]).\nThe postinstall script has similar functionality to the one used by JMT Trading (Command and Scripting Interpreter: Unix Shell [T1059.004]). It moves the property list (plist) file .vip.unioncrypto.plist from the Installer package to the LaunchDaemons folder (Scheduled Task/Job: Launchd [T1053.004]), but also changes the file permissions on the plist file to Root. Once in the folder, this property list (plist) file will launch the .unioncryptoupdater on system load as Root for every user. The postinstall script moves the .unioncryptoupdater program to a new location /Library/UnionCrypto/unioncryptoupdater and makes it executable. Because the LaunchDaemon will not run automatically after the plist file is moved, the postinstall script launches .unioncryptoupdater and runs it in the background (Create or Modify System Process: Launch Daemon [T1543.004]).\nPayload\nThe payload for the Windows malware is a Windows Dynamic-Link-Library. UnionCryptoUpdater.exe does not immediately download the stage 2 malware but instead downloads it after a time specified by the C2 server. This delay could be implemented to prevent researchers from directly obtaining the stage 2 malware.\nThe macOS X malware’s payload could not be downloaded, as the C2 server is no longer accessible. Additionally, none of the open-source reporting for this sample contained copies of the macOS X payload. The macOS X payload is likely similar in functionality to the Windows stage 2 detailed above.\nFor more details on AppleJeus Version 3: Union Crypto, see MAR-10322463-3.v1.\nCommonalities between Celas Trade Pro, JMT Trading, and Union Crypto\nHardcoded Values\nIn each AppleJeus version, there are hardcoded values used for encryption or to create a signature when combined with the time (table 1).\nTable 1: AppleJeus hardcoded values and uses\n\n\n\nAppleJeus Version \nValue \nUse \n\n\n\n\n1: Celas Trade Pro\nMoz&Wie;#t/6T!2y\nXOR encryption to send data\n\n\n1: Celas Trade Pro\nW29ab@ad%Df324V$Yd\nRC4 decryption\n\n\n2: JMT Trader Windows\nX,%`PMk--Jj8s+6=15:20:11\nXOR encryption to send data\n\n\n2: JMT Trader OSX\nX,%`PMk--Jj8s+6=\\x02\nXOR encryption to send data\n\n\n3: Union Crypto Trader\n12GWAPCT1F0I1S14\nCombined with time for signature\n\n\n\n \nThe Union Crypto Trader and Celas LLC (XOR) values are 16 bytes in length. For JMT Trader, the first 16 bytes of the Windows and macOS X values are identical, and the additional bytes are in a time format for the Windows sample. The structure of a 16-byte value combined with the time is also used in Union Crypto Trader to create the auth_signature.\nAs mentioned, FALLCHILL was reported as the final payload for Celas Trade Pro. All FALLCHILL samples use 16-byte hardcoded RC4 keys for sending data, similar to the 16-byte keys in the AppleJeus samples.\nOpen-Source Cryptocurrency Applications\nAll three AppleJeus samples are bundled with modified copies of legitimate cryptocurrency applications and can be used as originally designed to trade cryptocurrency. Both Celas LLC and JMT Trader modified the same cryptocurrency application, Q.T. Bitcoin Trader; Union Crypto Trader modified the Blackbird Bitcoin Arbitrage application.\nPostinstall Scripts, Property List Files, and LaunchDaemons\nThe macOS X samples of all three AppleJeus versions contain postinstall scripts with similar logic. The Celas LLC postinstall script only moves the plist file to a new location and launches Updater with the CheckUpdate parameter in the background. The JMT Trader and Union Crypto Trader also perform these actions and have identical functionality. The additional actions performed by both postinstall scripts are to change the file permissions on the plist, make a new directory in the /Library folder, move CrashReporter or UnionCryptoUpdater to the newly created folder, and make them executable.\nThe plist files for all three AppleJeus files have identical functionality. They only differ in the files’ names and one default comment that was not removed from the Celas LLC plist. As the logic and functionality of the postinstall scripts and plist files are almost identical, the LaunchDaemons created also function the same.\nThey will all launch the secondary executable as Root on system load for every user.\nAppleJeus Version 4: Kupay Wallet\nIntroduction and Infrastructure\nOn March 13, 2020, a new version of the AppleJeus malware was identified. The malware was marketed and distributed by a legitimate-looking company, called Kupay Wallet, on their website kupaywallet[.]com (Acquire Infrastructure: Domain [T1583.001]).\nThe domain www.kupaywallet[.]com resolved to IP address 104.200.67[.]96 from March 20, 2020, to January 16, 2021. CrownCloud US, LLC controlled the IP address (autonomous system number [ASN] 8100), and is located in New York, NY.\nThe domain www.kupaywallet[.]com had a valid Sectigo SSL certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak security verification level that does not require validation of the owner’s identity or the actual business’s existence.\nKupay Wallet Application Analysis\nWindows Program\nThe Windows version of the malicious cryptocurrency application is an MSI Installer. The MSI executes the following actions.\n\nInstalls Kupay.exe in folder C:\\Program Files (x86)\\Kupay\nInstalls KupayUpgrade.exe in folder C:\\Users\\<username>\\AppData\\Roaming\\KupaySupport\nRuns KupayUpgrade.exe\n\nThe program Kupay.exe loads a legitimate-looking cryptocurrency wallet platform, which exhibits no signs of malicious activity and is very similar to an open-source platform known as Copay, distributed by Atlanta-based company BitPay.\nThe program KupayUpgrade.exe first installs itself as a service (Create or Modify System Process: Windows Service [T1543.003]), which will automatically start when any user logs on (Boot or Logon Autostart Execution [T1547]). The service is installed with a description stating it is an “Automatic Kupay Upgrade.” When launched, it collects the victim’s host information (System Owner/User Discovery [T1033]), combines the information in strings before exfiltration, and sends it to a C2 website (Exfiltration Over C2 Channel [T1041]).\nmacOS X Program\nThe macOS version of the malicious application is a DMG Installer. The installer looks legitimate and has very similar functionality to the Windows version, but it does not have a digital certificate and will warn the user of that before installation. The installer executes the following actions.\n\nInstalls Kupay in folder /Applications/Kupay.app/Contents/MacOS/\nInstalls kupay_upgrade in folder /Applications/Kupay.app/Contents/MacOS/\nExecutes a postinstall script\n\nCreates KupayDaemon folder in /Library/Application Support folder\nMoves kupay_upgrade to the new folder\nMoves com.kupay.pkg.wallet.plist to folder /Library/LaunchDaemons/\nRuns the command launchctl load to load the plist without a restart\nRuns kupay_upgrade in the background\n\n\n\nKupay is likely a copy of an open-source cryptocurrency wallet application, loads a legitimate-looking wallet program (fully functional), and its functionality is identical to the Windows Kupay.exe program.\nThe kupay_upgrade program calls its function CheckUpdate (which contains most of the logic functionality of the malware) and sends a POST to the C2 server with a connection named “Kupay Wallet 9.0.1 (Check Update Osx)” (Application Layer Protocol: Web Protocols [T1071.001]). If the C2 server returns a file, it is decoded and written to the victim’s folder /private/tmp/kupay_update with permissions set by the command chmod 700 (only the user can read, write, and execute) (Command and Scripting Interpreter [T1059]). Stage 2 is then launched, and the malware, kupay_upgrade, returns to sleeping and checking in with the C2 server at predetermined intervals (Application Layer Protocol: Web Protocols [T1071.001]).\nThe postinstall script has similar functionality to other AppleJeus scripts (Command and Scripting Interpreter: Unix Shell [T1059.004]). It creates the KupayDaemon folder in /Library/Application Support folder and then moves kupay_upgrade to the new folder. It moves the property list (plist) file com.kupay.pkg.wallet.plist from the Installer package to the /Library/LaunchDaemons/ folder (Scheduled Task/Job: Launchd [T1053.004]). The script runs the command launchctl load to load the plist without a restart (Command and Scripting Interpreter [T1059]). But, since the LaunchDaemon will not run automatically after the plist file is moved, the postinstall script launches kupay_upgrade and runs it in the background (Create or Modify System Process: Launch Daemon [T1543.004]).\nPayload\nThe Windows malware’s payload could not be downloaded since the C2 server is no longer accessible. Additionally, none of the open-source reporting for this sample contained copies of the payload. The Windows payload is likely similar in functionality to the macOS X stage 2 detailed below.\nThe stage 2 payload for the macOS X malware was decoded and analyzed. The stage 2 malware has a variety of functionalities. Most importantly, it checks in with a C2 and, after connecting to the C2, can send or receive a payload, read and write files, execute commands via the terminal, etc.\nFor more details on AppleJeus Version 4: Kupay Wallet, see MAR-10322463-4.v1.\nAppleJeus Version 5: CoinGoTrade\nIntroduction and Infrastructure\nIn early 2020, another version of the AppleJeus malware was identified. This time the malware was marketed and distributed by a legitimate-looking company called CoinGoTrade on their website coingotrade[.]com (Acquire Infrastructure: Domain [T1583.001]).\nThe domain CoinGoTrade[.]com resolved to IP address 198.54.114[.]175 from February 28, 2020, to January 23, 2021. The IP address is controlled by NameCheap Inc. (ASN 22612) and is located in Atlanta, GA. This IP address is in the same ASN for Dorusio[.]com and Ants2Whale[.]com.\nThe domain CoinGoTrade[.]com had a valid Sectigo SSL certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak security verification level that does not require validation of the owner’s identity or the actual business’s existence.\nCoinGoTrade Application Analysis\nWindows Program\nThe Windows version of the malicious application is an MSI Installer. The installer appears to be legitimate and will execute the following actions.\n\nInstalls CoinGoTrade.exe in folder C:\\Program Files (x86)\\CoinGoTrade\nInstalls CoinGoTradeUpdate.exe in folder C:\\Users\\<username>\\AppData\\Roaming\\CoinGoTradeSupport\nRuns CoinGoTradeUpdate.exe\n\nCoinGoTrade.exe loads a legitimate-looking cryptocurrency wallet platform with no signs of malicious activity and is a copy of an open-source cryptocurrency application.\nCoinGoTradeUpdate.exe first installs itself as a service (Create or Modify System Process: Windows Service [T1543.003]), which will automatically start when any user logs on (Boot or Logon Autostart Execution [T1547]). The service is installed with a description stating it is an “Automatic CoinGoTrade Upgrade.” When launched, it collects the victim’s host information (System Owner/User Discovery [T1033]), combines the information in strings before exfiltration, and sends it to a C2 website (Exfiltration Over C2 Channel [T1041]).\nmacOS X Program\nThe macOS version of the malicious application is a DMG Installer. The installer looks legitimate and has very similar functionality to the Windows version, but it does not have a digital certificate and will warn the user of that before installation. The installer executes the following actions.\n\nInstalls CoinGoTrade in folder /Applications/CoinGoTrade.app/Contents/MacOS/\nInstalls CoinGoTradeUpgradeDaemon in folder /Applications/CoinGoTrade.app/Contents/MacOS/\nExecutes a postinstall script\n\nCreates CoinGoTradeService folder in /Library/Application Support folder\nMoves CoinGoTradeUpgradeDaemon to the new folder\nMoves com.coingotrade.pkg.product.plist to folder /Library/LaunchDaemons/\nRuns CoinGoTradeUpgradeDaemon in the background\n\n\n\nThe CoinGoTrade program is likely a copy of an open-source cryptocurrency wallet application and loads a legitimate-looking, fully functional wallet program).\nThe CoinGoTradeUpgradeDaemon program calls its function CheckUpdate (which contains most of the logic functionality of the malware) and sends a POST to the C2 server with a connection named “CoinGoTrade 1.0 (Check Update Osx)” (Application Layer Protocol: Web Protocols [T1071.001]). If the C2 server returns a file, it is decoded and written to the victim’s folder /private/tmp/updatecoingotrade with permissions set by the command chmod 700 (only the user can read, write, and execute) (Command and Scripting Interpreter [T1059]). Stage 2 is then launched, and the malware, CoinGoTradeUpgradeDaemon, returns to sleeping and checking in with the C2 server at predetermined intervals (Application Layer Protocol: Web Protocols [T1071.001]).\nThe postinstall script has similar functionality to the other scripts (Command and Scripting Interpreter: Unix Shell [T1059.004]) and installs CoinGoTrade and CoinGoTradeUpgradeDaemon in folder /Applications/CoinGoTrade.app/Contents/MacOS/. It moves the property list (plist) file com.coingotrade.pkg.product.plist to the /Library/LaunchDaemons/ folder (Scheduled Task/Job: Launchd [T1053.004]). Because the LaunchDaemon will not run automatically after the plist file is moved, the postinstall script launches CoinGoTradeUpgradeDaemon and runs it in the background (Create or Modify System Process: Launch Daemon [T1543.004]).\nPayload\nThe Windows malware’s payload could not be downloaded because the C2 server is no longer accessible. Additionally, none of the open-source reporting for this sample contained copies of the payload. The Windows payload is likely similar in functionality to the macOS X stage 2 detailed below.\nThe stage 2 payload for the macOS X malware was no longer available from the specified download URL. Still, a file was submitted to VirusTotal by the same user on the same date as the macOS X CoinGoTradeUpgradeDaemon. These clues suggest that the submitted file may be related to the macOS X version of the malware and the downloaded payload.\nThe file prtspool is a 64-bit Mach-O executable with a large variety of features that have all been confirmed as functionality. The file has three C2 URLs hardcoded into the file and communicates to these with HTTP POST multipart-form data boundary string. Like other HIDDEN COBRA malware, prtspool uses format strings to store data collected about the system and sends it to the C2s.\nFor more details on AppleJeus Version 5: CoinGoTrade, see MAR-10322463-5.v1.\nAppleJeus Version 6: Dorusio\nIntroduction and Infrastructure\nIn March 2020, an additional version of the AppleJeus malware was identified. This time the malware was marketed and distributed by a legitimate-looking company called Dorusio on their website, dorusio[.]com (Acquire Infrastructure: Domain [T1583.001]). Researchers collected samples for Windows and macOS X versions of the Dorusio Wallet (Develop Capabilities: Malware [T1587.001]). As of at least early 2020, the actual download links result in 404 errors. The download page has release notes with version revisions claiming to start with version 1.0.0, released on April 15, 2019.\nThe domain dorusio[.]com resolved to IP address 198.54.115[.]51 from March 30, 2020 to January 23, 2021. The IP address is controlled by NameCheap Inc. (ASN 22612) and is located in Atlanta, GA. This IP address is in the same ASN for CoinGoTrade[.]com and Ants2Whale[.]com.\nThe domain dorusio[.]com had a valid Sectigo SSL certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak security verification level that does not require validation of the owner’s identity or the actual business’s existence.\nDorusio Application Analysis\nWindows Program\nThe Windows version of the malicious application is an MSI Installer. The installer appears to be legitimate and will install the following two programs.\n\nInstalls Dorusio.exe in folder C:\\Program Files (x86)\\Dorusio\nInstalls DorusioUpgrade.exe in folder C:\\Users\\<username>\\AppData\\Roaming\\DorusioSupport\nRuns DorusioUpgrade.exe\n\nThe program, Dorusio.exe, loads a legitimate-looking cryptocurrency wallet platform with no signs of malicious activity and is a copy of an open-source cryptocurrency application.\nThe program DorusioUpgrade.exe first installs itself as a service (Create or Modify System Process: Windows Service [T1543.003]), which will automatically start when any user logs on (Boot or Logon Autostart Execution [T1547]). The service is installed with a description stating it “Automatic Dorusio Upgrade.” When launched, it collects the victim’s host information (System Owner/User Discovery [T1033]), combines the information in strings before exfiltration, and sends it to a C2 website (Exfiltration Over C2 Channel [T1041]).\nmacOS X Program\nThe macOS version of the malicious application is a DMG Installer. The installer looks legitimate and has very similar functionality to the Windows version, but it does not have a digital certificate and will warn the user of that before installation. The installer executes the following actions.\n\nInstalls Dorusio in folder /Applications/Dorusio.app/Contents/MacOS/\nInstalls Dorusio_upgrade in folder /Applications/Dorusio.app/Contents/MacOS/\nExecutes a postinstall script\n\nCreates DorusioDaemon folder in /Library/Application Support folder\nMoves Dorusio_upgrade to the new folder\nMoves com.dorusio.pkg.wallet.plist to folder /Library/LaunchDaemons/\nRuns Dorusio_upgrade in the background\n\n\n\nThe Dorusio program is likely a copy of an open-source cryptocurrency wallet application and loads a legitimate-looking wallet program (fully functional). Aside from the Dorusio logo and two new services, the wallet appears to be the same as the Kupay Wallet. This application seems to be a modification of the open-source cryptocurrency wallet Copay distributed by Atlanta-based company BitPay.\nThe Dorusio_upgrade program calls its function CheckUpdate (which contains most of the logic functionality of the malware) and sends a POST to the C2 server with a connection named “Dorusio Wallet 2.1.0 (Check Update Osx)” (Application Layer Protocol: Web Protocols [T1071.001]). If the C2 server returns a file, it is decoded and written to the victim’s folder /private/tmp/Dorusio_update with permissions set by the command chmod 700 (only the user can read, write, and execute) (Command and Scripting Interpreter [T1059]). Stage 2 is then launched, and the malware, Dorusio_upgrade, returns to sleeping and checking in with the C2 server at predetermined intervals (Application Layer Protocol: Web Protocols [T1071.001]).\nThe postinstall script has similar functionality to other AppleJeus scripts (Command and Scripting Interpreter: Unix Shell [T1059.004]). It creates the DorusioDaemon folder in /Library/Application Support folder and then moves Dorusio_upgrade to the new folder. It moves the property list (plist) file com.dorusio.pkg.wallet.plist from the Installer package to the /Library/LaunchDaemons/ folder (Scheduled Task/Job: Launchd [T1053.004]). Because the LaunchDaemon will not run automatically after the plist file is moved, the postinstall script launches Dorusio_upgrade and runs it in the background (Create or Modify System Process: Launch Daemon [T1543.004]).\nPayload\nNeither the payload for the Windows nor macOS X malware could be downloaded; the C2 server is no longer accessible. The payloads are likely similar in functionality to the macOS X stage 2 from CoinGoTrade and Kupay Wallet, or the Windows stage 2 from Union Crypto.\nFor more details on AppleJeus Version 6: Dorusio, see MAR-10322463-6.v1.\nAppleJeus 4, 5, and 6 Installation Conflictions\nIf a user attempts to install the Kupay Wallet, CoinGoTrade, and Dorusio applications on the same system, they will encounter installation conflicts.\nIf Kupay Wallet is already installed on a system and the user tries to install CoinGoTrade or Dorusio:\n\nPop-up windows appear, stating a more recent version of the program is already installed.\n\nIf CoinGoTrade is already installed on a system and the user attempts to install Kupay Wallet:\n\nKupay.exe will be installed in the C:\\Program Files (x86)\\CoinGoTrade\\ folder.\nAll CoinGoTrade files will be deleted.\nThe folders and files contained in the C:\\Users\\<username>\\AppData\\Roaming\\CoinGoTradeSupport will remain installed.\nKupayUpgrade.exe is installed in the new folder C:\\Users\\<username>\\AppData\\Roaming\\KupaySupport.\n\nIf Dorusio is already installed on a system and the user attempts to install Kupay Wallet:\n\nKupay.exe will be installed in the C:\\Program Files (x86)\\Dorusio\\ folder.\nAll Dorusio.exe files will be deleted.\nThe folders and files contained in C:\\Users\\<username>\\AppData\\Roaming\\DorusioSupport will remain installed.\nKupayUpgrade.exe is installed in the new folder C:\\Users\\<username>\\AppData\\Roaming\\KupaySupport.\n\nAppleJeus Version 7: Ants2Whale\nIntroduction and Infrastructure\nIn late 2020, a new version of AppleJeus was identified called “Ants2Whale.” The site for this version of AppleJeus is ants2whale[.]com (Acquire Infrastructure: Domain [T1583.001]). The website shows a legitimate-looking cryptocurrency company and application. The website contains multiple spelling and grammar mistakes indicating the creator may not have English as a first language. The website states that to download Ants2Whale, a user must contact the administrator, as their product is a “premium package” (Develop Capabilities: Malware [T1587.001]).\nThe domain ants2whale[.]com resolved to IP address 198.54.114[.]237 from September 23, 2020, to January 22, 2021. The IP address is controlled by NameCheap, Inc. (ASN 22612) and is located in Atlanta, GA. This IP address is in the same ASN for CoinGoTrade[.]com and Dorusio[.]com.\nThe domain ants2whale[.]com had a valid Sectigo SSL certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak security verification level that does not require validation of the owner’s identity or the actual business’s existence.\nAnts2Whale Application Analysis\nWindows Program\nAs of late 2020, the Windows program was not available on VirusTotal. It is likely very similar to the macOS X version detailed below.\nmacOS X Program\nThe macOS version of the malicious application is a DMG Installer. The installer looks legitimate and has very similar functionality to the Windows version, but it does not have a digital certificate and will warn the user of that before installation. The installer executes the following actions.\n\nInstalls Ants2Whale in folder /Applications/Ants2whale.app/Contents/MacOS/Ants2whale\nInstalls Ants2WhaleHelper in folder /Library/Application Support/Ants2WhaleSupport/\nExecutes a postinstall script\n\nMoves com.Ants2whale.pkg.wallet.plist to folder /Library/LaunchDaemons/\nRuns Ants2WhaleHelper in the background\n\n\n\nThe Ants2Whale and Ants2WhaleHelper programs and the postinstall script function almost identically to previous versions of AppleJeus and will not be discussed in depth in this advisory.\nFor more details on AppleJeus Version 7: Ants2Whale, see MAR-10322463-7.v1.\nATT&CK Profile\nFigure 2 and table 2 provide summaries of the MITRE ATT&CK techniques observed.\n\nFigure 2: MITRE ATT&CK enterprise techniques used by AppleJeus\n \nTable 2: MITRE ATT&CK techniques observed\n\n\n\nTactic Title\nTechnique ID\nTechnique Title \n\n\n\n\nResource Development [TA0042]\nT1583.001\nAcquire Infrastructure: Domain\n\n\nResource Development [TA0042]\nT1583.006\nAcquire Infrastructure: Web Services\n\n\nResource Development [TA0042]\nT1587.001\nDevelop Capabilities: Malware\n\n\nResource Development [TA0042]\nT1588.003\nObtain Capabilities: Code Signing Certificates\n\n\nResource Development [TA0042]\nT1588004\nObtain Capabilities: Digital Certificates\n\n\nInitial Access [TA0001]\nT1566.002\nPhishing: Spearphishing Link\n\n\nExecution [TA0002]\nT1059\nCommand and Scripting Interpreter\n\n\nExecution [TA0002]\nT1059.004\nCommand and Scripting Interpreter: Unix Shell\n\n\nExecution [TA0002]\nT1204.002\nUser Execution: Malicious File\n\n\nPersistence [TA0003]\nT1053.004\nScheduled Task/Job: Launchd\n\n\nPersistence [TA0003]\nT1543.004\nCreate or Modify System Process: Launch Daemon\n\n\nPersistence [TA0003]\nT1547\nBoot or Logon Autostart Execution\n\n\nPrivilege Escalation [TA0004]\nT1053.005\nScheduled Task/Job: Scheduled Task\n\n\nDefense Evasion [TA0005]\nT1027\nObfuscated Files or Information\n\n\nDefense Evasion [TA0005]\nT1548\nAbuse Elevation Control Mechanism\n\n\nDefense Evasion [TA0005]\nT1564.001\nHide Artifacts: Hidden Files and Directories\n\n\nDiscovery [TA0007]\nT1033\nSystem Owner/User Discovery\n\n\nExfiltration [TA0010]\nT1041\nExfiltration Over C2 Channel\n\n\nCommand and Control [TA0011]\nT1071.001\n\nApplication Layer Protocol: Web Protocols\n\n\n\nCommand and Control [TA0011]\nT1573\nEncrypted Channel\n\n\nCommand and Control [TA0011]\nT1573.001\nEncrypted Channel: Symmetric Cryptography\n\n\n\n\nMitigations\n\nCompromise Mitigations\nOrganizations that identify AppleJeus malware within their networks should take immediate action. Initial actions should include the following steps.\n\nContact the FBI, CISA, or Treasury immediately regarding any identified activity related to AppleJeus. (Refer to the Contact Information section below.)\nInitiate your organization’s incident response plan.\nGenerate new keys for wallets, and/or move to new wallets.\nIntroduce a two-factor authentication solution as an extra layer of verification.  \nUse hardware wallets, which keep the private keys in a separate, secured storage area.\nTo move funds out off a compromised wallet:\n\nDo not use the malware listed in this advisory to transfer funds, and  \nForm all transactions offline and then broadcast them to the network all at once in a short online session, ideally prior to the attacker accessing them.\n\n\nRemove impacted hosts from network.\nAssume the threat actors have moved laterally within the network and downloaded additional malware.\nChange all passwords to any accounts associated with impacted hosts.\nReimage impacted host(s).  \nInstall anti-virus software to run daily deep scans of the host.\nEnsure your anti-virus software is setup to download the latest signatures daily.\nInstall a Host Based Intrusion Detection (HIDS)-based software and keep it up to date.\nEnsure all software and hardware is up to date, and all patches have been installed.\nEnsure network-based firewall is installed and/or up to date.\nEnsure the firewall’s firmware is up to date.\n\nPro-Active Mitigations\nConsider the following recommendations for defense against AppleJeus malware and related activity.\nCryptocurrency Users\n\nVerify source of cryptocurrency-related applications.\nUse multiple wallets for key storage, striking the appropriate risk balance between hot and cold storage.\nUse custodial accounts with multi-factor authentication mechanisms for both user and device verification.\nPatronize cryptocurrency service businesses that offer indemnity protections for lost or stolen cryptocurrency.\nConsider having a dedicated device for cryptocurrency management.\n\nFinancial Service Companies\n\nVerify compliance with Federal Financial Institutions Examination Council (FFIEC) handbooks at https://ithandbook.ffiec.gov, especially those related to information security.\nReport suspicious cyber and financial activities. For more information on mandatory and voluntary reporting of cyber events via suspicious activity reports, see the Financial Crimes Enforcement Network (FinCEN) Advisory FIN-2016-A005: Advisory to Financial Institutions on Cyber- Events and Cyber-Enabled Crime at https://www.fincen.gov/sites/default/files/advisory/2016-10-25/Cyber%20Threats%20Advisory%20-%20FINAL%20508_2.pdf and FinCEN’s Section 314(b) Fact Sheet at https://www.fincen.gov/sites/default/files/shared/314bfactsheet.pdf.\n\nCryptocurrency Businesses\n\nVerify compliance with the Cryptocurrency Security Standard at http://cryptoconsortium.github.io/CCSS/.\n\nAll Organizations\n\nIncorporate IOCs identified in CISA’s Malware Analysis Reports on https://us-cert.cisa.gov/northkorea into intrusion detection systems and security alert systems to enable active blocking or reporting of suspected malicious activity.\nSee table 3 below, which provides a summary of preventative ATT&CK mitigations based on observed techniques.\n\nTable 3: MITRE ATT&CK mitigations based on observed techniques\n\n\n\nMitigation\nDescription\n\n\n\n\nUser Training [M1017]\nTrain users to identify social engineering techniques and spearphishing emails.\n\n\nUser Training [M1017]\nProvide users with the awareness of common phishing and spearphishing techniques and raise suspicion for potentially malicious events.\n\n\nUser Account Management [M1018]\nLimit privileges of user accounts and remediate Privilege Escalation vectors so only authorized administrators can create new Launch Daemons.\n\n\nUser Account Management [M1018]\nLimit privileges of user accounts and remediate Privilege Escalation vectors so only authorized administrators can create scheduled tasks on remote systems.\n\n\nSSL/TLS Inspection [M1020]\nUse SSL/TLS inspection to see encrypted sessions’ contents to look for network-based indicators of malware communication protocols.\n\n\nRestrict Web-Based Content [M1021]\nDetermine if certain websites that can be used for spearphishing are necessary for business operations and consider blocking access if the activity cannot be monitored well or poses a significant risk.\n\n\nRestrict Web-Based Content [M1021]\nBlock Script extensions to prevent the execution of scripts and HTA files that may commonly be used during the exploitation process.\n\n\nRestrict Web-Based Content [M1021]\nEmploy an adblocker to prevent malicious code served up through ads from executing.\n\n\nRestrict File and Directory Permissions [M1022]\nPrevent all users from writing to the /Library/StartupItems directory to prevent any startup items from getting registered since StartupItems are deprecated.\n\n\nPrivileged Account Management [M1026]\nWhen PowerShell is necessary, restrict PowerShell execution policy to administrators. Be aware that there are methods of bypassing the PowerShell execution policy, depending on environment configuration.\n\n\nPrivileged Account Management [M1026]\nConfigure the Increase Scheduling Priority option only to allow the Administrators group the rights to schedule a priority process.\n\n\nOperating System Configuration [M1028]\nConfigure settings for scheduled tasks to force tasks to run under the authenticated account’s context instead of allowing them to run as SYSTEM.\n\n\nNetwork Intrusion Prevention [M1031]\nUse network intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware and mitigate activity at the network level.\n\n\nExecution Prevention [M1038]\nUse application control tools where appropriate.\n\n\nExecution Prevention [M1038]\nUse application control tools to prevent the running of executables masquerading as other files.\n\n\nBehavior Prevention on Endpoint [M1040]\nConfigure endpoint (if possible) to block some process injection types based on common sequences of behavior during the injection process.\n\n\nDisable or Remove Feature or Program [M1042]\nDisable or remove any unnecessary or unused shells or interpreters.\n\n\nCode Signing [M1045]\nWhere possible, only permit the execution of signed scripts.\n\n\nAudit [M1047]\nAudit logging for launchd events in macOS can be reviewed or centrally collected using multiple options, such as Syslog, OpenBSM, or OSquery.\n\n\nAudit [M1047]\nToolkits like the PowerSploit framework contain PowerUp modules that can be used to explore systems for permission weaknesses in scheduled tasks that could be used to escalate privileges.\n\n\nAntivirus/Antimalware [M1049]\nUse an antivirus program to quarantine suspicious files automatically.\n\n\n\n \n\nContact Information\n\nRecipients of this report are encouraged to contribute any additional information that they may have related to this threat.\nFor any questions related to this report or to report an intrusion and request resources for incident response or technical assistance, please contact:\n\nThe FBI through the FBI Cyber Division (855-292-3937 or CyWatch@fbi.gov) or a local field office,\nCISA (888-282-0870 or Central@cisa.dhs.gov), or\nTreasury Office of Cybersecurity and Critical Infrastructure Protection (Treasury OCCIP) (202-622-3000 or OCCIP-Coord@treasury.gov).\n\n\nReferences\n\n[1] CISA Alert AA20-239A: FASTCash 2.0: North Korea's BeagleBoyz Robbing Banks\n[2] Department of the Treasury Press Release: Treasury Sanctions Individuals Laundering Cryptocurrency for Lazarus Group\n[3] Department of Justice Press Release: Two Chinese Nationals Charged with Laundering Over $100 Million in Cryptocurrency From Exchange Hack\n[4] CISA Alert TA17-318A: HIDDEN COBRA – North Korean Remote Administration Tool: FALLCHILL\n[5] CISA Alert TA17-318A: HIDDEN COBRA – North Korean Remote Administration Tool: FALLCHILL \n[6] MITRE ATT&CK Software: FALLCHILL\n[7] SecureList: Operation AppleJeus Sequel\n[8] GitHub: Blackbird Bitcoin Arbitrage\n\nRevisions\n\nFebruary 17, 2021: Initial Version|April 15, 2021: Updated MITRE ATT&CK technique from Command and Scripting Interpreter: AppleScript [T1059.002] to Command and Scripting Interpreter: Unix Shell [T1059.004].\n",
  "cves": [],
  "techniques": [
    "T1566",
    "T1071",
    "T1564",
    "T1204",
    "T1547",
    "T1583",
    "T1033",
    "T1548",
    "T1573",
    "T1583.001",
    "T1588.003",
    "T1053.004",
    "T1041",
    "T1588.004",
    "T1543.003",
    "T1053.005",
    "T1053",
    "T1588",
    "T1566.002",
    "T1573.001",
    "T1583.006",
    "T1027",
    "T1071.001",
    "T1587.001",
    "T1059",
    "T1543.004",
    "T1059.004",
    "T1204.002",
    "T1564.001",
    "T1059.002",
    "T1587",
    "T1543"
  ],
  "advisory": "aa21-048a",
  "title": "AppleJeus: Analysis of North Korea’s Cryptocurrency Malware | CISA",
  "source": "cybersecurity-advisories",
  "id": "d54ea5afbe9e0e1c61f814390aed5631bd03e28c45bd565ebd71f744402ef29c"
}