{
  "markdown": "\n\nSummary\n\nThis joint Cybersecurity Advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework, Version 9. See the ATT&CK for Enterprise framework for referenced threat actor techniques and for mitigations. \nThis joint advisory is the result of analytic efforts between the Federal Bureau of Investigation (FBI) and the Cybersecurity and Infrastructure Security Agency (CISA) to highlight the cyber threat associated with active exploitation of a newly identified vulnerability (CVE-2021-44077) in Zoho ManageEngine ServiceDesk Plus—IT help desk software with asset management.\nCVE-2021-44077, which Zoho rated critical, is an unauthenticated remote code execution (RCE) vulnerability affecting all ServiceDesk Plus versions up to, and including, version 11305. This vulnerability was addressed by the update released by Zoho on September 16, 2021 for ServiceDesk Plus versions 11306 and above. The FBI and CISA assess that advanced persistent threat (APT) cyber actors are among those exploiting the vulnerability. Successful exploitation of the vulnerability allows an attacker to upload executable files and place webshells, which enable the adversary to conduct post-exploitation activities, such as compromising administrator credentials, conducting lateral movement, and exfiltrating registry hives and Active Directory files. \nThe Zoho update that patched this vulnerability was released on September 16, 2021, along with a security advisory. Additionally, an email advisory was sent to all ServiceDesk Plus customers with additional information. Zoho released a subsequent security advisory on November 22, 2021, and advised customers to patch immediately.\nThe FBI and CISA are aware of reports of malicious cyber actors likely using exploits against CVE-2021-44077 to gain access [T1190] to ManageEngine ServiceDesk Plus, as early as late October 2021. The actors have been observed using various tactics, techniques and procedures (TTPs), including:\n\nWriting webshells [T1505.003] to disk for initial persistence\nObfuscating and Deobfuscating/Decoding Files or Information [T1027 and T1140]\nConducting further operations to dump user credentials [T1003]\nLiving off the land by only using signed Windows binaries for follow-on actions [T1218]\nAdding/deleting user accounts as needed [T1136]\nStealing copies of the Active Directory database (NTDS.dit) [T1003.003] or registry hives\nUsing Windows Management Instrumentation (WMI) for remote execution [T1047]\nDeleting files to remove indicators from the host [T1070.004]\nDiscovering domain accounts with the net Windows command [T1087.002]\nUsing Windows utilities to collect and archive files for exfiltration [T1560.001]\nUsing custom symmetric encryption for command and control (C2) [T1573.001]\n\nThe FBI and CISA are proactively investigating this malicious cyber activity:\n\nThe FBI leverages specially trained cyber squads in each of its 56 field offices and CyWatch, the FBI’s 24/7 operations center and watch floor, which provides around-the-clock support to track incidents and communicate with field offices across the country and partner agencies. \nCISA offers a range of no-cost cyber hygiene services to help organizations assess, identify, and reduce their exposure to threats. By requesting these services, organizations of any size could find ways to reduce their risk and mitigate attack vectors. \n\nSharing technical and/or qualitative information with the FBI and CISA helps empower and amplify our capabilities as federal partners to collect and share intelligence and engage with victims, while working to unmask and hold accountable those conducting malicious cyber activities.\nClick here for a PDF version of this report.\nClick here for indicators of compromise (IOCs) in STIX format.\n\nTechnical Details\n\nCompromise of the affected systems involves exploitation of CVE-2021-44077 in ServiceDesk Plus, allowing the attacker to:\n\nAchieve an unrestricted file upload through a POST request to the ServiceDesk REST API URL and upload an executable file, C:\\ManageEngine\\Servicedesk\\bin\\msiexec.exe, with a SHA256 hash of ecd8c9967b0127a12d6db61964a82970ee5d38f82618d5db4d8eddbb3b5726b7. This executable file serves as a dropper and contains an embedded, encoded Godzilla JAR file.\nGain execution for the dropper through a second POST request to a different REST API URL, which will then decode the embedded Godzilla JAR file and drop it to the filepath C:\\ManageEngine\\ServiceDesk\\lib\\tomcat\\tomcat-postgres.jar with a SHA256 hash of 67ee552d7c1d46885b91628c603f24b66a9755858e098748f7e7862a71baa015.\n\nConfirming a successful compromise of ManageEngine ServiceDesk Plus may be difficult—the attackers are known to run clean-up scripts designed to remove traces of the initial point of compromise and hide any relationship between exploitation of the vulnerability and the webshell.\nTargeted Industries \nAPT cyber actors have targeted Critical Infrastructure Sector industries, including the healthcare, financial services, electronics and IT consulting industries.\nIndicators of Compromise \nHashes\nWebshell:\n67ee552d7c1d46885b91628c603f24b66a9755858e098748f7e7862a71baa015\n068D1B3813489E41116867729504C40019FF2B1FE32AAB4716D429780E666324\n759bd8bd7a71a903a26ac8d5914e5b0093b96de61bf5085592be6cc96880e088\n262cf67af22d37b5af2dc71d07a00ef02dc74f71380c72875ae1b29a3a5aa23d\na44a5e8e65266611d5845d88b43c9e4a9d84fe074fd18f48b50fb837fa6e429d\nce310ab611895db1767877bd1f635ee3c4350d6e17ea28f8d100313f62b87382\n75574959bbdad4b4ac7b16906cd8f1fd855d2a7df8e63905ab18540e2d6f1600\n5475aec3b9837b514367c89d8362a9d524bfa02e75b85b401025588839a40bcb\nDropper:\necd8c9967b0127a12d6db61964a82970ee5d38f82618d5db4d8eddbb3b5726b7\nImplant:\n009d23d85c1933715c3edcccb46438690a66eebbcccb690a7b27c9483ad9d0ac \n083bdabbb87f01477f9cf61e78d19123b8099d04c93ef7ad4beb19f4a228589a\n342e85a97212bb833803e06621170c67f6620f08cc220cf2d8d44dff7f4b1fa3\n\nNGLite Backdoor:\n805b92787ca7833eef5e61e2df1310e4b6544955e812e60b5f834f904623fd9f\n3da8d1bfb8192f43cf5d9247035aa4445381d2d26bed981662e3db34824c71fd\n5b8c307c424e777972c0fa1322844d4d04e9eb200fe9532644888c4b6386d755\n3f868ac52916ebb6f6186ac20b20903f63bc8e9c460e2418f2b032a207d8f21d\n342a6d21984559accbc54077db2abf61fd9c3939a4b09705f736231cbc7836ae\n7e4038e18b5104683d2a33650d8c02a6a89badf30ca9174576bf0aff08c03e72\n\nKDC Sponge:\n3c90df0e02cc9b1cf1a86f9d7e6f777366c5748bd3cf4070b49460b48b4d4090\nb4162f039172dcb85ca4b85c99dd77beb70743ffd2e6f9e0ba78531945577665\ne391c2d3e8e4860e061f69b894cf2b1ba578a3e91de610410e7e9fa87c07304c\n\nMalicious IIS Module:\nbec067a0601a978229d291c82c35a41cd48c6fca1a3c650056521b01d15a72da\n\nRenamed WinRAR:\nd0c3d7003b7f5b4a3bd74a41709cfecfabea1f94b47e1162142de76aa7a063c7\n\nRenamed csvde:\n7d2780cd9acc516b6817e9a51b8e2889f2dec455295ac6e6d65a6191abadebff\nNetwork Indicators\nPOST requests sent to the following URLs:\n/RestAPI/ImportTechnicians?step=1\nDomains:\nseed.nkn[.]org\nNote: the domain seed.nkn[.]org is a New Kind of Network (NKN) domain that provides legitimate peer to peer networking services utilizing blockchain technology for decentralization. It is possible to have false positive hits in a corporate network environment and it should be considered suspicious to see any software-initiated contacts to this domain or any subdomain.\nLog File Analysis\n\nCheck serverOut*.txt log files under C:\\ManageEngine\\ServiceDesk\\logs\\ for suspicious log entries matching the following format:\n\n[<time>]|[<date>]|[com.adventnet.servicedesk.setup.action.ImportTechniciansAction]|[INFO]|[62]: fileName is : msiexec.exe]\n\n\n\nFilepaths\nC:\\ManageEngine\\ServiceDesk\\bin\\msiexec.exe\nC:\\ManageEngine\\ServiceDesk\\lib\\tomcat\\tomcat-postgres.jar\nC:\\Windows\\Temp\\ScriptModule.dll\nC:\\ManageEngine\\ServiceDesk\\bin\\ScriptModule.dll\nC:\\Windows\\system32\\ME_ADAudit.exe\nc:\\Users\\[username]\\AppData\\Roaming\\ADManager\\ME_ADManager.exe\n%ALLUSERPROFILE%\\Microsoft\\Windows\\Caches\\system.dat\nC:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat\nc:\\windows\\temp\\ccc.exe\nTactics, Techniques, and Procedures\n\nUsing WMI for lateral movement and remote code execution (in particular, wmic.exe)\nUsing plaintext credentials for lateral movement\nUsing pg_dump.exe to dump ManageEngine databases\nDumping NTDS.dit and SECURITY/SYSTEM/NTUSER registry hives\nActive credential harvesting through LSASS (KDC Sponge)\nExfiltrating through webshells\nConducting exploitation activity often through other compromised U.S. infrastructure\nDropping multiple webshells and/or implants to maintain persistence\nUsing renamed versions of WinRAR, csvde, and other legitimate third-party tools for reconnaissance and exfiltration\n\nYara Rules\nrule ReportGenerate_jsp {\n   strings:\n      $s1 = \"decrypt(fpath)\"\n      $s2 = \"decrypt(fcontext)\"\n      $s3 = \"decrypt(commandEnc)\"\n      $s4 = \"upload failed!\"\n      $s5 = \"sevck\"\n      $s6 = \"newid\"\n   condition:\n      filesize < 15KB and 4 of them\n}\n \nrule EncryptJSP {\n   strings:\n      $s1 = \"AEScrypt\"\n      $s2 = \"AES/CBC/PKCS5Padding\"\n      $s3 = \"SecretKeySpec\"\n      $s4 = \"FileOutputStream\"\n      $s5 = \"getParameter\"\n      $s6 = \"new ProcessBuilder\"\n      $s7 = \"new BufferedReader\"\n      $s8 = \"readLine()\"\n   condition:\n      filesize < 15KB and 6 of them\n}\n \nrule ZimbraImplant {\n    strings:\n        $u1 = \"User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/87.0.4280.88 Safari/537.36\"\n        $u2 = \"Content-Type: application/soap+xml; charset=UTF-8\"\n        $u3 = \"/service/soap\"\n        $u4 = \"Good Luck :::)\"\n        $s1 = \"zimBR\"\n        $s2 = \"log10\"\n        $s3 = \"mymain\"\n        $s4 = \"urn:zimbraAccount\"\n        $s5 = \"/service/upload?fmt=extended,raw\"\n        $s6 = \"<query>(in:\\\"inbox\\\" or in:\\\"junk\\\") is:unread</query>\"\n    condition:\n        (uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550) and filesize < 2MB and 1 of ($u*) and 3 of ($s*)\n}\n \nrule GodzillaDropper {\n    strings:\n        $s1 = \"UEsDBAoAAAAAAI8UXFM\" // base64 encoded PK/ZIP header\n        $s2 = \"../lib/tomcat/tomcat-postgres.jar\"\n        $s3 = \"RunAsManager.exe\"\n        $s4 = \"ServiceDesk\"\n        $s5 = \"C:\\\\Users\\\\pwn\\\\documents\\\\visual studio 2015\\\\Projects\\\\payloaddll\"\n        $s6 = \"CreateMutexA\"\n        $s7 = \"cplusplus_me\"\n    condition:\n        (uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550) and filesize < 350KB and 4 of them\n}\n \nrule GodzillaJAR {\n    strings:\n        $s1 = \"org/apache/tomcat/SSLFilter.class\"\n        $s2 = \"META-INF/services/javax.servlet.ServletContainerInitializer\"\n        $s3 = \"org/apache/tomcat/MainFilterInitializer.class\"\n    condition:\n        uint32(0) == 0x04034B50 and filesize < 50KB and all of them\n}\n \nrule APT_NGLite {\n    strings:\n        $s1 = \"/mnt/hgfs/CrossC2-2.2\"\n        $s2 = \"WHATswrongwithU\"\n        $s3 = \"//seed.nkn.org:\"\n        $s4 = \"Preylistener\"\n        $s5 = \"preyid\"\n        $s6 = \"Www-Authenticate\"\n    condition:\n        (uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550) and filesize < 15MB and 4 of them\n}\n \nrule KDCSponge {\n    strings:\n        $k1 = \"kdcsvc.dll\"\n        $k2 = \"kdccli.dll\"\n        $k3 = \"kdcsvs.dll\"\n        $f1 = \"KerbHashPasswordEx3\"\n        $f2 = \"KerbFreeKey\"\n        $f3 = \"KdcVerifyEncryptedTimeStamp\"\n        $s1 = \"download//symbols//%S//%S//%S\" wide\n        $s2 = \"KDC Service\"\n        $s3 = \"\\\\system.dat\"\n    condition:\n        (uint16(0) == 0x5A4D and uint32(uint32(0x3C)) == 0x00004550) and filesize < 1MB and 1 of ($k*) and 1 of ($f*) and 1 of ($s*)\n\nMitigations\n\nCompromise Mitigations\nOrganizations that identify any activity related to ManageEngine ServiceDesk Plus indicators of compromise within their networks should take action immediately. \nZoho ManageEngine ServiceDesk Plus build 11306, or higher, fixes CVE-2021-44077. ManageEngine initially released a patch for this vulnerability on September 16, 2021. A subsequent security advisory was released on November 22, 2021, and advised customers to patch immediately. Additional information can be found in the Zoho security advisory released on November 22, 2021.\nIn addition, Zoho has set up a security response plan center that provides additional details, a downloadable tool that can be run on potentially affected systems, and a remediation guide.\nFBI and CISA also strongly recommend domain-wide password resets and double Kerberos TGT password resets if any indication is found that the NTDS.dit file was compromised. \nNote: Implementing these password resets should not be taken as a comprehensive mitigation in response to this threat; additional steps may be necessary to regain administrative control of your network. Refer to your specific products mitigation guidance for details. \nActions for Affected Organizations\nImmediately report as an incident to CISA or the FBI (refer to Contact information section below) the existence of any of the following:\n\nIdentification of indicators of compromise as outlined above.\nPresence of webshell code on compromised ServiceDesk Plus servers.\nUnauthorized access to or use of accounts.\nEvidence of lateral movement by malicious actors with access to compromised systems.\nOther indicators of unauthorized access or compromise.\n\n\nContact Information\n\nRecipients of this report are encouraged to contribute any additional information that they may have related to this threat. \nFor any questions related to this report or to report an intrusion and request resources for incident response or technical assistance, please contact:\n\nThe FBI through the FBI Cyber Division (855-292-3937 or CyWatch@fbi.gov) or a local field office\nCISA (888-282-0870 or Central@cisa.dhs.gov).\n\n\nRevisions\n\nDecember 2, 2021: Initial version|December 6, 2021: STIX file added\n",
  "cves": [
    "CVE-2021-44077"
  ],
  "techniques": [
    "T1573.001",
    "T1505.003",
    "T1070.004",
    "T1560.001",
    "T1087.002",
    "T1003.003"
  ],
  "advisory": "aa21-336a",
  "title": "APT Actors Exploiting CVE-2021-44077 in Zoho ManageEngine ServiceDesk Plus | CISA",
  "source": "cybersecurity-advisories",
  "id": "0ae75877b9c7e3523d3200ebee3b32420bdee0c70022ec7109065ed6f2134739"
}