{"markdown": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Ongoing Cyber Threats to U.S. Water and Wastewater Systems \\| CISA\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Skip to main content](#main) \n\n\n\n\n\n\n\n\n\n\n\n\n![U.S. flag](/profiles/cisad8_gov/themes/custom/gesso/dist/images/us_flag_small.png)\n\n\n\n An official website of the United States government\n \n\n\n\n Here’s how you know\n \n\n\n\n\n\n Here’s how you know\n \n\n\n\n\n\n\n![Dot gov](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-dot-gov.svg)\n\n\n**Official websites use .gov** \n  \n\n A\n **.gov** \n website belongs to an official government organization in the United States.\n \n\n\n\n\n\n![HTTPS](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-https.svg)\n\n\n**Secure .gov websites use HTTPS** \n  \n\n A\n **lock** \n (\n \n\n\n Lock\n \n\n A locked padlock\n \n\n\n\n\n ) or\n **https://** \n means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo Americas Cyber Defense Agency](/sites/default/files/images/SVG/header_logo_tagline_update.svg)](/)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo](/sites/default/files/images/SVG/mobile_logo_wordmark.svg)](/)\n\n\n\n\n\n\n\n\n\n\n Search\n \n\n\n\n\n\n\n\n\n\n Menu\n \n\n\n\n\n\n\n\n\n\n\n\n\n![America's Cyber Defense Agency](/sites/default/files/images/SVG/header_tagline_mobile_update.svg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Close\n \n\n\n\n\n* Topics\n \n\n\n\n[Topics](/topics) \n\n\n\n\n[Cybersecurity Best Practices](/topics/cybersecurity-best-practices)\n\n\n\n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories)\n\n\n\n\n[Critical Infrastructure Security and Resilience](/topics/critical-infrastructure-security-and-resilience)\n\n\n\n\n[Election Security](/topics/election-security)\n\n\n\n\n[Emergency Communications](/topics/emergency-communications)\n\n\n\n\n[Industrial Control Systems](/topics/industrial-control-systems)\n\n\n\n\n[Information and Communications Technology Supply Chain Security](/topics/information-communications-technology-supply-chain-security)\n\n\n\n\n[Partnerships and Collaboration](/topics/partnerships-and-collaboration)\n\n\n\n\n[Physical Security](/topics/physical-security)\n\n\n\n\n[Risk Management](/topics/risk-management)\n\n\n\n\n\n[How can we help?](/audiences) \n\n\n[Government](/topics/government) \n[Educational Institutions](/topics/educational-institutions) \n[Industry](/topics/industry) \n[State, Local, Tribal, and Territorial](/topics/state-local-tribal-and-territorial) \n[Individuals and Families](/topics/individuals-and-families) \n[Small and Medium Businesses](/topics/small-and-medium-businesses) \n[Find Help Locally](/audiences/find-help-locally) \n[Faith\\-Based Community](/audiences/faith-based-community) \n[Executives](/audiences/executives) \n[High\\-Risk Communities](/audiences/high-risk-communities)\n* [Spotlight](/spotlight)\n* Resources \\& Tools\n \n\n\n\n[Resources \\& Tools](/resources-tools) \n\n\n\n\n[All Resources \\& Tools](/resources-tools/all-resources-tools)\n\n\n\n\n[Services](/resources-tools/services)\n\n\n\n\n[Programs](/resources-tools/programs)\n\n\n\n\n[Resources](/resources-tools/resources)\n\n\n\n\n[Training](/resources-tools/training)\n\n\n\n\n[Groups](/resources-tools/groups)\n* News \\& Events\n \n\n\n\n[News \\& Events](/news-events) \n\n\n\n\n[News](/news-events/news)\n\n\n\n\n[Events](/news-events/events)\n\n\n\n\n[Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)\n\n\n\n\n[Directives](/news-events/directives)\n\n\n\n\n[Request a CISA Speaker](/news-events/request-speaker)\n\n\n\n\n[Congressional Testimony](/news-events/congressional-testimony)\n\n\n\n\n[CISA Conferences](/cisa-conferences)\n\n\n\n\n[CISA Live!](/cisa-live)\n* Careers\n \n\n\n\n[Careers](/careers) \n\n\n\n\n[Benefits \\& Perks](/careers/benefits-perks)\n\n\n\n\n[HireVue Applicant Reasonable Accommodations Process](/careers/hirevue-applicant-reasonable-accommodations-process)\n\n\n\n\n[Hiring](/general-recruitment-and-hiring-faqs)\n\n\n\n\n[Resume \\& Application Tips](/careers/resume-application-tips)\n\n\n\n\n[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)\n\n\n\n\n[Veteran and Military Spouses](/careers/veteran-and-military-spouse-employment-opportunities)\n\n\n\n\n[Work @ CISA](/careers/work-cisa)\n* About\n \n\n\n\n[About](/about) \n\n\n\n\n[Culture](/about/culture)\n\n\n\n\n[Divisions \\& Offices](/about/divisions-offices)\n\n\n\n\n[Regions](/about/regions)\n\n\n\n\n[Leadership](/about/leadership)\n\n\n\n\n[Doing Business with CISA](/doing-business-cisa)\n\n\n\n\n[Site Links](/site-links)\n\n\n\n\n[Reporting Employee and Contractor Misconduct](/reporting-employee-and-contractor-misconduct)\n\n\n\n\n[CISA GitHub](/cisa-github)\n\n\n\n\n[CISA Central](/cisa-central)\n\n\n\n\n[2023 Year In Review](/about/2023YIR)\n\n\n\n\n[Contact Us](/about/contact-us)\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Breadcrumb\n \n1. [Home](/)\n2. [News \\& Events](/news-events)\n3. [Cybersecurity Advisories](/news-events/cybersecurity-advisories)\n4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94)\n\n\n\n\n\n\n\n\n Share:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Cybersecurity Advisory\n \nOngoing Cyber Threats to U.S. Water and Wastewater Systems\n==========================================================\n\n\n\n\n\n Last Revised\n \n\n\n October 25, 2021\n \n\n\n\n\n Alert Code\n \n\n AA21\\-287A\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n### Summary\n\n\n\n\n***Immediate Actions WWS Facilities Can Take Now to Protect Against Malicious Cyber Activity** \n  \n\n  \n\n • Do not click on\n [suspicious links](https://us-cert.cisa.gov/ncas/tips/ST04-014) \n .* \n  \n\n  \n\n*• If you use\n [RDP](https://www.ic3.gov/Media/Y2018/PSA180927) \n , secure and monitor it.\n   \n\n  \n\n •* \n*Use\n [strong passwords](https://us-cert.cisa.gov/ncas/tips/ST04-002) \n .* \n  \n\n  \n\n •\n *Use\n [multi\\-factor authentication](https://us-cert.cisa.gov/ncas/tips/ST05-012) \n .* \n\n\n\n\n****Note:** \n This advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT\\&CK®) framework, version 9\\. See the\n [ATT\\&CK for Enterprise](https://attack.mitre.org/versions/v9/techniques/enterprise/) \n for all referenced threat actor tactics and techniques.**\n\n\n\n\n This joint advisory is the result of analytic efforts between the Federal Bureau of Investigation (FBI), the Cybersecurity and Infrastructure Agency (CISA), the Environmental Protection Agency (EPA), and the National Security Agency (NSA) to highlight ongoing malicious cyber activity—by both known and unknown actors—targeting the information technology (IT) and operational technology (OT) networks, systems, and devices of\n [U.S. Water and Wastewater Systems (WWS) Sector facilities](https://www.cisa.gov/water-and-wastewater-systems-sector) \n . This activity—which includes attempts to compromise system integrity via unauthorized access—threatens the ability of WWS facilities to provide clean, potable water to, and effectively manage the wastewater of, their communities.\n **Note:** \n although cyber threats across\n [critical infrastructure sectors](https://www.cisa.gov/critical-infrastructure-sectors) \n are increasing, this advisory does not intend to indicate greater targeting of the WWS Sector versus others.\n \n\n\n\n To secure WWS facilities—including Department of Defense (DoD) water treatment facilities in the United States and abroad—against the TTPs listed below, CISA, FBI, EPA, and NSA strongly urge organizations to implement the measures described in the Recommended Mitigations section of this advisory.\n \n\n\n\n[Click here](/sites/default/files/publications/AA21-287A-Ongoing_Cyber_Threats_to_U.S._Water_and_Wastewater_Systems.pdf) \n for a PDF version of this report.\n \n\n\n\n### Technical Details\n\n\n\n### Threat Overview\n\n\n#### Tactics, Techniques, and Procedures\n\n\n\n WWS facilities may be vulnerable to the following common tactics, techniques, and procedures (TTPs) used by threat actors to compromise IT and OT networks, systems, and devices.\n \n\n\n* Spearphishing personnel to deliver malicious payloads, including ransomware \\[\n [T1566](https://attack.mitre.org/versions/v9/techniques/T1566/) \n ].\n\t+ Spearphishing is one of the most prevalent techniques used for initial access to IT networks. Personnel and their potential lack of cyber awareness are a vulnerability within an organization. Personnel may open malicious attachments or links to execute malicious payloads contained in emails from threat actors that have successfully bypassed email filtering controls.\n\t+ When organizations integrate IT with OT systems, attackers can gain access—either purposefully or inadvertently—to OT assets after the IT network has been compromised through spearphishing and other techniques.\n\t+ Exploitation of internet\\-connected services and applications that enable remote access to WWS networks \\[\n\t [T1210](https://attack.mitre.org/versions/v9/techniques/T1210/) \n\t ].\n\t\t- For example, threat actors can exploit a Remote Desktop Protocol (RDP) that is insecurely connected to the internet to infect a network with ransomware. If the RDP is used for process control equipment, the attacker could also compromise WWS operations. Note: the increased use of remote operations due to the COVID\\-19 pandemic has likely increased the prevalence of weaknesses associated with remote access.\n* Exploitation of unsupported or outdated operating systems and software.\n\t+ Threat actors likely seek to take advantage of perceived weaknesses among organizations that either do not have—or choose not to prioritize—resources for IT/OT infrastructure modernization. WWS facilities tend to allocate resources to physical infrastructure in need of replacement or repair (e.g., pipes) rather than IT/OT infrastructure.\n\t+ The fact that WWS facilities are inconsistently resourced municipal systems—not all of which have the resources to employ consistently high cybersecurity standards—may contribute to the use of unsupported or outdated operating systems and software.\n* Exploitation of control system devices with vulnerable firmware versions.\n\t+ WWS systems commonly use outdated control system devices or firmware versions, which expose WWS networks to publicly accessible and remotely executable vulnerabilities. Successful compromise of these devices may lead to loss of system control, denial of service, or loss of sensitive data \\[\n\t [T0827](https://collaborate.mitre.org/attackics/index.php/Technique/T0827) \n\t ].\n\n\n#### WWS Sector Cyber Intrusions\n\n\n\n Cyber intrusions targeting U.S. WWS facilities highlight vulnerabilities associated with the following threats:\n \n\n\n* Insider threats, from current or former employees who maintain improperly active credentials\n* Ransomware attacks\n\n\n\n WWS Sector cyber intrusions from 2019 to early 2021 include:\n \n\n\n* In August 2021, malicious cyber actors used Ghost variant ransomware against a California\\-based WWS facility. The ransomware variant had been in the system for about a month and was discovered when three supervisory control and data acquisition (SCADA) servers displayed a ransomware message.\n* In July 2021, cyber actors used remote access to introduce ZuCaNo ransomware onto a Maine\\-based WWS facility’s wastewater SCADA computer. The treatment system was run manually until the SCADA computer was restored using local control and more frequent operator rounds.\n* In March 2021, cyber actors used an unknown ransomware variant against a Nevada\\-based WWS facility. The ransomware affected the victim’s SCADA system and backup systems. The SCADA system provides visibility and monitoring but is not a full industrial control system (ICS).\n* In September 2020, personnel at a New Jersey\\-based WWS facility discovered potential Makop ransomware had compromised files within their system.\n* In March 2019, a former employee at Kansas\\-based WWS facility unsuccessfully attempted to threaten drinking water safety by using his user credentials, which had not been revoked at the time of his resignation, to remotely access a facility computer.\n\n\n\n### Mitigations\n\n\n\n\n The FBI, CISA, EPA, and NSA recommend WWS facilities—including DoD water treatment facilities in the United States and abroad—use a risk\\-informed analysis to determine the applicability of a range of technical and non\\-technical mitigations to prevent, detect, and respond to cyber threats.\n \n\n\n#### WWS Monitoring\n\n\n\n Personnel responsible for monitoring WWS should check for the following suspicious activities and indicators, which may be indicative of threat actor activity:\n \n\n\n* Inability of WWS facility personnel to access SCADA system controls at any time, either entirely or in part;\n* Unfamiliar data windows or system alerts appearing on SCADA system controls and facility data screens that could indicate a ransomware attack;\n* Detection by SCADA system controls, or by water treatment personnel, of abnormal operating parameters—such as unusually high chemical addition rates—used in the safe and proper treatment of drinking water;\n* Access of SCADA systems by unauthorized individuals or groups, e.g., former employees and current employees not authorized/assigned to operate SCADA systems and controls.\n* Access of SCADA systems at unusual times, which may indicate that a legitimate user’s credentials have been compromised\n* Unexplained SCADA system restarts.\n* Unchanging parameter values that normally fluctuate.\n\n\n#### Remote Access Mitigations\n\n\n\n Note: The increased use of remote operations due to the COVID\\-19 pandemic increases the necessity for asset owner\\-operators to assess the risk associated with enhanced remote access to ensure it falls within acceptable levels.\n \n\n\n* Require multi\\-factor authentication for all remote access to the OT network, including from the IT network and external networks.\n* Utilize\n [blocklisting and allowlisting](https://csrc.nist.gov/News/2015/NIST-Release-of-SP-800-167,-Guide-to-Application-W) \n to limit remote access to users with a verified business and/or operational need.\n* Ensure that all remote access technologies have logging enabled and regularly audit these logs to identify instances of unauthorized access.\n* Utilize manual start and stop features in place of always activated unattended access to reduce the time remote access services are running.\n* Audit networks for systems using remote access services.\n\t+ Close unneeded network ports associated with remote access services (e.g., RDP – Transmission Control Protocol \\[TCP] Port 3389\\).\n* When configuring\n [access control for a host](https://csrc.nist.gov/publications/detail/sp/800-82/rev-2/final) \n , utilize custom settings to limit the access a remote party can attempt to acquire.\n\n\n#### Network Mitigations\n\n\n* Implement and ensure robust network segmentation between IT and OT networks to limit the ability of malicious cyber actors to pivot to the OT network after compromising the IT network.\n\t+ Implement demilitarized zones (DMZs), firewalls, jump servers, and one\\-way communication diodes to prevent unregulated communication between the IT and OT networks.\n* Develop/update network maps to ensure a full accounting of all equipment that is connected to the network.\n\t+ Remove any equipment from networks that is not required to conduct operations to reduce the attack surface malicious actors can exploit.\n\n\n#### Planning and Operational Mitigations\n\n\n* Ensure the organization’s emergency response plan considers the full range of potential impacts that cyberattacks pose to operations, including loss or manipulation of view, loss or manipulation of control, and threats to safety.\n\t+ The plan should also consider third parties with legitimate need for OT network access, including engineers and vendors.\n\t+ Review, test, and update the emergency response plan on an annual basis to ensure accuracy.\n* Exercise the ability to fail over to alternate control systems, including manual operation while assuming degraded electronic communications.\n* Allow employees to gain decision\\-making experience via\n [tabletop exercises](https://www.cisa.gov/publication/cybersecurity-scenarios) \n that incorporate loss of visibility and control scenarios. Utilize resources such as the Environment Protection Agency’s (EPA)\n [Cybersecurity Incident Action Checklist](https://www.epa.gov/waterriskassessment/epa-cybersecurity-best-practices-water-sector) \n as well as the Ransomware Response Checklist on p. 11 of the\n [CISA\\-Multi\\-State Information Sharing and Analysis Center (MS\\-ISAC) Joint Ransomware Guide](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware Guide_S508C_.pdf) \n .\n\n\n#### Safety System Mitigations\n\n\n* Install independent cyber\\-physical safety systems. These are systems that physically prevent dangerous conditions from occurring if the control system is compromised by a threat actor.\n\t+ Examples of cyber\\-physical safety system controls include:\n\t\t- Size of the chemical feed pump\n\t\t- Gearing on valves\n\t\t- Pressure switches, etc.\n\t+ These types of controls benefit WWS Sector facilities—especially smaller facilities with limited cybersecurity capability—because they enable facility staff to assess systems from a worst\\-case scenario and determine protective solutions. Enabling cyber\\-physical safety systems allows operators to take physical steps to limit the damage, for example, by preventing cyber actors, who have gained control of a sodium hydroxide pump, from raising the pH to dangerous levels.\n\n\n### Additional Mitigations\n\n\n* Foster an organizational culture of cyber readiness. See the\n [CISA Cyber Essentials](https://www.cisa.gov/publication/cyber-essentials-toolkits) \n along with the items listed in the Resources section below for guidance.\n* Update software, including operating systems, applications, and firmware on IT network assets. Use a risk\\-based assessment strategy to determine which OT network assets and zones should participate in the patch management program. Consider using a centralized patch management system.\n* Set antivirus/antimalware programs to conduct regular scans of IT network assets using up\\-to\\-date signatures. Use a risk\\-based asset inventory strategy to determine how OT network assets are identified and evaluated for the presence of malware.\n* Implement regular data backup procedures on both the IT and OT networks.\n\t+ Regularly test backups.\n\t+ Ensure backups are not connected to the network to prevent the potential spread of ransomware to the backups.\n* When possible, enable OT device authentication, utilize the encrypted version of OT protocols, and encrypt all wireless communications to ensure the confidentiality and authenticity of process control data in transit.\n* Employ user account management to:\n\t+ Remove, disable, or rename any default system accounts wherever possible.\n\t+ Implement account lockout policies to reduce risk from brute\\-force attacks.\n\t+ Monitor the creation of administrator\\-level accounts by third\\-party vendors with robust and privileged account management policies and procedures.\n\t+ Implement a user account policy that includes set durations for deactivation and removal of accounts after employees leave the organization or after accounts reach a defined period of inactivity.\n* Implement data execution prevention controls, such as application allowlisting and software restriction policies that prevent programs from executing from common ransomware locations, such as temporary folders supporting popular internet browsers.\n* Train users through awareness and simulations to recognize and report phishing and social engineering attempts. Identify and suspend access of users exhibiting unusual activity.\n\n\n\n FBI, CISA, EPA, and NSA would like to thank Dragos as well as the WaterISAC for their contributions to this advisory.\n \n\n\n### Resources\n\n\n#### Cyber Hygiene Services\n\n\n\n CISA offers a range of no\\-cost\n [cyber hygiene services](https://www.cisa.gov/cyber-hygiene-services) \n —including vulnerability scanning and ransomware readiness assessments—to help critical infrastructure organizations assess, identify, and reduce their exposure to cyber threats. By taking advantage of these services, organizations of any size will receive recommendations on ways to reduce their risk and mitigate attack vectors.\n \n\n\n#### Rewards for Justice Reporting\n\n\n\n The U.S. Department of State’s Rewards for Justice (RFJ) program offers a reward of up to $10 million for reports of foreign government malicious activity against U.S. critical infrastructure. See the\n [RFJ website](https://rewardsforjustice.net/english/malicious_cyber_activity.html) \n for more information and how to report information securely.\n \n\n\n#### StopRansomware.gov\n\n\n\n The\n [StopRansomware.gov](https://www.cisa.gov/stopransomware) \n webpage is an interagency resource that provides guidance on ransomware protection, detection, and response. This includes ransomware alerts, reports, and resources from CISA and other federal partners, including:\n \n\n\n* CISA and MS\\-ISAC:\n [Joint Ransomware Guide](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware Guide_S508C.pdf)\n* CISA Insights:\n [Ransomware Outbreak](https://www.cisa.gov/blog/2019/08/21/cisa-insights-ransomware-outbreak-0)\n* CISA Webinar:\n [Combating Ransomware](https://www.youtube.com/watch?v=D8kC07tu27A)\n\n\n### Additional Resources\n\n\n\n For additional resources that can assist in preventing and mitigating this activity, see:\n \n\n\n* FBI\\-CISA\\-EPA\\-MS\\-ISAC Joint CSA:\n [Compromise of U.S. Water Treatment Facility](https://us-cert.cisa.gov/ncas/alerts/aa21-042a)\n* WaterISAC:\n [15 Cybersecurity Fundamentals for Water and Wastewater Utilities](https://www.waterisac.org/fundamentals)\n* American Water Works Association:\n [Cybersecurity Guidance and Assessment Tool](https://www.awwa.org/Resources-Tools/Resource-Topics/Risk-Resilience/Cybersecurity-Guidance)\n* EPA:\n [Cybersecurity Incident Action Checklist](https://www.epa.gov/waterriskassessment/epa-cybersecurity-best-practices-water-sector)\n* EPA:\n [Cybersecurity Best Practices for the Water Sector](https://www.epa.gov/waterriskassessment/epa-cybersecurity-best-practices-water-sector)\n* EPA: Supporting Cybersecurity Measures with the\n [Clean Water](https://www.epa.gov/cwsrf) \n and\n [Drinking Water](https://www.epa.gov/dwsrf) \n State Revolving Funds\n* CISA:\n [Cyber Risks \\& Resources for the Water and Wastewater Systems Sector](https://www.cisa.gov/ncf-water) \n infographic\n* CISA:\n [Critical ICS Cybersecurity Performance Goals and Objectives](https://www.cisa.gov/control-systems-goals-and-objectives)\n* CISA Fact Sheet:\n [Rising Ransomware Threat to Operational Technology Assets](https://www.cisa.gov/publication/ransomware-threat-to-ot)\n* CISA\\-MS\\-ISAC:\n [Joint Ransomware Guide](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware Guide_S508C_.pdf)\n* NSA CSA:\n [Stop Malicious Cyber Activity Against Connected OT](https://media.defense.gov/2021/Apr/29/2002630479/-1/-1/1/CSA_STOP-MCA-AGAINST-OT_UOO13672321.PDF)\n* CISA:\n [Insider Threat Mitigation Resources](https://www.cisa.gov/publication/insider-threat-mitigation-resources)\n* NIST:\n [Special Publication (SP) 800\\-167, Guide to Application Whitelisting](https://csrc.nist.gov/News/2015/NIST-Release-of-SP-800-167,-Guide-to-Application-W)\n* NIST:\n [SP 800\\-82 Rev. 2, Guide to Industrial Control Systems (ICS) Security (Section 6\\.2\\.1\\)](https://csrc.nist.gov/publications/detail/sp/800-82/rev-2/final)\n\n\n### Disclaimer of Endorsement\n\n\n\n The information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes.\n   \n\n  \n\n\n\n\n\n### Contact Information\n\n\n\n\n To report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local FBI field office at\n [www.fbi.gov/contact\\-us/field\\-offices](https://www.fbi.gov/contact-us/field-offices) \n , or the FBI’s 24/7 Cyber Watch (CyWatch) at (855\\) 292\\-3937 or by e\\-mail at\n [CyWatch@fbi.gov](mailto:CyWatch@fbi.gov) \n . When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. If you have any further questions related to this Joint Cybersecurity Advisory, or to request incident response resources or technical assistance related to these threats, contact CISA at\n [Central@cisa.dhs.gov](mailto:Central@cisa.dhs.gov \"Email CISA Central\") \n .\n \n\n\n\n### Revisions\n\n\n\n\n Initial Version: October 14, 2021\\|October 25, 2021: Corrected typo in Additional Resources\n \n\n\n\n\n\n\n\n\n\n\n This product is provided subject to this\n [Notification](/notification \"Follow link\") \n and this\n [Privacy \\& Use](/privacy-policy \"Follow link\") \n policy.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease share your thoughts\n--------------------------\n\n\n\n We recently updated our anonymous\n [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa21-287a) \n ; we’d welcome your feedback.\n \n\n\n\n\n\n\n\n\n\n\n\n\nRelated Advisories\n------------------\n\n\n\n\n\n\n\n\n\n\n Jul 11, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-193A\n \n\n### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a)\n\n\n\n\n\n\n\n\n\n\n\n Jul 08, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-190A\n \n\n### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a)\n\n\n\n\n\n\n\n\n\n\n\n May 10, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-131A\n \n\n### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a)\n\n\n\n\n\n\n\n\n\n\n\n Apr 18, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-109A\n \n\n### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Return to top](#) \n\n\n\n\n* [Topics](/topics)\n* [Spotlight](/spotlight)\n* [Resources \\& Tools](/resources-tools)\n* [News \\& Events](/news-events)\n* [Careers](/careers)\n* [About](/about)\n\n\n\n\n\n\n\n\n[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")\n\n\n* [Facebook](https://www.facebook.com/CISA)\n* [Twitter](https://twitter.com/CISAgov)\n* [LinkedIn](https://www.linkedin.com/company/cybersecurity-and-infrastructure-security-agency)\n* [YouTube](https://www.youtube.com/@cisagov)\n* [Instagram](https://www.instagram.com/cisagov)\n* [RSS](/subscribe-updates-cisa)\n\n\n\n\n CISA Central\n \n[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) \n[SayCISA@cisa.gov](mailto:SayCISA@cisa.gov) \n\n\n\n\n\n\n\n\n\n\n\n DHS Seal\n \n\n\n CISA.gov\n \n\n An official website of the U.S. Department of Homeland Security\n \n\n\n* [About CISA](/about \"About CISA\")\n* [Budget and Performance](https://www.dhs.gov/performance-financial-reports \"Budget and Performance\")\n* [DHS.gov](https://www.dhs.gov \"Department of Homeland Security\")\n* [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")\n* [FOIA Requests](https://www.dhs.gov/foia \"FOIA Requests\")\n* [No FEAR Act](/no-fear-act \"No FEAR Act Reporting\")\n* [Office of Inspector General](https://www.oig.dhs.gov/ \"Office of Inspector General\")\n* [Privacy Policy](/privacy-policy \"Privacy Policy\")\n* [Subscribe](https://public.govdelivery.com/accounts/USDHSCISA/subscriber/new?topic_id=USDHSCISA_138 \"Subscribe to Email Updates\")\n* [The White House](https://www.whitehouse.gov/ \"The White House\")\n* [USA.gov](https://www.usa.gov/ \"USA.gov\")\n* [Website Feedback](/forms/feedback \"Website Feedback\")\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "cves": [], "techniques": [], "advisory": "aa21-287a", "title": "Ongoing Cyber Threats to U.S. Water and Wastewater Systems | CISA", "source": "cybersecurity-advisories", "id": "d7d0a245542ddd36244060747ad52ca731145bd7b2ccff17954fd5e684eda5a5"}