{
  "markdown": " DarkSide Ransomware: Best Practices for Preventing Business Disruption from Ransomware Attacks \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events)4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94) Cybersecurity AdvisoryDarkSide Ransomware: Best Practices for Preventing Business Disruption from Ransomware Attacks============================================================================================== Last Revised July 08, 2021 Alert Code AA21\\-131A### Summary*This Advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT\\&CK®) framework, Version 9\\. See the [ATT\\&CK for Enterprise](https://attack.mitre.org/versions/v8/techniques/enterprise/)  for all referenced threat actor tactics and techniques.*  The Cybersecurity and Infrastructure Security Agency (CISA) and the Federal Bureau of Investigation (FBI) are aware of a ransomware attack affecting a critical infrastructure (CI) entity—a pipeline company—in the United States. Malicious cyber actors deployed DarkSide ransomware against the pipeline company’s information technology (IT) network.\\[ [1](https://www.colpipe.com/news/press-releases/media-statement-colonial-pipeline-system-disruption)  ] At this time, there is no indication that the entity’s operational technology (OT) networks have been directly affected by the ransomware. CISA and FBI urge CI asset owners and operators to adopt a heightened state of awareness and implement the recommendations listed in the Mitigations section of this Joint Cybersecurity Advisory, including implementing robust network segmentation between IT and OT networks; regularly testing manual controls; and ensuring that backups are implemented, regularly tested, and isolated from network connections. These mitigations will help CI owners and operators improve their entity's functional resilience by reducing their vulnerability to ransomware and the risk of severe business degradation if impacted by ransomware.* **(Updated May 19, 2021\\):** [Click here for a STIX package of indicators of compromise (IOCs)](/sites/default/files/publications/AA21-131A.stix.xml)  . **Note:**  These IOCs were shared with critical infrastructure partners and network defenders on May 10, 2021\\. The applications listed in the IOCs were leveraged by the threat actors during the course of a compromise. Some of these applications might appear within an organization's enterprise to support legitimate purposes; however, these applications can be used by threat actors to aid in malicious exploitation of an organization's enterprise. CISA and FBI recommend removing any application not deemed necessary for day\\-to\\-day operations.* **(Updated July 08, 2021\\)**  : Click [here](/sites/default/files/publications/MAR-10337802-1.v1.WHITE_stix.xml)  for downloadable IOCs associated with a sample of a DarkSide ransomware variant analyzed by CISA and FBI. Note: CISA and FBI have no evidence that this sample is related to the pipeline incident detailed in this CSA. This variant executes a dynamic\\-link library (DLL) program used to delete Volume Shadow copies available on the system. The malware collects, encrypts, and sends system information to the threat actor’s command and control (C2\\) domains and generates a ransom note to the victim. For more information about this variant, refer to Malware Analysis Report [MAR\\-10337802\\-1\\.v1: DarkSide Ransomware](https://us-cert.cisa.gov/ncas/analysis-reports/ar21-189a)  . Click [here](/sites/default/files/publications/AA21-131A_Darkside_Ransomware.pdf)  for a PDF version of this report.### Technical Details***Note**  : the analysis in this Joint Cybersecurity Advisory is ongoing, and the information provided should not be considered comprehensive. CISA and FBI will update this advisory as new information is available.*  After gaining initial access to the pipeline company’s network, DarkSide actors deployed DarkSide ransomware against the company’s IT network. In response to the cyberattack, the company has reported that they proactively disconnected certain OT systems to ensure the systems’ safety.\\[ [2](https://www.colpipe.com/news/press-releases/media-statement-colonial-pipeline-system-disruption)  ] At this time, there are no indications that the threat actor moved laterally to OT systems. DarkSide is ransomware\\-as\\-a\\-service (RaaS)—the developers of the ransomware receive a share of the proceeds from the cybercriminal actors who deploy it, known as “affiliates.” According to open\\-source reporting, since August 2020, DarkSide actors have been targeting multiple large, high\\-revenue organizations, resulting in the encryption and theft of sensitive data. The DarkSide group has publicly stated that they prefer to target organizations that can afford to pay large ransoms instead of hospitals, schools, non\\-profits, and governments.\\[ [3](https://securitynews.sonicwall.com/xmlpost/darkside-ransomware-targets-large-corporations-charges-up-to-2m/)  ],\\[ [4](https://www.varonis.com/blog/darkside-ransomware/)  ] According to open\\-source reporting, DarkSide actors have previously been observed gaining initial access through phishing and exploiting remotely accessible accounts and systems and Virtual Desktop Infrastructure (VDI) ( *Phishing*  \\[ [T1566]](https://attack.mitre.org/versions/v9/techniques/T1566/)  , *Exploit Public\\-Facing Application*  \\[ [T1190](https://attack.mitre.org/versions/v9/techniques/T1190/)  ], *External Remote Services*  \\[ [T1133](https://attack.mitre.org/versions/v9/techniques/T1133/)  ]).\\[ [5](https://www.bankinfosecurity.com/fbi-darkside-ransomware-used-in-colonial-pipeline-attack-a-16555)  ],\\[ [6](https://www.varonis.com/blog/darkside-ransomware/)  ] DarkSide actors have also been observed using Remote Desktop Protocol (RDP) to maintain *Persistence*  \\[ [TA0003](https://attack.mitre.org/versions/v9/tactics/TA0003/)  ].\\[ [7](https://www.varonis.com/blog/darkside-ransomware/)  ] After gaining access, DarkSide actors deploy DarkSide ransomware to encrypt and steal sensitive data ( *Data Encrypted for Impact*  \\[ [T1486](https://attack.mitre.org/techniques/T1486/)  ]). The actors then threaten to publicly release the data if the ransom is not paid.\\[ [8](https://securitynews.sonicwall.com/xmlpost/darkside-ransomware-targets-large-corporations-charges-up-to-2m/)  ],\\[ [9](https://www.varonis.com/blog/darkside-ransomware/)  ] The DarkSide ransomware uses Salsa20 and RSA encryption.\\[ [10](https://www.mcafee.com/enterprise/en-us/threat-center/threat-landscape-dashboard/ransomware-details.darkside-ransomware.html)  ] DarkSide actors primarily use [The Onion Router (TOR)](https://attack.mitre.org/software/S0183/)  for *Command and Control (C2\\)*  \\[ [TA0011](https://attack.mitre.org/versions/v9/tactics/TA0011/)  ] ( *Proxy: Multi\\-hop Proxy*  \\[ [1090\\.003](https://attack.mitre.org/versions/v9/techniques/T1090/003/)  ]).\\[ [11](https://securitynews.sonicwall.com/xmlpost/darkside-ransomware-targets-large-corporations-charges-up-to-2m/)  ],\\[ [12](https://www.varonis.com/blog/darkside-ransomware/)  ] The actors have also been observed using [Cobalt Strike](https://attack.mitre.org/versions/v9/software/S0154/)  for C2\\.\\[ [13](https://www.mcafee.com/enterprise/en-us/threat-center/threat-landscape-dashboard/ransomware-details.darkside-ransomware.html)  ]### Mitigations CISA and FBI urge CI owners and operators to apply the following mitigations to reduce the risk of compromise by ransomware attacks.* **Require multi\\-factor authentication**  for remote access to OT and IT networks.* **Enable strong spam filters to prevent phishing emails from reaching end users**  . Filter emails containing executable files from reaching end users.* **Implement a user training program and simulated attacks for spearphishing**  to discourage users from visiting malicious websites or opening malicious attachments and re\\-enforce the appropriate user responses to spearphishing emails.* **Filter network traffic**  to prohibit ingress and egress communications with known malicious IP addresses. Prevent users from accessing malicious websites by implementing URL blocklists and/or allowlists.* **Update software**  , including operating systems, applications, and firmware on IT network assets, in a timely manner. Consider using a centralized patch management system; use a risk\\-based assessment strategy to determine which OT network assets and zones should participate in the patch management program.* **Limit access to resources over networks, especially by restricting RDP**  . After assessing risks, if RDP is deemed operationally necessary, restrict the originating sources and require multi\\-factor authentication.* **Set antivirus/antimalware programs to conduct regular scans**  of IT network assets using up\\-to\\-date signatures. Use a risk\\-based asset inventory strategy to determine how OT network assets are identified and evaluated for the presence of malware.* **Implement unauthorized execution prevention by**  :\t+ **Disabling macro scripts from Microsoft Office files** \t transmitted via email. Consider using Office Viewer software to open Microsoft Office files transmitted via email instead of full Microsoft Office suite applications.\t+ **Implementing application allowlisting** \t , which only allows systems to execute programs known and permitted by security policy. Implement software restriction policies (SRPs) or other controls to prevent programs from executing from common ransomware locations, such as temporary folders supporting popular internet browsers or compression/decompression programs, including the\t `AppData/LocalAppData` \t folder.\t+ **Monitor and/or block inbound connections from Tor exit nodes and other anonymization services** \t to IP addresses and ports for which external connections are not expected (i.e., other than VPN gateways, mail ports, web ports). For more guidance, refer to Joint Cybersecurity Advisory\t [AA20\\-183A: Defending Against Malicious Cyber Activity Originating from Tor](https://us-cert.cisa.gov/ncas/alerts/aa20-183a) \t .\t+ **Deploy signatures to detect and/or block inbound connection from Cobalt Strike servers** \t and other post exploitation tools. CISA and FBI urge CI owners and operators to apply the following mitigations now to reduce the risk of severe business or functional degradation should their CI entity fall victim to a ransomware attack in the future.* **Implement and ensure robust network segmentation between IT and OT networks**  to limit the ability of adversaries to pivot to the OT network even if the IT network is compromised. Define a demilitarized zone that eliminates unregulated communication between the IT and OT networks.* **Organize OT assets into logical zones**  by taking into account criticality, consequence, and operational necessity. Define acceptable communication conduits between the zones and deploy security controls to filter network traffic and monitor communications between zones. Prohibit industrial control system (ICS) protocols from traversing the IT network.* **Identify OT and IT network inter\\-dependencies and develop workarounds or manual controls**  to ensure ICS networks can be isolated if the connections create risk to the safe and reliable operation of OT processes. Regularly test contingency plans such as manual controls so that safety critical functions can be maintained during a cyber incident. Ensure that the OT network can operate at necessary capacity even if the IT network is compromised.* **Regularly test manual controls**  so that critical functions can be kept running if ICS or OT networks need to be taken offline.* **Implement regular data backup procedures**  on both the IT and OT networks. Backup procedures should be conducted on a frequent, regular basis. The data backup procedures should also address the following best practices:\t+ **Ensure that backups are regularly tested** \t .\t+ **Store your backups separately** \t . Backups should be isolated from network connections that could enable the spread of ransomware. It is important that backups be maintained offline as many ransomware variants attempt to find and encrypt or delete accessible backups. Maintaining current backups offline is critical because if your network data is encrypted with ransomware, your organization can restore systems to its previous state. Best practice is to store your backups on a separate device that cannot be accessed from a network, such as on an external hard drive. (See the Software Engineering Institute’s page on\t [ransomware](https://insights.sei.cmu.edu/sei_blog/2017/05/ransomware-best-practices-for-prevention-and-response.html) \t ).\t+ **Maintain regularly updated “gold images” of critical systems in the event they need to be rebuilt** \t . This entails maintaining image “templates” that include a preconfigured operating system (OS) and associated software applications that can be quickly deployed to rebuild a system, such as a virtual machine or server.\t+ **Retain backup hardware** \t to rebuild systems in the event rebuilding the primary system is not preferred. Hardware that is newer or older than the primary system can present installation or compatibility hurdles when rebuilding from images.\t+ **Store source code or executables** \t . It is more efficient to rebuild from system images, but some images will not install on different hardware or platforms correctly; having separate access to needed software will help in these cases.* **Ensure user and process accounts are limited through account use policies, user account control, and privileged account management**  . Organize access rights based on the principles of least privilege and separation of duties. If your organization is impacted by a ransomware incident, CISA and FBI recommend the following actions:* **Isolate the infected system**  . Remove the infected system from all networks, and disable the computer’s wireless, Bluetooth, and any other potential networking capabilities. Ensure all shared and networked drives are disconnected, whether wired or wireless.* **Turn off other computers and devices**  . Power\\-off and segregate (i.e., remove from the network) the infected computer(s). Power\\-off and segregate any other computers or devices that shared a network with the infected computer(s) that have not been fully encrypted by ransomware. If possible, collect and secure all infected and potentially infected computers and devices in a central location, making sure to clearly label any computers that have been encrypted. Powering\\-off and segregating infected computers and computers that have not been fully encrypted may allow for the recovery of partially encrypted files by specialists. (See [Before You Connect a New Computer to the Internet](https://us-cert.cisa.gov/ncas/tips/ST15-003)  for tips on how to make a computer more secure before you reconnect it to a network.)* **Secure your backups**  . Ensure that your backup data is offline and secure. If possible, scan your backup data with an antivirus program to check that it is free of malware.* Refer to Joint Cybersecurity Advisory: [AA20\\-245A: Technical Approaches to Uncovering and Remediating Malicious Activity](https://us-cert.cisa.gov/ncas/alerts/aa20-245a)  for more best practices on incident response.**Note:**  CISA and the FBI do not encourage paying a ransom to criminal actors. Paying a ransom may embolden adversaries to target additional organizations, encourage other criminal actors to engage in the distribution of ransomware, and/or may fund illicit activities. Paying the ransom also does not guarantee that a victim’s files will be recovered. CISA and FBI urge you to report ransomware incidents to your [local FBI field office](http://www.fbi.gov/contact-us/field)  . CISA offers a range of no\\-cost [cyber hygiene services](https://www.cisa.gov/cyber-hygiene-services)  to help CI organizations assess, identify and reduce their exposure to threats, including ransomware. By requesting these services, organizations of any size could find ways to reduce their risk and mitigate attack vectors.### Resources* CISA and MS\\-ISAC: [Joint Ransomware Guide](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware Guide_S508C.pdf)* CISA: [Ransomware page](https://www.cisa.gov/ransomware)* CISA Tip: [Protecting Against Ransomware](https://us-cert.cisa.gov/ncas/tips/ST19-001)* CISA: [CISA Ransomware One\\-Pager and Technical Document](https://www.us-cert.gov/sites/default/files/publications/Ransomware_Executive_One-Pager_and_Technical_Document-FINAL.pdf)* CISA Insights: [Ransomware Outbreak](https://www.us-cert.gov/sites/default/files/2019-08/CISA_Insights-Ransomware_Outbreak_S508C.pdf)* CISA: [Pipeline Cybersecurity Initiative](https://www.cisa.gov/pipeline-cybersecurity-initiative)* CISA Webinar: [Combating Ransomware](https://www.youtube.com/watch?v=D8kC07tu27A)* CISA: [Cybersecurity Practices for Industrial Control Systems](https://www.cisa.gov/publication/cybersecurity-best-practices-for-industrial-control-systems)* FBI: [Incidents of Ransomware on the Rise](https://www.fbi.gov/news/stories/incidents-of-ransomware-on-the-rise/incidents-of-ransomware-on-the-rise)* National Security Agency (NSA): [Stop Malicious Cyber Activity Against Connected Operational Technology](https://media.defense.gov/2021/Apr/29/2002630479/-1/-1/1/CSA_STOP-MCA-AGAINST-OT_UOO13672321.PDF)* Department of Energy: [Oil and Natural Gas Subsector Cybersecurity Capability Maturity Model](https://www.energy.gov/sites/prod/files/2014/03/f13/ONG-C2M2-v1-1_cor.pdf)* Transportation Security Agency: [Pipeline Security Guidelines](https://www.tsa.gov/sites/default/files/pipeline_security_guidelines.pdf)* National Institute of Standards and Technology (NIST): [Framework for Improving Critical Infrastructure Cybersecurity](https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf)* NIST: [Ransomware Protection and Response](https://csrc.nist.gov/projects/ransomware-protection-and-response)* NIST: [Data Integrity: Identifying and Protecting Assets Against Ransomware and Other Destructive Events](https://www.nccoe.nist.gov/projects/building-blocks/data-integrity/identify-protect)* NIST: [Data Integrity: Detecting and Responding to Ransomware and Other Destructive Events](https://www.nccoe.nist.gov/projects/building-blocks/data-integrity/detect-respond)* NIST: [Data Integrity: Recovering from Ransomware and Other Destructive Events](https://www.nccoe.nist.gov/projects/building-blocks/data-integrity/recover)* NIST: [Guide to Industrial Control Systems (ICS) Security](https://csrc.nist.gov/publications/detail/sp/800-82/rev-2/final)* Software Engineering Institute: Ransomware: [Best Practices for Prevention and Response](https://insights.sei.cmu.edu/blog/ransomware-best-practices-for-prevention-and-response/)* NIST [Fact Sheet: How Do I Stay Prepared?](https://csrc.nist.gov/CSRC/media/Projects/ransomware-protection-and-response/documents/NIST_Tips_for_Preparing_for_Ransomware_Attacks.pdf)### Contact Information Victims of ransomware should report it immediately to CISA at [https://us\\-cert.cisa.gov/report](https://us-cert.cisa.gov/report)  , a [local FBI Field Office](https://www.fbi.gov/contact-us/field-offices)  , or [U.S. Secret Service Field Office](http://www.secretservice.gov/contact/field-offices/)  . To report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local FBI field office at [www.fbi.gov/contact\\-us/field](http://www.fbi.gov/contact-us/field)  , or the FBI’s 24/7 Cyber Watch (CyWatch) at (855\\) 292\\-3937 or by e\\-mail at [CyWatch@fbi.gov](mailto:CyWatch@fbi.gov)  . When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. To request incident response resources or technical assistance related to these threats, contact CISA at [central@cisa.dhs.gov](mailto:central@cisa.dhs.gov \"Email \")  .### References[\\[1] Colonial Pipeline Media Statement on Pipeline Disruption](https://www.colpipe.com/news/press-releases/media-statement-colonial-pipeline-system-disruption) [\\[2] Ibid](https://www.colpipe.com/news/press-releases/media-statement-colonial-pipeline-system-disruption) [\\[3] SonicWall: Darkside Ransomware Targets Large Corporations. Charges up to $2M.](https://securitynews.sonicwall.com/xmlpost/darkside-ransomware-targets-large-corporations-charges-up-to-2m/) [\\[4] Varonis: Return of the Darkside: Analysis of a Large\\-Scale Data Theft Campaign](https://www.varonis.com/blog/darkside-ransomware/) [\\[5] BankInfo Security: FBI: DarkSide Ransomware Used in Colonial Pipeline Attack](https://www.bankinfosecurity.com/fbi-darkside-ransomware-used-in-colonial-pipeline-attack-a-16555) [\\[6] Varonis: Return of the Darkside: Analysis of a Large\\-Scale Data Theft Campaign](https://www.varonis.com/blog/darkside-ransomware/) [\\[7] Ibid](https://www.varonis.com/blog/darkside-ransomware/) [\\[8] SonicWall: Darkside Ransomware Targets Large Corporations. Charges up to $2M](https://securitynews.sonicwall.com/xmlpost/darkside-ransomware-targets-large-corporations-charges-up-to-2m/) [\\[9] Varonis: Return of the Darkside: Analysis of a Large\\-Scale Data Theft Campaign](https://www.varonis.com/blog/darkside-ransomware/) [\\[10] McAfee: Threat Landscape Dashboard DarkSide – Ransomware](https://www.mcafee.com/enterprise/en-us/threat-center/threat-landscape-dashboard/ransomware-details.darkside-ransomware.html) [\\[11] SonicWall: Darkside Ransomware Targets Large Corporations. Charges up to $2M](https://securitynews.sonicwall.com/xmlpost/darkside-ransomware-targets-large-corporations-charges-up-to-2m/) [\\[12] Varonis: Return of the Darkside: Analysis of a Large\\-Scale Data Theft Campaign](https://www.varonis.com/blog/darkside-ransomware/) [\\[13] McAfee: Threat Landscape Dashboard DarkSide – Ransomware](https://www.mcafee.com/enterprise/en-us/threat-center/threat-landscape-dashboard/ransomware-details.darkside-ransomware.html) ### Revisions May 11, 2021: Initial Version\\|May 12, 2021: Added additional resources\\|May 19, 2021: Added IOCs\\|July 8, 2021: Added MAR\\-10337802\\-1\\.v1 and associated IOCs This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa21-131a)  ; Related Advisories------------------ Jul 11, 2024 Cybersecurity Advisory \\| AA24\\-193A### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a) Jul 08, 2024 Cybersecurity Advisory \\| AA24\\-190A### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a) May 10, 2024 Cybersecurity Advisory \\| AA24\\-131A### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a) Apr 18, 2024 Cybersecurity Advisory \\| AA24\\-109A### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "aa21-131a",
  "title": "DarkSide Ransomware: Best Practices for Preventing Business Disruption from Ransomware Attacks | CISA",
  "source": "cybersecurity-advisories",
  "id": "b15c95e1cbc0e68293200cbc63af05f7a18654e3f0447c8c4e9062ce44b71df0"
}