{"markdown": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Chinese State\\-Sponsored Cyber Operations: Observed TTPs \\| CISA\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Skip to main content](#main) \n\n\n\n\n\n\n\n\n\n\n\n\n![U.S. flag](/profiles/cisad8_gov/themes/custom/gesso/dist/images/us_flag_small.png)\n\n\n\n An official website of the United States government\n \n\n\n\n Here’s how you know\n \n\n\n\n\n\n Here’s how you know\n \n\n\n\n\n\n\n![Dot gov](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-dot-gov.svg)\n\n\n**Official websites use .gov** \n  \n\n A\n **.gov** \n website belongs to an official government organization in the United States.\n \n\n\n\n\n\n![HTTPS](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-https.svg)\n\n\n**Secure .gov websites use HTTPS** \n  \n\n A\n **lock** \n (\n \n\n\n Lock\n \n\n A locked padlock\n \n\n\n\n\n ) or\n **https://** \n means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo Americas Cyber Defense Agency](/sites/default/files/images/SVG/header_logo_tagline_update.svg)](/)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo](/sites/default/files/images/SVG/mobile_logo_wordmark.svg)](/)\n\n\n\n\n\n\n\n\n\n\n Search\n \n\n\n\n\n\n\n\n\n\n Menu\n \n\n\n\n\n\n\n\n\n\n\n\n\n![America's Cyber Defense Agency](/sites/default/files/images/SVG/header_tagline_mobile_update.svg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Close\n \n\n\n\n\n* Topics\n \n\n\n\n[Topics](/topics) \n\n\n\n\n[Cybersecurity Best Practices](/topics/cybersecurity-best-practices)\n\n\n\n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories)\n\n\n\n\n[Critical Infrastructure Security and Resilience](/topics/critical-infrastructure-security-and-resilience)\n\n\n\n\n[Election Security](/topics/election-security)\n\n\n\n\n[Emergency Communications](/topics/emergency-communications)\n\n\n\n\n[Industrial Control Systems](/topics/industrial-control-systems)\n\n\n\n\n[Information and Communications Technology Supply Chain Security](/topics/information-communications-technology-supply-chain-security)\n\n\n\n\n[Partnerships and Collaboration](/topics/partnerships-and-collaboration)\n\n\n\n\n[Physical Security](/topics/physical-security)\n\n\n\n\n[Risk Management](/topics/risk-management)\n\n\n\n\n\n[How can we help?](/audiences) \n\n\n[Government](/topics/government) \n[Educational Institutions](/topics/educational-institutions) \n[Industry](/topics/industry) \n[State, Local, Tribal, and Territorial](/topics/state-local-tribal-and-territorial) \n[Individuals and Families](/topics/individuals-and-families) \n[Small and Medium Businesses](/topics/small-and-medium-businesses) \n[Find Help Locally](/audiences/find-help-locally) \n[Faith\\-Based Community](/audiences/faith-based-community) \n[Executives](/audiences/executives) \n[High\\-Risk Communities](/audiences/high-risk-communities)\n* [Spotlight](/spotlight)\n* Resources \\& Tools\n \n\n\n\n[Resources \\& Tools](/resources-tools) \n\n\n\n\n[All Resources \\& Tools](/resources-tools/all-resources-tools)\n\n\n\n\n[Services](/resources-tools/services)\n\n\n\n\n[Programs](/resources-tools/programs)\n\n\n\n\n[Resources](/resources-tools/resources)\n\n\n\n\n[Training](/resources-tools/training)\n\n\n\n\n[Groups](/resources-tools/groups)\n* News \\& Events\n \n\n\n\n[News \\& Events](/news-events) \n\n\n\n\n[News](/news-events/news)\n\n\n\n\n[Events](/news-events/events)\n\n\n\n\n[Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)\n\n\n\n\n[Directives](/news-events/directives)\n\n\n\n\n[Request a CISA Speaker](/news-events/request-speaker)\n\n\n\n\n[Congressional Testimony](/news-events/congressional-testimony)\n\n\n\n\n[CISA Conferences](/cisa-conferences)\n\n\n\n\n[CISA Live!](/cisa-live)\n* Careers\n \n\n\n\n[Careers](/careers) \n\n\n\n\n[Benefits \\& Perks](/careers/benefits-perks)\n\n\n\n\n[HireVue Applicant Reasonable Accommodations Process](/careers/hirevue-applicant-reasonable-accommodations-process)\n\n\n\n\n[Hiring](/general-recruitment-and-hiring-faqs)\n\n\n\n\n[Resume \\& Application Tips](/careers/resume-application-tips)\n\n\n\n\n[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)\n\n\n\n\n[Veteran and Military Spouses](/careers/veteran-and-military-spouse-employment-opportunities)\n\n\n\n\n[Work @ CISA](/careers/work-cisa)\n* About\n \n\n\n\n[About](/about) \n\n\n\n\n[Culture](/about/culture)\n\n\n\n\n[Divisions \\& Offices](/about/divisions-offices)\n\n\n\n\n[Regions](/about/regions)\n\n\n\n\n[Leadership](/about/leadership)\n\n\n\n\n[Doing Business with CISA](/doing-business-cisa)\n\n\n\n\n[Site Links](/site-links)\n\n\n\n\n[Reporting Employee and Contractor Misconduct](/reporting-employee-and-contractor-misconduct)\n\n\n\n\n[CISA GitHub](/cisa-github)\n\n\n\n\n[CISA Central](/cisa-central)\n\n\n\n\n[2023 Year In Review](/about/2023YIR)\n\n\n\n\n[Contact Us](/about/contact-us)\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Breadcrumb\n \n1. [Home](/)\n2. [News \\& Events](/news-events)\n3. [Cybersecurity Advisories](/news-events/cybersecurity-advisories)\n4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94)\n\n\n\n\n\n\n\n\n Share:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Cybersecurity Advisory\n \nChinese State\\-Sponsored Cyber Operations: Observed TTPs\n========================================================\n\n\n\n\n\n Last Revised\n \n\n\n August 20, 2021\n \n\n\n\n\n Alert Code\n \n\n AA21\\-200B\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n### Summary\n\n\n\n\n*This advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT\\&CK®) framework, Version 9, and MITRE D3FEND™ framework, version 0\\.9\\.2\\-BETA\\-3\\. See the\n [ATT\\&CK for Enterprise](https://attack.mitre.org/versions/v8/techniques/enterprise/) \n for all referenced threat actor tactics and techniques and the\n [D3FEND framework](https://d3fend.mitre.org/) \n for referenced defensive tactics and techniques.* \n\n\n\n\n The National Security Agency, Cybersecurity and Infrastructure Security Agency (CISA), and Federal Bureau of Investigation (FBI) assess that People’s Republic of China state\\-sponsored malicious cyber activity is a major threat to U.S. and Allied cyberspace assets. Chinese state\\-sponsored cyber actors aggressively target U.S. and allied political, economic, military, educational, and critical infrastructure (CI) personnel and organizations to steal sensitive data, critical and emerging key technologies, intellectual property, and personally identifiable information (PII). Some target sectors include managed service providers, semiconductor companies, the Defense Industrial Base (DIB), universities, and medical institutions. These cyber operations support China’s long\\-term economic and military development objectives.\n \n\n\n\n This Joint Cybersecurity Advisory (CSA) provides information on tactics, techniques, and procedures (TTPs) used by Chinese state\\-sponsored cyber actors. This advisory builds on previous NSA, CISA, and FBI reporting to inform federal, state, local, tribal, and territorial (SLTT) government, CI, DIB, and private industry organizations about notable trends and persistent TTPs through collaborative, proactive, and retrospective analysis.\n \n\n\n\n To increase the defensive posture of their critical networks and reduce the risk of Chinese malicious cyber activity, NSA, CISA, and FBI urge government, CI, DIB, and private industry organizations to apply the recommendations listed in the Mitigations section of this advisory and in Appendix A: Chinese State\\-sponsored Cyber Actors' Observed Procedures.\n **Note:** \n NSA, CISA, and FBI encourage organization leaders to review\n [CISA Joint Insights: Chinese Malicious Cyber Activity: Threat Overview for Leaders](https://www.cisa.gov/publication/chinese-cyber-threat-overview-and-actions-leaders) \n for information on this threat to their organization.\n \n\n\n\n[Click here](https://media.defense.gov/2021/Jul/19/2002805003/-1/-1/1/CSA_CHINESE_STATE-SPONSORED_CYBER_TTPS.PDF) \n for a PDF version of this report.\n \n\n\n\n### Technical Details\n\n\n\n#### **Trends in Chinese State\\-Sponsored Cyber Operations**\n\n\n\n NSA, CISA, and FBI have observed increasingly sophisticated Chinese state\\-sponsored cyber activity targeting U.S. political, economic, military, educational, and CI personnel and organizations. NSA, CISA, and FBI have identified the following trends in Chinese state\\-sponsored malicious cyber operations through proactive and retrospective analysis:\n \n\n\n* **Acquisition of Infrastructure and Capabilities** \n . Chinese state\\-sponsored cyber actors remain agile and cognizant of the information security community’s practices. These actors take effort to mask their activities by using a revolving series of virtual private servers (VPSs) and common open\\-source or commercial penetration tools.\n* **Exploitation of Public Vulnerabilities.** \n Chinese state\\-sponsored cyber actors consistently scan target networks for critical and high vulnerabilities within days of the vulnerability’s public disclosure. In many cases, these cyber actors seek to exploit vulnerabilities in major applications, such as Pulse Secure, Apache, F5 Big\\-IP, and Microsoft products. For information on Common Vulnerabilities and Exposures (CVE) known to be exploited by malicious Chinese state\\-sponsored cyber actors, see:\n \n\n\n\t+ CISA\\-FBI Joint CSA AA20\\-133A:\n\t [Top 10 Routinely Exploited Vulnerabilities](https://us-cert.cisa.gov/ncas/alerts/aa20-133a) \n\t ,\n\t+ CISA Activity Alert: AA20\\-275A:\n\t [Potential for China Cyber Response to Heightened U.S.\\-China Tensions](https://us-cert.cisa.gov/ncas/alerts/aa20-275a) \n\t , and\n\t+ NSA CSA U/OO/179811\\-20:\n\t [Chinese State\\-Sponsored Actors Exploit Publicly Known Vulnerabilities](https://media.defense.gov/2020/Oct/20/2002519884/-1/-1/0/CSA_CHINESE_EXPLOIT_VULNERABILITIES_UOO179811.PDF) \n\t .\n* **Encrypted Multi\\-Hop Proxies.** \n Chinese state\\-sponsored cyber actors have been routinely observed using a VPS as an encrypted proxy. The cyber actors use the VPS as well as small office and home office (SOHO) devices as operational nodes to evade detection.\n\n\n#### **Observed Tactics and Techniques**\n\n\n\n Chinese state\\-sponsored cyber actors use a full array of tactics and techniques to exploit computer networks of interest worldwide and to acquire sensitive intellectual property, economic, political, and military information. Appendix B: MITRE ATT\\&CK Framework lists the tactics and techniques used by Chinese state\\-sponsored cyber actors. A downloadable\n [JSON file](https://github.com/nsacyber/chinese-state-sponsored-cyber-operations-observed-ttps) \n is also available on the\n [NSA Cybersecurity GitHub page](https://github.com/nsacyber) \n .\n \n\n\n\n Refer to Appendix A: Chinese State\\-Sponsored Cyber Actors’ Observed Procedures for information on procedures affiliated with these tactics and techniques as well as applicable mitigations.\n \n\n\n\n![]()\n\n\n\n\n*Figure 1: Example of tactics and techniques used in various cyber operations.* \n\n\n\n\n\n\n\n### Mitigations\n\n\n\n NSA, CISA, and FBI urge federal and SLTT government, CI, DIB, and private industry organizations to apply the following recommendations as well as the detection and mitigation recommendations in Appendix A, which are tailored to observed tactics and techniques:\n \n\n\n* **Patch systems and equipment promptly and diligently.** \n Focus on patching critical and high vulnerabilities that allow for remote code execution or denial\\-of\\-service on externally facing equipment and CVEs known to be exploited by Chinese state\\-sponsored cyber actors. Consider implementing a patch management program that enables a timely and thorough patching cycle.\n   \n\n  \n\n**Note:** \n for more information on CVEs routinely exploited by Chinese state\\-sponsored cyber actors refer to the resources listed in the Trends in Chinese State\\-Sponsored Cyber Operations section.\n* **Enhance monitoring of network traffic, email, and endpoint systems.** \n Review network signatures and indicators for focused activities, monitor for new phishing themes, and adjust email rules accordingly. Follow the best practices of restricting attachments via email and blocking URLs and domains based upon reputation. Ensure that log information is aggregated and correlated to enable maximum detection capabilities, with a focus on monitoring for account misuse. Monitor common ports and protocols for command and control (C2\\) activity. SSL/TLS inspection can be used to see the contents of encrypted sessions to look for network\\-based indicators of malware communication protocols. Implement and enhance network and endpoint event analysis and detection capabilities to identify initial infections, compromised credentials, and the manipulation of endpoint processes and files.\n* **Use protection capabilities to stop malicious activity.** \n Implement anti\\-virus software and other endpoint protection capabilities to automatically detect and prevent malicious files from executing. Use a network intrusion detection and prevention system to identify and prevent commonly employed adversarial malware and limit nefarious data transfers. Use a domain reputation service to detect suspicious or malicious domains. Use strong credentials for service accounts and multi\\-factor authentication (MFA) for remote access to mitigate an adversary's ability to leverage stolen credentials, but be aware of MFA interception techniques for some MFA implementations.▪\n\n\n### Resources\n\n\n\n Refer to\n [us\\-cert.cisa.gov/china](https://us-cert.cisa.gov/china) \n ,\n [https://www.ic3\\.gov/Home/IndustryAlerts](https://www.ic3.gov/Home/IndustryAlerts) \n , and\n [https://www.nsa.gov/What\\-We\\-Do/Cybersecurity/Advisories\\-Technical\\-Guidance/](https://www.nsa.gov/What-We-Do/Cybersecurity/Advisories-Technical-Guidance/) \n for previous reporting on Chinese state\\-sponsored malicious cyber activity.\n \n\n\n### Disclaimer of Endorsement\n\n\n\n The information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes.\n \n\n\n### Purpose\n\n\n\n This document was developed by NSA, CISA, and FBI in furtherance of their respective cybersecurity missions, including their responsibilities to develop and issue cybersecurity specifications and mitigations. This information may be shared broadly to reach all appropriate stakeholders.\n   \n\n  \n\n This document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction. For more information on the Traffic Light Protocol, see\n [http://www.us\\-cert.gov/tlp/.](http://www.us-cert.gov/tlp/) \n\n\n\n### Trademark Recognition\n\n\n\n MITRE and ATT\\&CK are registered trademarks of The MITRE Corporation. • D3FEND is a trademark of The MITRE Corporation. • Microsoft, Microsoft Exchange, Office 365, Microsoft Office, OneDrive, Outlook, OWA, PowerShell, Windows Defender, and Windows are registered trademarks of Microsoft Corporation. • Pulse Secure is a registered trademark of Pulse Secure, LLC. • Apache is a registered trademark of Apache Software Foundation. • F5 and BIG\\-IP are registered trademarks of F5 Networks. • Cobalt Strike is a registered trademark of Strategic Cyber LLC. • GitHub is a registered trademark of GitHub, Inc. • JavaScript is a registered trademark of Oracle Corporation. • Python is a registered trademark of Python Software Foundation. • Unix is a registered trademark of The Open Group. • Linux is a registered trademark of Linus Torvalds. • Dropbox is a registered trademark of Dropbox, Inc.\n \n\n\n### APPENDIX A: Chinese State\\-Sponsored Cyber Actors’ Observed Procedures\n\n\n\n**Note:** \n D3FEND techniques are based on the Threat Actor Procedure(s) and may not match automated mappings to ATT\\&CK techniques and sub\\-techniques.\n \n\n\n### Tactics:\n *Reconnaissance* \n \\[\n [TA0043](https://attack.mitre.org/versions/v9/tactics/TA0043) \n ]\n\n\n\n*Table 1: Chinese state\\-sponsored cyber actors’ Reconnaissance TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor     Technique / Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Active Scanning \\[  [T1595](https://attack.mitre.org/versions/v9/techniques/T1595)   ] | Chinese state\\-sponsored cyber actors have been assessed to perform reconnaissance on Microsoft® 365 (M365\\), formerly Office® 365, resources with the intent of further gaining information about the networks. These scans can be automated, through Python® scripts, to locate certain files, paths, or vulnerabilities. The cyber actors can gain valuable information on the victim network, such as the allocated resources, an organization’s fully qualified domain name, IP address space, and open ports to target or exploit. | Minimize the amount and sensitivity of data available to external parties, for example:  * Scrub user email addresses and contact lists from public websites, which can be used for social engineering, * Share only necessary data and information with third parties, and * Monitor and limit third\\-party access to the network.    Active scanning from cyber actors may be identified by monitoring network traffic for sources associated with botnets, adversaries, and known bad IPs based on threat intelligence. | Detect:  * Network Traffic Analysis   \t+ Connection Attempt Analysis \\[ \t [D3\\-CAA](https://d3fend.mitre.org/technique/d3f:ConnectionAttemptAnalysis)  \t ]    Isolate:  * Network Isolation   \t+ Inbound Traffic Filtering \\[ \t [D3\\-ITF](https://d3fend.mitre.org/technique/d3f:InboundTrafficFiltering)  \t ] |\n| Gather Victim Network Information \\[  [T1590](https://attack.mitre.org/versions/v9/techniques/T1590)   ] |\n\n\n### Tactics:\n *Resource Development* \n \\[\n [TA0042](https://attack.mitre.org/versions/v9/tactics/TA0042) \n ]\n\n\n\n*Table II: Chinese state\\-sponsored cyber actors’ Resource Development TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor     Technique / Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Acquire Infrastructure \\[  [T1583](https://attack.mitre.org/versions/v9/techniques/T1583)   ] | Chinese state\\-sponsored cyber actors have been observed using VPSs from cloud service providers that are physically distributed around the world to host malware and function as C2 nodes. | Adversary activities occurring outside the organization’s boundary of control and view makes mitigation difficult. Organizations can monitor for unexpected network traffic and data flows to and from VPSs and correlate other suspicious activity that may indicate an active threat. | N/A |\n| Stage Capabilities \\[  [T1608](https://attack.mitre.org/versions/v9/techniques/T1608)   ] |\n| Obtain Capabilities \\[  [T1588](https://attack.mitre.org/versions/v9/techniques/T1588)   ]:  * Tools \\[  [T1588\\.002](https://attack.mitre.org/versions/v9/techniques/T1588/002)   ] | Chinese state\\-sponsored cyber actors have been observed using Cobalt Strike® and tools from GitHub® on victim networks. | Organizations may be able to identify malicious use of Cobalt Strike by:  * Examining network traffic using Transport Layer Security (TLS) inspection to identify Cobalt Strike. Look for human generated vice machine\\-generated traffic, which will be more uniformly distributed. * Looking for the default Cobalt Strike TLS certificate. * Look at the user agent that generates the TLS traffic for discrepancies that may indicate faked and malicious traffic. * Review the traffic destination domain, which may be malicious and an indicator of compromise. * Look at the packet's HTTP host header. If it does not match with the destination domain, it may indicate a fake Cobalt Strike header and profile. * Check the Uniform Resource Identifier (URI) of the flow to see if it matches one associated with Cobalt Strike's malleable C2 language. If discovered, additional recovery and investigation will be required. | N/A |\n\n\n### Tactics:\n *Initial Access* \n \\[\n [TA0001](https://attack.mitre.org/versions/v9/tactics/TA0001/) \n ]\n\n\n\n*Table III: Chinese state\\-sponsored cyber actors’ Initial Access TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Detection and Mitigation Recommendations |\n| --- | --- | --- | --- |\n| Drive By Compromise \\[  [T1189](https://attack.mitre.org/versions/v9/techniques/T1189)   ] | Chinese state\\-sponsored cyber actors have been observed gaining access to victim networks through watering hole campaigns of typo\\-squatted domains. | * Ensure all browsers and plugins are kept up to date. * Use modern browsers with security features turned on. * Restrict the use of unneeded websites, block unneeded downloads/attachments, block unneeded JavaScript®, restrict browser extensions, etc. * Use adblockers to help prevent malicious code served through advertisements from executing. * Use script blocking extensions to help prevent the execution of unneeded JavaScript, which may be used during exploitation processes. * Use browser sandboxes or remote virtual environments to mitigate browser exploitation. * Use security applications that look for behavior used during exploitation, such as Windows Defender® Exploit Guard (WDEG). | Detect:  * Identifier Analysis \t+ Homoglyph Detection \\[ \t [D3\\-HD](https://d3fend.mitre.org/technique/d3f:HomoglyphDetection)  \t ] \t+ URL Analysis \\[ \t [D3\\-UA](https://d3fend.mitre.org/technique/d3f:URLAnalysis)  \t ] * File Analysis \t+ Dynamic Analysis \\[ \t [D3\\-DA](https://d3fend.mitre.org/technique/d3f:DynamicAnalysis)  \t ]    Isolate:  * Execution Isolation \t+ Hardware\\-based Process Isolation \\[ \t [D3\\-HBPI](https://d3fend.mitre.org/technique/d3f:Hardware-basedProcessIsolation)  \t ] \t+ Executable Allowlisting \\[ \t [D3\\-EAL](https://d3fend.mitre.org/technique/d3f:ExecutableAllowlisting)  \t ] * Network Isolation \t+ DNS Denylisting \\[ \t [D3\\-DNSDL](https://d3fend.mitre.org/technique/d3f:DNSDenylisting)  \t ] \t+ Outbound Traffic Filtering \\[ \t [D3\\-OTF](https://d3fend.mitre.org/technique/d3f:OutboundTrafficFiltering)  \t ] |\n| Exploit Public\\-Facing Application \\[  [T1190](https://attack.mitre.org/versions/v9/techniques/T1190)   ] | Chinese state\\-sponsored cyber actors have exploited known vulnerabilities in Internet\\-facing systems.\\[  [1](https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html%20)   ] For information on vulnerabilities known to be exploited by Chinese state\\-sponsored cyber actors, refer to the Trends in Chinese State\\-Sponsored Cyber Operations section for a list of resources.     Chinese state\\-sponsored cyber actors have also been observed:  * Using short\\-term VPS devices to scan and exploit vulnerable Microsoft Exchange® Outlook Web Access (OWA®) and plant webshells. * Targeting on\\-premises Identity and Access Management (IdAM) and federation services in hybrid cloud environments to gain access to cloud resources. * Deploying a public proof of concept (POC) exploit targeting a public\\-facing appliance vulnerability. | Review previously published alerts and advisories from NSA, CISA, and FBI, and diligently patch vulnerable applications known to be exploited by cyber actors. Refer to the Trends in Chinese State\\-Sponsored Cyber Operations section for a non\\-inclusive list of resources.     Additional mitigations include:  * Consider implementing Web Application Firewalls (WAF), which can prevent exploit traffic from reaching an application. * Segment externally facing servers and services from the rest of the network with a demilitarized zone (DMZ). * Use multi\\-factor authentication (MFA) with strong factors and require regular re\\-authentication. * Disable protocols using weak authentication. * Limit access to and between cloud resources with the desired state being a Zero Trust model. For more information refer to NSA Cybersecurity Information Sheet: \\[  [Embracing a Zero Trust Security Model](https://media.defense.gov/2021/Feb/25/2002588479/-1/-1/0/CSI_EMBRACING_ZT_SECURITY_MODEL_UOO115131-21.PDF)   ]. * When possible, use cloud\\-based access controls on cloud resources (e.g., cloud service provider (CSP)\\-managed authentication between virtual machines). * Use automated tools to audit access logs for security concerns. * Where possible, enforce MFA for password resets. * Do not include Application Programing Interface (API) keys in software version control systems where they can be unintentionally leaked. | Harden:  * Application Hardening \\[  [D3\\-AH](https://d3fend.mitre.org/technique/d3f:ApplicationHardening)   ] * Platform Hardening \t+ Software Update \\[ \t [D3\\-SU](https://d3fend.mitre.org/technique/d3f:SoftwareUpdate)  \t ]    Detect:  * File Analysis \\[  [D3\\-FA](https://d3fend.mitre.org/technique/d3f:FileAnalysis)   ] * Network Traffic Analysis \t+ Client\\-server Payload Profiling \\[ \t [D3\\-CSPP](https://d3fend.mitre.org/technique/d3f:Client-serverPayloadProfiling)  \t ] * Process Analysis \t+ Process Spawn Analysis \t+ Process Lineage Analysis \\[ \t [D3\\-PLA](https://d3fend.mitre.org/technique/d3f:ProcessLineageAnalysis)  \t ]    Isolate:  * Network Isolation \t+ Inbound Traffic Filtering \\[ \t [D3\\-ITF](https://d3fend.mitre.org/technique/d3f:InboundTrafficFiltering)  \t ] |\n| Phishing \\[  [T1566](https://attack.mitre.org/versions/v9/techniques/T1566)   ]:  * Spearphishing Attachment \\[  [T1566\\.001](https://attack.mitre.org/versions/v9/techniques/T1566/001)   ] * Spearphishing Link \\[  [T1566\\.002](https://attack.mitre.org/versions/v9/techniques/T1566/002)   ] | Chinese state\\-sponsored cyber actors have been observed conducting spearphishing campaigns. These email compromise attempts range from generic emails with mass targeted phishing attempts to specifically crafted emails in targeted social engineering lures.     These compromise attempts use the cyber actors’ dynamic collection of VPSs, previously compromised accounts, or other infrastructure in order to encourage engagement from the target audience through domain typo\\-squatting and masquerading. These emails may contain a malicious link or files that will provide the cyber actor access to the victim’s device after the user clicks on the malicious link or opens the attachment. | * Implement a user training program and simulated spearphishing emails to discourage users from visiting malicious websites or opening malicious attachments and re\\-enforce the appropriate user responses to spearphishing emails. Quarantine suspicious files with antivirus solutions. * Use a network intrusion prevention system (IPS) to scan and remove malicious email attachments. * Block uncommon file types in emails that are not needed by general users (  `.exe`   ,  `.jar`   ,  `.vbs`   ) * Use anti\\-spoofing and email authentication mechanisms to filter messages based on validity checks of the sender domain (using Sender Policy Framework \\[SPF]) and integrity of messages (using Domain Keys Identified Mail \\[DKIM]). Enabling these mechanisms within an organization (through policies such as Domain\\-based Message Authentication, Reporting, and Conformance \\[DMARC]) may enable recipients (intra\\-org and cross domain) to perform similar message filtering and validation. * Determine if certain websites that can be used for spearphishing are necessary for business operations and consider blocking access if activity cannot be monitored well or if it poses a significant risk. * Prevent users from clicking on malicious links by stripping hyperlinks or implementing \"URL defanging\" at the Email Security Gateway or other email security tools. * Add external sender banners to emails to alert users that the email came from an external sender. | Harden:  * Message Hardening \t+ Message Authentication \\[ \t [D3\\-MAN](https://d3fend.mitre.org/technique/d3f:MessageAuthentication)  \t ] \t+ Transfer Agent Authentication \\[ \t [D3\\-TAAN](https://d3fend.mitre.org/technique/d3f:TransferAgentAuthentication)  \t ]    Detect:  * File Analysis \t+ Dynamic Analysis \\[ \t [D3\\-DA](https://d3fend.mitre.org/technique/d3f:DynamicAnalysis)  \t ] * Identifier Analysis \t+ Homoglyph Detection \\[ \t [D3\\-HD](https://d3fend.mitre.org/technique/d3f:HomoglyphDetection)  \t ] \t+ URL Analysis \\[ \t [D3\\-UA](https://d3fend.mitre.org/technique/d3f:URLAnalysis)  \t ] * Message Analysis \t+ Sender MTA Reputation Analysis \\[ \t [D3\\-SMRA](https://d3fend.mitre.org/technique/d3f:SenderMTAReputationAnalysis)  \t ] \t+ Sender Reputation Analysis \\[ \t [D3\\-SRA](https://d3fend.mitre.org/technique/d3f:SenderReputationAnalysis)  \t ] |\n| External Remote Services \\[  [T1133](https://attack.mitre.org/versions/v9/techniques/T1133)   ] | Chinese state\\-sponsored cyber actors have been observed:  * Exploiting vulnerable devices immediately after conducting scans for critical zero\\-day or publicly disclosed vulnerabilities. The cyber actors used or modified public proof of concept code in order to exploit vulnerable systems. * Targeting Microsoft Exchange offline address book (OAB) virtual directories (VDs). * Exploiting Internet accessible webservers using webshell small code injections against multiple code languages, including  `net`   ,  `asp`   ,  `apsx`   ,  `php`   ,  `japx`   , and  `cfm`   .   **Note:**   refer to the references listed above in Exploit Public\\-Facing Application \\[  [T1190](https://attack.mitre.org/versions/v9/techniques/T1190)   ] for information on CVEs known to be exploited by malicious Chinese cyber actors.      **Note:**   this technique also applies to Persistence \\[  [TA0003](https://attack.mitre.org/versions/v9/tactics/TA0003)   ]. | * Many exploits can be mitigated by applying available patches for vulnerabilities (such as CVE\\-2019\\-11510, CVE\\-2019\\-19781, and CVE\\-2020\\-5902\\) affecting external remote services. * Reset credentials after virtual private network (VPN) devices are upgraded and reconnected to the external network. * Revoke and generate new VPN server keys and certificates (this may require redistributing VPN connection information to users). * Disable Remote Desktop Protocol (RDP) if not required for legitimate business functions. * Restrict VPN traffic to and from managed service providers (MSPs) using a dedicated VPN connection. * Review and verify all connections between customer systems, service provider systems, and other client enclaves. | Harden:  * Software Update \\[  [D3\\-SU](https://d3fend.mitre.org/technique/d3f:SoftwareUpdate)   ]    Detect:  * Network Traffic Analysis \t+ Connection Attempt Analysis \\[ \t [D3\\-CAA](https://d3fend.mitre.org/technique/d3f:ConnectionAttemptAnalysis)  \t ] * Platform Monitoring \\[  [D3\\-PM](https://d3fend.mitre.org/technique/d3f:PlatformMonitoring)   ] * Process Analysis \t+ Process Spawn Analysis \\[ \t [D3\\-SPA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ] \t\t- Process Lineage Analysis \\[ \t\t [D3\\-PLA](https://d3fend.mitre.org/technique/d3f:ProcessLineageAnalysis)  \t\t ] |\n| Valid Accounts \\[  [T1078](https://attack.mitre.org/versions/v9/techniques/T1078)   ]:  * Default Accounts \\[  [T1078\\.001](https://attack.mitre.org/versions/v9/techniques/T1078/001)   ] * Domain Accounts \\[  [T1078\\.002](https://attack.mitre.org/versions/v9/techniques/T1078/002)   ] | Chinese state\\-sponsored cyber actors have been observed: gaining credential access into victim networks by using legitimate, but compromised credentials to access OWA servers, corporate login portals, and victim networks.    **Note:**   this technique also applies to Persistence \\[  [TA0003](https://attack.mitre.org/versions/v9/tactics/TA0003)   ], Privilege Escalation \\[  [TA0004](https://attack.mitre.org/versions/v9/tactics/TA0004)   ], and Defense Evasion \\[  [TA0005](https://attack.mitre.org/versions/v9/tactics/TA0005)   ]. | * Adhere to best practices for password and permission management. * Ensure that MSP accounts are not assigned to administrator groups and restrict those accounts to only systems they manage * Do not store credentials or sensitive data in plaintext. * Change all default usernames and passwords. * Routinely update and secure applications using Secure Shell (SSH). * Update SSH keys regularly and keep private keys secure. * Routinely audit privileged accounts to identify malicious use. | Harden:  * Credential Hardening \t+ Multi\\-factor Authentication \\[ \t [D3\\-MFA](https://d3fend.mitre.org/technique/d3f:Multi-factorAuthentication)  \t ]    Detect:  * User Behavior Analysis \\[  [D3\\-UBA](https://d3fend.mitre.org/technique/d3f:UserBehaviorAnalysis)   ] \t+ Authentication Event Thresholding \\[ \t [D3\\-ANET](https://d3fend.mitre.org/technique/d3f:AuthenticationEventThresholding)  \t ] \t+ Job Function Access Pattern Analysis \\[ \t [D3\\-JFAPA](https://d3fend.mitre.org/technique/d3f:JobFunctionAccessPatternAnalysis)  \t ] |\n\n\n### Tactics:\n *Execution* \n \\[\n [TA0002](https://attack.mitre.org/versions/v9/tactics/TA0002) \n ]\n\n\n\n*Table IV: Chinese state\\-sponsored cyber actors’ Execution TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Command and Scripting Interpreter \\[  [T1059](https://attack.mitre.org/versions/v9/techniques/T1059)   ]:  * PowerShell® \\[  [T1059\\.001](https://attack.mitre.org/versions/v9/techniques/T1059/001)   ] * Windows® Command Shell \\[  [T1059\\.003](https://attack.mitre.org/versions/v9/techniques/T1059/003)   ] * Unix® Shell \\[  [T1059\\.004](https://attack.mitre.org/versions/v9/techniques/T1059/004)   ] * Python \\[  [T1059\\.006](https://attack.mitre.org/versions/v9/techniques/T1059/006)   ] * JavaScript \\[  [T1059\\.007](https://attack.mitre.org/versions/v9/techniques/T1059/007)   ] * Network Device CLI \\[  [T1059\\.008](https://attack.mitre.org/versions/v9/techniques/T1059/008)   ] | Chinese state\\-sponsored cyber actors have been observed:  * Using cmd.exe, JavaScript/Jscript Interpreter, and network device command line interpreters (CLI). * Using PowerShell to conduct reconnaissance, enumeration, and discovery of the victim network. * Employing Python scripts to exploit vulnerable servers. * Using a UNIX shell in order to conduct discovery, enumeration, and lateral movement on Linux® servers in the victim network. | PowerShell  * Turn on PowerShell logging. (  **Note:**   this works better in newer versions of PowerShell. NSA, CISA, and FBI recommend using version 5 or higher.) * Push Powershell logs into a security information and event management (SIEM) tool. * Monitor for suspicious behavior and commands. Regularly evaluate and update blocklists and allowlists. * Use an antivirus program, which may stop malicious code execution that cyber actors attempt to execute via PowerShell. * Remove PowerShell if it is not necessary for operations. * Restrict which commands can be used.    Windows Command Shell  * Restrict use to administrator, developer, or power user systems. Consider its use suspicious and investigate, especially if average users run scripts. * Investigate scripts running out of cycle from patching or other administrator functions if scripts are not commonly used on a system, but enabled. * Monitor for and investigate other unusual or suspicious scripting behavior.    Unix  * Use application controls to prevent execution. * Monitor for and investigate unusual scripting behavior. Use of the Unix shell may be common on administrator, developer, or power user systems. In this scenario, normal users running scripts should be considered suspicious. * If scripts are not commonly used on a system, but enabled, scripts running out of cycle from patching or other administrator functions should be considered suspicious.    Python  * Audit inventory systems for unauthorized Python installations. * Blocklist Python where not required. * Prevent users from installing Python where not required.    JavaScript  * Turn off or restrict access to unneeded scripting components. * Blocklist scripting where appropriate. * For malicious code served up through ads, adblockers can help prevent that code from executing.    Network Device Command Line Interface (CLI)  * Use TACACS\\+ to keep control over which commands administrators are permitted to use through the configuration of authentication and command authorization. * Use an authentication, authorization, and accounting (AAA) systems to limit actions administrators can perform and provide a history of user actions to detect unauthorized use and abuse. * Ensure least privilege principles are applied to user accounts and groups. | Harden:  * Platform Hardening \\[  [D3\\-PH](https://d3fend.mitre.org/technique/d3f:PlatformHardening)   ]    Detect:  * Process Analysis   \t+ Script Execution Analysis \\[ \t [D3\\-SEA](https://d3fend.mitre.org/technique/d3f:ScriptExecutionAnalysis)  \t ]    Isolate:  * Execution Isolation   \t+ Executable Allowlisting \\[ \t [D3\\-EAL](https://d3fend.mitre.org/technique/d3f:ExecutableAllowlisting)  \t ] |\n| Scheduled Task/Job \\[  [T1053](https://attack.mitre.org/versions/v9/techniques/T1053)   ]  * Cron \\[  [T1053\\.003](https://attack.mitre.org/versions/v9/techniques/T1053/003)   ] * Scheduled Task \\[  [T1053\\.005](https://attack.mitre.org/versions/v9/techniques/T1053/005)   ] | Chinese state\\-sponsored cyber actors have been observed using Cobalt Strike, webshells, or command line interface tools, such as  `schtask`   or  `crontab`   to create and schedule tasks that enumerate victim devices and networks.      **Note:**   this technique also applies to Persistence \\[  [TA0003](https://attack.mitre.org/versions/v9/tactics/TA0003)   ] and Privilege Escalation \\[  [TA0004](https://attack.mitre.org/versions/v9/tactics/TA0004)   ]. | •    Monitor scheduled task creation from common utilities using command\\-line invocation and compare for any changes that do not correlate with known software, patch cycles, or other administrative activity.     •    Configure event logging for scheduled task creation and monitor process execution from  `svchost.exe`   (Windows 10\\) and Windows Task Scheduler (Older version of Windows) to look for changes in  `%systemroot%\\System32\\Tasks`   that do not correlate with known software, patch cycles, or other administrative activity. Additionally monitor for any scheduled tasks created via command line utilities—such as PowerShell or Windows Management Instrumentation (WMI)—that do not conform to typical administrator or user actions. | Detect:  * Platform Monitoring \t+ Operating System Monitoring \\[ \t [D3\\-OSM](https://d3fend.mitre.org/technique/d3f:OperatingSystemMonitoring)  \t ] \t\t- Scheduled Job Analysis \\[ \t\t [D3\\-SJA](https://d3fend.mitre.org/technique/d3f:ScheduledJobAnalysis)  \t\t ] \t\t- System Daemon Monitoring \\[ \t\t [D3\\-SDM](https://d3fend.mitre.org/technique/d3f:SystemDaemonMonitoring)  \t\t ] \t\t- System File Analysis \\[ \t\t [D3\\-SFA](https://d3fend.mitre.org/technique/d3f:SystemFileAnalysis)  \t\t ]    Isolate:  * Execution Isolation \t+ Executable Allowlisting \\[ \t [D3\\-EAL](https://d3fend.mitre.org/technique/d3f:ExecutableAllowlisting)  \t ] |\n| User Execution \\[  [T1204](https://attack.mitre.org/versions/v9/techniques/T1204)   ]  * Malicious Link \\[  [T1204\\.001](https://attack.mitre.org/versions/v9/techniques/T1204/001)   ] * Malicious File \\[  [T1204\\.002](https://attack.mitre.org/versions/v9/techniques/T1204/002)   ] | Chinese state\\-sponsored cyber actors have been observed conducting spearphishing campaigns that encourage engagement from the target audience. These emails may contain a malicious link or file that provide the cyber actor access to the victim’s device after the user clicks on the malicious link or opens the attachment. | * Use an antivirus program, which may stop malicious code execution that cyber actors convince users to attempt to execute. * Prevent unauthorized execution by disabling macro scripts from Microsoft Office files transmitted via email. Consider using Office Viewer software to open Microsoft Office files transmitted via email instead of full Microsoft Office suite applications. * Use a domain reputation service to detect and block suspicious or malicious domains. * Determine if certain categories of websites are necessary for business operations and consider blocking access if activity cannot be monitored well or if it poses a significant risk. * Ensure all browsers and plugins are kept up to date. * Use modern browsers with security features turned on. * Use browser and application sandboxes or remote virtual environments to mitigate browser or other application exploitation. | Detect:  * File Analysis \t+ Dynamic Analysis \\[ \t [D3\\-DA](https://d3fend.mitre.org/technique/d3f:DynamicAnalysis)  \t ] \t+ File Content Rules \\[ \t [D3\\-FCR](https://d3fend.mitre.org/technique/d3f:FileContentRules)  \t ] * Identifier Analysis \t+ Homoglyph Detection \\[ \t [D3\\-HD](https://d3fend.mitre.org/technique/d3f:HomoglyphDetection)  \t ] \t+ URL Analysis \\[ \t [D3\\-UA](https://d3fend.mitre.org/technique/d3f:URLAnalysis)  \t ] * Network Traffic Analysis \t+ DNS Traffic Analysis \\[ \t [D3\\-DNSTA](https://d3fend.mitre.org/technique/d3f:DNSTrafficAnalysis)  \t ]    Isolate:  * Execution Isolation \t+ Hardware\\-based Process Isolation \\[ \t [D3\\-HBPI](https://d3fend.mitre.org/technique/d3f:Hardware-basedProcessIsolation)  \t ] \t+ Executable Allowlisting \\[ \t [D3\\-EAL](https://d3fend.mitre.org/technique/d3f:ExecutableAllowlisting)  \t ] * Network Isolation \t+ DNS Denylisting \\[ \t [D3\\-DNSDL](https://d3fend.mitre.org/technique/d3f:DNSDenylisting)  \t ] \t+ Outbound Traffic Filtering \\[ \t [D3\\-OTF](https://d3fend.mitre.org/technique/d3f:OutboundTrafficFiltering)  \t ] |\n\n\n### Tactics:\n *Persistence* \n \\[\n [TA0003](https://attack.mitre.org/versions/v9/tactics/TA0003) \n ]\n\n\n\n*Table V: Chinese state\\-sponsored cyber actors’ Persistence TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Hijack Execution Flow \\[  [T1574](https://attack.mitre.org/versions/v9/techniques/T1574)   ]:  * DLL Search Order Hijacking \\[  [T1574\\.001](https://attack.mitre.org/versions/v9/techniques/T1574/001)   ] | Chinese state\\-sponsored cyber actors have been observed using benign executables which used Dynamic Link Library (DLL) load\\-order hijacking to activate the malware installation process.    **Note:**   this technique also applies to Privilege Escalation \\[  [TA0004](https://attack.mitre.org/versions/v9/tactics/TA0004)   ] and Defense Evasion \\[  [TA0005](https://attack.mitre.org/versions/v9/tactics/TA0005)   ]. | * Disallow loading of remote DLLs. * Enable safe DLL search mode. * Implement tools for detecting search order hijacking opportunities. * Use application allowlisting to block unknown DLLs. * Monitor the file system for created, moved, and renamed DLLs. * Monitor for changes in system DLLs not associated with updates or patches. * Monitor DLLs loaded by processes (e.g., legitimate name, but abnormal path). | Detect:  * Platform Monitoring \t+ Operating System Monitoring \t\t- Service Binary Verification \\[ \t\t [D3\\-SBV](https://d3fend.mitre.org/technique/d3f:ServiceBinaryVerification)  \t\t ] * Process Analysis \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ]    Isolate:  * Execution Isolation \t+ Executable Allowlisting \\[ \t [D3\\-EAL](https://d3fend.mitre.org/technique/d3f:ExecutableAllowlisting)  \t ] |\n| Modify Authentication Process \\[  [T1556](https://attack.mitre.org/versions/v9/techniques/T1556)   ]  * Domain Controller Authentication \\[  [T1556\\.001](https://attack.mitre.org/versions/v9/techniques/T1556/001)   ] | Chinese state\\-sponsored cyber actors were observed creating a new sign\\-in policy to bypass MFA requirements to maintain access to the victim network.     Note: this technique also applies to Defense Evasion \\[  [TA0005](https://attack.mitre.org/versions/v9/tactics/TA0005)   ] and Credential Access \\[  [TA0006](https://attack.mitre.org/versions/v9/tactics/TA0006)   ]. | * Monitor for policy changes to authentication mechanisms used by the domain controller. * Monitor for modifications to functions exported from authentication DLLs (such as  `cryptdll.dll`   and  `samsrv.dll`   ). * Configure robust, consistent account activity audit policies across the enterprise and with externally accessible services. * Look for suspicious account behavior across systems that share accounts, either user, admin, or service accounts (for example, one account logged into multiple systems simultaneously, multiple accounts logged into the same machine simultaneously, accounts logged in at odd times or outside of business hours). * Correlate other security systems with login information (e.g., a user has an active login session but has not entered the building or does not have VPN access). * Monitor for new, unfamiliar DLL files written to a domain controller and/or local computer. Monitor for and correlate changes to Registry entries. | Detect:  * Process Analysis \\[  [D3\\-PA](https://d3fend.mitre.org/technique/d3f:ProcessAnalysis)   ] * User Behavior Analysis \t+ Authentication Event Thresholding \\[ \t [D3\\-ANET](https://d3fend.mitre.org/technique/d3f:AuthenticationEventThresholding)  \t ] \t+ User Geolocation Logon Pattern Analysis \\[ \t [D3\\-UGLPA](https://d3fend.mitre.org/technique/d3f:UserGeolocationLogonPatternAnalysis)  \t ] |\n| Server Software Component \\[  [T1505](https://attack.mitre.org/versions/v9/techniques/T1505)   ]:  * Web Shell \\[  [T1505\\.003](https://attack.mitre.org/versions/v9/techniques/T1505/003)   ] | Chinese state\\-sponsored cyber actors have been observed planting web shells on exploited servers and using them to provide the cyber actors with access to the victim networks. | * Use Intrusion Detection Systems (IDS) to monitor for and identify China Chopper traffic using IDS signatures. * Monitor and search for predictable China Chopper shell syntax to identify infected files on hosts. * Perform integrity checks on critical servers to identify and investigate unexpected changes. * Have application developers sign their code using digital signatures to verify their identity. * Identify and remediate web application vulnerabilities or configuration weaknesses. Employ regular updates to applications and host operating systems. * Implement a least\\-privilege policy on web servers to reduce adversaries’ ability to escalate privileges or pivot laterally to other hosts and control creation and execution of files in particular directories. * If not already present, consider deploying a DMZ between web\\-facing systems and the corporate network. Limiting the interaction and logging traffic between the two provides a method to identify possible malicious activity. * Ensure secure configuration of web servers. All unnecessary services and ports should be disabled or blocked. Access to necessary services and ports should be restricted, where feasible. This can include allowlisting or blocking external access to administration panels and not using default login credentials. * Use a reverse proxy or alternative service, such as mod\\_security, to restrict accessible URL paths to known legitimate ones. * Establish, and backup offline, a “known good” version of the relevant server and a regular change management policy to enable monitoring for changes to servable content with a file integrity system. * Employ user input validation to restrict exploitation of vulnerabilities. * Conduct regular system and application vulnerability scans to establish areas of risk. While this method does not protect against zero\\-day exploits, it will highlight possible areas of concern. * Deploy a web application firewall and conduct regular virus signature checks, application fuzzing, code reviews, and server network analysis. | Detect:  * Network Traffic Analysis \t+ Client\\-server Payload Profiling \\[ \t [D3\\-CSPP](https://d3fend.mitre.org/technique/d3f:Client-serverPayloadProfiling)  \t ] \t+ Per Host Download\\-Upload Ratio Analysis \\[ \t [D3\\-PHDURA](https://d3fend.mitre.org/technique/d3f:PerHostDownload-UploadRatioAnalysis)  \t ] * Process Analysis \t+ Process Spawn Analysis \t\t- Process Lineage Analysis \\[ \t\t [D3\\-PLA](https://d3fend.mitre.org/technique/d3f:ProcessLineageAnalysis)  \t\t ]    Isolate:  * Network Isolation \t+ Inbound Traffic Filtering \\[ \t [D3\\-ITF](https://d3fend.mitre.org/technique/d3f:InboundTrafficFiltering)  \t ] |\n| Create or Modify System Process \\[  [T1543](https://attack.mitre.org/versions/v9/techniques/T1543)   ]:  * Windows Service \\[  [T1543\\.003](https://attack.mitre.org/versions/v9/techniques/T1543/003)   ] | Chinese state\\-sponsored cyber actors have been observed executing malware shellcode and batch files to establish new services to enable persistence.    **Note:**   this technique also applies to Privilege Escalation \\[  [TA0004](https://attack.mitre.org/versions/v9/tactics/TA0004)   ]. | * Only allow authorized administrators to make service changes and modify service configurations. * Monitor processes and command\\-line arguments for actions that could create or modify services, especially if such modifications are unusual in your environment. * Monitor WMI and PowerShell for service modifications. | Detect:  * Process Analysis \t+ Process Spawn Analysis \\[ \t [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ] |\n\n\n### Tactics:\n *Privilege Escalation* \n \\[\n [TA0004](https://attack.mitre.org/versions/v9/tactics/TA0004) \n ]\n\n\n\n*Table VI: Chinese state\\-sponsored cyber actors’ Privilege Escalation TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Domain Policy Modification \\[  [T1484](https://attack.mitre.org/versions/v9/techniques/T1484)   ]  * Group Policy Modification \\[  [T1484\\.001](https://attack.mitre.org/versions/v9/techniques/T1484/001)   ] | Chinese state\\-sponsored cyber actors have also been observed modifying group policies for password exploitation.    **Note:**   this technique also applies to Defense Evasion \\[  [TA0005](https://attack.mitre.org/versions/v9/tactics/TA0005)   ]. | * Identify and correct Group Policy Object (GPO) permissions abuse opportunities (e.g., GPO modification privileges) using auditing tools. * Monitor directory service changes using Windows event logs to detect GPO modifications. Several events may be logged for such GPO modifications. * Consider implementing WMI and security filtering to further tailor which users and computers a GPO will apply to. | Detect:  * Network Traffic Analysis \t+ Administrative Network Activity Analysis \\[ \t [D3\\-ANAA](https://d3fend.mitre.org/technique/d3f:AdministrativeNetworkActivityAnalysis)  \t ] * Platform Monitoring \t+ Operating System Monitoring \t\t- System File Analysis \\[ \t\t [D3\\-SFA](https://d3fend.mitre.org/technique/d3f:SystemFileAnalysis)  \t\t ] |\n| Process Injection \\[  [T1055](https://attack.mitre.org/versions/v9/techniques/T1055)   ]:  * Dynamic Link Library Injection \\[  [T1055\\.001](https://attack.mitre.org/versions/v9/techniques/T1055/001)   ] * Portable Executable Injection \\[  [T1055\\.002](https://attack.mitre.org/versions/v9/techniques/T1055/002)   ] | Chinese state\\-sponsored cyber actors have been observed:  * Injecting into the  `rundll32.exe`   process to hide usage of Mimikatz, as well as injecting into a running legitimate  `explorer.exe`   process for lateral movement. * Using shellcode that injects implants into newly created instances of the Service Host process (  `svchost`   )   **Note:**   this technique also applies to Defense Evasion \\[  [TA0005](https://attack.mitre.org/versions/v9/tactics/TA0005)   ]. | * Use endpoint protection software to block process injection based on behavior of the injection process. * Monitor DLL/Portable Executable (PE) file events, specifically creation of these binary files as well as the loading of DLLs into processes. Look for DLLs that are not recognized or not normally loaded into a process. * Monitor for suspicious sequences of Windows API calls such as  `CreateRemoteThread`   ,  `VirtualAllocEx`   , or  `WriteProcessMemory`   and analyze processes for unexpected or atypical behavior such as opening network connections or reading files. * To minimize the probable impact of a threat actor using Mimikatz, always limit administrative privileges to only users who actually need it; upgrade Windows to at least version 8\\.1 or 10; run Local Security Authority Subsystem Service (LSASS) in protected mode on Windows 8\\.1 and higher; harden the local security authority (LSA) to prevent code injection. | * Execution Isolation \t+ Hardware\\-based Process Isolation \\[ \t [D3\\-HBPI](https://d3fend.mitre.org/technique/d3f:Hardware-basedProcessIsolation)  \t ] \t+ Mandatory Access Control \\[ \t [D3\\-MAC](https://d3fend.mitre.org/technique/d3f:MandatoryAccessControl)  \t ] |\n\n\n### Tactics:\n *Defense Evasion* \n \\[\n [TA0005](https://attack.mitre.org/versions/v9/tactics/TA0005) \n ]\n\n\n\n*Table VII: Chinese state\\-sponsored cyber actors’ Defensive Evasion TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Deobfuscate/Decode Files or Information \\[  [T1140](https://attack.mitre.org/versions/v9/techniques/T1140)   ] | Chinese state\\-sponsored cyber actors were observed using the 7\\-Zip utility to unzip imported tools and malware files onto the victim device. | * Monitor the execution file paths and command\\-line arguments for common archive file applications and extensions, such as those for Zip and RAR archive tools, and correlate with other suspicious behavior to reduce false positives from normal user and administrator behavior. * Consider blocking, disabling, or monitoring use of 7\\-Zip. | Detect:  * Process Analysis \t+ Process Spawn Analysis \\[ \t [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ]    Isolate:  * Execution Isolation \t+ Executable Denylisting \\[ \t [D3\\-EDL](https://d3fend.mitre.org/technique/d3f:ExecutableDenylisting)  \t ] |\n| Hide Artifacts \\[  [T1564](https://attack.mitre.org/versions/v9/techniques/T1564)   ] | Chinese state\\-sponsored cyber actors were observed using benign executables which used DLL load\\-order hijacking to activate the malware installation process. | * Monitor files, processes, and command\\-line arguments for actions indicative of hidden artifacts, such as executables using DLL load\\-order hijacking that can activate malware. * Monitor event and authentication logs for records of hidden artifacts being used. * Monitor the file system and shell commands for hidden attribute usage. | Detect:  * Process Analysis \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ]    Isolate:  * Execution Isolation \t+ Executable Allowlisting \\[ \t [D3\\-EAL](https://d3fend.mitre.org/technique/d3f:ExecutableAllowlisting)  \t ] |\n| Indicator Removal from Host \\[  [T1070](https://attack.mitre.org/versions/v9/techniques/T1070)   ] | Chinese state\\-sponsored cyber actors have been observed deleting files using  `rm`   or  `del`   commands.     Several files that the cyber actors target would be timestomped, in order to show different times compared to when those files were created/used. | * Make the environment variables associated with command history read only to ensure that the history is preserved. * Recognize timestomping by monitoring the contents of important directories and the attributes of the files. * Prevent users from deleting or writing to certain files to stop adversaries from maliciously altering their  `~/.bash_history`   or  `ConsoleHost_history.txt`   files. * Monitor for command\\-line deletion functions to correlate with binaries or other files that an adversary may create and later remove. Monitor for known deletion and secure deletion tools that are not already on systems within an enterprise network that an adversary could introduce. * Monitor and record file access requests and file handles. An original file handle can be correlated to a compromise and inconsistencies between file timestamps and previous handles opened to them can be a detection rule. | Detect:  * Platform Monitoring \t+ Operating System Monitoring \t\t- System File Analysis \\[ \t\t [D3\\-SFA](https://d3fend.mitre.org/technique/d3f:SystemFileAnalysis)  \t\t ] * Process Analysis \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ]    Isolate:  * Execution Isolation \t+ Executable Allowlisting \\[ \t [D3\\-EAL](https://d3fend.mitre.org/technique/d3f:ExecutableAllowlisting)  \t ] |\n| Obfuscated Files or Information \\[  [T1027](https://attack.mitre.org/versions/v9/techniques/T1027)   ] | Chinese state\\-sponsored cyber actors were observed Base64 encoding files and command strings to evade security measures. | Consider utilizing the Antimalware Scan Interface (AMSI) on Windows 10 to analyze commands after being processed/interpreted. | Detect:  * Process Analysis \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ] |\n| Signed Binary Proxy Execution \\[  [T1218](https://attack.mitre.org/versions/v9/techniques/T1218)   ]  * `Mshta`   \\[  [T1218\\.005](https://attack.mitre.org/versions/v9/techniques/T1218/005)   ] * `Rundll32`   \\[  [T1218\\.011](https://attack.mitre.org/versions/v9/techniques/T1218/011)   ] | Chinese state\\-sponsored cyber actors were observed using Microsoft signed binaries, such as  `Rundll32`   , as a proxy to execute malicious payloads. | Monitor processes for the execution of known proxy binaries (e.g., r  `undll32.exe`   ) and look for anomalous activity that does not follow historically good arguments and loaded DLLs associated with the invocation of the binary. | Detect:  * Process Analysis   \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ] \t+ Process Spawn Analysis \\[ \t [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ] |\n\n\n### Tactics:\n *Credential Access* \n \\[\n [TA0006](https://attack.mitre.org/versions/v9/tactics/TA0006) \n ]\n\n\n\n*Table VIII: Chinese state\\-sponsored cyber actors’ Credential Access TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Exploitation for Credential Access \\[  [T1212](https://attack.mitre.org/versions/v9/techniques/T1212)   ] | Chinese state\\-sponsored cyber actors have been observed exploiting Pulse Secure VPN appliances to view and extract valid user credentials and network information from the servers. | * Update and patch software regularly. * Use cyber threat intelligence and open\\-source reporting to determine vulnerabilities that threat actors may be actively targeting and exploiting; patch those vulnerabilities immediately. | Harden:  * Platform Hardening   \t+ Software Update \\[ \t [D3\\-SU](https://d3fend.mitre.org/technique/d3f:SoftwareUpdate)  \t ] * Credential Hardening   \t+ Multi\\-factor Authentication \\[ \t [D3\\-MFA](https://d3fend.mitre.org/technique/d3f:Multi-factorAuthentication)  \t ] |\n| OS Credential Dumping \\[  [T1003](https://attack.mitre.org/versions/v9/techniques/T1003)   ]     •    LSASS Memory \\[  [T1003\\.001](https://attack.mitre.org/versions/v9/techniques/T1003/001)   ]     •    NTDS \\[  [T1003\\.003](https://attack.mitre.org/versions/v9/techniques/T1003/003)   ] | Chinese state\\-sponsored cyber actors were observed targeting the LSASS process or Active directory (  `NDST.DIT)`   for credential dumping. | * Monitor process and command\\-line arguments for program execution that may be indicative of credential dumping, especially attempts to access or copy the  `NDST.DIT`   . * Ensure that local administrator accounts have complex, unique passwords across all systems on the network. * Limit credential overlap across accounts and systems by training users and administrators not to use the same passwords for multiple accounts. * Consider disabling or restricting NTLM. * Consider disabling  `WDigest`   authentication. * Ensure that domain controllers are backed up and properly secured (e.g., encrypt backups). * Implement Credential Guard to protect the LSA secrets from credential dumping on Windows 10\\. This is not configured by default and requires hardware and firmware system requirements. * Enable Protected Process Light for LSA on Windows 8\\.1 and Windows Server 2012 R2\\. | Harden:  * Credential Hardening \\[  [D3\\-CH](https://d3fend.mitre.org/technique/d3f:CredentialHardening)   ]    Detect:  * Process Analysis   \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ] \t+ System Call Analysis \\[ \t [D3\\-SCA](https://d3fend.mitre.org/technique/d3f:SystemCallAnalysis)  \t ]    Isolate:  * Execution Isolation   \t+ Hardware\\-based Process Isolation \\[ \t [D3\\-HBPI](https://d3fend.mitre.org/technique/d3f:Hardware-basedProcessIsolation)  \t ] \t+ Mandatory Access Control \\[ \t [D3\\-MAC](https://d3fend.mitre.org/technique/d3f:MandatoryAccessControl)  \t ] |\n\n\n### Tactics:\n *Discovery* \n \\[\n [TA0007](https://attack.mitre.org/versions/v9/tactics/TA0007) \n ]\n\n\n\n*Table IX: Chinese state\\-sponsored cyber actors’ Discovery TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| File and Directory Discovery \\[  [T1083](https://attack.mitre.org/versions/v9/techniques/T1083)   ] | Chinese state\\-sponsored cyber actors have been observed using multiple implants with file system enumeration and traversal capabilities. | Monitor processes and command\\-line arguments for actions that could be taken to gather system and network information. WMI and PowerShell should also be monitored. | Detect:  * User Behavior Analysis   \t+ Job Function Access Pattern Analysis \\[ \t [D3\\-JFAPA](https://d3fend.mitre.org/technique/d3f:JobFunctionAccessPatternAnalysis)  \t ] * Process Analysis   \t+ Database Query String Analysis \\[ \t [D3\\-DQSA](https://d3fend.mitre.org/technique/d3f:DatabaseQueryStringAnalysis)  \t ] \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ] \t+ Process Spawn Analysis \\[ \t [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ] |\n| Permission Group Discovery \\[  [T1069](https://attack.mitre.org/versions/v9/techniques/T1069)   ] | Chinese state\\-sponsored cyber actors have been observed using commands, including  `net group`   and  `net localgroup`   , to enumerate the different user groups on the target network. | Monitor processes and command\\-line arguments for actions that could be taken to gather system and network information. Remote access tools with built\\-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as Windows Management Instrumentation and PowerShell. | Detect:  * Process Analysis * Process Spawn Analysis \\[  [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)   ]   \t+ System Call Analysis \\[ \t [D3\\-SCA](https://d3fend.mitre.org/technique/d3f:SystemCallAnalysis)  \t ] * User Behavior Analysis \\[  [D3\\-UBA](https://d3fend.mitre.org/technique/d3f:UserBehaviorAnalysis)   ] |\n| Process Discovery \\[  [T1057](https://attack.mitre.org/versions/v9/techniques/T1057)   ] | Chinese state\\-sponsored cyber actors have been observed using commands, including  `tasklist`   ,  `jobs`   ,  `ps`   , or  `taskmgr`   , to reveal the running processes on victim devices. | Normal, benign system and network events that look like process discovery may be uncommon, depending on the environment and how they are used. Monitor processes and command\\-line arguments for actions that could be taken to gather system and network information. Remote access tools with built\\-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as Windows Management Instrumentation and PowerShell. | Detect:  * Process Analysis   \t+ Process Spawn Analysis \\[ \t [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ] \t+ System Call Analysis \\[ \t [D3\\-SCA](https://d3fend.mitre.org/technique/d3f:SystemCallAnalysis)  \t ] * User Behavior Analysis \\[  [D3\\-UBA](https://d3fend.mitre.org/technique/d3f:UserBehaviorAnalysis)   ] |\n| Network Service Scanning \\[  [T1046](https://attack.mitre.org/versions/v9/techniques/T1046)   ] | Chinese state\\-sponsored cyber actors have been observed using  `Nbtscan`   and  `nmap`   to scan and enumerate target network information. | •    Ensure that unnecessary ports and services are closed to prevent discovery and potential exploitation.     •    Use network intrusion detection and prevention systems to detect and prevent remote service scans such as  `Nbtscan`   or  `nmap`   .     •    Ensure proper network segmentation is followed to protect critical servers and devices to help mitigate potential exploitation. | Detect:  * Network Traffic Analysis   \t+ Connection Attempt Analysis \\[ \t [D3\\-CAA](https://d3fend.mitre.org/technique/d3f:ConnectionAttemptAnalysis)  \t ]    Isolate:  * Network Isolation   \t+ Inbound Traffic Filtering \\[ \t [D3\\-ITF](https://d3fend.mitre.org/technique/d3f:InboundTrafficFiltering)  \t ] |\n| Remote System Discovery \\[  [T1018](https://attack.mitre.org/versions/v9/techniques/T1018)   ] | Chinese state\\-sponsored cyber actors have been observed using Base\\-64 encoded commands, including  `ping`   ,  `net group`   , and  `net user`   to enumerate target network information. | Monitor for processes that can be used to discover remote systems, such as  `ping.exe`   and  `tracert.exe`   , especially when executed in quick succession. | Detect:  * Process Analysis   \t+ Process Spawn Analysis \\[ \t [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ] * User Behavior Analysis   \t+ Job Function Access Pattern Analysis \\[ \t [D3\\-JFAPA](https://d3fend.mitre.org/technique/d3f:JobFunctionAccessPatternAnalysis)  \t ] |\n\n\n### Tactics:\n *Lateral Movement* \n \\[\n [TA0008](https://attack.mitre.org/versions/v9/tactics/TA0008) \n ]\n\n\n\n*Table X: Chinese state\\-sponsored cyber actors’ Lateral Movement TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Exploitation of Remote Services \\[  [T1210](https://attack.mitre.org/versions/v9/techniques/T1210)   ] | Chinese state\\-sponsored cyber actors used valid accounts to log into a service specifically designed to accept remote connections, such as telnet, SSH, RDP, and Virtual Network Computing (VNC). The actor may then perform actions as the logged\\-on user.     Chinese state\\-sponsored cyber actors also used on\\-premises Identity and Access Management (IdAM) and federation services in hybrid cloud environments in order to pivot to cloud resources. | Chinese state\\-sponsored cyber actors used valid accounts to log into a service specifically designed to accept remote connections, such as telnet, SSH, RDP, and Virtual Network Computing (VNC). The actor may then perform actions as the logged\\-on user.     Chinese state\\-sponsored cyber actors also used on\\-premises Identity and Access Management (IdAM) and federation services in hybrid cloud environments in order to pivot to cloud resources.  * Disable or remove unnecessary services. * Minimize permissions and access for service accounts. * Perform vulnerability scanning and update software regularly. * Use threat intelligence and open\\-source exploitation databases to determine services that are targets for exploitation. | Detect:  * Network Traffic Analysis   \t+ Remote Terminal Session Detection \\[ \t [D3\\-RTSD](https://d3fend.mitre.org/technique/d3f:RemoteTerminalSessionDetection)  \t ] * User Behavior Analysis \\[  [D3\\-UBA](https://d3fend.mitre.org/technique/d3f:UserBehaviorAnalysis)   ]    Isolate:  * Execution Isolation   \t+ Mandatory Access Control \\[ \t [D3\\-MAC](https://d3fend.mitre.org/technique/d3f:MandatoryAccessControl)  \t ] |\n\n\n### Tactics:\n *Collection* \n \\[\n [TA0009](https://attack.mitre.org/versions/v9/tactics/TA0009) \n ]\n\n\n\n*Table XI: Chinese state\\-sponsored cyber actors’ Collection TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Archive Collected Data \\[  [T1560](https://attack.mitre.org/versions/v9/techniques/T1560)   ] | Chinese state\\-sponsored cyber actors used compression and encryption of exfiltration files into RAR archives, and subsequently utilizing cloud storage services for storage. | * Scan systems to identify unauthorized archival utilities or methods unusual for the environment. * Monitor command\\-line arguments for known archival utilities that are not common in the organization's environment. | Detect:  * Process Analysis   \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ] \t+ Process Spawn Analysis \\[ \t [D3\\-PSA](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)  \t ]    Isolate:  * Execution Isolation   \t+ Executable Denylisting \\[ \t [D3\\-EDL](https://d3fend.mitre.org/technique/d3f:ExecutableDenylisting)  \t ] |\n| Clipboard Data \\[  [T1115](https://attack.mitre.org/versions/v9/techniques/T1115)   ] | Chinese state\\-sponsored cyber actors used RDP and execute  `rdpclip.exe`   to exfiltrate information from the clipboard. | * Access to the clipboard is a legitimate function of many applications on an operating system. If an organization chooses to monitor for this behavior, then the data will likely need to be correlated against other suspicious or non\\-user\\-driven activity (e.g. excessive use of  `pbcopy/pbpaste`   (Linux) or  `clip.exe`   (Windows) run by general users through command line). * If possible, disable use of RDP and other file sharing protocols to minimize a malicious actor's ability to exfiltrate data. | Detect:  * Network Traffic Analysis   \t+ Remote Terminal Session Detection  \\[ \t [D3\\-RTSD](https://d3fend.mitre.org/technique/d3f:RemoteTerminalSessionDetection)  \t ]    Isolate:  * Network Isolation   \t+ Inbound Traffic Filtering \\[ \t [D3\\-ITF](https://d3fend.mitre.org/technique/d3f:InboundTrafficFiltering)  \t ] \t+ Outbound Traffic Filtering \\[ \t [D3\\-OTF](https://d3fend.mitre.org/technique/d3f:OutboundTrafficFiltering)  \t ] |\n| Data Staged \\[  [T1074](https://attack.mitre.org/versions/v9/techniques/T1074)   ] | Chinese state\\-sponsored cyber actors have been observed using the  `mv`   command to export files into a location, like a compromised Microsoft Exchange, IIS, or emplaced webshell prior to compressing and exfiltrating the data from the target network. | Processes that appear to be reading files from disparate locations and writing them to the same directory or file may be an indication of data being staged, especially if they are suspected of performing encryption or compression on the files, such as using 7\\-Zip, RAR, ZIP, or zlib. Monitor publicly writeable directories, central locations, and commonly used staging directories (recycle bin, temp folders, etc.) to regularly check for compressed or encrypted data that may be indicative of staging. | Detect:  * Process Analysis   \t+ File Access Pattern Analysis \\[ \t [D3\\-FAPA](https://d3fend.mitre.org/technique/d3f:FileAccessPatternAnalysis)  \t ] |\n| Email Collection \\[  [T1114](https://attack.mitre.org/versions/v9/techniques/T1114)   ] | Chinese state\\-sponsored cyber actors have been observed using the  `New-MailboxExportReques`   t PowerShell cmdlet to export target email boxes. | * Audit email auto\\-forwarding rules for suspicious or unrecognized rulesets. * Encrypt email using public key cryptography, where feasible. * Use MFA on public\\-facing mail servers. | Harden:  * Credential Hardening   \t+ Multi\\-factor Authentication \\[ \t [D3\\-MFA](https://d3fend.mitre.org/technique/d3f:Multi-factorAuthentication)  \t ] * Message Hardening   \t+ Message Encryption \\[ \t [D3\\-MENCR](https://d3fend.mitre.org/technique/d3f:MessageEncryption)  \t ]    Detect:  * Process Analysis \\[  [D3\\-PA](https://d3fend.mitre.org/technique/d3f:ProcessAnalysis)   ] |\n\n\n### Tactics:\n *Command and Control* \n \\[\n [TA0011](https://attack.mitre.org/versions/v9/tactics/TA0011) \n ]\n\n\n\n*Table XII: Chinese state\\-sponsored cyber actors’ Command and Control TTPs with detection and mitigation recommendations* \n\n\n\n\n\n| Threat Actor Technique /     Sub\\-Techniques | Threat Actor Procedure(s) | Detection and Mitigation Recommendations | Defensive Tactics and Techniques |\n| --- | --- | --- | --- |\n| Application Layer Protocol \\[  [T1071](https://attack.mitre.org/versions/v9/techniques/T1071)   ] | Chinese state\\-sponsored cyber actors have been observed:  * Using commercial cloud storage services for command and control. * Using malware implants that use the Dropbox® API for C2 and a downloader that downloads and executes a payload using the Microsoft OneDrive® API. | Use network intrusion detection and prevention systems with network signatures to identify traffic for specific adversary malware. | Detect:  * Network Traffic Analysis   \t+ Client\\-server Payload Profiling \\[ \t [D3\\-CSPP](https://d3fend.mitre.org/technique/d3f:Client-serverPayloadProfiling)  \t ] \t+ File Carving \\[ \t [D3\\-FC](https://d3fend.mitre.org/technique/d3f:FileCarving)  \t ]    Isolate:  * Network Isolation   \t+ DNS Denylisting \\[ \t [D3\\-DNSDL](https://d3fend.mitre.org/technique/d3f:DNSDenylisting)  \t ] |\n| Ingress Tool Transfer \\[  [T1105](https://attack.mitre.org/versions/v9/techniques/T1105)   ] | Chinese state\\-sponsored cyber actors have been observed importing tools from GitHub or infected domains to victim networks. In some instances. Chinese state\\-sponsored cyber actors used the Server Message Block (SMB) protocol to import tools into victim networks. | * Perform ingress traffic analysis to identify transmissions that are outside of normal network behavior. * Do not expose services and protocols (such as File Transfer Protocol \\[FTP]) to the Internet without strong business justification. * Use signature\\-based network intrusion detection and prevention systems to identify adversary malware coming into the network. | Isolate:  * Network Isolation   \t+ Inbound Traffic Filtering \\[ \t [D3\\-ITF](https://d3fend.mitre.org/technique/d3f:InboundTrafficFiltering)  \t ] |\n| Non\\-Standard Port \\[  [T1571](https://attack.mitre.org/versions/v9/techniques/T1571)   ] | Chinese state\\-sponsored cyber actors have been observed using a non\\-standard SSH port to establish covert communication channels with VPS infrastructure. | * Use signature\\-based network intrusion detection and prevention systems to identify adversary malware calling back to C2\\. * Configure firewalls to limit outgoing traffic to only required ports based on the functions of that network segment. * Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port. | Detect:  * Network Traffic Analysis   \t+ Client\\-server Payload Profiling \\[ \t [D3\\-CSPP](https://d3fend.mitre.org/technique/d3f:Client-serverPayloadProfiling)  \t ] \t+ Protocol Metadata Anomaly Detection \\[ \t [D3\\-PMAD](https://d3fend.mitre.org/technique/d3f:ProtocolMetadataAnomalyDetection)  \t ]    Isolate:  * Network Isolation   \t+ Inbound Traffic Filtering \\[ \t [D3\\-ITF](https://d3fend.mitre.org/technique/d3f:InboundTrafficFiltering)  \t ] \t+ Outbound Traffic Filtering \\[ \t [D3\\-OTF](https://d3fend.mitre.org/technique/d3f:OutboundTrafficFiltering)  \t ] |\n| Protocol Tunneling \\[  [T1572](https://attack.mitre.org/versions/v9/techniques/T1572)   ] | Chinese state\\-sponsored cyber actors have been observed using tools like dog\\-tunnel and  `dns2tcp.exe`   to conceal C2 traffic with existing network activity. | * Monitor systems for connections using ports/protocols commonly associated with tunneling, such as SSH (port 22\\). Also monitor for processes commonly associated with tunneling, such as Plink and the OpenSSH client. * Analyze packet contents to detect application layer protocols that do not follow the expected protocol standards. * Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server) | Detect:  * Network Traffic Analysis   \t+ Protocol Metadata Anomaly Detection \\[ \t [D3\\-PMAD](https://d3fend.mitre.org/technique/d3f:ProtocolMetadataAnomalyDetection)  \t ] |\n| Proxy \\[  [T1090](https://attack.mitre.org/versions/v9/techniques/T1090)   ]:  * Multi\\-Hop Proxy \\[  [T1090\\.003](https://attack.mitre.org/versions/v9/techniques/T1090/003)   ] | Chinese state\\-sponsored cyber actors have been observed using a network of VPSs and small office and home office (SOHO) routers as part of their operational infrastructure to evade detection and host C2 activity. Some of these nodes operate as part of an encrypted proxy service to prevent attribution by concealing their country of origin and TTPs. | Monitor traffic for encrypted communications originating from potentially breached routers to other routers within the organization. Compare the source and destination with the configuration of the device to determine if these channels are authorized VPN connections or other encrypted modes of communication.  * Alert on traffic to known anonymity networks (such as Tor) or known adversary infrastructure that uses this technique. * Use network allow and blocklists to block traffic to known anonymity networks and C2 infrastructure. | Detect:  * Network Traffic Analysis   \t+ Protocol Metadata Anomaly Detection \\[ \t [D3\\-PMAD](https://d3fend.mitre.org/technique/d3f:ProtocolMetadataAnomalyDetection)  \t ] \t+ Relay Pattern Analysis \\[ \t [D3\\-RPA](https://d3fend.mitre.org/technique/d3f:RelayPatternAnalysis)  \t ]    Isolate:  * Network Isolation   \t+ Outbound Traffic Filtering \\[ \t [D3\\-OTF](https://d3fend.mitre.org/technique/d3f:OutboundTrafficFiltering)  \t ] |\n\n\n### Appendix B: MITRE ATT\\&CK Framework\n\n\n\n![]()\n\n\n\n\n*Figure 2: MITRE ATT\\&CK Enterprise tactics and techniques used by Chinese state\\-sponsored cyber actors (\n [Click here for the downloadable JSON file](https://github.com/nsacyber/chinese-state-sponsored-cyber-operations-observed-ttps) \n .)* \n\n\n\n\n### Contact Information\n\n\n\n\n To report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local FBI field office at\n [www.fbi.gov/contact\\-us/field](http://www.fbi.gov/contact-us/field) \n , or the FBI’s 24/7 Cyber Watch (CyWatch) at (855\\) 292\\-3937 or by e\\-mail at\n [CyWatch@fbi.gov](mailto:CyWatch@fbi.gov) \n . When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact.\n \n\n\n\n To request incident response resources or technical assistance related to these threats, contact CISA at\n [Central@cisa.dhs.gov](mailto:Central@cisa.dhs.gov) \n .\n \n\n\n\n For NSA client requirements or general cybersecurity inquiries, contact the NSA Cybersecurity Requirements Center at 410\\-854\\-4200 or\n [Cybersecurity\\_Requests@nsa.gov.](mailto:Cybersecurity_Requests@nsa.gov) \n\n\n\n\n Media Inquiries / Press Desk:\n   \n\n  \n\n •    NSA Media Relations, 443\\-634\\-0721,\n [MediaRelations@nsa.gov](mailto:MediaRelations@nsa.gov) \n  \n\n  \n\n •    CISA Media Relations, 703\\-235\\-2010,\n [CISAMedia@cisa.dhs.gov](mailto:CISAMedia@cisa.dhs.gov) \n  \n\n  \n\n •    FBI National Press Office, 202\\-324\\-3691,\n [npo@fbi.gov](mailto:npo@fbi.gov) \n\n\n\n\n### References\n\n\n\n\n[\\[1] FireEye: This is Not a Test: APT41 Initiates Global Intrusion Campaign Using Multiple Exploits](https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html) \n\n\n### Revisions\n\n\n\n\n July 19, 2021: Initial Version\n \n\n\n\n\n\n\n\n\n\n\n This product is provided subject to this\n [Notification](/notification \"Follow link\") \n and this\n [Privacy \\& Use](/privacy-policy \"Follow link\") \n policy.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease share your thoughts\n--------------------------\n\n\n\n We recently updated our anonymous\n [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa21-200b) \n ; we’d welcome your feedback.\n \n\n\n\n\n\n\n\n\n\n\n\n\nRelated Advisories\n------------------\n\n\n\n\n\n\n\n\n\n\n Jul 11, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-193A\n \n\n### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a)\n\n\n\n\n\n\n\n\n\n\n\n Jul 08, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-190A\n \n\n### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a)\n\n\n\n\n\n\n\n\n\n\n\n May 10, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-131A\n \n\n### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a)\n\n\n\n\n\n\n\n\n\n\n\n Apr 18, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-109A\n \n\n### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Return to top](#) \n\n\n\n\n* [Topics](/topics)\n* [Spotlight](/spotlight)\n* [Resources \\& Tools](/resources-tools)\n* [News \\& Events](/news-events)\n* [Careers](/careers)\n* [About](/about)\n\n\n\n\n\n\n\n\n[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")\n\n\n* [Facebook](https://www.facebook.com/CISA)\n* [Twitter](https://twitter.com/CISAgov)\n* [LinkedIn](https://www.linkedin.com/company/cybersecurity-and-infrastructure-security-agency)\n* [YouTube](https://www.youtube.com/@cisagov)\n* [Instagram](https://www.instagram.com/cisagov)\n* [RSS](/subscribe-updates-cisa)\n\n\n\n\n CISA Central\n \n[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) \n[SayCISA@cisa.gov](mailto:SayCISA@cisa.gov) \n\n\n\n\n\n\n\n\n\n\n\n DHS Seal\n \n\n\n CISA.gov\n \n\n An official website of the U.S. Department of Homeland Security\n \n\n\n* [About CISA](/about \"About CISA\")\n* [Budget and Performance](https://www.dhs.gov/performance-financial-reports \"Budget and Performance\")\n* [DHS.gov](https://www.dhs.gov \"Department of Homeland Security\")\n* [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")\n* [FOIA Requests](https://www.dhs.gov/foia \"FOIA Requests\")\n* [No FEAR Act](/no-fear-act \"No FEAR Act Reporting\")\n* [Office of Inspector General](https://www.oig.dhs.gov/ \"Office of Inspector General\")\n* [Privacy Policy](/privacy-policy \"Privacy Policy\")\n* [Subscribe](https://public.govdelivery.com/accounts/USDHSCISA/subscriber/new?topic_id=USDHSCISA_138 \"Subscribe to Email Updates\")\n* [The White House](https://www.whitehouse.gov/ \"The White House\")\n* [USA.gov](https://www.usa.gov/ \"USA.gov\")\n* [Website Feedback](/forms/feedback \"Website Feedback\")\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "cves": ["CVE-2019-11510", "CVE-2020-5902", "CVE-2019-19781"], "techniques": ["T1078.001", "T1556.001", "T1059.003", "T1055.002", "T1053.005", "T1204.002", "T1003.001", "T1059.007", "T1588.002", "T1204.001", "T1484.001", "T1059.006", "T1505.003", "T1003.003", "T1543.003", "T1218.005", "T1218.011", "T1574.001", "T1059.004", "T1055.001", "T1566.001", "T1053.003", "T1566.002", "T1059.008", "T1078.002", "T1090.003", "T1059.001"], "advisory": "aa21-200b", "title": "Chinese State-Sponsored Cyber Operations: Observed TTPs | CISA", "source": "cybersecurity-advisories", "id": "e0cbf2dcf41badd3cc18650c725da27bba61c775b92f831845ba520604f8a1b0"}