{
  "markdown": "\n\nSummary\n\nThis joint Cybersecurity Advisory (CSA) provides the top Common Vulnerabilities and Exposures (CVEs) used since 2020 by People’s Republic of China (PRC) state-sponsored cyber actors as assessed by the National Security Agency (NSA), Cybersecurity and Infrastructure Security Agency (CISA), and Federal Bureau of Investigation (FBI). PRC state-sponsored cyber actors continue to exploit known vulnerabilities to actively target U.S. and allied networks as well as software and hardware companies to steal intellectual property and develop access into sensitive networks.\nThis joint CSA builds on previous NSA, CISA, and FBI reporting to inform federal and state, local, tribal and territorial (SLTT) government; critical infrastructure, including the Defense Industrial Base Sector; and private sector organizations about notable trends and persistent tactics, techniques, and procedures (TTPs).\nNSA, CISA, and FBI urge U.S. and allied governments, critical infrastructure, and private sector organizations to apply the recommendations listed in the Mitigations section and Appendix A to increase their defensive posture and reduce the threat of compromise from PRC state-sponsored malicious cyber actors.\nFor more information on PRC state-sponsored malicious cyber activity, see CISA’s China Cyber Threat Overview and Advisories webpage, FBI’s Industry Alerts, and NSA’s Cybersecurity Advisories & Guidance. \nDownload the PDF version of this report: pdf, 409 KB\n\nTechnical Details\n\nNSA, CISA, and FBI continue to assess PRC state-sponsored cyber activities as being one of the largest and most dynamic threats to U.S. government and civilian networks. PRC state-sponsored cyber actors continue to target government and critical infrastructure networks with an increasing array of new and adaptive techniques—some of which pose a significant risk to Information Technology Sector organizations (including telecommunications providers), Defense Industrial Base (DIB) Sector organizations, and other critical infrastructure organizations.\nPRC state-sponsored cyber actors continue to exploit known vulnerabilities and use publicly available tools to target networks of interest. NSA, CISA, and FBI assess PRC state-sponsored cyber actors have actively targeted U.S. and allied networks as well as software and hardware companies to steal intellectual property and develop access into sensitive networks. See Table 1 for the top used CVEs.\nTable I: Top CVEs most used by Chinese state-sponsored cyber actors since 2020\n\n\n\n\nVendor\n\n\nCVE\n\n\nVulnerability Type\n\n\n\n\nApache Log4j\n\n\nCVE-2021-44228\n\n\nRemote Code Execution\n\n\n\n\nPulse Connect Secure\n\n\nCVE-2019-11510\n\n\nArbitrary File Read\n\n\n\n\nGitLab CE/EE\n\n\nCVE-2021-22205\n\n\nRemote Code Execution\n\n\n\n\nAtlassian\n\n\nCVE-2022-26134\n\n\nRemote Code Execution\n\n\n\n\nMicrosoft Exchange\n\n\nCVE-2021-26855\n\n\nRemote Code Execution\n\n\n\n\nF5 Big-IP\n\n\nCVE-2020-5902\n\n\nRemote Code Execution\n\n\n\n\nVMware vCenter Server\n\n\nCVE-2021-22005\n\n\nArbitrary File Upload \n\n\n\n\nCitrix ADC\n\n\nCVE-2019-19781\n\n\nPath Traversal\n\n\n\n\nCisco Hyperflex\n\n\nCVE-2021-1497\n\n\nCommand Line Execution\n\n\n\n\nBuffalo WSR\n\n\nCVE-2021-20090\n\n\nRelative Path Traversal\n\n\n\n\nAtlassian Confluence Server and Data Center\n\n\nCVE-2021-26084\n\n\nRemote Code Execution\n\n\n\n\nHikvision Webserver\n\n\nCVE-2021-36260\n\n\nCommand Injection\n\n\n\n\nSitecore XP\n\n\nCVE-2021-42237\n\n\nRemote Code Execution\n\n\n\n\nF5 Big-IP\n\n\nCVE-2022-1388\n\n\nRemote Code Execution\n\n\n\n\nApache\n\n\nCVE-2022-24112\n\n\nAuthentication Bypass by Spoofing\n\n\n\n\nZOHO\n\n\nCVE-2021-40539\n\n\nRemote Code Execution\n\n\n\n\nMicrosoft\n\n\nCVE-2021-26857\n\n\nRemote Code Execution\n\n\n\n\nMicrosoft\n\n\nCVE-2021-26858\n\n\nRemote Code Execution\n\n\n\n\nMicrosoft\n\n\nCVE-2021-27065\n\n\nRemote Code Execution\n\n\n\n\nApache HTTP Server\n\n\nCVE-2021-41773\n\n\nPath Traversal\n\n\n\n\nThese state-sponsored actors continue to use virtual private networks (VPNs) to obfuscate their activities and target web-facing applications to establish initial access. Many of the CVEs indicated in Table 1 allow the actors to surreptitiously gain unauthorized access into sensitive networks, after which they seek to establish persistence and move laterally to other internally connected networks. For additional information on PRC state-sponsored cyber actors targeting network devices, please see People’s Republic of China State-Sponsored Cyber Actors Exploit Network Providers and Devices.\n\nMitigations\n\nNSA, CISA, and FBI urge organizations to apply the recommendations below and those listed in Appendix A.\n\nUpdate and patch systems as soon as possible. Prioritize patching vulnerabilities identified in this CSA and other known exploited vulnerabilities.\nUtilize phishing-resistant multi-factor authentication whenever possible. Require all accounts with password logins to have strong, unique passwords, and change passwords immediately if there are indications that a password may have been compromised. \nBlock obsolete or unused protocols at the network edge. \nUpgrade or replace end-of-life devices.\nMove toward the Zero Trust security model. \nEnable robust logging of Internet-facing systems and monitor the logs for anomalous activity.\n\t \n\nAppendix A\nTable II: Apache CVE-2021-44228\n\n\n\n\nApache CVE-2021-44228 CVSS 3.0: 10 (Critical)\n\n\n\n\nVulnerability Description \nApache Log4j2 2.0-beta9 through 2.15.0 (excluding security releases 2.12.2, 2.12.3, and 2.3.1) JNDI features used in configuration, log messages, and parameters do not protect against malicious actor controlled LDAP and other JNDI related endpoints. A malicious actor who can control log messages or log message parameters could execute arbitrary code loaded from LDAP servers when message lookup substitution is enabled. From log4j 2.15.0, this behavior has been disabled by default. From version 2.16.0 (along with 2.12.2, 2.12.3, and 2.3.1), this functionality has been completely removed. Note that this vulnerability is specific to log4j-core and does not affect log4net, log4cxx, or other Apache Logging Services projects.\n\n\n\n\nRecommended Mitigations \n\nApply patches provided by vendor and perform required system updates. \n\n\n\n\n\nDetection Methods \n\nSee vendor’s Guidance For Preventing, Detecting, and Hunting for Exploitation of the Log4j 2 Vulnerability. \n\n\n\n\n\nVulnerable Technologies and Versions \nThere are numerous vulnerable technologies and versions associated with CVE-2021-44228. For a full list, check https://nvd.nist.gov/vuln/detail/CVE-2021-44228.\n\n\n\n\nTable III: Pulse CVE-2019-11510\n\n\n\n\nPulse CVE-2019-11510 CVSS 3.0: 10 (Critical)\n\n\n\n\nVulnerability Description \nThis vulnerability has been modified since it was last analyzed by NVD. It is awaiting reanalysis, which may result in further changes to the information provided. In Pulse Secure Pulse Connect Secure (PCS) 8.2 before 8.2R12.1, 8.3 before 8.3R7.1, and 9.0 before 9.0R3.4, an unauthenticated remote malicious actor could send a specially crafted URI to perform an arbitrary file reading vulnerability.\n\n\n\n\nRecommended Mitigations \n\nApply patches provided by vendor and perform required system updates. \n\n\n\n\n\nDetection Methods \n\nUse CISA’s “Check Your Pulse” Tool.\n\n\n\n\n\nVulnerable Technologies and Versions \nPulse Connect Secure (PCS) 8.2 before 8.2R12.1, 8.3 before 8.3R7.1, and 9.0 before 9.0R3.4\n\n\n\n\nTable IV: GitLab CVE-2021-22205\n\n\n\n\nGitLab CVE-2021-22205 CVSS 3.0: 10 (Critical)\n\n\n\n\nVulnerability Description \nAn issue has been discovered in GitLab CE/EE affecting all versions starting from 11.9. GitLab was not properly validating image files passed to a file parser, which resulted in a remote command execution.\n\n\n\n\nRecommended Mitigations \n\nUpdate to 12.10.3, 13.9.6, and 13.8.8 for GitLab.\nHotpatch is available via GitLab.\n\n\n\n\n\nDetection Methods \n\nInvestigate logfiles.\nCheck GitLab Workhorse.\n\n\n\n\n\nVulnerable Technologies and Versions \nGitlab CE/EE.\n\n\n\n\nTable V: Atlassian CVE-2022-26134\n\n\n\n\nAtlassian CVE-2022-26134 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nIn affected versions of Confluence Server and Data Center, an OGNL injection vulnerability exists that could allow an unauthenticated malicious actor to execute arbitrary code on a Confluence Server or Data Center instance. The affected versions are from 1.3.0 before 7.4.17, 7.13.0 before 7.13.7, 7.14.0 before 7.14.3, 7.15.0 before 7.15.2, 7.16.0 before 7.16.4, 7.17.0 before 7.17.4, and 7.18.0 before 7.18.1.\n\n\n\n\nRecommended Mitigations  \n\nImmediately block all Internet traffic to and from affected products AND apply the update per vendor instructions.  \n\n\nEnsure Internet-facing servers are up-to-date and have secure compliance practices. \nShort term workaround is provided here. \n\n\n\n\n\nDetection Methods \nN/A\n\n\n\n\nVulnerable Technologies and Versions \nAll supported versions of Confluence Server and Data Center\nConfluence Server and Data Center versions after 1.3.0\n\n\n\n\nTable VI: Microsoft CVE-2021-26855\n\n\n\n\nMicrosoft CVE-2021-26855                                                     CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nMicrosoft has released security updates for Windows Exchange Server. To exploit these vulnerabilities, an authenticated malicious actor could send malicious requests to an affected server. A malicious actor  who successfully exploited these vulnerabilities would execute arbitrary code and compromise the affected systems. If successfully exploited, these vulnerabilities could allow an adversary to obtain access to sensitive information, bypass security restrictions, cause a denial of service conditions, and/or perform unauthorized actions on the affected Exchange server, which could aid in further malicious activity.\n\n\n\n\nRecommended Mitigations \n\nApply the appropriate Microsoft Security Update.\nMicrosoft Exchange Server 2013 Cumulative Update 23 (KB5000871)\nMicrosoft Exchange Server 2016 Cumulative Update 18 (KB5000871)\nMicrosoft Exchange Server 2016 Cumulative Update 19 (KB5000871)\nMicrosoft Exchange Server 2019 Cumulative Update 7 (KB5000871)\nMicrosoft Exchange Server 2019 Cumulative Update 8 (KB5000871)\nRestrict untrusted connections.\n\n\n\n\n\nDetection Methods \n\nAnalyze Exchange product logs for evidence of exploitation.\nScan for known webshells.\n\n\n\n\n\nVulnerable Technologies and Versions \nMicrosoft Exchange 2013, 2016, and 2019.\n\n\n\n\nTable VII: F5 CVE-2020-5902\n\n\n\n\nF5 CVE-2020-5902 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nIn BIG-IP versions 15.0.0-15.1.0.3, 14.1.0-14.1.2.5, 13.1.0-13.1.3.3, 12.1.0-12.1.5.1, and 11.6.1-11.6.5.1, the Traffic Management User Interface (TMUI), also referred to as the Configuration utility, has a Remote Code Execution (RCE) vulnerability in undisclosed pages.\n\n\n\n\nRecommended Mitigations \n\nApply FY BIG-IP Update.\nRestrict access to the configuration utility.\n\n\n\n\n\nDetection Methods \n\nUse F5’s CVE-2020-5902 IoC Detection Tool.\nAdditional detection methods can be found at https://support.f5.com/csp/article/K52145254. \n\n\n\n\n\nVulnerable Technologies and Versions \nF5 Big-IP Access Policy Manager\nF5 Big-IP Advanced Firewall Manager\nF5 Big-IP Advanced Web Application Firewall\nF5 Big-IP Analytics\nF5 Big-IP Application Acceleration Manager\nF5 Big-IP Application Security Manager\nF5 Big-IP Ddos Hybrid Defender\nF5 Big-IP Domain Name System (DNS)\nF5 Big-IP Fraud Protection Service (FPS)\nF5 Big-IP Global Traffic Manager (GTM)\nF5 Big-IP Link Controller\nF5 Networks Big-IP Local Traffic Manager (LTM)\nF5 Big-IP Policy Enforcement Manager (PEM)\nF5 SSL Orchestrator\n\n\n\n\nReferences \nhttps://support.f5.com/csp/article/K00091341 \nhttps://support.f5.com/csp/article/K07051153 \nhttps://support.f5.com/csp/article/K20346072 \nhttps://support.f5.com/csp/article/K31301245 \nhttps://support.f5.com/csp/article/K33023560 \nhttps://support.f5.com/csp/article/K43638305 \nhttps://support.f5.com/csp/article/K52145254 \nhttps://support.f5.com/csp/article/K82518062\n\n\n\n\nTable VIII: VMware CVE-2021-22005\n\n\n\n\nVMware CVE-2021-22005 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nThe vCenter Server contains an arbitrary file upload vulnerability in the Analytics service. A malicious actor with network access to port 443 on vCenter Server may exploit this issue to execute code on vCenter Server by uploading a specially crafted file.\n\n\n\n\nRecommended Mitigations \n\nApply Vendor Updates.\n\n\n\n\n\nDetection Methods \nN/A\n\n\n\n\nVulnerable Technologies and Versions \nVMware Cloud Foundation\nVMware VCenter Server \n\n\n\n\nTable IX: Citrix CVE-2019-19781\n\n\n\n\nCitrix CVE-2019-19781 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nThis vulnerability has been modified since it was last analyzed by NVD. It is awaiting reanalysis, which may result in further changes to the information provided. An issue was discovered in Citrix Application Delivery Controller (ADC) and Gateway 10.5, 11.1, 12.0, 12.1, and 13.0. They allow Directory Traversal.\n\n\n\n\nRecommended Mitigations \n\nApply vendor mitigations.\nUse the CTX269180 - CVE-2019-19781 Verification Tool provided by Citrix.\n\n\n\n\n\nDetection Methods \nN/A\n\n\n\n\nVulnerable Technologies and Versions \nCitrix ADC, Gateway, and SD-WAN WANOP\n\n\n\n\nTable X: Cisco CVE-2021-1497\n\n\n\n\nCisco CVE-2021-1497 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nMultiple vulnerabilities in the web-based management interface of Cisco HyperFlex HX could allow an unauthenticated, remote malicious actor to perform a command injection against an affected device. For more information about these vulnerabilities, see the Technical details section of this advisory.\n\n\n\n\nRecommended Mitigations \n\nApply Cisco software updates.\n\n\n\n\n\nDetection Methods \n\nLook at the Snort Rules provided by Cisco.\n\n\n\n\n\nVulnerable Technologies and Versions \nCisco Hyperflex Hx Data Platform 4.0(2A)\n\n\n\n\nTable XI: Buffalo CVE-2021-20090\n\n\n\n\nBuffalo CVE-2021-20090 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nA path traversal vulnerability in the web interfaces of Buffalo WSR-2533DHPL2 firmware version <= 1.02 and WSR-2533DHP3 firmware version <= 1.24 could allow unauthenticated remote malicious actors to bypass authentication.\n\n\n\n\nRecommended Mitigations \n\nUpdate firmware to latest available version.\n\n \n\n\n\n\nDetection Methods \n\nN/A\n\n\n\n\n\nVulnerable Technologies and Versions \nBuffalo Wsr-2533Dhpl2-Bk Firmware\nBuffalo Wsr-2533Dhp3-Bk Firmware\n\n\n\n\nTable XII: Atlassian CVE-2021-26084\n\n\n\n\nAtlassian CVE-2021-26084 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nIn affected versions of Confluence Server and Data Center, an OGNL injection vulnerability exists that would allow an unauthenticated malicious actor to execute arbitrary code on a Confluence Server or Data Center instance. The affected versions are before version 6.13.23 and from version 6.14.0 before 7.4.11, version 7.5.0 before 7.11.6, and version 7.12.0 before 7.12.5.\n\n\n\n\nRecommended Mitigations \n\nUpdate confluence version to 6.13.23, 7.4.11, 7.11.6, 7.12.5, and 7.13.0.\nAvoid using end-of-life devices.\nUse Intrusion Detection Systems (IDS).\n\n\n\n\n\nDetection Methods \nN/A\n\n\n\n\nVulnerable Technologies and Versions \nAtlassian Confluence\nAtlassian Confluence Server\nAtlassian Data Center\nAtlassian Jira Data Center\n\n\n\n\nTable XIII: Hikvision CVE-2021-36260\n\n\n\n\nHikvision CVE-2021-36260 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nThis vulnerability has been modified since it was last analyzed by NVD. It is awaiting reanalysis, which may result in further changes to the information provided. A command injection vulnerability exists in the web server of some Hikvision products. Due to the insufficient input validation, a malicious actor can exploit the vulnerability to launch a command injection by sending some messages with malicious commands.\n\n\n\n\nRecommended Mitigations \n\nApply the latest firmware updates.\n\n\n\n\n\nDetection Methods \nN/A\n\n\n\n\nVulnerable Technologies and Versions \nVarious Hikvision Firmware to include Ds, Ids, and Ptz \n\n\n\n\nReferences \nhttps://www.cisa.gov/uscert/ncas/current-activity/2021/09/28/rce-vulnerability-hikvision-cameras-cve-2021-36260  \n\n\n\n\nTable XIV: Sitecore CVE-2021-42237\n\n\n\n\nSitecore CVE-2021-42237 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nSitecore XP 7.5 Initial Release to Sitecore XP 8.2 Update-7 is vulnerable to an insecure deserialization attack where it is possible to achieve remote command execution on the machine. No authentication or special configuration is required to exploit this vulnerability.\n\n\n\n\nRecommended Mitigations \n\nUpdate to latest version.\nDelete the Report.ashx file from /sitecore/shell/ClientBin/Reporting/Report.ashx.\n\n\n\n\n\nDetection Methods \n\nN/A\n\n\n\n\n\nVulnerable Technologies and Versions \nSitecore Experience Platform 7.5, 7.5 Update 1, and 7.5 Update 2\nSitecore Experience Platform 8.0, 8.0 Service Pack 1, and 8.0 Update 1-Update 7\nSitecore Experience Platform 8.0 Service Pack 1\nSitecore Experience Platform 8.1, and  Update 1-Update 3\nSitecore Experience Platform 8.2, and Update 1-Update 7\n\n\n\n\nTable XV: F5 CVE-2022-1388\n\n\n\n\nF5 CVE-2022-1388 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nThis vulnerability has been modified since it was last analyzed by NVD. It is awaiting reanalysis, which may result in further changes to the information provided. On F5 BIG-IP 16.1.x versions prior to 16.1.2.2, 15.1.x versions prior to 15.1.5.1, 14.1.x versions prior to 14.1.4.6, 13.1.x versions prior to 13.1.5, and all 12.1.x and 11.6.x versions, undisclosed requests may bypass iControl REST authentication. Note: Software versions which have reached End of Technical Support (EoTS) are not evaluated.\n\n\n\n\nRecommended Mitigations \n\nBlock iControl REST access through the self IP address.\nBlock iControl REST access through the management interface.\nModify the BIG-IP httpd configuration.\n\n\n\n\n\nDetection Methods \nN/A\n\n\n\n\nVulnerable Technologies and Versions \nBig IP versions:\n16.1.0-16.1.2\n15.1.0-15.1.5\n14.1.0-14.1.4\n13.1.0-13.1.4\n12.1.0-12.1.6\n11.6.1-11.6.5\n\n\n\n\nTable XVI: Apache CVE-2022-24112\n\n\n\n\nApache CVE-2022-24112 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nA malicious actor can abuse the batch-requests plugin to send requests to bypass the IP restriction of Admin API. A default configuration of Apache APISIX (with default API key) is vulnerable to remote code execution. When the admin key was changed or the port of Admin API was changed to a port different from the data panel, the impact is lower. But there is still a risk to bypass the IP restriction of Apache APISIX's data panel. There is a check in the batch-requests plugin which overrides the client IP with its real remote IP. But due to a bug in the code, this check can be bypassed.\n\n\n\n\nRecommended Mitigations \n\nIn affected versions of Apache APISIX, you can avoid this risk by explicitly commenting out batch-requests in the conf/config.yaml and conf/config-default.yaml files and restarting Apache APISIX.\n\n\nUpdate to 2.10.4 or 2.12.1.\n\n\n\n\n\nDetection Methods \nN/A\n\n\n\n\nVulnerable Technologies and Versions \nApache APISIX between 1.3 and 2.12.1 (excluding 2.12.1)\nLTS versions of Apache APISIX between 2.10.0 and 2.10.4 \n\n\n\n\nTable XVII: ZOHO CVE-2021-40539\n\n\n\n\nZOHO CVE-2021-40539 CVSS 3.0: 9.8 (Critical)\n\n\n\n\nVulnerability Description \nZoho ManageEngine ADSelfService Plus version 6113 and prior is vulnerable to REST API authentication bypass with resultant remote code execution.\n\n\n\n\nRecommended Mitigations \n\nUpgrade to latest version. \n\n\n\n\n\nDetection Methods \n\nRun ManageEngine’s detection tool.\nCheck for specific files and logs.\n\n\n\n\n\nVulnerable Technologies and Versions \nZoho Corp ManageEngine ADSelfService Plus\n\n\n\n\nTable XVIII: Microsoft CVE-2021-26857\n\n\n\n\nMicrosoft CVE-2021-26857 CVSS 3.0: 7.8 (High)\n\n\n\n\nVulnerability Description \nMicrosoft Exchange Server remote code execution vulnerability. This CVE ID differs from CVE-2021-26412, CVE-2021-26854, CVE-2021-26855, CVE-2021-26858, CVE-2021-27065, and CVE-2021-27078.\n\n\n\n\nRecommended Mitigations \n\nUpdate to support latest version.\nInstall Microsoft security patch.\nUse Microsoft Exchange On-Premises Mitigation Tool.\n\n\n\n\n\nDetection Methods \n\nRun Exchange script: https://github.com/microsoft/CSS-Exchange/tree/main/Security.\nHashes can be found here: https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/#scan-log.\n\n\n\n\n\nVulnerable Technologies and Versions \nMicrosoft Exchange Servers\n\n\n\n\nTable XIX: Microsoft CVE-2021-26858\n\n\n\n\nMicrosoft CVE-2021-26858 CVSS 3.0: 7.8 (High)\n\n\n\n\nVulnerability Description \nMicrosoft Exchange Server remote code execution vulnerability. This CVE ID differs from CVE-2021-26412, CVE-2021-26854, CVE-2021-26855, CVE-2021-26858, CVE-2021-27065, and CVE-2021-27078.\n\n\n\n\nRecommended Mitigations \n\nUpdate to support latest version.\nInstall Microsoft security patch.\nUse Microsoft Exchange On-Premises Mitigation Tool.\n\n\n\n\n\nDetection Methods \n\nRun Exchange script: https://github.com/microsoft/CSS-Exchange/tree/main/Security.\nHashes can be found here:  https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/#scan-log.\n\n\n\n\n\nVulnerable Technologies and Versions \nMicrosoft Exchange Servers\n\n\n\n\nTable XX: Microsoft CVE-2021-27065\n\n\n\n\nMicrosoft CVE-2021-27065 CVSS 3.0: 7.8 (High)\n\n\n\n\nVulnerability Description \nMicrosoft Exchange Server remote code execution vulnerability. This CVE ID differs from CVE-2021-26412, CVE-2021-26854, CVE-2021-26855, CVE-2021-26858, CVE-2021-27065, and CVE-2021-27078.\n\n\n\n\nRecommended Mitigations \n\nUpdate to support latest version.\nInstall Microsoft security patch.\nUse Microsoft Exchange On-Premises Mitigation Tool.\n\n\n\n\n\nDetection Methods \n\nRun Exchange script: https://github.com/microsoft/CSS-Exchange/tree/main/Security.\nHashes can be found here: https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/#scan-log.\n\n\n\n\n\nVulnerable Technologies and Versions \nMicrosoft Exchange Servers\n\n\n\n\nReferences \nhttps://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2021-27065\n\n\n\n\nTable XXI: Apache CVE-2021-41773\n\n\n\n\nApache CVE-2021-41773 CVSS 3.0: 7.5 (High)\n\n\n\n\nVulnerability Description \nThis vulnerability has been modified since it was last analyzed by NVD. It is awaiting reanalysis, which may result in further changes to the information provided. A flaw was found in a change made to path normalization in Apache HTTP Server 2.4.49. A malicious actor could use a path traversal attack to map URLs to files outside the directories configured by Alias-like directives. If files outside of these directories are not protected by the usual default configuration \"require all denied,\" these requests can succeed. Enabling CGI scripts for these aliased paths could allow for remote code execution. This issue is known to be exploited in the wild. This issue only affects Apache 2.4.49 and not earlier versions. The fix in Apache HTTP Server 2.4.50 is incomplete (see CVE-2021-42013).\n\n\n\n\nRecommended Mitigations \n\nApply update or patch.\n\n\n\n\n\nDetection Methods \n\nCommercially available scanners can detect CVE. \n\n\n\n\n\nVulnerable Technologies and Versions \nApache HTTP Server 2.4.49 and 2.4.50\nFedoraproject Fedora 34 and 35\nOracle Instantis Enterprise Track 17.1-17.3\nNetapp Cloud Backup\n\n\n\n\n\nRevisions\n\nInitial Publication: October 6, 2022\n",
  "cves": [
    "CVE-2021-42013",
    "CVE-2021-44228",
    "CVE-2021-27078",
    "CVE-2020-5902",
    "CVE-2021-22005",
    "CVE-2019-11510",
    "CVE-2021-27065",
    "CVE-2021-26857",
    "CVE-2021-20090",
    "CVE-2021-40539",
    "CVE-2021-26854",
    "CVE-2019-19781",
    "CVE-2021-1497",
    "CVE-2021-41773",
    "CVE-2022-26134",
    "CVE-2021-26412",
    "CVE-2022-1388",
    "CVE-2021-42237",
    "CVE-2021-26855",
    "CVE-2021-26084",
    "CVE-2021-26858",
    "CVE-2021-36260",
    "CVE-2021-22205",
    "CVE-2022-24112"
  ],
  "techniques": [],
  "advisory": "aa22-279a",
  "title": "Top CVEs Actively Exploited By People’s Republic of China State-Sponsored Cyber Actors | CISA",
  "source": "cybersecurity-advisories",
  "id": "a3ffade28f4f67be2c123f60aa26f8ef3822b0f4e8173bfbd2fe17afb6e7fcf8"
}