{
  "markdown": "\n\nSummary\n\nActions to take today to mitigate cyber threats from ransomware:\n• Prioritize remediating known exploited vulnerabilities.\n• Train users to recognize and report phishing attempts.\n• Enable and enforce multifactor authentication.\nNote: this joint Cybersecurity Advisory (CSA) is part of an ongoing #StopRansomware effort to publish advisories for network defenders that detail various ransomware variants and ransomware threat actors. These #StopRansomware advisories include recently and historically observed tactics, techniques, and procedures (TTPs) and indicators of compromise (IOCs) to help organizations protect against ransomware. Visit stopransomware.gov to see all #StopRansomware advisories and to learn more about other ransomware threats and no-cost resources.\nThe Federal Bureau of Investigation (FBI), the Cybersecurity and Infrastructure Security Agency (CISA), the Department of the Treasury, and the Financial Crimes Enforcement Network (FinCEN) are releasing this CSA to provide information on MedusaLocker ransomware. Observed as recently as May 2022, MedusaLocker actors predominantly rely on vulnerabilities in Remote Desktop Protocol (RDP) to access victims’ networks. The MedusaLocker actors encrypt the victim's data and leave a ransom note with communication instructions in every folder containing an encrypted file. The note directs victims to provide ransomware payments to a specific Bitcoin wallet address. MedusaLocker appears to operate as a Ransomware-as-a-Service (RaaS) model based on the observed split of ransom payments. Typical RaaS models involve the ransomware developer and various affiliates that deploy the ransomware on victim systems. MedusaLocker ransomware payments appear to be consistently split between the affiliate, who receives 55 to 60 percent of the ransom; and the developer, who receives the remainder. \nDownload the PDF version of this report: pdf, 633 kb\n\nTechnical Details\n\nMedusaLocker ransomware actors most often gain access to victim devices through vulnerable Remote Desktop Protocol (RDP) configurations [T1133]. Actors also frequently use email phishing and spam email campaigns—directly attaching the ransomware to the email—as initial intrusion vectors [T1566].\nMedusaLocker ransomware uses a batch file to execute PowerShell script invoke-ReflectivePEInjection [T1059.001]. This script propagates MedusaLocker throughout the network by editing the EnableLinkedConnections value within the infected machine’s registry, which then allows the infected machine to detect attached hosts and networks via Internet Control Message Protocol (ICMP) and to detect shared storage via Server Message Block (SMB) Protocol. \nMedusaLocker then: \n\nRestarts the LanmanWorkstation service, which allows registry edits to take effect. \nKills the processes of well-known security, accounting, and forensic software. \nRestarts the machine in safe mode to avoid detection by security software [T1562.009].\nEncrypts victim files with the AES-256 encryption algorithm; the resulting key is then encrypted with an RSA-2048 public key [T1486]. \nRuns every 60 seconds, encrypting all files except those critical to the functionality of the victim’s machine and those that have the designated encrypted file extension. \nEstablishes persistence by copying an executable (svhost.exe or svhostt.exe) to the %APPDATA%\\Roaming directory and scheduling a task to run the ransomware every 15 minutes. \nAttempts to prevent standard recovery techniques by deleting local backups, disabling startup recovery options, and deleting shadow copies [T1490].\n\nMedusaLocker actors place a ransom note into every folder containing a file with the victim's encrypted data. The note outlines how to communicate with the MedusaLocker actors, typically providing victims one or more email address at which the actors can be reached. The size of MedusaLocker ransom demands appears to vary depending on the victim’s financial status as perceived by the actors. \n \nIndicators of Compromise\n\n\n\nEncrypted File Extensions\n\n\n\n\n.1btc\n.matlock20\n.marlock02\n.readinstructions\n\n\n.bec\n.mylock\n.jpz.nz\n.marlock11\n\n\n.cn\n.NET1\n.key1\n.fileslocked\n\n\n.datalock\n.NZ\n.lock\n.lockfilesUS\n\n\n.deadfilesgr\n.tyco\n.lockdata7\n.rs\n\n\n.faratak\n.uslockhh\n.lockfiles\n.tyco\n\n\n.fileslock\n.zoomzoom\n.perfection\n.uslockhh\n\n\n.marlock13\nn.exe\n.Readinstruction\n.marlock08\n\n\n.marlock25\nnt_lock20\n.READINSTRUCTION\n \n\n\n.marlock6\n.marlock01\n.ReadInstructions\n \n\n\n\n \n\n\n\nRansom Note File Names\n\n\n\n\nhow_to_ recover_data.html \nhow_to_recover_data.html.marlock01\n\n\ninstructions.html \nREADINSTRUCTION.html \n\n\n!!!HOW_TO_DECRYPT!!!\nHow_to_recovery.txt\n\n\nreadinstructions.html \nreadme_to_recover_files\n\n\nrecovery_instructions.html \nHOW_TO_RECOVER_DATA.html\n\n\nrecovery_instruction.html\n \n\n\n\n \n\n\n\nPayment Wallets\n\n\n\n\n14oxnsSc1LZ5M2cPZeQ9rFnXqEvPCnZikc \n\n\n1DRxUFhvJjGUdojCzMWSLmwx7Qxn79XbJq \n\n\n18wRbb94CjyTGkUp32ZM7krCYCB9MXUq42 \n\n\n1AbRxRfP6yHePpi7jmDZkS4Mfpm1ZiatH5\n\n\n1Edcufenw1BB4ni9UadJpQh9LVx9JGtKpP\n\n\n1DyMbw6R9PbJqfUSDcK5729xQ57yJrE8BC \n\n\n184ZcAoxkvimvVZaj8jZFujC7EwR3BKWvf \n\n\n14oH2h12LvQ7BYBufcrY5vfKoCq2hTPoev\n\n\nbc1qy34v0zv6wu0cugea5xjlxagsfwgunwkzc0xcjj\n\n\nbc1q9jg45a039tn83jk2vhdpranty2y8tnpnrk9k5q\n\n\nbc1qz3lmcw4k58n79wpzm550r5pkzxc2h8rwmmu6xm\n\n\n1AereQUh8yjNPs9Wzeg1Le47dsqC8NNaNM\n\n\n1DeNHM2eTqHp5AszTsUiS4WDHWkGc5UxHf\n\n\n1HEDP3c3zPwiqUaYuWZ8gBFdAQQSa6sMGw\n\n\n1HdgQM9bjX7u7vWJnfErY4MWGBQJi5mVWV\n\n\n1nycdn9ebxht4tpspu4ehpjz9ghxlzipll\n\n\n12xd6KrWVtgHEJHKPEfXwMVWuFK4k1FCUF\n\n\n1HZHhdJ6VdwBLCFhdu7kDVZN9pb3BWeUED\n\n\n1PormUgPR72yv2FRKSVY27U4ekWMKobWjg\n\n\n14cATAzXwD7CQf35n8Ea5pKJPfhM6jEHak\n\n\n1PopeZ4LNLanisswLndAJB1QntTF8hpLsD\n\n\n\n \n\n\n\nEmail Addresses\n\n\n\n\nwillyhill1960@tutanota[.]com \nunlockfile@cock[.]li\n\n\nzlo@keem[.]ne \nunlockmeplease@airmail[.]cc \n\n\nzlo@keemail[.]me \nunlockmeplease@protonmail[.]com \n\n\nzlo@tfwno[.]gf \nwillyhill1960@protonmail[.]com \n\n\nsupport@ypsotecs[.]com\nsupport@imfoodst[.]com \n\n\n\n \n\n\n\nEmail Addresses\n\n\n\n\ntraceytevin@protonmail[.]com \nsupport@itwgset[.]com\n\n\nunlock_file@aol[.]com \nsupport@novibmaker[.]com\n\n\nunlock_file@outlook[.]com \nsupport@securycasts[.]com \n\n\nsupport@exoprints[.]com\nrewmiller-1974@protonmail[.]com\n\n\nsupport@exorints[.]com \nrpd@keemail[.]me\n\n\nsupport@fanbridges[.]com \nsoterissylla@wyseil[.]com \n\n\nsupport@faneridges[.]com\nsupport@careersill[.]com \n\n\nperfection@bestkoronavirus[.]com \nkarloskolorado@tutanota[.]com\n\n\npool1256@tutanota[.]com \nkevynchaz@protonmail[.]com \n\n\nrapid@aaathats3as[.]com\nkorona@bestkoronavirus[.]com\n\n\nrescuer@tutanota[.]com\nlockPerfection@gmail[.]com\n\n\nithelp01@decorous[.]cyou\nlockperfection@gmail[.]com \n\n\nithelp01@wholeness[.]business\nmulierfagus@rdhos[.]com\n\n\nithelp02@decorous[.]cyou\n[rescuer]@cock[.]li \n\n\nithelp02@wholness[.]business\n107btc@protonmail[.]com \n\n\nithelpresotre@outlook[.]com\n33btc@protonmail[.]com \n\n\ncmd@jitjat[.]org \n777decoder777@protonmail[.]com\n\n\ncoronaviryz@gmail[.]com\n777decoder777@tfwno[.]gf\n\n\ndec_helper@dremno[.]com\nandrewmiller-1974@protonmail[.]com\n\n\ndec_helper@excic[.]com \nangelomartin-1980@protonmail[.]com\n\n\ndec_restore@prontonmail[.]com \nballioverus@quocor[.]com\n\n\ndec_restore1@outlook[.]com\nbeacon@jitjat[.]org\n\n\nbitcoin@sitesoutheat[.]com \nbeacon@msgsafe[.]io\n\n\nbriansalgado@protonmail[.]com\nbest666decoder@tutanota[.]com \n\n\nbugervongir@outlook[.]com\nbitcoin@mobtouches[.]com \n\n\nbest666decoder@protonmail[.]com \nencrypt2020@outlook[.]com \n\n\ndecoder83540@cock[.]li\nfast-help@inbox[.]lv\n\n\ndecra2019@gmail[.]com \nfuc_ktheworld1448@outlook[.]com\n\n\ndiniaminius@winrof[.]com \nfucktheworld1448@cock[.]li\n\n\ndirhelp@keemail[.]me \ngartaganisstuffback@gmail[.]com \n\n\n\n \n\n\n\nEmail Addresses\n\n\n\n\nemaila.elaich@iav.ac[.]ma\ngavingonzalez@protonmail[.]com\n\n\nemd@jitjat[.]org\ngsupp@onionmail[.]org\n\n\nencrypt2020@cock[.]li \ngsupp@techmail[.]info\n\n\nbest666decoder@protonmail[.]com \nhelper@atacdi[.]com \n\n\nithelp@decorous[.]cyou\nhelper@buildingwin[.]com \n\n\nithelp@decorous[.]cyoum\nhelprestore@outlook[.]com\n\n\nithelp@wholeness[.]business\nhelptorestore@outlook[.]com\n\n\n\n \n\n\n\nTOR Addresses\n\n\n\n\nhttp://gvlay6u4g53rxdi5.onion/6-iSm1B1Ehljh8HYuXGym4Xyu1WdwsR2Av-6tXiw1BImsqoLh7pd207Rl6XYoln7sId \n\n\nhttp://gvlay6u4g53rxdi5.onion/8-grp514hncgblilsjtd32hg6jtbyhlocr5pqjswxfgf2oragnl3pqno6fkqcimqin\n\n\nhttp://gvlay6y4g53rxdi5.onion/21-8P4ZLCsMETPaLw9MkSlXJsNZWdHe0rxjt-XmBgZLWlm5ULGFCOJFuVdEymmxysofwu\n\n\nhttp://gvlay6u4g53rxdi5.onion/2l-8P4ZLCsMTPaLw9MkSlXJsNZWdHeOrxjtE9lck1MuXPYo29daQys6gomZZXUImN7Z \n\n\nhttp://gvlay6u4g53rxdi5.onion/21-8P4ZLCsMTPaLw9MkSlXJsNZWdHe0rxjt-DcaE9HeHywqSHvdcIwOndCS4PuWASX8g \n\n\nhttp://gvlay6u4g53rxdi5.onion/21-8P4ZLCsMTPaLw9MkSlXJsNZWdHe0rxjt-kB4rQXGKyxGiLyw7YDsMKSBjyfdwcyxo\n\n\nhttp://gvlay6u4g53rxdi5.onion/21-8P4ZLCsMTPaLw9MkSlXJsNZWdHe0rxjt-bET6JbB9vEMZ7qYBPqUMCxOQExFx4iOi \n\n\nhttp://gvlay6u4g53rxdi5. onion/8-MO0Q7O97Hgxvm1YbD7OMnimImZJXEWaG-RbH4TvdwVTGQB3X6VOUOP3lgO6YOJEOW\n\n\nhttp://gvlay6u4g53rxdi5.onion/8-gRp514hncgb1i1sjtD32hG6jTbUh1ocR-Uola2Fo30KTJvZX0otYZgTh5txmKwUNe \n\n\nhttp://gvlay6u4g53rxdi5.onion/21-E6UQFCEuCn4KvtAh4TonRTpyHqFo6F6L-OWQwD1w1Td7hY7IGUUjxmHMoFSQW6blg \n\n\nhttp://gvlay6u4g53rxdi5.onion/21-E6UQFCEuCn4KvtAh4TonRTpyHqFo6F6L-uGHwkkWCoUtBbZWN50sSS4Ds8RABkrKy \n\n\nhttp://gvlay6u4g53rxdi5.onion/21-E6UQFCEuCn4KvtAh4TonRTpyHqFo6F6L-Tj3PRnQlpHc9OftRVDGAWUulvE80yZbc \n\n\nhttp://gvlay6u4g53rxdi5.onion/8-Ww5sCBhsL8eM4PeAgsfgfa9lrqa81r31-tDQRZCAUe4164X532j9Ky16IBN9StWTH \n\n\nhttp://gvlay6u4g53rxdi5.onion/21-wIq5kK9gGKiTmyups1U6fABj1VnXIYRB-I5xek6PG2EbWlPC7C1rXfsqJBlWlFFfY\n\n\nqd7pcafncosqfqu3ha6fcx4h6sr7tzwagzpcdcnytiw3b6varaeqv5yd.onion\n\n\nhttp://medusacegu2ufmc3kx2kkqicrlcxdettsjcenhjena6uannk5f4ffuyd.onion/leakdata/[REDACTED]\n\n\n\nDisclaimer: Many of these observed IP addresses are several years old and have been historically linked to MedusaLocker ransomware. We recommend these IP addresses be investigated or vetted by organizations prior to taking action, such as blocking.\n\n\n\nIP Address\nLast Observed\n\n\n\n\n195.123.246.138\nNov-2021\n\n\n138.124.186.221\nNov-2021\n\n\n159.223.0.9\nNov-2021\n\n\n45.146.164.141\nNov-2021\n\n\n185.220.101.35\nNov-2021\n\n\n185.220.100.249\nSep-2021\n\n\n50.80.219.149\nSep-2021\n\n\n185.220.101.146\nSep-2021\n\n\n185.220.101.252\nSep-2021\n\n\n179.60.150.97\nSep-2021\n\n\n84.38.189.52\nSep-2021\n\n\n94.232.43.63\nJul-2021\n\n\n108.11.30.103\nApr-2021\n\n\n194.61.55.94\nApr-2021\n\n\n198.50.233.202\nApr-2021\n\n\n40.92.90.105\nJan-2021\n\n\n188.68.216.23\nDec-2020\n\n\n87.251.75.71\nDec-2020\n\n\n196.240.57.20\nOct-2020\n\n\n198.0.198.5\nAug-2020\n\n\n194.5.220.122\nMar-2020\n\n\n194.5.250.124\nMar-2020\n\n\n194.5.220.124\nMar-2020\n\n\n104.210.72.161\nNov-2019\n\n\n\n \nMITRE ATT&CK Techniques\nMedusaLocker actors use the ATT&CK techniques listed in Table 1.\nTable 1: MedusaLocker Actors ATT&CK Techniques for Enterprise\n\n\n\nInitial Access\n\n\n\n\nTechnique Title\nID\nUse\n\n\nExternal Remote Services\nT1133\nMedusaLocker actors gained access to victim devices through vulnerable RDP configurations.\n\n\nPhishing\nT1566\nMedusaLocker actors used phishing and spearphishing to obtain access to victims' networks.\n\n\nExecution\n\n\nTechnique Title\nID\nUse\n\n\nCommand and Scripting Interpreter: PowerShell\n\nT1059.001\n\nMedusaLocker actors may abuse PowerShell commands and scripts for execution.\n\n\nDefense Evasion\n\n\nTechnique Title\nID\nUse\n\n\nImpair Defenses: Safe Mode Boot\n\nT1562.009\n\nMedusaLocker actors may abuse Windows safe mode to disable endpoint defenses. Safe mode starts up the Windows operating system with a limited set of drivers and services.\n\n\nImpact\n\n\nTechnique Title\nID\nUse\n\n\nData Encrypted for Impact\nT1486\nMedusaLocker actors encrypt data on target systems or on large numbers of systems in a network to interrupt availability to system and network resources.\n\n\nInhibit System Recovery\nT1490\nMedusaLocker actors may deny access to operating systems containing features that can help fix corrupted systems, such as backup catalog, volume shadow copies, and automatic repair.\n\n\n\n \n\nMitigations\n\n\nImplement a recovery plan that maintains and retains multiple copies of sensitive or proprietary data and servers in a physically separate, segmented, and secure location (i.e., hard drive, storage device, or the cloud).\nImplement network segmentation and maintain offline backups of data to ensure limited interruption to the organization.\nRegularly back up data and password protect backup copies stored offline. Ensure copies of critical data are not accessible for modification or deletion from the system where the data resides.\nInstall, regularly update, and enable real time detection for antivirus software on all hosts.\nInstall updates for operating systems, software, and firmware as soon as possible.\nReview domain controllers, servers, workstations, and active directories for new and/or unrecognized accounts.\nAudit user accounts with administrative privileges and configure access controls according to the principle of least privilege. \nDisable unused ports.\nConsider adding an email banner to emails received from outside your organization.\nDisable hyperlinks in received emails.\nEnforce multifactor authentication (MFA).\nUse National Institute of Standards and Technology (NIST) standards for developing and managing password policies:\n\nUse longer passwords consisting of at least 8 characters and no more than 64 characters in length.\nStore passwords in hashed format using industry-recognized password managers.\nAdd password user “salts” to shared login credentials.\nAvoid reusing passwords.\nImplement multiple failed login attempt account lockouts.\nDisable password “hints”.\nRefrain from requiring password changes unless there is evidence of password compromise. Note: NIST guidance suggests favoring longer passwords and no longer require regular and frequent password resets. Frequent password resets are more likely to result in users developing password “patterns” cyber criminals can easily decipher.\nRequire administrator credentials to install software.\n\n\nOnly use secure networks; avoid using public Wi-Fi networks.\nConsider installing and using a virtual private network (VPN) to establish secure remote connections.\nFocus on cybersecurity awareness and training. Regularly provide users with training on information security principles and techniques as well as overall emerging cybersecurity risks and vulnerabilities, such as ransomware and phishing scams.\n\n \nResources\n\nStopransomware.gov is a whole-of-government approach that gives one central location for ransomware resources and alerts.\nResource to mitigate a ransomware attack: CISA-Multi-State Information Sharing and Analysis Center (MS-ISAC) Joint Ransomware Guide\nNo-cost cyber hygiene services: Cyber Hygiene Services and Ransomware Readiness Assessment\n\nReporting\n\nTo report an incident and request technical assistance, contact CISA at Central@cisa.dhs.gov or 888-282-0870, or FBI through a local field office. \nFinancial Institutions must ensure compliance with any applicable Bank Secrecy Act requirements, including suspicious activity reporting obligations. Indicators of compromise (IOCs), such as suspicious email addresses, file names, hashes, domains, and IP addresses, can be provided under Item 44 of the Suspicious Activity Report (SAR) form. For more information on mandatory and voluntary reporting of cyber events via SARs, see FinCEN Advisory FIN-2016-A005, Advisory to Financial Institutions on Cyber-Events and Cyber-Enabled Crime, October 25, 2016; and FinCEN Advisory FIN-2021-A004, Advisory on Ransomware and the Use of the Financial System to Facilitate Ransom Payments, November 8, 2021, which updates FinCEN Advisory FIN-2020-A006.\nThe U.S. Department of State’s Rewards for Justice (RFJ) program offers a reward of up to $10 million for reports of foreign government malicious activity against U.S. critical infrastructure. See the RFJ website for more information and how to report information securely.\n\n\nContact Information\n\nTo report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact your local FBI field office at www.fbi.gov/contact-us/field-offices. When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. To report incidents and anomalous activity or to request incident response resources or technical assistance related to this threat, contact CISA at report@cisa.gov.\n\nRevisions\n\nJune 30, 2022: Initial Version\n",
  "cves": [],
  "techniques": [
    "T1562.009",
    "T1566",
    "T1486",
    "T1490",
    "T1059",
    "T1133",
    "T1059.001",
    "T1562"
  ],
  "advisory": "aa22-181a",
  "title": "#StopRansomware: MedusaLocker | CISA",
  "source": "cybersecurity-advisories",
  "id": "9ab3719aa70ba1e57d85f3fe9711d173c44b5dc52b6fc370d6fdbd827e1ea790"
}