{
  "markdown": "\n\nSummary\n\nThe Sandworm actor, which the United Kingdom and the United States have previously attributed to the Russian GRU, has replaced the exposed VPNFilter malware with a new more advanced framework.\nThe United Kingdom's (UK) National Cyber Security Centre (NCSC), the Cybersecurity and Infrastructure Security Agency (CISA), the National Security Agency (NSA), and the Federal Bureau of Investigation (FBI) in the U.S. have identified that the actor known as Sandworm or Voodoo Bear is using a new malware, referred to here as Cyclops Blink. The NCSC, CISA, and the FBI have previously attributed the Sandworm actor to the Russian General Staff Main Intelligence Directorate’s Russian (GRU’s) Main Centre for Special Technologies (GTsST). The malicious cyber activity below has previously been attributed to Sandworm:\n\nThe BlackEnergy disruption of Ukrainian electricity in 2015\nIndustroyer in 2016\nNotPetya in 2017\nAttacks against the Winter Olympics and Paralympics in 2018 \nA series of disruptive attacks against Georgia in 2019\n\nCyclops Blink appears to be a replacement framework for the VPNFilter malware exposed in 2018, and which exploited network devices, primarily small office/home office (SOHO) routers and network attached storage (NAS) devices.\nThis advisory summarizes the VPNFilter malware it replaces, and provides more detail on Cyclops Blink, as well as the associated tactics, techniques and procedures (TTPs) used by Sandworm. An NCSC malware analysis report on Cyclops Blink is also available.\nIt also provides mitigation measures to help organizations defend against malware.\nClick here for a PDF version of this report.\n\nTechnical Details\n\nVPNFilter\nThe malware was first exposed in 2018\nA series of articles published by Cisco Talos in 2018 describes VPNFilter and its modules in detail. VPNFilter was deployed in stages, with most functionality in the third-stage modules. These modules enabled traffic manipulation, destruction of the infected host device, and likely enabled downstream devices to be exploited. They also allowed monitoring of Modbus SCADA protocols, which appears to be an ongoing requirement for Sandworm, as also seen in their previous attacks against ICS networks.\nVPNFilter targeting was widespread and appeared indiscriminate, with some exceptions: Cisco Talos reported an increase of victims in Ukraine in May 2018. Sandworm also deployed VPNFilter against targets in the Republic of Korea before the 2018 Winter Olympics. \nIn May 2018, Cisco Talos published the blog that exposed VPNFilter and the U.S. Department of Justice linked the activity to Sandworm and announced efforts to disrupt the botnet.\nActivity since its exposure \nA Trendmicro blog in January 2021 detailed residual VPNFilter infections and provided data which showed that although there had been a reduction in requests to a known C2 domain, there was still more than a third of the original number of first-stage infections.\nSandworm has since shown limited interest in existing VPNFilter footholds, instead preferring to retool.\nCyclops Blink\nActive since 2019\nThe NCSC, CISA, the FBI, and NSA, along with industry partners, have now identified a large-scale modular malware framework (T1129) which is targeting network devices. The new malware is referred to here as Cyclops Blink and has been deployed since at least June 2019, fourteen months after VPNFilter was disrupted. In common with VPNFilter, Cyclops Blink deployment also appears indiscriminate and widespread.\nThe actor has so far primarily deployed Cyclops Blink to WatchGuard devices, but it is likely that Sandworm would be capable of compiling the malware for other architectures and firmware.\nNote: Note that only WatchGuard devices that were reconfigured from the manufacturer default settings to open remote management interfaces to external access could be infected\nMalware overview \nThe malware itself is sophisticated and modular with basic core functionality to beacon (T1132.002) device information back to a server and enable files to be downloaded and executed. There is also functionality to add new modules while the malware is running, which allows Sandworm to implement additional capability as required.\nThe NCSC has published a malware analysis report on Cyclops Blink which provides more detail about the malware.\nPost exploitation \nPost exploitation, Cyclops Blink is generally deployed as part of a firmware ‘update’ (T1542.001). This achieves persistence when the device is rebooted and makes remediation harder.\nVictim devices are organized into clusters and each deployment of Cyclops Blink has a list of command and control (C2) IP addresses and ports that it uses (T1008). All the known C2 IP addresses to date have been used by compromised WatchGuard firewall devices. Communications between Cyclops Blink clients and servers are protected under Transport Layer Security (TLS) (T1071.001), using individually generated keys and certificates. Sandworm manages Cyclops Blink by connecting to the C2 layer through the Tor network.\n\n\nMitigations\n\nCyclops Blink persists on reboot and throughout the legitimate firmware update process. Affected organizations should therefore take steps to remove the malware. \nWatchGuard has worked closely with the FBI, CISA, NSA and the NCSC, and has provided tooling and guidance to enable detection and removal of Cyclops Blink on WatchGuard devices through a non-standard upgrade process. Device owners should follow each step in these instructions to ensure that devices are patched to the latest version and that any infection is removed.\nThe tooling and guidance from WatchGuard can be found at: https://detection.watchguard.com/.\nIn addition:\n\nIf your device is identified as infected with Cyclops Blink, you should assume that any passwords present on the device have been compromised and replace them (see NCSC password guidance for organizations.\nYou should ensure that the management interface of network devices is not exposed to the internet.\n\nIndicators of Compromise\nPlease refer to the accompanying Cyclops Blink malware analysis report for indicators of compromise which may help detect this activity. \nMITRE ATT&CK®\nThis advisory has been compiled with respect to the MITRE ATT&CK® framework, a globally accessible knowledge base of adversary tactics and techniques based on real-world observations.\n\n\n\n\nTactic\n\n\nTechnique\n\n\nProcedure\n\n\n\n\nInitial Access\n\n\nT1133\n\n\nExternal Remote Services\nThe actors most likely deploy modified device firmware images by exploiting an externally available service\n\n\n\n\nExecution\n\n\nT1059.004\n\n\nCommand and Scripting Interpreter: Unix Shell\nCyclops Blink executes downloaded files using the Linux API\n\n\n\n\nPersistence\n\n\nT1542.001\n\n\nPre-OS Boot: System Firmware\nCyclops Blink is deployed within a modified device firmware image\n\n\n\n\nT1037.004\n\n\nBoot or Logon Initialization Scripts: RC Scripts\nCyclops Blink is executed on device startup, using a modified RC script\n\n\n\nDefense Evasion\n\n \nT1562.004\n\n\nImpair Defenses: Disable or Modify System Firewall\nCyclops Blink modifies the Linux system firewall to enable C2 communication\n\n\n\n \n\n \nT1036.005\n\n\nMasquerading: Match Legitimate Name or Location\nCyclops Blink masquerades as a Linux kernel thread process\n\n\n\n\nDiscovery\n\n\nT1082\n\n\nSystem Information Discovery\nCyclops Blink regularly queries device information\n\n\n\n\nCommand and Control\n\n\nT1090\n\n\nProxy\n\n\n\n\nT1132.002\n\n\nData Encoding: Non-Standard Encoding\nCyclops Blink command messages use a custom binary scheme to encode data\n\n\n\n\nT1008\n\n\nFallback Channels\nCyclops Blink randomly selects a C2 server from contained lists of IPv4 addresses and port numbers\n\n\n\n\nT1071.001\n\n\nApplication Layer Protocol: Web Protocols\nCyclops Blink can download files via HTTP or HTTPS\n\n\n\n\nT1573.002\n\n\nEncrypted Channel: Asymmetric Cryptography\nCyclops Blink C2 messages are individually encrypted using AES-256-CBC and sent underneath TLS\n\n\n\n\nT1571\n\n\nNon-Standard Port\nThe list of port numbers used by Cyclops Blink includes non-standard ports not typically associated with HTTP or HTTPS traffic\n\n\n\nExfiltration\n\nT1041\n\n\nExfiltration Over C2 Channel\nCyclops Blink can upload files to a C2 server\n\n\n\n\nA Cyclops Blink infection does not mean that an organization is the primary target, but it may be selected to be, or its machines could be used to conduct attacks.\nOrganizations are advised to follow the mitigation advice in this advisory to defend against this activity, and to refer to indicators of compromise (not exhaustive) in the Cyclops Blink malware analysis report to detect possible activity on networks. \nUK organizations affected by the activity outlined in should report any suspected compromises to the NCSC at https://report.ncsc.gov.uk/.\nFurther Guidance\nA variety of mitigations will be of use in defending against the malware featured in this advisory:\n\nDo not expose management interfaces of network devices to the internet: the management interface is a significant attack surface, so not exposing them reduces the risk. See NCSC guidance: https://www.ncsc.gov.uk/guidance/acquiring-managing-and-disposing-network-devices.\nProtect your devices and networks by keeping them up to date: use the latest supported versions, apply security patches promptly, use anti-virus and scan regularly to guard against known malware threats. See NCSC guidance: https://www.ncsc.gov.uk/guidance/mitigating-malware.\nUse multi-factor authentication to reduce the impact of password compromises. See NCSC guidance: https://www.ncsc.gov.uk/guidance/multi-factor-authentication-online-services and https://www.ncsc.gov.uk/guidance/setting-two-factor-authentication-2fa.\nTreat people as your first line of defense. Tell staff how to report suspected phishing emails, and ensure they feel confident to do so. Investigate their reports promptly and thoroughly. Never punish users for clicking phishing links or opening attachments. See NCSC guidance: https://www.ncsc.gov.uk/phishing. \nSet up a security monitoring capability so you are collecting the data that will be needed to analyze network intrusions. See NCSC Guidance: https://www.ncsc.gov.uk/guidance/introduction-logging-security-purposes. \nPrevent and detect lateral movement in your organization’s networks. See NCSC guidance: https://www.ncsc.gov.uk/guidance/preventing-lateral-movement.\n\nAbout This Document\nThis advisory is the result of a collaborative effort by United Kingdom’s National Cyber Security Centre (NCSC), the United States’ National Security Agency (NSA), the Federal Bureau of Investigation (FBI), and Department of Homeland Security (DHS) Cybersecurity and Infrastructure Security Agency (CISA). \nCISA, FBI, and NSA agree with this attribution and the details provided in the report.\nThis advisory has been compiled with respect to the MITRE ATT&CK® framework, a globally accessible knowledge base of adversary tactics and techniques based on real-world observations. \nDisclaimers\nThis report draws on information derived from NCSC and industry sources. Any NCSC findings and recommendations made have not been provided with the intention of avoiding all risks and following the recommendations will not remove all such risk. Ownership of information risks remains with the relevant system owner at all times.\nDisclaimer of Endorsement: The information and opinions contained in this document are provided \"as is\" and without any warranties or guarantees. Reference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United States Government, and this guidance shall not be used for advertising or product endorsement purposes.\nFor NSA client requirements or general cybersecurity inquiries, contact the Cybersecurity Requirements Center at 410-854-4200 or Cybersecurity_Requests@nsa.gov.\n\nContact Information\n\nTo report suspicious or criminal activity related to information found in this joint Cybersecurity Advisory:\nU.S. organizations contact your local FBI field office at fbi.gov/contact-us/field-offices, or the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by email at CyWatch@fbi.gov. When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. To request incident response resources or technical assistance related to these threats, contact CISA at Central@cisa.gov.\nAustralian organizations should report incidents to the Australian Signals Directorate’s (ASD’s) ACSC via cyber.gov.au or call 1300 292 371 (1300 CYBER 1).\nU.K. organizations should report a significant cyber security incident: ncsc.gov.uk/report-an-incident (monitored 24 hrs) or for urgent assistance, call 03000 200 973.\n\nRevisions\n\nFebruary 23, 2022: Initial Version\n",
  "cves": [],
  "techniques": [
    "T1071",
    "T1036.005",
    "T1573.002",
    "T1132.002",
    "T1071.001",
    "T1542",
    "T1562.004",
    "T1041",
    "T1129",
    "T1008",
    "T1571",
    "T1132",
    "T1059.004",
    "T1082",
    "T1133",
    "T1542.001",
    "T1090",
    "T1037.004"
  ],
  "advisory": "aa22-054a",
  "title": "New Sandworm Malware Cyclops Blink Replaces VPNFilter | CISA",
  "source": "cybersecurity-advisories",
  "id": "85b7560f4e1e6cd79cdbe5e6894c8cad88ee8624cdd3f4a590f5995992cb6209"
}