{
  "markdown": "\n\nSummary\n\nThis joint Cybersecurity Advisory (CSA) was coauthored by cybersecurity authorities of the United States, Australia, Canada, New Zealand, and the United Kingdom: the Cybersecurity and Infrastructure Security Agency (CISA), National Security Agency (NSA), Federal Bureau of Investigation (FBI), Australian Cyber Security Centre (ACSC), Canadian Centre for Cyber Security (CCCS), New Zealand National Cyber Security Centre (NZ NCSC), and United Kingdom’s National Cyber Security Centre (NCSC-UK). This advisory provides details on the top 15 Common Vulnerabilities and Exposures (CVEs) routinely exploited by malicious cyber actors in 2021, as well as other CVEs frequently exploited.\nU.S., Australian, Canadian, New Zealand, and UK cybersecurity authorities assess, in 2021, malicious cyber actors aggressively targeted newly disclosed critical software vulnerabilities against broad target sets, including public and private sector organizations worldwide. To a lesser extent, malicious cyber actors continued to exploit publicly known, dated software vulnerabilities across a broad spectrum of targets. \nThe cybersecurity authorities encourage organizations to apply the recommendations in the Mitigations section of this CSA. These mitigations include applying timely patches to systems and implementing a centralized patch management system to reduce the risk of compromise by malicious cyber actors.\nDownload the Joint Cybersecurity Advisory: 2021 top Routinely Exploited Vulnerabilities (pdf, 777kb).\n\nTechnical Details\n\nKey Findings\nGlobally, in 2021, malicious cyber actors targeted internet-facing systems, such as email servers and virtual private network (VPN) servers, with exploits of newly disclosed vulnerabilities. For most of the top exploited vulnerabilities, researchers or other actors released proof of concept (POC) code within two weeks of the vulnerability’s disclosure, likely facilitating exploitation by a broader range of malicious actors.\nTo a lesser extent, malicious cyber actors continued to exploit publicly known, dated software vulnerabilities—some of which were also routinely exploited in 2020 or earlier. The exploitation of older vulnerabilities demonstrates the continued risk to organizations that fail to patch software in a timely manner or are using software that is no longer supported by a vendor.\nTop 15 Routinely Exploited Vulnerabilities\nTable 1 shows the top 15 vulnerabilities U.S., Australian, Canadian, New Zealand, and UK cybersecurity authorities observed malicious actors routinely exploiting in 2021, which include:\n\nCVE-2021-44228. This vulnerability, known as Log4Shell, affects Apache’s Log4j library, an open-source logging framework. An actor can exploit this vulnerability by submitting a specially crafted request to a vulnerable system that causes that system to execute arbitrary code. The request allows a cyber actor to take full control over the system. The actor can then steal information, launch ransomware, or conduct other malicious activity.[1] Log4j is incorporated into thousands of products worldwide. This vulnerability was disclosed in December 2021; the rapid widespread exploitation of this vulnerability demonstrates the ability of malicious actors to quickly weaponize known vulnerabilities and target organizations before they patch.\nCVE-2021-26855, CVE-2021-26858, CVE-2021-26857, CVE-2021-27065. These vulnerabilities, known as ProxyLogon, affect Microsoft Exchange email servers. Successful exploitation of these vulnerabilities in combination (i.e., “vulnerability chaining”) allows an unauthenticated cyber actor to execute arbitrary code on vulnerable Exchange Servers, which, in turn, enables the actor to gain persistent access to files and mailboxes on the servers, as well as to credentials stored on the servers. Successful exploitation may additionally enable the cyber actor to compromise trust and identity in a vulnerable network.\nCVE-2021-34523, CVE-2021-34473, CVE-2021-31207. These vulnerabilities, known as ProxyShell, also affect Microsoft Exchange email servers. Successful exploitation of these vulnerabilities in combination enables a remote actor to execute arbitrary code. These vulnerabilities reside within the Microsoft Client Access Service (CAS), which typically runs on port 443 in Microsoft Internet Information Services (IIS) (e.g., Microsoft’s web server). CAS is commonly exposed to the internet to enable users to access their email via mobile devices and web browsers. \nCVE-2021-26084. This vulnerability, affecting Atlassian Confluence Server and Data Center, could enable an unauthenticated actor to execute arbitrary code on vulnerable systems. This vulnerability quickly became one of the most routinely exploited vulnerabilities after a POC was released within a week of its disclosure. Attempted mass exploitation of this vulnerability was observed in September 2021.\n\nThree of the top 15 routinely exploited vulnerabilities were also routinely exploited in 2020: CVE-2020-1472, CVE-2018-13379, and CVE-2019-11510. Their continued exploitation indicates that many organizations fail to patch software in a timely manner and remain vulnerable to malicious cyber actors.\nTable 1: Top 15 Routinely Exploited Vulnerabilities in 2021\n\n\n\nCVE\nVulnerability Name\nVendor and Product\nType\n\n\n\n\nCVE-2021-44228\nLog4Shell\nApache Log4j\nRemote code execution (RCE)\n\n\nCVE-2021-40539\n \nZoho ManageEngine AD SelfService Plus\nRCE\n\n\nCVE-2021-34523\nProxyShell\nMicrosoft Exchange Server\nElevation of privilege\n\n\nCVE-2021-34473\nProxyShell\nMicrosoft Exchange Server\nRCE\n\n\nCVE-2021-31207\nProxyShell\nMicrosoft Exchange Server\nSecurity feature bypass\n\n\nCVE-2021-27065\nProxyLogon\nMicrosoft Exchange Server\nRCE\n\n\nCVE-2021-26858\nProxyLogon\nMicrosoft Exchange Server\nRCE\n\n\nCVE-2021-26857\nProxyLogon\nMicrosoft Exchange Server\nRCE\n\n\nCVE-2021-26855\nProxyLogon\nMicrosoft Exchange Server\nRCE\n\n\n\nCVE-2021-26084\n \n\n \nAtlassian Confluence Server and Data Center\nArbitrary code execution\n\n\nCVE-2021-21972\n \nVMware vSphere Client\nRCE\n\n\nCVE-2020-1472\nZeroLogon\nMicrosoft Netlogon Remote Protocol (MS-NRPC)\nElevation of privilege\n\n\nCVE-2020-0688\n \nMicrosoft Exchange Server\nRCE\n\n\nCVE-2019-11510\n \nPulse Secure Pulse Connect Secure\nArbitrary file reading\n\n\nCVE-2018-13379\n \nFortinet FortiOS and FortiProxy\nPath traversal\n\n\n\nAdditional Routinely Exploited Vulnerabilities\nIn addition to the 15 vulnerabilities listed in table 1, U.S., Australian, Canadian, New Zealand, and UK cybersecurity authorities identified vulnerabilities, listed in table 2, that were also routinely exploited by malicious cyber actors in 2021. \nThese vulnerabilities include multiple vulnerabilities affecting internet-facing systems, including Accellion File Transfer Appliance (FTA), Windows Print Spooler, and Pulse Secure Pulse Connect Secure. Three of these vulnerabilities were also routinely exploited in 2020: CVE-2019-19781, CVE-2019-18935, and CVE-2017-11882.\nTable 2: Additional Routinely Exploited Vulnerabilities in 2021\n\n\n\nCVE\nVendor and Product\nType\n\n\n\n\nCVE-2021-42237\nSitecore XP\nRCE\n\n\nCVE-2021-35464\nForgeRock OpenAM server\nRCE\n\n\nCVE-2021-27104\nAccellion FTA\nOS command execution\n\n\nCVE-2021-27103\nAccellion FTA\nServer-side request forgery\n\n\nCVE-2021-27102\nAccellion FTA\nOS command execution\n\n\nCVE-2021-27101\nAccellion FTA\nSQL injection\n\n\nCVE-2021-21985\nVMware vCenter Server\nRCE\n\n\nCVE-2021-20038\nSonicWall Secure Mobile Access (SMA)\nRCE\n\n\nCVE-2021-40444\nMicrosoft MSHTML\nRCE\n\n\nCVE-2021-34527\nMicrosoft Windows Print Spooler\nRCE\n\n\nCVE-2021-3156\nSudo\nPrivilege escalation\n\n\nCVE-2021-27852\nCheckbox Survey\nRemote arbitrary code execution\n\n\nCVE-2021-22893\nPulse Secure Pulse Connect Secure\nRemote arbitrary code execution\n\n\nCVE-2021-20016\nSonicWall SSLVPN SMA100\nImproper SQL command neutralization, allowing for credential access\n\n\nCVE-2021-1675\nWindows Print Spooler\nRCE\n\n\nCVE-2020-2509\nQNAP QTS and QuTS hero\nRemote arbitrary code execution\n\n\nCVE-2019-19781\nCitrix Application Delivery Controller (ADC) and Gateway\nArbitrary code execution\n\n\nCVE-2019-18935\nProgress Telerik UI for ASP.NET AJAX\nCode execution\n\n\nCVE-2018-0171\nCisco IOS Software and IOS XE Software\nRemote arbitrary code execution\n\n\nCVE-2017-11882\nMicrosoft Office\nRCE\n\n\nCVE-2017-0199\nMicrosoft Office\nRCE\n\n\n\n\nMitigations\n\nVulnerability and Configuration Management\n\nUpdate software, operating systems, applications, and firmware on IT network assets in a timely manner. Prioritize patching known exploited vulnerabilities, especially those CVEs identified in this CSA, and then critical and high vulnerabilities that allow for remote code execution or denial-of-service on internet-facing equipment. For patch information on CVEs identified in this CSA, refer to the appendix. \n\nIf a patch for a known exploited or critical vulnerability cannot be quickly applied, implement vendor-approved workarounds.\n\n\nUse a centralized patch management system.\nReplace end-of-life software, i.e., software that is no longer supported by the vendor. For example, Accellion FTA was retired in April 2021.\nOrganizations that are unable to perform rapid scanning and patching of internet-facing systems should consider moving these services to mature, reputable cloud service providers (CSPs) or other managed service providers (MSPs). Reputable MSPs can patch applications—such as webmail, file storage, file sharing, and chat and other employee collaboration tools—for their customers. However, as MSPs and CSPs expand their client organization's attack surface and may introduce unanticipated risks, organizations should proactively collaborate with their MSPs and CSPs to jointly reduce that risk. For more information and guidance, see the following resources.\n\nCISA Insights Risk Considerations for Managed Service Provider Customers\nCISA Insights Mitigations and Hardening Guidance for MSPs and Small- and Mid-sized Businesses\nACSC advice on How to Manage Your Security When Engaging a Managed Service Provider\n\n\n\nIdentity and Access Management\n\nEnforce multifactor authentication (MFA) for all users, without exception.\nEnforce MFA on all VPN connections. If MFA is unavailable, require employees engaging in remote work to use strong passwords. \nRegularly review, validate, or remove privileged accounts (annually at a minimum).\nConfigure access control under the concept of least privilege principle.\n\nEnsure software service accounts only provide necessary permissions (least privilege) to perform intended functions (non-administrative privileges).\n\n\n\nNote: see CISA Capacity Enhancement Guide – Implementing Strong Authentication and ACSC guidance on Implementing Multi-Factor Authentication for more information on hardening authentication systems.\nProtective Controls and Architecture \n\nProperly configure and secure internet-facing network devices, disable unused or unnecessary network ports and protocols, encrypt network traffic, and disable unused network services and devices. \n\nHarden commonly exploited enterprise network services, including Link-Local Multicast Name Resolution (LLMNR) protocol, Remote Desktop Protocol (RDP), Common Internet File System (CIFS), Active Directory, and OpenLDAP.\nManage Windows Key Distribution Center (KDC) accounts (e.g., KRBTGT) to minimize Golden Ticket attacks and Kerberoasting.\nStrictly control the use of native scripting applications, such as command-line, PowerShell, WinRM, Windows Management Instrumentation (WMI), and Distributed Component Object Model (DCOM).\n\n\nSegment networks to limit or block lateral movement by controlling access to applications, devices, and databases. Use private virtual local area networks. \nContinuously monitor the attack surface and investigate abnormal activity that may indicate lateral movement of a threat actor or malware.\n\nUse security tools, such as endpoint detection and response (EDR) and security information and event management (SIEM) tools. Consider using an information technology asset management (ITAM) solution to ensure your EDR, SIEM, vulnerability scanner etc., are reporting the same number of assets.\nMonitor the environment for potentially unwanted programs.\n\n\nReduce third-party applications and unique system/application builds; provide exceptions only if required to support business critical functions.\nImplement application allowlisting. \n\nResources\n\nFor the top vulnerabilities exploited in 2020, see joint CSA Top Routinely Exploited Vulnerabilities\nFor the top exploited vulnerabilities 2016 through 2019, see joint CSA Top 10 Routinely Exploited Vulnerabilities. \nSee the appendix for additional partner resources on the vulnerabilities mentioned in this CSA.\n\nDisclaimer\nThe information in this report is being provided “as is” for informational purposes only. CISA, the FBI, NSA, ACSC, CCCS, NZ NCSC, and NCSC-UK do not endorse any commercial product or service, including any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring.\nPurpose \nThis document was developed by U.S., Australian, Canadian, New Zealand, and UK cybersecurity authorities in furtherance of their respective cybersecurity missions, including their responsibilities to develop and issue cybersecurity specifications and mitigations.\nReferences\n[1] CISA’s Apache Log4j Vulnerability Guidance\nAppendix: Patch Information and Additional Resources for  Top Exploited Vulnerabilities\n\n\n\nCVE\nVendor\nAffected Products\nPatch Information\nResources\n\n\n\n\nCVE-2021-42237\nSitecore\n\nSitecore XP 7.5.0 - Sitecore XP 7.5.2\nSitecore XP 8.0.0 - Sitecore XP 8.2.7\n\nSitecore Security Bulletin SC2021-003-499266\n\nACSC Alert Active Exploitation of vulnerable Sitecore Experience Platform Content Management Systems\n \n\n\n\nCVE-2021-35464\nForgeRock\n\nAccess Management (AM) 5.x, 6.0.0.x, 6.5.0.x, 6.5.1, 6.5.2.x and 6.5.3\nOpenAM 9.x, 10.x, 11.x, 12.x and 13.x\n\nForgeRock AM Security Advisory #202104\n\nACSC Advisory Active exploitation of ForgeRock Access Manager / OpenAM servers\nCCCS ForgeRock Security Advisory\n\n\n\nCVE-2021-27104\nAccellion\nFTA 9_12_370 and earlier\nAccellion Press Release: Update to Recent FTA Security Incident\n\nJoint CSA Exploitation of Accellion File Transfer Appliance\nACSC Alert Potential Accellion File Transfer Appliance compromise\n \n \n\n\n\nCVE-2021-27103\nFTA 9_12_411 and earlier\n\n\nCVE-2021-27102\nFTA versions 9_12_411 and earlier\n\n\nCVE-2021-27101\nFTA 9_12_370 and earlier\n \n\n\nCVE-2021-21985\nVMware\n\nvCenter Server 7.0, 6.7, 6.5\nCloud Foundation (vCenter Server) 4.x and 3.x\n\nVMware Advisory VMSA-2021-0010\nCCCS VMware Security Advisory\n\n\nCVE-2021-21972\nVMware\n\nvCenter Server 7.0, 6.7, 6.5\nCloud Foundation (vCenter Server) 4.x and 3.x\n\nVMware Advisory VMSA-2021-0002\n\nACSC Alert VMware vCenter Server plugin remote code execution vulnerability\nCCCS VMware Security Advisory\nCCCS Alert APT Actors Target U.S. and Allied Networks - Update 1\n\n\n\nCVE-2021-20038\nSonicWall\nSMA 100 Series (SMA 200, 210, 400, 410, 500v), versions 10.2.0.8-37sv, 10.2.1.1-19sv, 10.2.1.2-24sv\nSonicWall Security Advisory SNWLID-2021-0026\n\nACSC Alert Remote code execution vulnerability present in SonicWall SMA 100 series appliances\nCCCS SonicWall Security Advisory\n \n\n\n\nCVE-2021-44228\nApache\n\nLog4j, all versions from 2.0-beta9 to 2.14.1\nFor other affected vendors and products, see CISA's GitHub repository.\n\n\nLog4j: Apache Log4j Security Vulnerabilities\nFor additional information, see joint CSA: Mitigating Log4Shell and Other Log4j-Related Vulnerabilities\n\n\nCISA webpage Apache Log4j Vulnerability Guidance\nCCCS Active exploitation of Apache Log4j vulnerability - Update 7\n\n\n\nCVE-2021-40539\nZoho ManageEngine\nADSelfService Plus version 6113 and prior\nZoho ManageEngine: ADSelfService Plus 6114 Security Fix Release\n\nJoint CSA APT Actors Exploiting Newly Identified Vulnerability in ManageEngine ADSelfService Plus\nCCCS Zoho Security Advisory\n\n\n\nCVE-2021-40444\nMicrosoft\nMultiple Windows products; see Microsoft Security Update Guide: MSHTML Remote Code Execution Vulnerability, CVE-2021-40444\nMicrosoft Security Update Guide: MSHTML Remote Code Execution Vulnerability, CVE-2021-40444\n \n\n\nCVE-2021-34527\nMicrosoft\nMultiple Windows products; see Microsoft Security Update Guide: Windows Print Spooler Remote Code Execution Vulnerability, CVE-2021-34527\nMicrosoft Security Update Guide: Windows Print Spooler Remote Code Execution Vulnerability, CVE-2021-34527\n\nJoint CSA Russian State-Sponsored Cyber Actors Gain Network Access by Exploiting Default Multifactor Authentication Protocols and “PrintNightmare” Vulnerability\nCCCS Alert Windows Print Spooler Vulnerability Remains Unpatched – Update 3\n\n\n\nCVE-2021-34523\nMicrosoft\n\nMicrosoft Exchange Server 2013 Cumulative Update 23\nMicrosoft Exchange Server 2016 Cumulative Updates 19 and 20\nMicrosoft Exchange Server 2019 Cumulative Updates 8 and 9\n\nMicrosoft Security Update Guide: Microsoft Exchange Server Elevation of Privilege Vulnerability, CVE-2021-34523\n\nJoint CSA Iranian Government-Sponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities in Furtherance of Malicious Activities\nACSC Alert Microsoft Exchange ProxyShell Targeting in Australia\n \n\n\n\nCVE-2021-34473\nMicrosoft\nMultiple Exchange Server versions; see: Microsoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-34473\nMicrosoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-34473\n\n\nCVE-2021-31207\nMicrosoft\nMultiple Exchange Server versions; see Microsoft Update Guide: Microsoft Exchange Server Security Feature Bypass Vulnerability, CVE-2021-31207\nMicrosoft Update Guide: Microsoft Exchange Server Security Feature Bypass Vulnerability, CVE-2021-31207\n\n\nCVE-2021-3156\nSudo\nSudo before 1.9.5p2\nSudo Stable Release 1.9.5p2\n \n\n\nCVE-2021-27852\nCheckbox Survey\nCheckbox Survey versions prior to 7\n \n \n\n\nCVE-2021-27065\nMicrosoft Exchange Server\nMultiple versions; see: Microsoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-27065\nMicrosoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-27065\n\nCISA Alert: Mitigate Microsoft Exchange Server Vulnerabilities\nACSC Advisory Active exploitation of Vulnerable Microsoft Exchange servers\nCCCS Alert Active Exploitation of Microsoft Exchange Vulnerabilities - Update 4\n\n\n\nCVE-2021-26858\nMicrosoft\nExchange Server, multiple versions; see Microsoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-26858\nMicrosoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-26858\n\n\nCVE-2021-26857\nMicrosoft\nExchange Server, multiple versions; see Microsoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-26857\nMicrosoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-26857\n\n\nCVE-2021-26855\nMicrosoft\nExchange Server, multiple versions; see Microsoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-26855\nMicrosoft Security Update Guide: Microsoft Exchange Server Remote Code Execution Vulnerability, CVE-2021-26855\n\n\n\nCVE-2021-26084\n \n\nJira Atlassian\nConfluence Server and Data Center, versions 6.13.23, from version 6.14.0 before 7.4.11, from version 7.5.0 before 7.11.6, and from version 7.12.0 before 7.12.5.\nJira Atlassian: Confluence Server Webwork OGNL injection - CVE-2021-26084\n\nACSC Alert Remote code execution vulnerability present in certain versions of Atlassian Confluence\nCCCS Atlassian Security Advisory\n\n\n\nCVE-2021-22893\nPulse Secure\nPCS 9.0R3/9.1R1 and Higher\nPulse Secure SA44784 - 2021-04: Out-of-Cycle Advisory: Multiple Vulnerabilities Resolved in Pulse Connect Secure 9.1R11.4\nCCCS Alert  Active Exploitation of Pulse Connect Secure Vulnerabilities - Update 1\n\n\nCVE-2021-20016\nSonicWall\nSMA 100 devices (SMA 200, SMA 210, SMA 400, SMA 410, SMA 500v)\nSonicWall Security Advisory SNWLID-2021-0001\n \n\n\nCVE-2021-1675\nMicrosoft\nMultiple Windows products; see Microsoft Security Update Guide Windows Print Spooler Remote Code Execution Vulnerability, CVE-2021-1675\nMicrosoft Security Update Guide: Windows Print Spooler Remote Code Execution Vulnerability, CVE-2021-1675\nCCCS Alert Windows Print Spooler Vulnerability Remains Unpatched – Update 3\n\n\nCVE-2020-2509\nQNAP\n\nQTS, multiple versions; see QNAP: Command Injection Vulnerability in QTS and QuTS hero\nQuTS hero h4.5.1.1491 build 20201119 and later\n\nQNAP: Command Injection Vulnerability in QTS and QuTS hero\n \n\n\nCVE-2020-1472\nMicrosoft\nWindows Server, multiple versions; see Microsoft Security Update Guide: Netlogon Elevation of Privilege Vulnerability, CVE-2020-1472\nMicrosoft Security Update Guide: Netlogon Elevation of Privilege Vulnerability, CVE-2020-1472\n\nACSC Alert Netlogon elevation of privilege vulnerability (CVE-2020-1472)\nJoint CSA APT Actors Chaining Vulnerabilities Against SLTT, Critical Infrastructure, and Elections Organizations\nCCCS Alert Microsoft Netlogon Elevation of Privilege Vulnerability - CVE-2020-1472 - Update 1\n\n\n\nCVE-2020-0688\nMicrosoft\nExchange Server, multiple versions; see Microsoft Security Update Guide: Microsoft Exchange Validation Key Remote Code Execution Vulnerability, CVE-2020-0688\nMicrosoft Security Update Guide: Microsoft Exchange Validation Key Remote Code Execution Vulnerability, CVE-2020-0688\n\nCISA Alert Chinese Ministry of State Security-Affiliated Cyber Threat Actor Activity\nJoint CSA Russian State-Sponsored Cyber Actors Target Cleared Defense Contractor Networks to Obtain Sensitive U.S. Defense Information and Technology\nCCCS Alert Microsoft Exchange Validation Key Remote Code Execution Vulnerability\n\n\n\nCVE-2019-19781\nCitrix\n\nADC and Gateway version 13.0 all supported builds before 13.0.47.24\nNetScaler ADC and NetScaler Gateway, version 12.1 all supported builds before 12.1.55.18; version 12.0 all supported builds before 12.0.63.13; version 11.1 all supported builds before 11.1.63.15; version 10.5 all supported builds before 10.5.70.12\nSD-WAN WANOP appliance models 4000-WO, 4100-WO, 5000-WO, and 5100-WO all supported software release builds before 10.2.6b and 11.0.3b\n\nCitrix Security Bulletin CTX267027\n\nJoint CSA APT Actors Chaining Vulnerabilities Against SLTT, Critical Infrastructure, and Elections Organizations\nCISA Alert Chinese Ministry of State Security-Affiliated Cyber Threat Actor Activity\nCCCS Alert Detecting Compromises relating to Citrix CVE-2019-19781\n \n \n \n\n\n\nCVE-2019-18935\nProgress Telerik\nUI for ASP.NET AJAX through 2019.3.1023\nTelerik UI for ASP.NET AJAX Allows JavaScriptSerializer Deserialization\n\nACSC Alert Active exploitation of vulnerability in Microsoft Internet Information Services\n \n\n\n\nCVE-2019-11510\nPulse Secure\nPulse Connect Secure 8.2 before 8.2R12.1, 8.3 before 8.3R7.1, and 9.0 before 9.0R3.4\nPulse Secure: SA44101 - 2019-04: Out-of-Cycle Advisory: Multiple vulnerabilities resolved in Pulse Connect Secure / Pulse Policy Secure 9.0RX\n\nCISA Alert Continued Exploitation of Pulse Secure VPN Vulnerability\nCISA Alert Chinese Ministry of State Security-Affiliated Cyber Threat Actor Activity\nACSC Advisory Recommendations to mitigate vulnerability in Pulse Connect Secure VPN Software\nJoint CSA APT Actors Chaining Vulnerabilities Against SLTT, Critical Infrastructure, and Elections Organizations\nCCCS Alert APT Actors Target U.S. and Allied Networks - Update 1\n\n\n\nCVE-2018-13379\nFortinet\nFortiProxy 2.0.2, 2.0.1, 2.0.0, 1.2.8, 1.2.7, 1.2.6, 1.2.5, 1.2.4, 1.2.3, 1.2.2, 1.2.1, 1.2.0, 1.1.6\nFortinet FortiGuard Labs: FG-IR-20-233\n\nJoint CSA Russian State-Sponsored Cyber Actors Target Cleared Defense Contractor Networks to Obtain Sensitive U.S. Defense Information and Technology\nJoint CSA Iranian Government-Sponsored APT Cyber Actors Exploiting Microsoft Exchange and Fortinet Vulnerabilities in Furtherance of Malicious Activities\nJoint CSA APT Actors Chaining Vulnerabilities Against SLTT, Critical Infrastructure, and Elections Organizations\nACSC Alert APT exploitation of Fortinet Vulnerabilities\nCCCS Alert Exploitation of Fortinet FortiOS vulnerabilities (CISA, FBI) - Update 1\n\n\n\nCVE-2018-0171\nCisco\nSee Cisco Security Advisory: cisco-sa-20180328-smi2\nCisco Security Advisory: cisco-sa-20180328-smi2\nCCCS Action Required to Secure the Cisco IOS and IOS XE Smart Install Feature\n\n\nCVE-2017-11882\nMicrosoft\nOffice, multiple versions; see Microsoft Security Update Guide: Microsoft Office Memory Corruption Vulnerability, CVE-2017-11882\nMicrosoft Security Update Guide: Microsoft Office Memory Corruption Vulnerability, CVE-2017-11882\nCCCS Alert Microsoft Office Security Update\n\n\nCVE-2017-0199\nMicrosoft\nMultiple products; see Microsoft Security Update Guide: Microsoft Office/WordPad Remote Code Execution Vulnerability w/Windows, CVE-2017-0199\nMicrosoft Security Update Guide: Microsoft Office/WordPad Remote Code Execution Vulnerability w/Windows, CVE-2017-0199\nCCCS Microsoft Security Updates\n\n\n\n\nContact Information\n\nU.S. organizations: Organizations can also report anomalous cyber activity and/or cyber incidents 24/7 to report@cisa.gov or by calling 1-844-Say-CISA (1-844-729-2472) and/or to the FBI via your local FBI field office or the FBI’s 24/7 CyWatch at (855) 292-3937 or CyWatch@fbi.gov. When available, please include the following information regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of equipment used for the activity; the name of the submitting company or organization; and a designated point of contact. For NSA client requirements or general cybersecurity inquiries, contact Cybersecurity_Requests@nsa.gov. Australian organizations: visit cyber.gov.au or call 1300 292 371 (1300 CYBER 1) to report cybersecurity incidents and access alerts and advisories. Canadian organizations: report incidents by emailing CCCS at contact@cyber.gc.ca. New Zealand organizations: report cyber security incidents to incidents@ncsc.govt.nz or call 04 498 7654. United Kingdom organizations: report a significant cyber security incident: ncsc.gov.uk/report-an-incident (monitored 24 hours) or, for urgent assistance, call 03000 200 973.\n\nRevisions\n\nApril 27, 2022: Initial Version\n",
  "cves": [
    "CVE-2021-1675",
    "CVE-2019-18935",
    "CVE-2021-27102",
    "CVE-2021-21972",
    "CVE-2021-44228",
    "CVE-2021-22893",
    "CVE-2017-0199",
    "CVE-2017-11882",
    "CVE-2021-35464",
    "CVE-2021-26084",
    "CVE-2021-26855",
    "CVE-2021-40444",
    "CVE-2021-20016",
    "CVE-2021-34523",
    "CVE-2021-31207",
    "CVE-2019-11510",
    "CVE-2021-3156",
    "CVE-2021-27104",
    "CVE-2020-2509",
    "CVE-2021-26858",
    "CVE-2020-1472",
    "CVE-2021-27101",
    "CVE-2021-20038",
    "CVE-2021-27103",
    "CVE-2021-34527",
    "CVE-2019-19781",
    "CVE-2021-26857",
    "CVE-2021-34473",
    "CVE-2021-42237",
    "CVE-2021-40539",
    "CVE-2021-21985",
    "CVE-2018-0171",
    "CVE-2021-27065",
    "CVE-2021-27852",
    "CVE-2020-0688",
    "CVE-2018-13379"
  ],
  "techniques": [],
  "advisory": "aa22-117a",
  "title": "2021 Top Routinely Exploited Vulnerabilities | CISA",
  "source": "cybersecurity-advisories",
  "id": "90629359c55455dbf6205ad357b9e3cf41e0f13d8e841bf8eab4410d5d07945a"
}