{"markdown": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Enhancing Cyber Resilience: Insights from the CISA Healthcare and Public Health Sector Risk and Vulnerability Assessment \\| CISA\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Skip to main content](#main) \n\n\n\n\n\n\n\n\n\n\n\n\n![U.S. flag](/profiles/cisad8_gov/themes/custom/gesso/dist/images/us_flag_small.png)\n\n\n\n An official website of the United States government\n \n\n\n\n Here’s how you know\n \n\n\n\n\n\n Here’s how you know\n \n\n\n\n\n\n\n![Dot gov](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-dot-gov.svg)\n\n\n**Official websites use .gov** \n  \n\n A\n **.gov** \n website belongs to an official government organization in the United States.\n \n\n\n\n\n\n![HTTPS](/profiles/cisad8_gov/themes/custom/gesso/dist/images/icon-https.svg)\n\n\n**Secure .gov websites use HTTPS** \n  \n\n A\n **lock** \n (\n \n\n\n Lock\n \n\n A locked padlock\n \n\n\n\n\n ) or\n **https://** \n means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo Americas Cyber Defense Agency](/sites/default/files/images/SVG/header_logo_tagline_update.svg)](/)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[![CISA Logo](/sites/default/files/images/SVG/mobile_logo_wordmark.svg)](/)\n\n\n\n\n\n\n\n\n\n\n Search\n \n\n\n\n\n\n\n\n\n\n Menu\n \n\n\n\n\n\n\n\n\n\n\n\n\n![America's Cyber Defense Agency](/sites/default/files/images/SVG/header_tagline_mobile_update.svg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Close\n \n\n\n\n\n* Topics\n \n\n\n\n[Topics](/topics) \n\n\n\n\n[Cybersecurity Best Practices](/topics/cybersecurity-best-practices)\n\n\n\n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories)\n\n\n\n\n[Critical Infrastructure Security and Resilience](/topics/critical-infrastructure-security-and-resilience)\n\n\n\n\n[Election Security](/topics/election-security)\n\n\n\n\n[Emergency Communications](/topics/emergency-communications)\n\n\n\n\n[Industrial Control Systems](/topics/industrial-control-systems)\n\n\n\n\n[Information and Communications Technology Supply Chain Security](/topics/information-communications-technology-supply-chain-security)\n\n\n\n\n[Partnerships and Collaboration](/topics/partnerships-and-collaboration)\n\n\n\n\n[Physical Security](/topics/physical-security)\n\n\n\n\n[Risk Management](/topics/risk-management)\n\n\n\n\n\n[How can we help?](/audiences) \n\n\n[Government](/topics/government) \n[Educational Institutions](/topics/educational-institutions) \n[Industry](/topics/industry) \n[State, Local, Tribal, and Territorial](/topics/state-local-tribal-and-territorial) \n[Individuals and Families](/topics/individuals-and-families) \n[Small and Medium Businesses](/topics/small-and-medium-businesses) \n[Find Help Locally](/audiences/find-help-locally) \n[Faith\\-Based Community](/audiences/faith-based-community) \n[Executives](/audiences/executives) \n[High\\-Risk Communities](/audiences/high-risk-communities)\n* [Spotlight](/spotlight)\n* Resources \\& Tools\n \n\n\n\n[Resources \\& Tools](/resources-tools) \n\n\n\n\n[All Resources \\& Tools](/resources-tools/all-resources-tools)\n\n\n\n\n[Services](/resources-tools/services)\n\n\n\n\n[Programs](/resources-tools/programs)\n\n\n\n\n[Resources](/resources-tools/resources)\n\n\n\n\n[Training](/resources-tools/training)\n\n\n\n\n[Groups](/resources-tools/groups)\n* News \\& Events\n \n\n\n\n[News \\& Events](/news-events) \n\n\n\n\n[News](/news-events/news)\n\n\n\n\n[Events](/news-events/events)\n\n\n\n\n[Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)\n\n\n\n\n[Directives](/news-events/directives)\n\n\n\n\n[Request a CISA Speaker](/news-events/request-speaker)\n\n\n\n\n[Congressional Testimony](/news-events/congressional-testimony)\n\n\n\n\n[CISA Conferences](/cisa-conferences)\n\n\n\n\n[CISA Live!](/cisa-live)\n* Careers\n \n\n\n\n[Careers](/careers) \n\n\n\n\n[Benefits \\& Perks](/careers/benefits-perks)\n\n\n\n\n[HireVue Applicant Reasonable Accommodations Process](/careers/hirevue-applicant-reasonable-accommodations-process)\n\n\n\n\n[Hiring](/general-recruitment-and-hiring-faqs)\n\n\n\n\n[Resume \\& Application Tips](/careers/resume-application-tips)\n\n\n\n\n[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)\n\n\n\n\n[Veteran and Military Spouses](/careers/veteran-and-military-spouse-employment-opportunities)\n\n\n\n\n[Work @ CISA](/careers/work-cisa)\n* About\n \n\n\n\n[About](/about) \n\n\n\n\n[Culture](/about/culture)\n\n\n\n\n[Divisions \\& Offices](/about/divisions-offices)\n\n\n\n\n[Regions](/about/regions)\n\n\n\n\n[Leadership](/about/leadership)\n\n\n\n\n[Doing Business with CISA](/doing-business-cisa)\n\n\n\n\n[Site Links](/site-links)\n\n\n\n\n[Reporting Employee and Contractor Misconduct](/reporting-employee-and-contractor-misconduct)\n\n\n\n\n[CISA GitHub](/cisa-github)\n\n\n\n\n[CISA Central](/cisa-central)\n\n\n\n\n[2023 Year In Review](/about/2023YIR)\n\n\n\n\n[Contact Us](/about/contact-us)\n\n\n\n\n\n\n\n\n\n[Free Cyber Services](/resources-tools/resources/free-cybersecurity-services-and-tools \"Free Cyber Services\") \n[\\#protect2024](/protect2024) \n[Secure Our World](/node/18883) \n[Shields Up](/node/8056) \n[Report A Cyber Issue](/node/16591) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Breadcrumb\n \n1. [Home](/)\n2. [News \\& Events](/news-events)\n3. [Cybersecurity Advisories](/news-events/cybersecurity-advisories)\n4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94)\n\n\n\n\n\n\n\n\n Share:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Cybersecurity Advisory\n \nEnhancing Cyber Resilience: Insights from the CISA Healthcare and Public Health Sector Risk and Vulnerability Assessment\n========================================================================================================================\n\n\n\n\n\n Release Date\n \n\n\n December 15, 2023\n \n\n\n\n\n Alert Code\n \n\n AA23\\-349A\n \n\n\n\n\n Related topics:\n \n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories) \n ,\n [Incident Detection, Response, and Prevention](/topics/cyber-threats-and-advisories/incident-detection-response-and-prevention) \n ,\n [Malware, Phishing, and Ransomware](/topics/cyber-threats-and-advisories/malware-phishing-and-ransomware) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n#### Actions to take today to harden your internal environment to mitigate follow\\-on activity after initial access.\n\n\n\n\n\n1. Use phishing\\-resistant multi\\-factor authentication (MFA) for all administrative access.\n2. Verify the implementation of appropriate hardening measures, and change, remove, or deactivate all default credentials.\n3. Implement network segregation controls.\n\n\n\n\n\n\n\n\n### **SUMMARY**\n\n\n\n In January 2023, the Cybersecurity and Infrastructure Security Agency (CISA) conducted a Risk and Vulnerability Assessment (RVA) at the request of a\n [Healthcare and Public Health (HPH) sector](https://www.cisa.gov/topics/critical-infrastructure-security-and-resilience/critical-infrastructure-sectors/healthcare-and-public-health-sector \"Healthcare and Public Health Sector\") \n organization to identify vulnerabilities and areas for improvement. An RVA is a two\\-week penetration test of an entire organization, with one week spent on external testing and one week spent assessing the internal network. As part of the RVA, the CISA assessment team conducted web application, phishing, penetration, database, and wireless assessments. The assessed organization was a large organization deploying on\\-premises software.\n \n\n\n\n During the one\\-week external assessment, the assessment team did not identify any significant or exploitable conditions in externally available systems that may allow a malicious actor to easily obtain initial access to the organization’s network. Furthermore, the assessment team was unable to gain initial access to the assessed organization through phishing. However, during internal penetration testing, the team exploited misconfigurations, weak passwords, and other issues through multiple attack paths to compromise the organization’s domain.\n \n\n\n\n In coordination with the assessed organization, CISA is releasing this Cybersecurity Advisory (CSA) detailing the RVA team’s activities and key findings to provide network defenders and software manufacturers recommendations for improving their organizations’ and customers’ cyber posture, which reduces the impact of follow\\-on activity after initial access. CISA encourages the HPH sector and other critical infrastructure organizations deploying on\\-premises software, as well as software manufacturers, to apply the recommendations in the Mitigations section of this CSA to harden networks against malicious activity and to reduce the likelihood of domain compromise.\n \n\n\n\n Download the PDF version of this report:\n \n\n\n\n\n[AA23\\-349A Enhancing Cyber Resilience: Insights from the CISA Healthcare and Public Health Sector Risk and Vulnerability Assessment](/sites/default/files/2023-12/aa23-349a-risk-vulnerability-assessment-healthcare-public-health-sector.pdf) \n\n (PDF, 744\\.23 KB\n )\n \n\n\n### **TECHNICAL DETAILS**\n\n\n\n**Note:** \n This advisory uses the\n [MITRE ATT\\&CK for Enterprise](https://attack.mitre.org/versions/v14/matrices/enterprise/ \"Enterprise Matrix\") \n framework, version 14\\. See the MITRE ATT\\&CK Tactics and Techniques section for tables of the threat actors’ activity mapped to MITRE ATT\\&CK\n ® \n tactics and techniques with corresponding mitigation and/or detection recommendations. For assistance with mapping malicious cyber activity to the MITRE ATT\\&CK framework, see CISA and MITRE ATT\\&CK’s\n [Best Practices for MITRE ATT\\&CK Mapping](https://www.cisa.gov/news-events/news/best-practices-mitre-attckr-mapping \"Best Practices for MITRE ATT&CK Mapping\") \n and CISA’s\n [Decider Tool](https://github.com/cisagov/Decider/ \"cisagov / decider\") \n .\n \n\n\n#### **Introduction**\n\n\n\n CISA has authority to, upon request, provide analyses, expertise, and other technical assistance to critical infrastructure owners and operators and provide operational and timely technical assistance to federal and non\\-federal entities with respect to cybersecurity risks.\n *See generally* \n 6 U.S.C. §§ 652(c)(5\\), 659(c)(6\\). After receiving a request for an RVA from the organization and coordinating high\\-level details of the engagement with certain personnel at the organization, CISA conducted the RVA in January 2023\\.\n \n\n\n\n During RVAs, CISA tests the security posture of an organization’s network over a two\\-week period to determine the risk, vulnerability, and exploitability of systems and networks. During the first week (the external phase), the team tests public facing systems to identify exploitable vulnerabilities. During the second week (the internal phase), the team determines the susceptibility of the environment to an actor with internal access (e.g., malicious cyber actor or insider threat). The assessment team offers five services:\n \n\n\n* **Web Application Assessment:** \n The assessment team uses commercial and open source tools to identify vulnerabilities in public\\-facing and internal web applications, demonstrating how they could be exploited.\n* **Phishing Assessment:** \n The assessment team tests the susceptibility of staff and infrastructure to phishing attacks and determines what impact a phished user workstation could have on the internal network. The RVA team crafts compelling email pretexts and generates payloads, similar to ones used by threat actors, in order to provide a realistic threat perspective to the organization.\n* **Penetration Testing:** \n The assessment team tests the security of an environment by simulating scenarios an advanced cyber actor may attempt. The team’s goals are to establish a foothold, escalate privileges, and compromise the domain. The RVA team leverages both open source and commercial tools for host discovery, port and service mapping, vulnerability discovery and analysis, and vulnerability exploitation.\n* **Database Assessment:** \n The assessment team uses commercial database tools to review databases for misconfigurations and missing patches.\n* **Wireless Assessment:** \n The assessment team uses specialized wireless hardware to assess wireless access points, connected endpoints, and user awareness for vulnerabilities.\n\n\n\n The assessed organization was in the HPH sector. See Table 1 for services in\\-scope for this RVA.\n \n\n\n\n\n\n*Table 1: In\\-Scope RVA Services* \n\n| **Phase** | **Scope** | **Services** |\n| --- | --- | --- |\n| External Assessment | Publicly available HPH\\-organization endpoints discovered during scanning | Penetration Testing     Phishing Assessment     Web Application Assessment |\n| Internal Assessment | Internally available HPH\\-organization endpoints discovered during scanning | Database Assessment     Penetration Testing     Web Application Assessment     Wireless Assessment |\n\n\n#### **Phase I: External Assessment**\n\n\n##### ***Penetration and Web Application Testing***\n\n\n\n The CISA team did not identify any significant or exploitable conditions from penetration or web application testing that may allow a malicious actor to easily obtain initial access to the organization’s network.\n \n\n\n##### **Phishing Assessment**\n\n\n\n The CISA team conducted phishing assessments that included both user and systems testing.\n \n\n\n\n The team’s phishing assessment was unsuccessful because the organization’s defensive tools blocked the execution of the team’s payloads. The payload testing resulted in most of the team’s payloads being blocked by host\\-based protections through a combination of browser, policy, and antivirus software. Some of the payloads were successfully downloaded to disk without being immediately removed, but upon execution, the antivirus software detected the malicious code and blocked it from running. Some payloads appeared to successfully evade host\\-based protections but did not create a connection to the command and control (C2\\) infrastructure, indicating they may have been incompatible with the system or blocked by border protections.\n \n\n\n\n Since none of the payloads successfully connected to the assessment team’s C2 server, the team conducted a credential harvesting phishing campaign. Users were prompted to follow a malicious link within a phishing email under the pretext of verifying tax information and were then taken to a fake login form.\n \n\n\n\n While twelve unique users from the organization submitted credentials through the malicious form, the CISA team was unable to leverage the credentials because they had limited access to external\\-facing resources. Additionally, the organization had multi\\-factor authentication (MFA) implemented for cloud accounts.\n **Note:** \n At the time of the assessment, the CISA team’s operating procedures did not include certain machine\\-in\\-the\\-middle attacks that could have circumvented the form of MFA in place. However, it is important to note that tools like Evilginx\\[\n [1](https://github.com/kgretzky/evilginx \"kgretzky / evilginx\") \n ] can be leveraged to bypass non\\-phishing resistant forms of MFA. Furthermore, if a user executes a malicious file, opening a connection to a malicious actor’s command and control server, MFA will not prevent the actor from executing commands and carrying out actions under the context of that user.\n \n\n\n#### **Phase II: Internal Assessment**\n\n\n##### ***Database, Web Application, and Wireless Testing***\n\n\n\n The CISA assessment team did not identify any significant or exploitable conditions from database or wireless testing that may allow a malicious actor to easily compromise the confidentiality, integrity, and availability of the tested environment.\n \n\n\n\n The team did identify default credentials \\[\n [T1078\\.001](https://attack.mitre.org/versions/v14/techniques/T1078/001/ \"Valid Accounts: Default Accounts\") \n ] for multiple web interfaces during web application testing and used default printer credentials while penetration testing. (See the Attack Path 2 section for more information.)\n \n\n\n##### ***Penetration Testing***\n\n\n\n The assessment team starts internal penetration testing with a connection to the organization’s network but without a valid domain account. The team’s goal is to compromise the domain by gaining domain admin or enterprise administrator\\-level permissions. Generally, the team first attempts to gain domain user access and then escalate privileges until the domain is compromised. This process is called the “attack path”—acquiring initial access to an organization and escalating privileges until the domain is compromised and/or vital assets for the organization are accessed. The attack path requires specialized expertise and is realistic to what adversaries may do in an environment.\n \n\n\n\n For this assessment, the team compromised the organization’s domain through four unique attack paths, and in a fifth attack path the team obtained access to sensitive information.\n \n\n\n\n See the sections below for a description of the team’s attack paths mapped to the MITRE ATT\\&CK for Enterprise framework. See the Findings section for information on issues that enabled the team to compromise the domain.\n \n\n\n###### ***Attack Path 1***\n\n\n\n The assessment team initiated LLMNR/NBT\\-NS/mDNS/DHCP poisoning \\[\n [T1557\\.001](https://attack.mitre.org/versions/v14/techniques/T1557/001/ \"Adversary-in-the-Middle: LLMNR/NBT-NS Poisoning and SMB Relay\") \n ] with Responder\\[\n [2](https://github.com/lgandx/Responder \"lgandx / Responder\") \n ], which works in two steps:\n \n\n\n1. Responder listens to multicast name resolution queries (e.g.,\n `LLMNR UDP/5355` \n ,\n `NBTNS UDP/137` \n ) \\[\n [T1040](https://attack.mitre.org/versions/v14/techniques/T1040/ \"Network Sniffing\") \n ] and under the right conditions spoofs a response to direct the victim host to a CISA\\-controlled machine on which Responder is running.\n2. Once a victim connects to the machine, Responder exploits the connection to perform malicious functions such as stealing credentials or opening a session on a targeted host \\[\n [T1021](https://attack.mitre.org/versions/v14/techniques/T1021/ \"Remote Services\") \n ].\n\n\n\n With this tool, the CISA team captured fifty\\-five New Technology Local Area Network Manager version 2 (NTLMv2\\) hashes, including the NTLMv2 hash for a service account.\n **Note:** \n NTLMv2 and other variations of the hash protocol are used for clients to join a domain, authenticate between Active Directory forests, authenticate between earlier versions of Windows operating systems (OSs), and authenticate computers that are not normally a part of the domain.\\[\n [3](https://learn.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level \"Network security: LAN Manager authentication level\") \n ] Cracking these passwords may enable malicious actors to establish a foothold in the domain and move laterally or elevate their privileges if the hash belongs to a privileged account.\n \n\n\n\n The service account had a weak password, allowing the team to quickly crack it \\[\n [T1110\\.002](https://attack.mitre.org/versions/v14/techniques/T1110/002/ \"Brute Force: Password Cracking\") \n ] and obtain access to the organization’s domain. With domain access, the CISA assessment team enumerated accounts with a Service Principal Name (SPN) set \\[\n [T1087\\.002](https://attack.mitre.org/versions/v14/techniques/T1087/002/ \"Account Discovery: Domain Account\") \n ]. SPN is the unique service identifier used by Kerberos authentication\\[\n [4](https://learn.microsoft.com/en-us/windows/win32/ad/service-principal-names \"Service principal names\") \n ], and accounts with SPN are susceptible to Kerberoasting.\n \n\n\n\n The CISA team used Impacket’s\\[\n [5](https://github.com/fortra/impacket \"fortra / impacket\") \n ] GetUserSPNs tool to request Ticket\\-Granting Service (TGS) tickets for all accounts with SPN set and obtained their Kerberos hashes \\[\n [T1558\\.003](https://attack.mitre.org/versions/v14/techniques/T1558/003/ \"Steal or Forge Kerberos Tickets: Kerberoasting\") \n ]. Three of these accounts had domain administrator privileges—offline, the team cracked ACCOUNT 1 (which had a weak password).\n \n\n\n\n Using CrackMapExec\\[\n [6](https://github.com/Porchetta-Industries/CrackMapExec \"byt3bl33d3r / CrackMapExec\") \n ], the assessment team used ACCOUNT 1 \\[\n [T1078\\.002](https://attack.mitre.org/versions/v14/techniques/T1078/002/ \"Valid Accounts: Domain Accounts\") \n ] to successfully connect to a domain controller (DC). The team confirmed they compromised the domain because ACCOUNT 1 had\n `READ,WRITE` \n permissions over the\n `C$` \n administrative share \\[\n [T1021\\.002](https://attack.mitre.org/versions/v14/techniques/T1021/002/ \"Remote Services: SMB/Windows Admin Shares\") \n ] (see Figure 1\\).\n \n\n\n\n\n![Figure 1: ACCOUNT 1 Domain Admin Privileges](/sites/default/files/styles/large/public/2023-12/Figure%201%20-%20ACCOUNT%201%20Domain%20Admin%20Privileges.png?itok=cARq9lWe)\n\n\n\n\n*Figure 1: ACCOUNT 1 Domain Admin Privileges* \n\n\n\n\n\n To further demonstrate the impact of compromising ACCOUNT 1, the assessment team used it to access a virtual machine interface. If a malicious actor compromised ACCOUNT 1, they could use it to modify, power off \\[\n [T1529](https://attack.mitre.org/versions/v14/techniques/T1529/ \"System Shutdown/Reboot\") \n ], and/or delete critical virtual machines, including domain controllers and file servers.\n \n\n\n###### ***Attack Path 2***\n\n\n\n The team first mapped the network to identify open web ports \\[\n [T1595\\.001](https://attack.mitre.org/versions/v14/techniques/T1595/001/ \"Active Scanning: Scanning IP Blocks\") \n ], and then attempted to access various web interfaces \\[\n [T1133](https://attack.mitre.org/versions/v14/techniques/T1133/ \"External Remote Services\") \n ] with default administrator credentials. The CISA team was able to log into a printer interface with a default password and found the device was configured with domain credentials to allow employees to save scanned documents to a network share \\[\n [T1080](https://attack.mitre.org/versions/v14/techniques/T1080/ \"Taint Shared Content\") \n ].\n \n\n\n\n While logged into the printer interface as an administrator, the team 1\\) modified the “Save as file” configuration to use File Transfer Protocol (FTP) instead of Server Message Block (SMB) and 2\\) changed the Server Name and Network Path to point to a CISA\\-controlled machine running Responder \\[\n [T1557](https://attack.mitre.org/versions/v14/techniques/T1557/ \"Adversary-in-the-Middle\") \n ]. Then, the team executed a “Connection Test” that sent the username and password over FTP \\[\n [T1187](https://attack.mitre.org/versions/v14/techniques/T1187/ \"Forced Authentication\") \n ] to the CISA machine running Responder, which captured cleartext credentials for a non\\-privileged domain account (ACCOUNT 2\\).\n \n\n\n\n Using ACCOUNT 2 and Certipy\\[\n [7](https://github.com/ly4k/Certipy \"Certipy\") \n ], the team enumerated potential certificate template vulnerabilities found in Active Directory Certificate Services (ADCS).\n **Note:** \n ADCS templates are used to build certificates for different types of servers and other entities on an organization’s network. Malicious actors can exploit template misconfigurations \\[\n [T1649](https://attack.mitre.org/versions/v14/techniques/T1649/ \"Steal or Forge Authentication Certificates\") \n ] to manipulate the certificate infrastructure into issuing fraudulent certificates and/or escalate user privileges to a domain administrator.\n \n\n\n\n The\n `WebServer` \n template was misconfigured to allow all authenticated users permission to:\n \n\n\n* Change the properties of the template (via\n `Object Control Permissions` \n with\n `Write Property Principals` \n set to\n `Authenticated Users` \n ).\n* Enroll for the certificate (via\n `Enrollment Permissions` \n including the\n `Authenticated Users` \n group).\n* Request a certificate for a different user (via\n `EnrolleeSuppliesSubject` \n set as\n `True` \n ).\n\n\n\n See Figure 2 for the displayed certificate template misconfigurations.\n \n\n\n\n\n![Figure 2: Misconfigured Certificate Template Enumerated via Certipy](/sites/default/files/styles/large/public/2023-12/Figure%202%20-%20Misconfigured%20Certificate%20Template%20Enumerated%20via%20Certipy.png?itok=9nEucGuk)\n\n\n\n The template’s\n `Client Authentication` \n was set to\n `False` \n , preventing the CISA assessment team from requesting a certificate that could be used to authenticate to a server in the domain. To demonstrate how this misconfiguration could lead to privilege escalation, the assessment team, leveraging its status as a mere authenticated user, briefly changed the\n `WebServer` \n template properties to set\n `Client Authentication` \n to\n `True` \n so that a certificate could be obtained for server authentication, ensuring the property was set back to its original setting of\n `False` \n immediately thereafter.\n \n\n\n\n The team used Certipy with the ACCOUNT 2 credentials to request a certificate for a Domain Administrator account (ACCOUNT 3\\). The team then authenticated to the domain controller as ACCOUNT 3 with the generated certificate \\[\n [T1550](https://attack.mitre.org/versions/v14/techniques/T1550/ \"Use Alternate Authentication Material\") \n ] and retrieved the NTLM hash for ACCOUNT 3 \\[\n [T1003](https://attack.mitre.org/versions/v14/techniques/T1003/ \"OS Credential Dumping\") \n ]. The team used the hash to authenticate to the domain controller \\[\n [T1550\\.002](https://attack.mitre.org/versions/v14/techniques/T1550/002/ \"Use Alternate Authentication Material: Pass the Hash\") \n ] and validated Domain Administrator privileges, demonstrating compromise of the domain via the\n `WebServer` \n template misconfiguration.\n \n\n\n###### ***Attack Path 3***\n\n\n\n The CISA team used a tool called CrackMapExec to spray easily guessable passwords \\[\n [T1110\\.003](https://attack.mitre.org/versions/v14/techniques/T1110/003/ \"Brute Force: Password Spraying\") \n ] across all domain accounts and obtained two sets of valid credentials for standard domain user accounts.\n \n\n\n\n The assessment team leveraged one of the domain user accounts (ACCOUNT 4\\) to enumerate ADCS via Certipy and found that web enrollment was enabled (see Figure 3\\). If web enrollment is enabled, malicious actors can abuse certain services and/or misconfigurations in the environment to coerce a server to authenticate to an actor\\-controlled computer, which can relay the authentication to the ADCS web enrollment service and obtain a certificate for the server’s account (known as a relay attack).\n \n\n\n\n\n![Figure 3: Misconfigured ADCS Enumerated via Certipy](/sites/default/files/styles/large/public/2023-12/Figure%203%20-%20Misconfigured%20ADCS%20Enumerated%20via%20Certipy.png?itok=1Z-Pu9sU)\n\n\n\n\n*Figure 3: Misconfigured ADCS Enumerated via Certipy* \n\n\n\n\n\n The team used PetitPotam \\[\n [8](https://github.com/topotam/PetitPotam \"topotam / PetitPotam\") \n ] with ACCOUNT 4 credentials to force the organization’s domain controller to authenticate to the CISA\\-operated machine and then used Certipy to relay the coerced authentication attempt to the ADCS web enrollment service to receive a valid certificate for ACCOUNT 5, the domain controller machine account. They used this certificate to acquire a TGT \\[\n [T1558](https://attack.mitre.org/versions/v14/techniques/T1558/ \"Steal or Forge Kerberos Tickets\") \n ] for ACCOUNT 5\\.\n \n\n\n\n With the TGT for ACCOUNT 5, the CISA team used\n `DCSync` \n to dump the NTLM hash \\[\n [T1003\\.006](https://attack.mitre.org/versions/v14/techniques/T1003/006 \"OS Credential Dumping: DCSync\") \n ] for ACCOUNT 3 (a Domain Administrator account \\[see\n [Attack Path 2](#_Attack_Path_2) \n section]), effectively leading to domain compromise.\n \n\n\n###### ***Attack Path 4***\n\n\n\n The CISA team identified several systems on the organization’s network that do not enforce SMB signing. The team exploited this misconfiguration to obtain cleartext credentials for two domain administrator accounts.\n \n\n\n\n First, the team used Responder to capture the NTLMv2 hash for a domain administrator account. Next, they used Impacket’s NTLMrelayx tool\\[\n [9](https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py \"fortra / impacket\") \n ] to relay the authentication for the domain administrator, opening a SOCKS connection on a host that did not enforce SMB signing. The team then used DonPAPI\\[\n [10](https://github.com/login-securite/DonPAPI \"login-securite / DonPAPI\") \n ] to dump cleartext credentials through the SOCKS connection and obtained credentials for two additional domain administrator accounts.\n \n\n\n\n The CISA team validated the privileges of these accounts by checking for\n `READ,WRITE` \n access on a domain controller\n `C$` \n share \\[\n [T1039](https://attack.mitre.org/versions/v14/techniques/T1039/ \"Data from Network Shared Drive\") \n ], demonstrating Domain Administrator access and therefore domain compromise.\n \n\n\n###### ***Attack Path 5***\n\n\n\n The team did vulnerability scanning \\[\n [T1046](https://attack.mitre.org/versions/v14/techniques/T1046/ \"Network Service Discovery\") \n ] and identified a server vulnerable to\n [CVE\\-2017\\-0144](https://nvd.nist.gov/vuln/detail/CVE-2017-0144 \"CVE-2017-0144\") \n (an Improper Input Validation \\[\n [CWE\\-20](https://cwe.mitre.org/data/definitions/20.html \"CWE-20: Improper Input Validation\") \n ] vulnerability known as “EternalBlue” that affects SMB version 1 \\[SMBv1] and enables remote code execution \\[see Figure 4]).\n \n\n\n\n\n![Figure 4: Checking for EternalBlue Vulnerability](/sites/default/files/styles/large/public/2023-12/Figure%204%20-%20Checking%20for%20EternalBlue%20Vulnerability.png?itok=WMjX5PW9)\n\n\n\n\n*Figure 4: Checking for EternalBlue Vulnerability* \n\n\n\n\n\n The CISA assessment team then executed a well\\-known EternalBlue exploit \\[\n [T1210](https://attack.mitre.org/versions/v14/techniques/T1210/ \"Exploitation of Remote Services\") \n ] and established a shell on the server. This shell allowed them to execute commands \\[\n [T1059\\.003](https://attack.mitre.org/versions/v14/techniques/T1059/003/ \"Command and Scripting Interpreter: Windows Command Shell\") \n ] under the context of the local\n `SYSTEM` \n account.\n \n\n\n\n With this local\n `SYSTEM` \n account, CISA dumped password hashes from a Security Account Manager (SAM) database \\[\n [T1003\\.002](https://attack.mitre.org/versions/v14/techniques/T1003/002/ \"OS Credential Dumping: Security Account Manager\") \n ]. The team parsed the hashes and identified one for a local administrator account. Upon parsing the contents of the SAM database dump, the CISA team identified an NTLM hash for the local administrator account, which can be used to authenticate to various services.\n \n\n\n\n The team sprayed the acquired NTLM hash across a network segment and identified multiple instances of password reuse allowing the team to access various resources including sensitive information with the hash.\n \n\n\n#### **Findings**\n\n\n##### ***Key Issues***\n\n\n\n The CISA assessments team identified several findings as potentially exploitable vulnerabilities that could compromise the confidentiality, integrity, and availability of the tested environment. Each finding, listed below, includes a description with supporting details. See the Mitigations section for recommendations on how to mitigate these issues.\n \n\n\n\n The CISA team rated their findings on a severity scale from critical to informational (see Table 2\\).\n \n\n\n\n\n\n*Table 2: Severity Rating Criteria* \n\n| **Severity** | **Description** |\n| --- | --- |\n| Critical | Critical vulnerabilities pose an immediate and severe risk to the environment because of the ease of exploitation and potential impact. Critical items are reported to the customer immediately. |\n| High | Malicious actors may be able to exercise full control on the targeted device. |\n| Medium | Malicious actors may be able to exercise some control of the targeted device. |\n| Low | The vulnerabilities discovered are reported as items of interest but are not normally exploitable. Many low items reported by security tools are not included in this report because they are often informational, unverified, or of minor risk. |\n| Informational | These vulnerabilities are potential weaknesses within the system that cannot be readily exploited. These findings represent areas that the customer should be cognizant of, but do not require any immediate action. |\n\n\n\n The CISA assessment team identified four High severity vulnerabilities and one Medium severity vulnerability during penetration testing that contributed to the team’s ability to compromise the domain. See Table 3 for a list and description of these findings.\n \n\n\n\n\n\n*Table 3: Key Issues Contributing to Domain Compromise* \n\n| **Issue** | **Severity** | **Service** | **Description** |\n| --- | --- | --- | --- |\n| Poor Credential Hygiene: Easily Crackable Passwords | High | Penetration Testing | As part of their assessment, the team reviewed the organization’s domain password policy and found it was weak because the minimum password length was set to 8 characters. Passwords less than 15 characters without randomness are easily crackable, and malicious actors with minimal technical knowledge can use these credentials to access the related services.     The assessment team was able to easily crack many passwords throughout the assessment to move laterally and increase access within the domain. Specifically, the team:  * Cracked the NTLMv2 hash for a domain account, and subsequently accessed the domain. (See the Attack Path 1 section.)    Cracked the password hash (obtained via Kerberoasting) of a domain administrator account and subsequently compromised the domain. (See the Attack Path 1 section.) |\n| Poor Credential Hygiene: Guessable Credentials | High | Penetration Testing | As part of the penetration test, the assessment team tested to see if one or more services is accessible using a list of enumerated usernames alongside an easily guessed password. The objective is to see if a malicious actor with minimal technical knowledge can use these credentials to access the related services, enabling them to move laterally or escalate privileges. Easily guessable passwords are often comprised of common words, seasons, months and/or years, and are sometimes combined with special characters. Additionally, phrases or names that are popular locally (such as the organization being tested or a local sports teams) may also be considered easily guessable.     The team sprayed common passwords against domain user accounts and obtained valid credentials for standard domain users. (See the Attack Path 3 section.) (Cracking was not necessary for this attack.) |\n| Misconfigured ADCS Certificate Templates | High | Penetration Testing | The team identified a WebServer template configured to allow all authenticated users permission to change the properties of the template and obtain certificates for different users. The team exploited the template to acquire a certificate for a Domain Administrator account (see the Attack Path 2 section). |\n| Unnecessary Network Services Enabled | High | Penetration Testing | Malicious actors can exploit security vulnerabilities and misconfigurations in network services, especially legacy services.     The assessment team identified legacy name resolution protocols (e.g., NetBIOS, LLMNR, mDNS) enabled in the network, and abused LLMNR to capture NTLMv2 hashes, which they then cracked and used for domain access. (See the Attack Path 1 section.)     The team also identified an ADCS server with web enrollment enabled and leveraged it to compromise the domain through coercion and relaying. (See Attack Path 3 section.)     Additionally, the team identified hosts with  `WebClient`   and Spooler services, which are often abused by malicious actors to coerce authentication. |\n| Elevated Service Account Privileges | High | Penetration Testing | Applications often require user accounts to operate. These user accounts, which are known as service accounts, often require elevated privileges. If an application or service running with a service account is compromised, an actor may have the same privileges and access as the service account.     The CISA team identified a service account with Domain Administrator privileges and used it to access the domain after cracking its password (See the Attack Path 1 section). |\n| SMB Signing Not Enabled | High | Penetration Testing | The CISA team identified several systems on the organization’s network that do not enforce SMB signing and exploited this for relayed authentication to obtain cleartext credentials for two domain administrator accounts. |\n| Insecure Default Configuration: Default Credentials | Medium | Web Application Assessment | Many off\\-the\\-shelf applications are released with built\\-in administrative accounts using predefined credentials that can often be found with a simple web search. Malicious actors with minimal technical knowledge can use these credentials to access the related services.     During testing, the CISA team identified multiple web interfaces with default administrator credentials and used default credentials for a printer interface to capture domain credentials of a non\\-privileged domain account. (See the Attack Path 2 section.) |\n\n\n\n In addition to the issues listed above, the team identified three High and seven Medium severity findings. These vulnerabilities and misconfigurations may allow a malicious actor to compromise the confidentiality, integrity, and availability of the tested environment. See Table 4 for a list and description of these findings.\n \n\n\n\n\n\n*Table 4: Additional Key Issues* \n\n| **Issue** | **Severity** | **Service** | **Description** |\n| --- | --- | --- | --- |\n| Poor Credential Hygiene: Password Reuse for Administrator and User Accounts | High | Penetration Testing | Elevated password reuse is when an administrator uses the same password for their user and administrator accounts. If the user account password is compromised, it can be used to gain access to the administrative account.     The assessment team identified an instance where the same password was set for an admin user’s administrative account as well as their standard user account. |\n| Poor Credential Hygiene: Password Reuse for Administrator Accounts | Medium | Penetration Testing | If administrator passwords are the same for various administrator accounts, malicious actors can use the password to access all systems that share this credential after compromising one account.     The assessment team found multiple instances of local administrator accounts across various systems using the same password. |\n| Poor Patch Management: Out\\-of\\-Date Software | High | Penetration Testing | Patches and updates are released to address existing and emerging security vulnerabilities, and failure to apply the latest leaves systems open to attack with publicly available exploits. (The risk presented by missing patches and updates depends on the severity of the vulnerability).     The assessment team identified several unpatched systems including instances of  [CVE\\-2019\\-0708](https://nvd.nist.gov/vuln/detail/CVE-2019-0708 \"CVE-2019-0708\")   (known as “BlueKeep”) and EternalBlue.     The team was unable to successfully compromise the systems with BlueKeep, but they did exploit EternalBlue on a server to implant a shell on a server with local  `SYSTEM`   privileges (see the Attack Path 5 section). |\n| Poor Patch Management: Unsupported OS or Application | High | Penetration Testing | Using software or hardware that is no longer supported by the vendor poses a significant security risk because new and existing vulnerabilities are no longer patched). There is no way to address security vulnerabilities on these devices to ensure that they are secure. The overall security posture of the entire network is at risk because an attacker can target these devices to establish an initial foothold into the network.     The assessment team identified end\\-of\\-life (EOL) Windows Server 2008 R2 and Windows Server 2008 and Windows 5\\.1\\. |\n| Use of Weak Authentication Measures | Medium | Penetration Testing | Applications may have weak or broken mechanisms to verify user identity before granting user access to protected functionalities. Malicious actors can exploit these to bypass authentication and gain access to use application resources and functionality.     The assessment team abused the Cisco Smart Install protocol to obtain configuration files for several Cisco devices on the organization’s network. These files contained encrypted Cisco passwords. (The CISA team was unable to crack these passwords within the assessment timeframe.) |\n| PII Disclosure | Medium | Penetration Testing | The assessment team identified an unencrypted Excel file containing PII on a file share. |\n| Hosts with Unconstrained Delegation Enabled Unnecessarily | Medium | Penetration Testing | The CISA team identified two systems that appeared to be configured with  `Unconstrained Delegation`   enabled. Hosts with  `Unconstrained Delegation`   enabled store the Kerberos TGTs of all users that authenticate to that host, enabling actors to steal service tickets or compromise krbtgt accounts and perform  [golden ticket](https://attack.mitre.org/versions/v14/techniques/T1558/001/ \"Steal or Forge Kerberos Tickets: Golden Ticket\")   or  [silver ticket](https://attack.mitre.org/versions/v14/techniques/T1558/002/ \"Steal or Forge Kerberos Tickets: Silver Ticket\")   attacks.     Although the assessment team was unable to fully exploit this configuration because they lost access to one of the vulnerable hosts, it could have led to domain compromise under the right circumstances. |\n| Cleartext Password Disclosure | Medium | Penetration Testing | Storing passwords in cleartext is a security risk because malicious actors with access to these files can use them.     The assessment team identified several unencrypted files on a file share containing passwords for various personal and organizational accounts. |\n| Insecure File Shares | Medium | Penetration Testing | Access to sensitive data (e.g., data related to business functions, IT functions, and/or personnel) should be restricted to only certain authenticated and authorized users.     The assessment team found an unsecured directory on a file share with sensitive IT information. The directory was accessible to all users in the domain group. Malicious actors with user privileges could access and/or exfiltrate this data. |\n\n\n##### *Additional Issues*\n\n\n\n The CISA team identified one Informational severity within the organization’s networks and systems. These issues may allow a malicious actor to compromise the confidentiality, integrity, and availability of the tested environment, but are not readily exploitable. The information provided is to encourage the stakeholder to investigate these issues further to adjust their environments or eliminate certain aspects as needed, but the urgency is low.\n \n\n\n\n\n\n*Table 5: Informational Issues That CISA Team Noted* \n\n| **Issue** | **Severity** | **Service** | **Description** |\n| --- | --- | --- | --- |\n| Overly Permissive Accounts | Informational | Penetration Testing | Account privileges are intended to control user access to host or application resources to limit access to sensitive information in support of a least\\-privilege security model. When user (or other) accounts have high privileges, users can see and/or do things they normally should not, and malicious actors can exploit this to access host and application resources.     The assessment team identified Active Directory objects where the  `Human Resources`   group appeared to be part of the privileged  `Account Operators`   group. This may have provided elevated privileges to accounts in the  `Human Resources`   group. (The CISA team was unable to validate and demonstrate the potential impact of this relationship within the assessment period). |\n\n\n##### ***Noted Strengths***\n\n\n\n The CISA team noted the following business, technical, and administrative components that enhanced the network security posture of the tested environment:\n \n\n\n* The organization’s network was found to have several strong, security\\-oriented characteristics such as:\n\t+ Effective antivirus software;\n\t+ Endpoint detection and response capabilities;\n\t+ Good policies and best practices for protecting users from malicious files including not allowing users to mount ISO files;\n\t+ Minimal external attack surface, limiting an adversary’s ability to leverage external vulnerabilities to gain initial access to the organization’s networks and systems;\n\t+ Strong wireless protocols;\n\t+ And network segmentation.\n* The organization’s security also demonstrated their ability to detect some of the CISA team's actions throughout testing and overall situational awareness through the use of logs and alerts.\n* The organization used MFA for cloud accounts. The assessment team obtained cloud credentials via a phishing campaign but was unable to use them because of MFA prompts.\n\n\n### **MITIGATIONS**\n\n\n#### **Network Defenders**\n\n\n\n CISA recommends HPH Sector and other critical infrastructure organizations implement the mitigations in Table 6 to mitigate the issues listed in the Findings section of this advisory. These mitigations align with the Cross\\-Sector Cybersecurity Performance Goals (CPGs) developed by CISA and the National Institute of Standards and Technology (NIST). The CPGs provide a minimum set of practices and protections that CISA and NIST recommend all organizations implement. CISA and NIST based the CPGs on existing cybersecurity frameworks and guidance to protect against the most common and impactful threats, tactics, techniques, and procedures. Visit CISA’s\n [Cross\\-Sector Cybersecurity Performance Goals](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\") \n for more information on the CPGs, including additional recommended baseline protections.\n \n\n\n\n\n\n*Table 6: Recommendations to Mitigate Identified Issues* \n\n| **Issue** | **Recommendation** |\n| --- | --- |\n| Poor Credential Hygiene: Easily Crackable Passwords | * **Follow National Institute of Standards and Technologies (NIST)**  [**guidelines**](https://csrc.nist.gov/publications/detail/sp/800-63b/final \"Digital Identity Guidelines: Authentication and Lifecycle Management\") **when creating password policies**   to enforce use of “strong” passwords that cannot be cracked \\[  [CPG 2\\.B](/sites/default/files/2023-03/CISA_CPG_REPORT_v1.0.1_FINAL.pdf \"Cross-Sector Cybersecurity Performance Goals March 2023 Update\")    ]    .\\[  [11](https://csrc.nist.gov/pubs/sp/800/63/b/upd2/final \"Digital Identity Guidelines: Authentication and Lifecycle Management\")   ] Consider using password managers to generate and store passwords. * **Use “strong” passphrases for private keys**   to make cracking resource intensive \\[  [CPG 2\\.B](/sites/default/files/2023-03/CISA_CPG_REPORT_v1.0.1_FINAL.pdf \"Cross-Sector Cybersecurity Performance Goals March 2023 Update\")    ]    . Do not store credentials within the registry in Windows systems. Establish an organizational policy that prohibits password storage in files. * **Ensure adequate password length (ideally 15\\+ characters) and complexity requirements for Windows service accounts**   and implement passwords with periodic expiration on these accounts \\[  [CPG 2\\.B](/sites/default/files/2023-03/CISA_CPG_REPORT_v1.0.1_FINAL.pdf \"Cross-Sector Cybersecurity Performance Goals March 2023 Update\")   ]. Use Managed Service Accounts, when possible, to manage service account passwords automatically. |\n| Poor Credential Hygiene: Guessable Credentials | * **Do not reuse local administrator account passwords across systems**   . Ensure that passwords are “strong” and unique \\[  [CPG 2\\.C](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. * **Use phishing\\-resistant multi\\-factor authentication (MFA) for all administrative access**   , including domain administrative access \\[  [CPG 2\\.H](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. If an organization that uses mobile push\\-notification\\-based MFA is unable to implement phishing\\-resistant MFA, use number matching to mitigate MFA fatigue. For more information, see CISA fact sheets on  [Implementing Phishing\\-Resistant MFA](/sites/default/files/publications/fact-sheet-implementing-phishing-resistant-mfa-508c.pdf \"mplementing Phishing-Resistant MFA\")   and  [Implementing Number Matching in MFA Applications](/sites/default/files/publications/fact-sheet-implement-number-matching-in-mfa-applications-508c.pdf \"Implementing Number Matching in MFA Applications\")   . |\n| Misconfigured ADCS Certificate Templates | * **Restrict enrollment rights in templates to only those users or groups that require it**   . Remove the  `Enrollee Supplies Subject`   flag from templates if it is not necessary or enforce manager approval if required. Consider removing  `Write Owner, Write DACL`   and  `Write Property`   permissions from low\\-privilege groups, such as  `Authenticated Users`   where those permissions are not needed. |\n| Unnecessary Network Services Enabled | * **Ensure that only ports, protocols, and services with validated business needs are running on each system**   . Disable deprecated protocols (including NetBIOS, LLMNR, and mDNS) on the network that are not strictly necessary for business functions, or limit the systems and services that use the protocol, where possible \\[  [CPG 2\\.W](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. * **Disable the**  `WebClient` **and Spooler services**   where possible to minimize risk of coerced authentication. * **Disable ADCS web\\-enrollment services**   . If this service cannot be disabled, disable NTLM authentication to prevent malicious actors from performing NTLM relay attacks or abusing the Spooler and  `WebClient`   services to coerce and relay authentication to the web\\-enrollment service. |\n| Elevated Service Account Privileges | * **Run daemon applications using a non\\-Administrator account**   when appropriate. * **Configure Service accounts with only the permissions necessary for the services they operate**   . * To mitigate Kerberoasting attacks,  **use AES or stronger encryption**   instead of RC4 for Kerberos hashes \\[  [CPG 2\\.K](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. RC4 is considered weak encryption. |\n| SMB Signing Not Enabled | * **Require SMB signing for both SMB client and server on all systems**   to prevent certain adversary\\-in\\-the\\-middle and pass\\-the\\-hash attacks. See Microsoft’s  [Overview of Server Message Block signing](https://learn.microsoft.com/en-us/troubleshoot/windows-server/networking/overview-server-message-block-signing \"Overview of Server Message Block signing\")   for more information. |\n| Insecure Default Configuration: Default Credentials | * **Verify the implementation of appropriate hardening measures, and change, remove, or deactivate all default credentials**   \\[  [CPG 2\\.A](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. * Before deploying any new devices in a networked environment,  **change all default passwords for applications, operating systems, routers, firewalls, wireless access points, and other systems**   to have values consistent with administration\\-level accounts \\[  [CPG 2\\.A](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. |\n| Poor Credential Hygiene: Password Reuse for Administrator and User Accounts | * **Discontinue reuse or sharing of administrative credentials**   among user/administrative accounts \\[  [CPG 2\\.C](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. * **Use unique credentials across workstations**   , when possible,    in accordance with applicable federal standards, industry best practices, and/or agency\\-defined requirements. * **Train users, especially privileged users, against password reuse**   \\[  [CPG 2\\.I](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. |\n| Poor Credential Hygiene: Password Reuse for Administrator Accounts | * **Discontinue reuse or sharing of administrative credentials among systems**   \\[  [CPG 2\\.C](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. When possible, use unique credentials across all workstations in accordance with applicable federal standards, industry best practices, and/or agency\\-defined requirements. * **Implement a security awareness program**   that focuses on the methods commonly used in intrusions that can be blocked through individual action \\[  [CPG 2\\.I](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. * **Implement Local Administrator Password Solution (LAPS)**   where possible if your OS is older than Windows Server 2019 and Windows 10 as these versions do not have LAPS built in.  **Note:**   The authoring organizations recommend organizations upgrade to Windows Server 2019 and Windows 10 or greater. |\n| Poor Patch Management: Out\\-of\\-Date Software | * **Enforce consistent patch management**   across all systems and hosts within the network environment \\[  [CPG 1\\.E](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. * Where patching is not possible due to limitations,  **implement network segregation controls**   \\[  [CPG 2\\.F](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ] to limit exposure of the vulnerable system or host. * **Consider deploying automated patch management tools and software update tools**   for operating system and software/applications on all systems for which such tools are available and safe. |\n| Poor Patch Management: Unsupported OS or Application | * **Evaluate the use of unsupported hardware and software and discontinue**   where possible. If discontinuing the use of unsupported hardware and software is not possible, implement additional network protections to mitigate the risk. |\n| Use of Weak Authentication Measures | * **Require phishing\\-resistant MFA for all user accounts that have access to sensitive data or systems**   . If MFA is not possible, it is recommended to, at a minimum, configure a more secure password policy by aligning with guidelines put forth by trusted entities such as NIST \\[  [CPG 2\\.H](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. |\n| PII Disclosure | * **Implement a process to review files and systems for insecure handling of PII**   \\[  [CPG 2\\.L](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ].    Properly secure or remove the information. Conduct periodic scans of server machines using automated tools to determine whether sensitive data (e.g., personally identifiable information, health, credit card, or classified information) is present on the system in cleartext. * **Encrypt PII and other sensitive data**   , and train users who handle sensitive data to utilize best practices for encrypting data and storing it securely. If sensitive data must be stored on shares or other locations, restrict access to these locations as much as possible through access controls and network segmentation \\[  [CPG 2\\.F, 2\\.K, 2\\.L](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. |\n| Hosts with Unconstrained Delegation Enabled Unnecessarily | * **Remove**  `Unconstrained Delegation` **from all servers**   . If  `Unconstrained Delegation`   functionality is required, upgrade operating systems and applications to leverage other approaches (e.g., configure  `Constrained Delegation`   , enable the  `Account is sensitive and cannot be delegated`   option) or explore whether systems can be retired or further isolated from the enterprise. CISA recommends Windows Server 2019 or greater. |\n| Cleartext Password Disclosure | * **Implement a review process for files and systems to look for cleartext account credentials**   . When credentials are found, remove or change them to maintain security \\[  [CPG 2\\.L](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. * **Conduct periodic scans of server machines using automated tools to determine whether sensitive data**   (e.g., personally identifiable information, health, credit card, or classified information) is present on the system in cleartext. Consider implementing a secure password manager solution in cases where passwords need to be stored \\[  [CPG 2\\.L](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. |\n| Insecure File Shares | * **Restrict access to file shares containing sensitive data**   to only certain authenticated and authorized users \\[  [CPG 2\\.L](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\")   ]. |\n\n\n\n Additionally, CISA recommends that HPH sector organizations implement the following strategies to mitigate cyber threats:\n \n\n\n* **Mitigation Strategy \\#1 Asset Management and Security:** \n\t+ CISA recommends that HPH sector organizations implement and maintain an asset management policy to reduce the risk of exposing vulnerabilities, devices, or services that could be exploited by threat actors to gain unauthorized access, steal sensitive data, or disrupt critical services. The focus areas for this mitigation strategy include asset management and asset security, addressing asset inventory, procurement, decommissioning, and network segmentation as they relate to hardware, software, and data assets.\n* **Mitigation Strategy \\#2 Identity Management and Device Security:** \n\t+ CISA recommends entities secure their devices and digital accounts and manage their online access to protect sensitive data and PII/PHI from compromise. The focus areas for this mitigation strategy include email security, phising prevention, access management, password policies, data protection and loss prevention, and device logs and monitoring solutions.\n* **Mitigation Strategy \\#3 Vulnerability, Patch, and Configuration Management:** \n\t+ CISA recommends entities mitigate known vulnerabilities and establish secure configuration baselines to reduce the likelihood of threat actors exploiting known vulnerabilities to breach organizational networks. The focus areas for this mitigation strategy include vulnerability and patch Management, and configuration and change management.\n\n\n\n For more information on these mitigations strategies, see CISA’s\n [Healthcare and Public Health Sector](https://www.cisa.gov/topics/critical-infrastructure-security-and-resilience/critical-infrastructure-sectors/healthcare-and-public-health-sector \"Healthcare and Public Health Sector\") \n webpage.\n \n\n\n#### **Software Manufacturers**\n\n\n\n The above mitigations apply to HPH sector and other critical infrastructure organizations with on\\-premises or hybrid environments. Recognizing that insecure software is the root cause of the majority of these flaws, and that the responsibility should not be on the end user, CISA urges software manufacturers to implement the following to reduce the prevalence of misconfigurations, weak passwords, and other weaknesses identified and exploited through the assessment team:\n \n\n\n* **Embed security into product architecture throughout the** \n**entire** \n software development lifecycle (SDLC).\n* **Eliminate default passwords** \n . Do not provide software with default passwords. To eliminate default passwords, require administrators set a “strong” password \\[\n [CPG 2\\.B](https://www.cisa.gov/cross-sector-cybersecurity-performance-goals \"Cross-Sector Cybersecurity Performance Goals\") \n ] during installation and configuration.\n* **Create secure configuration templates** \n . Provide configuration templates with certain safe settings based on an organization’s risk appetite (e.g., low, medium, and high security templates). Support these templates with hardening guides based on the risks the manufacturer has identified. The default configuration should be a secure one, and organizations should need to opt in if they desire a less secure configuration.\n* **Design products so that the compromise of a single security control does not result in compromise of the entire system** \n . For example, narrowly provision user privileges by default and employ ACLs to reduce the impact of a compromised account. This will make it more difficult for a malicious cyber actor to escalate privileges and move laterally.\n* **Mandate MFA,** \n[**ideally phishing\\-resistant MFA**](/sites/default/files/publications/fact-sheet-implementing-phishing-resistant-mfa-508c.pdf \"Implementing Phishing-Resistant MFA\")\n**, for privileged users** \n and make MFA a default, rather than opt\\-in, feature.\n\n\n\n These mitigations align with tactics provided in the joint guide\n [Shifting the Balance of Cybersecurity Risk: Principles and Approaches for Secure by Design Software](/sites/default/files/2023-10/Shifting-the-Balance-of-Cybersecurity-Risk-Principles-and-Approaches-for-Secure-by-Design-Software.pdf \"Shifting the Balance of Cybersecurity Risk: Principles and Approaches for Secure by Design Software\") \n . CISA urges software manufacturers to take ownership of improving the security outcomes of their customers by applying these and other secure by design tactics. By using secure by design tactics, software manufacturers can make their product lines secure “out of the box” without requiring customers to spend additional resources making configuration changes, purchasing security software and logs, monitoring, and making routine updates.\n \n\n\n\n For more information on secure by design, see CISA’s\n [Secure by Design](https://www.cisa.gov/securebydesign \"Secure by Design\") \n webpage. For more information on common misconfigurations and guidance on reducing their prevalence, see the joint advisory\n [NSA and CISA Red and Blue Teams Share Top Ten Cybersecurity Misconfigurations](https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-278a \"NSA and CISA Red and Blue Teams Share Top Ten Cybersecurity Misconfigurations\") \n .\n \n\n\n### **VALIDATE SECURITY CONTROLS**\n\n\n\n In addition to applying the listed mitigations, CISA recommends exercising, testing, and validating your organization’s security program against the threat behaviors mapped to the MITRE ATT\\&CK for Enterprise framework in this advisory. CISA recommends testing your existing security controls inventory to assess how they perform against the ATT\\&CK techniques described in this advisory.\n \n\n\n\n To get started:\n \n\n\n1. Select an ATT\\&CK technique described in this advisory (see Tables 7 – 16\\).\n2. Align your security technologies against the technique.\n3. Test your technologies against the technique.\n4. Analyze your detection and prevention technologies’ performance.\n5. Repeat the process for all security technologies to obtain a set of comprehensive performance data.\n6. Tune your security program, including people, processes, and technologies, based on the data generated by this process.\n\n\n\n CISA recommends continually testing your security program, at scale, in a production environment to ensure optimal performance against the MITRE ATT\\&CK techniques identified in this advisory.\n \n\n\n### **RESOURCES**\n\n\n* For consolidated findings from the RVAs by Fiscal Year mapped to MITRE ATT\\&CK, see CISA’s\n [Risk and Vulnerability Assessments](https://www.cisa.gov/resources-tools/resources/risk-and-vulnerability-assessments \"Risk and Vulnerability Assessments\") \n page.\n* See joint CSA\n [NSA and CISA Red and Blue Teams Share Top Ten Cybersecurity Misconfigurations](https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-278a \"NSA and CISA Red and Blue Teams Share Top Ten Cybersecurity Misconfigurations\") \n for information on the most common cybersecurity misconfigurations in large organizations and TTPs actors use to exploit these misconfigurations.\n* See CISA’s\n [Healthcare and Public Health Sector](https://www.cisa.gov/topics/critical-infrastructure-security-and-resilience/critical-infrastructure-sectors/healthcare-and-public-health-sector \"Healthcare and Public Health Sector\") \n webpage.\n* See CISA’s\n [RedEye tool on CISA’s GitHub page](https://github.com/cisagov/RedEye/ \"cisagov / RedEye\") \n . RedEye is an interactive open\\-source analytic tool used to visualize and report red team command and control activities. See CISA’s\n [RedEye tool overview video](https://www.youtube.com/watch?v=b_ARIVl4BkQ \"Redeye - Visualizing Penetration Testing Engagements\") \n for more information.\n\n\n### **REFERENCES**\n\n\n\n \\[1]\n [Github \\| kgretzky / evilginx](https://github.com/kgretzky/evilginx \"kgretzky / evilginx\") \n  \n\n \\[2]\n [Github \\| lgandx / Responder](https://github.com/lgandx/Responder \"lgandx / Responder\") \n  \n\n \\[3]\n [Network security LAN Manager authentication level \\- Windows Security \\| Microsoft Learn](https://learn.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level \"Network security: LAN Manager authentication level\") \n  \n\n \\[4]\n [Service principal names \\- Win32 apps \\| Microsoft Learn](https://learn.microsoft.com/en-us/windows/win32/ad/service-principal-names \"Service principal names\") \n  \n\n \\[5]\n [Github \\| fortra / impacket](https://github.com/fortra/impacket \"fortra / impacket\") \n  \n\n 6]\n [Github \\| byt3bl33d3r / CrackMapExec](https://github.com/byt3bl33d3r/CrackMapExec \"byt3bl33d3r / CrackMapExec\") \n  \n\n \\[7]\n [Github \\| ly4k / Certipy](https://github.com/ly4k/Certipy \"ly4k / Certipy\") \n  \n\n \\[8]\n [Github \\| topotam / PetitPotam](https://github.com/topotam/PetitPotam \"topotam / PetitPotam\") \n  \n\n \\[9]\n [Github \\| fortra / impacket / examples](https://github.com/fortra/impacket/blob/master/examples/ntlmrelayx.py \"fortra / impacket / examples\") \n  \n\n \\[10]\n [Github \\| login\\-securite / DonPAPI](https://github.com/login-securite/DonPAPI \"login-securite / DonPAPI\") \n  \n\n \\[11]\n [SP 800\\-63B, Digital Identity Guidelines: Authentication and Lifecycle Management \\| CSRC (nist.gov)](https://csrc.nist.gov/pubs/sp/800/63/b/upd2/final \"Digital Identity Guidelines: Authentication and Lifecycle Management\") \n\n\n\n### **APPENDIX: MITRE ATT\\&CK TACTICS AND TECHNIQUES**\n\n\n\n\n\n*Table 7: CISA Team ATT\\&CK Techniques for Reconnaissance* \n\n| **Reconnaissance** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Active Scanning: Scanning IP Blocks | [T1595\\.001](https://attack.mitre.org/versions/v14/techniques/T1595/001/ \"Active Scanning: Scanning IP Blocks\") | The CISA team first mapped the network to identify open web ports. |\n\n\n\n\n\n*Table 8: CISA Team ATT\\&CK Techniques for Initial Access* \n\n| **Initial Access** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Valid Accounts: Default Accounts | [T1078\\.001](https://attack.mitre.org/versions/v14/techniques/T1078/001/ \"Valid Accounts: Default Accounts\") | The CISA team did identify default credentials for multiple web interfaces during web application testing and used default printer credentials while penetration testing. |\n| External Remote Services | [T1133](https://attack.mitre.org/versions/v14/techniques/T1133/ \"External Remote Services\") | The CISA team attempted to access various web interfaces with default administrator credentials. |\n\n\n\n\n\n*Table 9: CISA Team ATT\\&CK Techniques for Execution* \n\n| **Execution** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Command\\-Line Interface | [T1059](https://attack.mitre.org/versions/v14/techniques/T1059/ \"Command-Line Interface\") | The CISA team accessed a virtual machine interface enabling them to modify, power off, and/or delete critical virtual machines including domain controllers, file servers, and servers. |\n| Command and Scripting Interpreter: Windows Command Shell | [T1059\\.003](https://attack.mitre.org/versions/v14/techniques/T1059/003/ \"Command and Scripting Interpreter: Windows Command Shell\") | The CISA team used a webshell that allowed them to execute commands under the context of the local  `SYSTEM`   account. |\n\n\n\n\n\n*Table 10: CISA Team ATT\\&CK Techniques for Privilege Escalation* \n\n| **Privilege Escalation** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Valid Accounts: Domain Accounts | [T1078\\.002](https://attack.mitre.org/versions/v14/techniques/T1078/002/ \"Valid Accounts: Domain Accounts\") | The CISA team used CrackMapExec to use ACCOUNT 1 to successfully connect to a domain controller (DC). |\n\n\n\n\n\n*Table 11: CISA Team ATT\\&CK Techniques for Defense Evasion* \n\n| **Defense Evasion** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Use Alternate Authentication Material | [T1550](https://attack.mitre.org/versions/v14/techniques/T1550/ \"Use Alternate Authentication Material\") | The CISA team authenticated to the domain controller as ACCOUNT 3 with the generated certificate. |\n\n\n\n\n\n*Table 12: CISA Team ATT\\&CK Techniques for Credential Access* \n\n| **Credential Access** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| LLMNR/NBT\\-NS Poisoning and Relay | [T1557\\.001](https://attack.mitre.org/versions/v14/techniques/T1557/001/ \"Adversary-in-the-Middle: LLMNR/NBT-NS Poisoning and SMB Relay\") | The CISA team initiated a LLMNR/NBT\\-NS/mDNS/DHCP poisoning tool to spoof a connection to the organization’s server for forced access. |\n| Brute Force: Password Cracking | [T1110\\.002](https://attack.mitre.org/versions/v14/techniques/T1110/002/ \"Brute Force: Password Cracking\") | The CISA team cracked a service account with a weak password, giving them access to it. |\n| Steal or Forge Kerberos Tickets: Kerberoasting | [T1558\\.003](https://attack.mitre.org/versions/v14/techniques/T1558/003/ \"Steal or Forge Kerberos Tickets: Kerberoasting\") | The CISA team gained access to domain accounts because any domain user can request a TGS ticket for domain accounts. |\n| Adversary\\-in\\-the\\-Middle | [T1557](https://attack.mitre.org/versions/v14/techniques/T1557/001/ \"Adversary-in-the-Middle\") | The CISA team modified the “Save as file” configuration, to use File Transfer Protocol (FTP) instead of Server Message Block (SMB) and changed the Server Name and Network Path to point to a CISA\\-controlled machine running Responder. |\n| Forced Authentication | [T1187](https://attack.mitre.org/versions/v14/techniques/T1187/ \"Forced Authentication\") | The CISA team executed a “Connection Test” that sent the username and password over FTP. |\n| Steal or Forge Authentication Certificates | [T1649](https://attack.mitre.org/versions/v14/techniques/T1649/ \"Steal or Forge Authentication Certificates\") | The CISA team used  `Certipy`   to enumerate the ADCS certificate template vulnerabilities, allowing them to obtain certificates for different users. |\n| OS Credential Dumping | [T1003](https://attack.mitre.org/versions/v14/techniques/T1003/ \"OS Credential Dumping\") | The CISA team retrieved the NTLM hash for ACCOUNT 3\\. |\n| Use Alternate Authentication Material: Pass the Hash | [T1550\\.002](https://attack.mitre.org/versions/v14/techniques/T1550/002/ \"Use Alternate Authentication Material: Pass the Hash\") | The CISA team used the hash to authenticate to the domain controller and validated Domain Administrator privileges, demonstrating compromise of the domain. |\n| Brute Force: Password Spraying | [T1110\\.003](https://attack.mitre.org/versions/v14/techniques/T1110/003 \"Brute Force: Password Spraying\") | The CISA team used a tool called  `CrackMapExec`   to spray easily guessable passwords across all domain accounts, giving them two sets of valid credentials. |\n| Steal or Forge Kerberos Tickets | [T1558](https://attack.mitre.org/versions/v14/techniques/T1558/003/ \"Steal or Forge Kerberos Tickets\") | The CISA team used this certificate to acquire a TGT for ACCOUNT 5\\. |\n| OS Credential Dumping: DCSync | [T1003\\.006](https://attack.mitre.org/versions/v14/techniques/T1003/006 \"OS Credential Dumping: DCSync\") | The CISA team used  `DCSync`   to dump the NTLM hash for ACCOUNT 3 (a Domain Administrator account), effectively leading to domain compromise. |\n| OS Credential Dumping: Security Account Manager | [T1003\\.002](https://attack.mitre.org/versions/v14/techniques/T1003/002/ \"OS Credential Dumping: Security Account Manager\") | The CISA team dumped password hashes from a Security Account Manager (SAM) database. |\n\n\n\n\n\n*Table 13: CISA Team ATT\\&CK Techniques for Discovery* \n\n| **Discovery** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Network Sniffing | [T1040](https://attack.mitre.org/versions/v14/techniques/T1040/ \"Network Sniffing\") | The CISA team spoofed a response to direct the victim host to a CISA\\-controlled machine on which Responder is running. |\n| Account Discovery: Domain Account | [T1087\\.002](https://attack.mitre.org/versions/v14/techniques/T1087/002/ \"Account Discovery: Domain Account\") | The CISA team enumerated accounts with a Service Principal Name (SPN) set with their domain access. |\n| Network Service Scanning | [T1046](https://attack.mitre.org/versions/v14/techniques/T1046/ \"Network Service Scanning\") | The CISA team canned the organization’s network to identify open web ports to see where they could leverage the default credentials they had. |\n\n\n\n\n\n*Table 14: CISA Team ATT\\&CK Techniques for Lateral Movement* \n\n| **Lateral Movement** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Remote Services | [T1021](https://attack.mitre.org/versions/v14/techniques/T1021/ \"Remote Services\") | The CISA team exploited its Responder to perform malicious functions, such as stealing credentials or opening a session on a targeted host. |\n| SMB/Windows Admin Shares | [T1021\\.002](https://attack.mitre.org/versions/v14/techniques/T1021/002/ \" SMB/Windows Admin Shares\") | The CISA team confirmed they compromised the domain because ACCOUNT 1 had  `READ,WRITE`   permissions over the  `C$`   administrative share. |\n| Taint Shared Content | [T1080](https://attack.mitre.org/versions/v14/techniques/T1080/ \"Taint Shared Content\") | The CISA team found the device was configured with domain credentials to allow employees to save scanned documents to a network share. |\n| Exploitation of Remote Services | [T1210](https://attack.mitre.org/versions/v14/techniques/T1210/ \"Exploitation of Remote Services\") | The CISA team then executed a well\\-known EternalBlue exploit and established a shell on the server. |\n\n\n\n\n\n*Table 15: CISA Team ATT\\&CK Techniques for Collection* \n\n| **Collection** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| Data from Network Shared Drive | [T1039](https://attack.mitre.org/versions/v14/techniques/T1039/ \"Data from Network Shared Drive\") | The CISA team obtained credentials for cleartext, hashes, and from files. |\n\n\n\n\n\n*Table 16: CISA Team ATT\\&CK Techniques for Impact* \n\n| **Collection** |  |  |\n| --- | --- | --- |\n| **Technique Title** | **ID** | **Use** |\n| System Shutdown/Reboot | [T1529](https://attack.mitre.org/versions/v14/techniques/T1529/ \"System Shutdown/Reboot\") | The CISA team assessed that with ACCOUNT 1, they could use it to modify, power off, and/or delete critical virtual machines, including domain controllers and file servers. |\n\n\n### **VERSION HISTORY**\n\n\n\n December 14, 2023: Initial version.\n \n\n\n\n\n\n\n\n\n\n\n This product is provided subject to this\n [Notification](/notification \"Follow link\") \n and this\n [Privacy \\& Use](/privacy-policy \"Follow link\") \n policy.\n \n\n\n\n\n\n\n\n\n\n\n\n### Tags\n\n\n\n\n Topics\n \n\n[Cyber Threats and Advisories](/topics/cyber-threats-and-advisories) \n ,\n [Incident Detection, Response, and Prevention](/topics/cyber-threats-and-advisories/incident-detection-response-and-prevention) \n ,\n [Malware, Phishing, and Ransomware](/topics/cyber-threats-and-advisories/malware-phishing-and-ransomware) \n ,\n [Critical Infrastructure Security and Resilience](/topics/critical-infrastructure-security-and-resilience) \n\n\n\n\n Sector\n \n\n[Healthcare and Public Health Sector](/topics/critical-infrastructure-security-and-resilience/critical-infrastructure-sectors/healthcare-and-public-health-sector) \n\n\n\n\n MITRE ATT\\&CK TTP\n \n\n Collection (TA0009\\), Credential Access (TA0006\\), Defense Evasion (TA0005\\), Discovery (TA0007\\), Execution (TA0002\\), Impact (TA0040\\), Initial Access (TA0001\\), Lateral Movement (TA0008\\), Privilege Escalation (TA0004\\), Reconnaissance (TA0043\\)\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease share your thoughts\n--------------------------\n\n\n\n We recently updated our anonymous\n [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-349a) \n ; we’d welcome your feedback.\n \n\n\n\n\n\n\n\n\n\n\n\n\nRelated Advisories\n------------------\n\n\n\n\n\n\n\n\n\n\n Jul 11, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-193A\n \n\n### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a)\n\n\n\n\n\n\n\n\n\n\n\n Jul 08, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-190A\n \n\n### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a)\n\n\n\n\n\n\n\n\n\n\n\n May 10, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-131A\n \n\n### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a)\n\n\n\n\n\n\n\n\n\n\n\n Apr 18, 2024\n \n\n\n Cybersecurity Advisory \\| AA24\\-109A\n \n\n### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[Return to top](#) \n\n\n\n\n* [Topics](/topics)\n* [Spotlight](/spotlight)\n* [Resources \\& Tools](/resources-tools)\n* [News \\& Events](/news-events)\n* [Careers](/careers)\n* [About](/about)\n\n\n\n\n\n\n\n\n[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")\n\n\n* [Facebook](https://www.facebook.com/CISA)\n* [Twitter](https://twitter.com/CISAgov)\n* [LinkedIn](https://www.linkedin.com/company/cybersecurity-and-infrastructure-security-agency)\n* [YouTube](https://www.youtube.com/@cisagov)\n* [Instagram](https://www.instagram.com/cisagov)\n* [RSS](/subscribe-updates-cisa)\n\n\n\n\n CISA Central\n \n[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) \n[SayCISA@cisa.gov](mailto:SayCISA@cisa.gov) \n\n\n\n\n\n\n\n\n\n\n\n DHS Seal\n \n\n\n CISA.gov\n \n\n An official website of the U.S. Department of Homeland Security\n \n\n\n* [About CISA](/about \"About CISA\")\n* [Budget and Performance](https://www.dhs.gov/performance-financial-reports \"Budget and Performance\")\n* [DHS.gov](https://www.dhs.gov \"Department of Homeland Security\")\n* [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")\n* [FOIA Requests](https://www.dhs.gov/foia \"FOIA Requests\")\n* [No FEAR Act](/no-fear-act \"No FEAR Act Reporting\")\n* [Office of Inspector General](https://www.oig.dhs.gov/ \"Office of Inspector General\")\n* [Privacy Policy](/privacy-policy \"Privacy Policy\")\n* [Subscribe](https://public.govdelivery.com/accounts/USDHSCISA/subscriber/new?topic_id=USDHSCISA_138 \"Subscribe to Email Updates\")\n* [The White House](https://www.whitehouse.gov/ \"The White House\")\n* [USA.gov](https://www.usa.gov/ \"USA.gov\")\n* [Website Feedback](/forms/feedback \"Website Feedback\")\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "cves": ["CVE-2019-0708", "CVE-2017-0144"], "techniques": ["T1550.002", "T1078.001", "T1059.003", "T1087.002", "T1003.002", "T1557.001", "T1558.003", "T1110.002", "T1078.002", "T1110.003", "T1003.006", "T1595.001", "T1021.002"], "advisory": "aa23-349a", "title": "Enhancing Cyber Resilience: Insights from the CISA Healthcare and Public Health Sector Risk and Vulnerability Assessment | CISA", "source": "cybersecurity-advisories", "id": "570c8a2ad1a0d808b7c801da579d6e886fe183a2ce9773da36283d2ce0427109"}