{
  "markdown": " ESXiArgs Ransomware Virtual Machine Recovery Guidance \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events)4. [Cybersecurity Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A94) Cybersecurity AdvisoryESXiArgs Ransomware Virtual Machine Recovery Guidance===================================================== Release Date February 08, 2023 Alert Code AA23\\-039A Related topics:[Securing Networks](/topics/cyber-threats-and-advisories/securing-networks)  , , [Malware, Phishing, and Ransomware](/topics/cyber-threats-and-advisories/malware-phishing-and-ransomware) ### Summary The Cybersecurity and Infrastructure Security Agency (CISA) and the Federal Bureau of Investigation (FBI) are releasing this joint Cybersecurity Advisory (CSA) in response to the ongoing ransomware campaign, known as “ESXiArgs.” Malicious actors may be exploiting known vulnerabilities in VMware ESXi servers that are likely running unpatched and out\\-of\\-service or out\\-of\\-date versions of VMware ESXi software to gain access and deploy ransomware. The ESXiArgs ransomware encrypts configuration files on ESXi servers, potentially rendering virtual machines (VMs) unusable. CISA has released an ESXiArgs recovery script at [github.com/cisagov/ESXiArgs\\-Recover](https://github.com/cisagov/ESXiArgs-Recover)  . Organizations that have fallen victim to ESXiArgs ransomware can use this script to attempt to recover their files. This CSA provides guidance on how to use the script. ESXiArgs actors have compromised over 3,800 servers globally. CISA and FBI encourage all organizations managing VMware ESXi servers to:* **Update servers to the latest version of VMware ESXi software**  ,* **Harden ESXi hypervisors by disabling the Service Location Protocol (SLP) service**  , and* **Ensure the ESXi hypervisor is not exposed to the public interne**  t. If malicious actors have compromised your organization with ESXiArgs ransomware, CISA and FBI recommend following the script and guidance provided in this CSA to attempt to recover access to your files. Download the PDF version of this report:[ESXiArgs Ransomware Virtual Machine Recovery Guidance](/sites/default/files/2023-02/aa23-039a-esxiargs-ransomware-virtual-machine-recovery-guidance.pdf)  (PDF, 711\\.08 KB )**Note:**  CISA and FBI will update this CSA as more information becomes available.### Technical Details Open\\-source reporting indicates that malicious actors are exploiting known vulnerabilities in VMware ESXi software to gain access to servers and deploy ESXiArgs ransomware. The actors are likely targeting end\\-of\\-life ESXi servers or ESXi servers that do not have the available ESXi software patches applied. [\\[1]](https://blogs.vmware.com/security/2023/02/83330.html)  ESXiArgs ransomware encrypts certain configuration files on ESXi servers, potentially rendering VMs unusable. Specifically, the ransomware encrypts configuration files associated with the VMs; it does not encrypt flat files. As a result, it is possible, in some cases, for victims to reconstruct the encrypted configuration files based on the unencrypted flat file. The recovery script documented below automates the process of recreating configuration files. The full list of file extensions encrypted by the malware is: `vmdk`  , `vmx`  , `vmxf`  , `vmsd`  , `vmsn`  , `vswp`  , `vmss`  , `nvram`  , `vmem`  .### Recovery Guidance CISA and FBI do not encourage paying the ransom as payment does not guarantee victim files will be recovered. Furthermore, payment may also embolden adversaries to target additional organizations, encourage other criminal actors to engage in the distribution of ransomware, and/or fund illicit activities. Regardless of whether you or your organization have decided to pay the ransom, CISA and FBI urge you to promptly report ransomware incidents to a [local FBI Field Office](https://www.fbi.gov/contact-us/field-offices)  , or to CISA at [cisa.gov/report](https://edit-testint.cisa.gov/report)  . CISA is providing these steps to enable organizations to attempt recovery of their VMs. CISA’s GitHub ESXiArgs recovery script, which also outlines these steps, is available at [github.com/cisagov/ESXiArgs\\-Recover](https://github.com/cisagov/ESXiArgs-Recover)  . CISA is aware that some organizations have reported success in recovering files without paying ransoms. CISA’s script is based on findings published by third\\-party researchers. [\\[2]](https://enes.dev/)  Any organization seeking to use CISA’s ESXiArgs recovery script should carefully review the script to determine if it is appropriate for their environment before deploying it. This script does not seek to delete the encrypted configuration files, but instead seeks to create new configuration files that enable access to the VMs. While CISA works to ensure that scripts like this one are safe and effective, this script is delivered without warranty, either implicit or explicit. Do not use this script without understanding how it may affect your system. CISA does not assume liability for damage caused by this script. **Note:**  Organizations that run into problems with the script can create a GitHub issue at [https://github.com/cisagov/ESXiArgs\\-Recover/issues](https://github.com/cisagov/ESXiArgs-Recover/issues)  ; CISA will do our best to resolve concerns.1. **Quarantine or take affected hosts offline**  to ensure that repeat infection does not occur.2. **Download CISA’s recovery script**  and save it as `/tmp/recover.sh`  . For example, with `wget`  : `wget -O /tmp/recover.sh` `https://raw.githubusercontent.com/cisagov/ESXiArgs-Recover/main/recover.sh.`3. **Give the script execute permissions:** `chmod +x /tmp/recover.sh`4. **Navigate to the folder of a VM you would like to recover and run** `ls` **to view the files**  .\t* **Note:** \t You may browse these folders by running\t `ls /vmfs/volumes/datastore1` \t . For instance, if the folder is called\t `example` \t , run\t `cd /vmfs/volumes/datastore1/example` \t .5. **View files by running** `ls`  . Note the name of the VM (via naming convention: `[name].vmdk`  ).6. **Run the recovery script**  with `/tmp/recover.sh [name]`  , where `[name]`  is the name of the VM determined previously.\t* If the VM is a thin format, run\t `/tmp/recover.sh [name] thin` \t .\t* If successful, the recovery script will output that it has successfully run. If unsuccessful, it may not be possible for the recovery script to recover your VMs; consider engaging external incident response help.7. If the script succeeded, **re\\-register the VM**  .\t1. If the ESXi web interface is inaccessible,\t **remove the ransom note and restore** \t access via the following steps. (\t **Note:** \t Taking the steps below moves the ransom note to the file ransom.html. Consider archiving this file for future incident review.)\t\t* Run\t\t `cd /usr/lib/vmware/hostd/docroot/ui/ && mv index.html ransom.html && mv index1.html index.html` \t\t .\t\t* Run\t\t `cd /usr/lib/vmware/hostd/docroot && mv index.html ransom.html && rm index.html && mv index1.html index.html` \t\t .\t\t* **Reboot the ESXi server** \t\t (e.g., with the\t\t `reboot` \t\t command). After a few minutes, you should be able to navigate to the web interface.\t\t* In the ESXi web interface,\t\t **navigate to the Virtual Machines page** \t\t .\t\t* If the VM you restored already exists, right click on the VM and select\t\t `Unregister` \t\t (see figure 1\\).![Figure 1: Unregistering the virtual machine](/sites/default/files/styles/medium/public/2023-02/aa23-039a_figure_1_unregistering_the_virtual_machine.png?itok=X4tb4gvK) Figure 1: Unregistering the virtual machine.* Select `Create / Register VM`  (see figure 2\\).* Select `Register an existing virtual machine`  (see figure 2\\).![Figure 2: Registering the virtual machine, selecting machine to register.](/sites/default/files/styles/medium/public/2023-02/aa23-039a_figure_2.png?itok=dxxAMkjg) Figure 2: Registering the virtual machine, selecting machine to register. Click `Select one or more virtual machines, a datastore or a directory`  to navigate to the folder of the VM you restored. Select the `vmx`  file in the folder (see figure 3\\).![Figure 3: Registering the virtual machine, finalizing registration.](/sites/default/files/styles/medium/public/2023-02/aa23-039a_figure_3.png?itok=A6jW48vo) Figure 3: Registering the virtual machine, finalizing registration. Select `Next`  and `Finish`  . You should now be able to use the VM as normal. Figure 3: Registering the virtual machine, finalizing registration. Select Next and Finish. You should now be able to use the VM as normal.8. **Update servers to the latest software version, disable the Service Location Protocol (SLP) service, and ensure the ESXi hypervisor is not configured to be exposed to the public internet**  before putting systems back online.#### Additional Incident Response The above script only serves as a method to recover essential services. Although CISA and FBI have not seen any evidence that the actors have established persistence, we recommend organizations take the following additional incident response actions after applying the script:1. Review network logging to and from ESXi hosts and the guest VMs for unusual scanning activity.2. Review traffic from network segments occupied by the ESXi hosts and guests. Consider restricting non\\-essential traffic to and from these segments. If you detect activity from the above, implement your incident response plan. CISA and FBI urge you to promptly report ransomware incidents to [a local FBI Field Office](https://www.fbi.gov/contact-us/field-offices)  , or to CISA at [cisa.gov/report](https://www.cisa.gov/report)  . Organizations should also collect and review artifacts, such as running processes/services, unusual authentications, and recent network connections. See the joint CSA from the cybersecurity authorities of Australia, Canada, New Zealand, the United Kingdom, and the United States on [Technical Approaches to Uncovering and Remediating Malicious Activity](https://us-cert.cisa.gov/ncas/alerts/aa20-245a)  for additional guidance on hunting or investigating a network, and for common mistakes in incident handling. CISA also encourages government network administrators to see CISA’s Federal Government Cybersecurity Incident and Vulnerability Response Playbooks. Although tailored to federal civilian branch agencies, these playbooks provide operational procedures for planning and conducting cybersecurity incident and vulnerability response activities and detail steps for both incident and vulnerability response. Additional resources for recovering `.vmdk`  files can be found on a third\\-party researcher’s website. [\\[2]](https://enes.dev/) ### Mitigations**Note:**  These mitigations align with the cross\\-sector Cybersecurity Performance Goals (CPGs) developed by CISA and the National Institute of Standards and Technology (NIST). The CPGs provide a minimum set of practices and protections that CISA and NIST recommend all organizations implement. CISA and NIST based the CPGs on existing cybersecurity frameworks and guidance to protect against the most common and impactful threats, tactics, techniques, and procedures. For more information on the CPGs, including additional recommended baseline protections, see [cisa.gov/cpg](https://www.cisa.gov/cpg)  . CISA and FBI recommend all organizations:* Temporarily remove connectivity for the associated ESXi server(s).\t+ **Upgrade your ESXi servers to the latest version of VMware ESXi software** \t[\\[CPG 5\\.1]](https://www.cisa.gov/sites/default/files/publications/2022_00092_CISA_CPG_Report_508c.pdf) \t . ESXi releases are cumulative, and the latest builds are documented in VMware’s article, Build numbers and versions of VMware ESXi/ESX.\t+ **Harden ESXi hypervisors by disabling the Service Location Protocol (SLP) service** \t , which ESXiArgs may leverage. For more information on executing workarounds, see VMware’s guidance\t [How to Disable/Enable the SLP Service on VMware ESXi](https://kb.vmware.com/s/article/76372) \t .\t+ **Ensure your ESXi hypervisor is not configured to be exposed to the public internet.** In addition, CISA and FBI recommend organizations apply the following recommendations to prepare for, mitigate/prevent, and respond to ransomware incidents.### Preparing for Ransomware* Maintain offline backups of data, and regularly test backup and restoration [\\[CPG 7\\.3]](https://www.cisa.gov/sites/default/files/publications/2022_00092_CISA_CPG_Report_508c.pdf)  . These practices safeguard an organization’s continuity of operations or at least minimize potential downtime from a ransomware incident and protect against data losses.* Ensure all backup data is encrypted, immutable (i.e., cannot be altered or deleted), and covers the entire organization’s data infrastructure.* Create, maintain, and exercise a basic cyber incident response plan and associated communications plan that includes response procedures for a ransomware incident [\\[CPG 7\\.1, 7\\.2]](https://www.cisa.gov/sites/default/files/publications/2022_00092_CISA_CPG_Report_508c.pdf)  .### Mitigating and Preventing Ransomware* Restrict Server Message Block (SMB) Protocol within the network to only access servers that are necessary and remove or disable outdated versions of SMB (i.e., SMB version 1\\). Threat actors use SMB to propagate malware across organizations.* [Require phishing\\-resistant MFA](https://www.cisa.gov/sites/default/files/publications/fact-sheet-implementing-phishing-resistant-mfa-508c.pdf)  for as many services as possible [\\[CPG 1\\.3]](https://www.cisa.gov/sites/default/files/publications/2022_00092_CISA_CPG_Report_508c.pdf)  —particularly for webmail, VPNs, accounts that access critical systems, and privileged accounts that manage backups.* Review the security posture of third\\-party vendors and those interconnected with your organization. Ensure all connections between third\\-party vendors and outside software or hardware are monitored and reviewed for suspicious activity.* Implement allow\\-listing policies for applications and remote access that only allow systems to execute known and permitted programs.* Open document readers in protected viewing modes to help prevent active content from running.* Implement user training program and phishing exercises to raise awareness among users about the risks of visiting suspicious websites, clicking on suspicious links, and opening suspicious attachments. Reinforce the appropriate user response to phishing and spearphishing emails.* Use strong passwords [\\[CPG 1\\.4]](https://www.cisa.gov/sites/default/files/publications/2022_00092_CISA_CPG_Report_508c.pdf)  and avoid reusing passwords for multiple accounts. See CISA Tip [Choosing and Protecting Passwords](https://www.cisa.gov/tips/st04-002)  and the NIST’s [Special Publication 800\\-63B: Digital Identity Guidelines](https://csrc.nist.gov/publications/detail/sp/800-63b/final)  for more information.* Require administrator credentials to install software [\\[CPG 1\\.5]](https://www.cisa.gov/sites/default/files/publications/2022_00092_CISA_CPG_Report_508c.pdf)  .* Audit user accounts with administrative or elevated privileges and configure access controls with least privilege in mind [\\[CPG 1\\.5]](https://www.cisa.gov/sites/default/files/publications/2022_00092_CISA_CPG_Report_508c.pdf)  .* Install and regularly update antivirus and antimalware software on all hosts.* Consider adding an email banner to messages coming from outside your organizations.* Disable hyperlinks in received emails.* **Consider participating in CISA’s no\\-cost** [Automated Indicator Sharing (AIS) program](https://www.cisa.gov/ais)  to receive real\\-time exchange of machine\\-readable cyber threat indicators and defensive measures.### Responding to Ransomware Incidents If a ransomware incident occurs at your organization:* Follow your organization’s Ransomware Response Checklist (see Preparing for Ransomware section).* Scan backups. If possible, scan backup data with an antivirus program to check that it is free of malware. This should be performed using an isolated, trusted system to avoid exposing backups to potential compromise.* Follow the notification requirements as outlined in your cyber incident response plan.* Report incidents to CISA at [cisa.gov/report](https://www.cisa.gov/report)  , FBI at a [local FBI Field Office](https://www.fbi.gov/contact-us/field-offices)  , or the U.S. Secret Service (USSS) at a [USSS Field Office](http://www.secretservice.gov/contact/field-offices/)  .* Apply incident response best practices found in the joint Cybersecurity Advisory, [Technical Approaches to Uncovering and Remediating Malicious Activity](https://us-cert.cisa.gov/ncas/alerts/aa20-245a)  , developed by CISA and the cybersecurity authorities of Australia, Canada, New Zealand, and the United Kingdom.**Note:**  CISA and FBI strongly discourage paying ransoms as doing so does not guarantee files and records will be recovered. Furthermore, payment may also embolden adversaries to target additional organizations, encourage other criminal actors to engage in the distribution of ransomware, and/or fund illicit activities.### Resources See [Stopransomware.gov](https://www.cisa.gov/stopransomware)  , a whole\\-of\\-government approach, for ransomware resources and alerts.### Acknowledgements CISA and FBI would like to thank VMware for their contributions to this CSA.### References[VMware Security Response Center (vSRC) Response to 'ESXiArgs' Ransomware Attack…](https://blogs.vmware.com/security/2023/02/83330.html) [Enes Sonmez and Ahmet Aykac, YoreGroup Tech Team: decrypt your crypted files in…](https://enes.dev/) ### Revisions February, 2023: Initial Version This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.### Tags Topics[Securing Networks](/topics/cyber-threats-and-advisories/securing-networks)  , , [Malware, Phishing, and Ransomware](/topics/cyber-threats-and-advisories/malware-phishing-and-ransomware)  , [Information Sharing](/topics/cyber-threats-and-advisories/information-sharing)  Co\\-Sealers and Partners Federal Bureau of Investigation-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-039a)  ; Related Advisories------------------ Jul 11, 2024 Cybersecurity Advisory \\| AA24\\-193A### [CISA Red Team’s Operations Against a Federal Civilian Executive Branch Organization Highlights the Necessity of Defense\\-in\\-Depth](/news-events/cybersecurity-advisories/aa24-193a) Jul 08, 2024 Cybersecurity Advisory \\| AA24\\-190A### [People’s Republic of China (PRC) Ministry of State Security APT40 Tradecraft in Action](/news-events/cybersecurity-advisories/aa24-190a) May 10, 2024 Cybersecurity Advisory \\| AA24\\-131A### [\\#StopRansomware: Black Basta](/news-events/cybersecurity-advisories/aa24-131a) Apr 18, 2024 Cybersecurity Advisory \\| AA24\\-109A### [\\#StopRansomware: Akira Ransomware](/news-events/cybersecurity-advisories/aa24-109a)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "aa23-039a",
  "title": "ESXiArgs Ransomware Virtual Machine Recovery Guidance | CISA",
  "source": "cybersecurity-advisories",
  "id": "11dd4fdd35666be6944e063b65dc2c8230814a4ad658588b28cfb8ccd6fde8b2"
}