{
  "markdown": "\nSUMMARY\nThe Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), the Multi-State Information Sharing and Analysis Center (MS-ISAC), and the Canadian Centre for Cyber Security (CCCS) are releasing this joint Cybersecurity Advisory (CSA) in response to cyber threat actors leveraging newly identified Truebot malware variants against organizations in the United States and Canada. As recently as May 31, 2023, the authoring organizations have observed an increase in cyber threat actors using new malware variants of Truebot (also known as Silence.Downloader). Truebot is a botnet that has been used by malicious cyber groups like CL0P Ransomware Gang to collect and exfiltrate information from its target victims.\nPrevious Truebot malware variants were primarily delivered by cyber threat actors via malicious phishing email attachments; however, newer versions allow cyber threat actors to also gain initial access through exploiting CVE-2022-31199—(a remote code execution vulnerability in the Netwrix Auditor application), enabling deployment of the malware at scale within the compromised environment. Based on confirmation from open-source reporting and analytical findings of Truebot variants, the authoring organizations assess cyber threat actors are leveraging both phishing campaigns with malicious redirect hyperlinks and CVE-2022-31199 to deliver new Truebot malware variants.\nThe authoring organizations recommend hunting for the malicious activity using the guidance outlined in this CSA, as well as applying vendor patches to Netwrix Auditor (version 10.5—see Mitigations section below).[1] Any organization identifying indicators of compromise (IOCs) within their environment should urgently apply the incident responses and mitigation measures detailed in this CSA and report the intrusion to CISA or the FBI.\nDownload the PDF version of this report:\n\n\nAA23-187A Increased Truebot Activity Infects U.S. and Canada Based Networks\n(PDF,       891.26 KB\n  )\n\n\nRead the associated Malware Analysis Report MAR-10445155-1.v1 Truebot Activity Infects U.S. and Canada Based Networks or download the PDF version below:\n\n\nMAR-10445155-1.v1 Truebot Activity Infects U.S. and Canada Based Networks\n(PDF,       315.39 KB\n  )\n\n\nFor a downloadable copy of IOCs in .xml and .json format, see:\n\n\nAA23-187A STIX XML\n(XML,       204.54 KB\n  )\n\n\n\n\nAA23-187A STIX JSON\n(JSON,       140.24 KB\n  )\n\n\nTECHNICAL DETAILS\nNote: This advisory uses the MITRE ATT&CK® for Enterprise framework, version 13. See the MITRE ATT&CK Tactics and Techniques section below for cyber threat actors’ activity mapped to MITRE ATT&CK tactics and techniques.\nInitial Access and Execution\nIn recent months, open source reporting has detailed an increase in Truebot malware infections, particularly cyber threat actors using new tactics, techniques, and procedures (TTPs), and delivery methods.[2] Based on the nature of observed Truebot operations, the primary objective of a Truebot infection is to exfiltrate sensitive data from the compromised host(s) for financial gain [TA0010].\n\nPhishing:\n\nCyber threat actors have historically used malicious phishing emails as the primary delivery method of Truebot malware, which tricks recipients into clicking a hyperlink to execute malware. Cyber threat actors have further been observed concealing email attachments (executables) as software update notifications [T1189] that appear to be legitimate [T1204.002], [T1566.002]. Following interaction with the executable, users will be redirected to a malicious web domain where script files are then executed. Note: Truebot malware can be hidden within various, legitimate file formats that are used for malicious purposes [T1036.008].[3]\n\n\nExploitation of CVE-2022-31199:\n\nThough phishing remains a prominent delivery method, cyber threat actors have shifted tactics, exploiting, in observable manner, a remote code execution vulnerability (CVE-2022-31199) in Netwrix Auditor [T1190]—software used for on-premises and cloud-based IT system auditing. Through exploitation of this CVE, cyber threat actors gain initial access, as well as the ability to move laterally within the compromised network [T1210].\n\n\n\n\n \n\nFigure 1: CVE-2022-31199 Delivery Method for Truebot\n\nFollowing the successful download of the malicous file, Truebot renames itself and then loads FlawedGrace onto the host. Please see the FlawedGrace section below for more information on how this remote access tool (RAT) is used in Truebot operations.\nAfter deployment by Truebot, FlawedGrace is able to modify registry [T1112] and print spooler programs [T1547.012] that control the order that documents are loaded to a print queue. FlawedGrace manipulates these features to both escalate privilege and establish persistence.\nDuring FlawedGrace’s execution phase, the RAT stores encrypted payloads [T1027.009] within the registry. The tool can create scheduled tasks and inject payloads into msiexec[.]exe and svchost[.]exe, which are command processes that enable FlawedGrace to establish a command and control (C2) connection to 92.118.36[.]199, for example, as well as load dynamic link libraries (DLLs) [T1055.001] to accomplish privilege escalation.\nSeveral hours post initial access, Truebot has been observed injecting Cobalt Strike beacons into memory [T1055] in a dormant mode for the first few hours prior to initiating additional operations. Please see the Cobalt Strike section below for more information on how this remote access tool (RAT) is used in Truebot operations.\nDiscovery and Defense Evasion\nDuring the first stage of Truebot’s execution process, it checks the current version of the operating system (OS) with RtlGetVersion and processor architecture using GetNativeSystemInfo [T1082].[4] Note: This variant of Truebot malware is designed with over one gigabyte (GB) of junk code which functions to hinder detection and analysis efforts [T1027.001].\nFollowing the initial checks for system information, Truebot has the capability to enumerate all running processes [T1057], collect sensitive local host data [T1005], and send this data to an encoded data string described below for second-stage execution. Based on IOCs in table 1, Truebot also has the ability to discover software security protocols and system time metrics, which aids in defense evasion, as well as enables synchronization with the compromised system’s internal clock to facilitate scheduling tasks [T1518.001][T1124].\nNext, it uses a .JSONIP extension, (e.g., IgtyXEQuCEvAM.JSONIP), to create a thirteen character globally unique identifier (GUID)—a 128-bit text string that Truebot uses to label and organize the data it collects [T1036].\nAfter creating the GUID, Truebot compiles and enumerates running process data into either a base64 or unique hexadecimal encoded string [T1027.001]. Truebot’s main goal is identifying the presence of security debugger tools. However, the presence of identified debugger tools does not change Truebot’s execution process—the data is compiled into a base64 encoded string for tracking and defense evasion purposes [T1082][T1622].\nData Collection and Exfiltration\nFollowing Truebot’s enumeration of running processes and tools, the affected system’s computer and domain name [T1082][T1016], along with the newly generated GUID, are sent to a hard-coded URL in a POST request (as observed in the user-agent string). Note: A user-agent string is a customized HTTP request that includes specific device information required for interaction with web content. In this instance, cyber threat actors can redirect victims to malicious domains and further establish a C2 connection.\nThe POST request functions as means for establishing a C2 connection for bi-lateral communication. With this established connection, Truebot uses a second obfuscated domain to receive additional payloads [T1105], self-replicate across the environment [T1570], and/or delete files used in its operations [T1070.004]. Truebot malware has the capability to download additional malicious modules [T1105], load shell code [T1620], and deploy various tools to stealthily navigate an infected network.\nAssociated Delivery Vectors and Tools\nTruebot has been observed in association with the following delivery vectors and tools:\nRaspberry Robin (Malware)\nRaspberry Robin is a wormable malware with links to other malware families and various infection methods, including installation via USB drive [T1091].[5] Raspberry Robin has evolved into one of the largest malware distribution platforms and has been observed deploying Truebot, as well as other post-compromise payloads such as IcedID and Bumblebee malware.[6] With the recent shift in Truebot delivery methods from malicious emails to the exploitation of CVE-2022-31199, a large number of Raspberry Robin infections have leveraged this exploitable CVE.[2]\nFlawed Grace (Malware)\nFlawedGrace is a remote access tool (RAT) that can receive incoming commands [T1059] from a C2 server sent over a custom binary protocol [T1095] using port 443 to deploy additional tools [T1105].[7] Truebot malware has been observed leveraging (and dropping) FlawedGrace via phishing campaigns as an additional payload [T1566.002].[8] Note: FlawedGrace is typically deployed minutes after Truebot malware is executed.\nCobalt Strike (Tool)\nCobalt Strike is a popular remote access tool (RAT) that cyber threat actors have leveraged—in an observable manner—for a variety of post-exploitation means. Typically a few hours after Truebot’s execution phase, cyber threat actors have been observed deploying additional payloads containing Cobalt Strike beacons for persistence and data exfiltration purposes [T1059].[2] Cyber threat actors use Cobalt Strike to move laterally via remote service session hijacking [T1563.001][T1563.002], collecting valid credentials through LSASS memory credential dumping, or creating local admin accounts to achieve pass the hash alternate authentication [T1003.001][T1550.002].\nTeleport (Tool)\nCyber threat actors have been observed using a custom data exfiltration tool, which Talos has named “Teleport.”[2] Teleport is known to evade detection during data exfiltration by using an encryption key hardcoded in the binary and a custom communication protocol [T1095] that encrypts data using advanced encryption standard (AES) and a hardcoded key [T1048][T1573.002]. Furthermore, to maintain its stealth, Teleport limits the data it collects and syncs with outbound organizational data/network traffic [T1029][T1030].\nTruebot Malware Indicators of Compromise (IOCs)\nTruebot IOCs from May 31, 2023, contain IOCs from cyber threat actors conducting Truebot malspam campaigns. Information is derived from a trusted third party, they observed cyber threat actors from 193.3.19[.]173 (Russia) using a compromised local account to conduct phishing campaigns on May 23, 2023 and spread malware through: https[:]//snowboardspecs[.]com/nae9v, which then promptly redirects the user to: https://www.meditimespharma[.]com/gfghthq/, which a trusted third party has linked to other trending Truebot activity.\nAfter redirecting to https://www.meditimespharma[.]com/gfghthq/, trusted third parties have observed, the cyber threat actors using Truebot to pivot to https://corporacionhardsoft[.]com/images/2/Document_16654.exe, which is a domain associated with snowboardspecs[.]com. This malicious domain has been linked to UNC4509, a threat cluster that has been known to use traffic distribution systems (TDS) to redirect users to either a benign or malicious website to facilitate their malicious phishing campaigns in May 2023.\nAccording to trusted third parties, the MD5 Hash: 6164e9d297d29aa8682971259da06848 is downloaded from https://corporacionhardsoft.com/images/2/Document_16654[.]exe, and has been flagged by numerous security vendors, as well as is linked to UNC4509 Truebot campaigns. Note: These IOCs are associated with Truebot campaigns used by Graceful Spider to deliver FlawedGrace and LummaStealer payloads in May of 2023.\nAfter Truebot is downloaded, the malware copies itself to C:\\Intel\\RuntimeBroker.exe and—based on trusted third party analysis—links to https://essadonio.com/538332[.]php (which is linked to 45.182.189[.]71 (Panama) and is associated with other trending Truebot malware campaigns from May 2023).\nPlease reference table 1 for IOCs described in the paragraph above.\n\n\n\nTable 1: Truebot IOCs from May of 2023\n \n \n\n\n\n\nIndicator Type\nIndicator\nSource\n\n\nRegistrant\nGKG[.]NET Domain Proxy Service Administrator\nTrusted Third Party\n\n\nCompromised Account Created:\n2022-04-10\nTrusted Third Party\n\n\nMalicious account created\n1999-11-09\nTrusted Third Party\n\n\nIP\n193.3.19[.]173 (Russia)\nTrusted Third Party\n\n\nURL\nhttps://snowboardspecs[.]com/nae9v\nTrusted Third Party\n\n\nDomain\nhttps://corporacionhardsoft[.]com/images/2/Document_16654.exe\nTrusted Third Party\n\n\nFile\nDocument_16654[.]exe\nTrusted Third Party\n\n\nMD5 Hash\n6164e9d297d29aa8682971259da06848\nTrusted Third Party\n\n\nFile\nDocument_may_24_16654[.]exe\nTrusted Third Party\n\n\nFile\nC:\\Intel\\RuntimeBroker[.]exe\nTrusted Third Party\n\n\nURL\nhttps://essadonio.com/538332[.]php\nTrusted Third Party\n\n\nIP\n45.182.189[.]71 (Panama)\nTrusted Third Party\n\n\nAccount Created\n2023-05-18\nTrusted Third Party\n\n\n\n \n\n\n\nTable 2: Truebot malware IOCs from May of 2023\n \n \n\n\n\n\nIndicator Type\nIndicator\nSource\n\n\nFile Name\nSecretsdump[.]py\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nDomain\nImsagentes[.]pe\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nURL\nhttps://imsagentes[.]pe/dgrjfj/\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nURL\nhttps://imsagentes[.]pe/dgrjfj\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nURL\nhttps://hrcbishtek[.]com/{5\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nURL\nhttps://ecorfan.org/base/sj/document_may_24_16654[.]exe\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nDomain\nHrcbishtek[.]com\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nMD5 Hash\nF33734DFBBFF29F68BCDE052E523C287\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nMD5 Hash\nF176BA63B4D68E576B5BA345BEC2C7B7\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nMD5 Hash\nF14F2862EE2DF5D0F63A88B60C8EEE56\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nDomain\nEssadonio[.]com\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nDomain\nEcorfan[.]org\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nSHA256 Hash\nC92C158D7C37FEA795114FA6491FE5F145AD2F8C08776B18AE79DB811E8E36A3\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nFile Name\nAtexec[.]py\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nMD5 Hash\nA0E9F5D64349FB13191BC781F81F42E1\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nIPv4\n92.118.36[.]199\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nIPv4\n81.19.135[.]30\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nMD5 Hash\n72A589DA586844D7F0818CE684948EEA\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nSHA256 Hash\n717BEEDCD2431785A0F59D194E47970E9544FBF398D462A305F6AD9A1B1100CB\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nIPv4\n5.188.86[.]18\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nIPv4\n5.188.206[.]78\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nIPv4\n45.182.189[.]71\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nIPv4\n139.60.160[.]166\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\nSHA256 Hash\n121A1F64FFF22C4BFCEF3F11A23956ED403CDEB9BDB803F9C42763087BD6D94E\nhttps://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/\n\n\n\n \n\n\n\nTable 3: Truebot IOCs from May 2023 (Malicious Domains, and Associated IP addresses and URLs)\n \n \n\n\n\n\nMalicious Domain\nAssociated IP(s)\nBeacon URL\n\n\nnitutdra[.]com\n46.161.40[.]128\n \n\n\nromidonionhhgtt[.]com\n46.161.40.128\n \n\n\nmidnigthwaall[.]com\n46.161.40[.]128\n \n\n\ndragonetzone[.]com\n46.161.40[.]128\nhxxps://dragonetzone[.]com/gate_info[.]php\n\n\nrprotecruuio[.]com\n45.182.189[.]71\n \n\n\nessadonio[.]com\n45.182.189[.]71\nhxxps://nomoresense[.]com/checkinfo[.]php\n\n\nnomoresense[.]com\n45.182.189[.]91\nhxxps://nomoresense[.]com/checkinfo[.]php\n\n\nronoliffuion[.]com\n45.182.189[.]120\nhxxps://ronoliffuion[.]com/dns[.]php\n\n\nbluespiredice[.]com\n45.182.189[.]119\n \n\n\ndremmfyttrred[.]com\n45.182.189[.]103\nhxxps://dremmfyttrred[.]com/dns[.]php\n\n\nms-online-store[.]com\n45.227.253[.]102\n \n\n\nber6vjyb[.]com\n92.118.36[.]252\nhxxps://ber6vjyb[.]com/dns[.]php\n\n\njirostrogud[.]com\n88.214.27[.]101\nhxxps://ber6vjyb[.]com/dns[.]php\n\n\nfuanshizmo[.]com\n45.182.189[.]229\n \n\n\nqweastradoc[.]com\n92.118.36[.]213\nhxxp://nefosferta[.]com/gate[.]php\n\n\nqweastradoc[.]com\n92.118.36[.]213\nhxxp://nefosferta[.]com/gate[.]php\n\n\nqweastradoc[.]com\n92.118.36[.]213\nhxxp://nefosferta[.]com/gate[.]php\n\n\nhiperfdhaus[.]com\n88.214.27[.]100\nhxxp://nefosferta[.]com/gate[.]php\n\n\nguerdofest[.]com\n45.182.189[.]228\nhxxp://qweastradoc[.]com/gate[.]php\n\n\nnefosferta[.]com\n179.60.150[.]139\nhxxp://nefosferta[.]com/gate[.]php\n\n\n\n \n\n\n\nTable 4: Truebot IOCs from May 2023 Continued (Malicious Domains and Associated Hashes)\n \n \n \n\n\n\n\n Malicious Domain\nMD5\nSHA1\nSHA256\n\n\nnitutdra[.]com\n \n \n \n\n\nromidonionhhgtt[.]com\n \n \n \n\n\nmidnigthwaall[.]com\n \n \n \n\n\ndragonetzone[.]com\n64b27d2a6a55768506a5658a31c045de\nc69f080180430ebf15f984be14fb4c76471cd476\ne0178ab0893a4f25c68ded11e74ad90403443e413413501d138e0b08a910471e\n\n\nrprotecruuio[.]com\n \n \n \n\n\nessadonio[.]com\n9a3bad7d8516216695887acc9668cda1\na89c097138e5aab1f35b9a03900600057d907690\n4862618fcf15ba4ad15df35a8dcb0bdb79647b455fea6c6937c7d050815494b0\n\n\nessadonio[.]com\n6164e9d297d29aa8682971259da06848\n96b95edc1a917912a3181d5105fd5bfad1344de0\n717beedcd2431785a0f59d194e47970e9544fbf398d462a305f6ad9a1b1100cb\n\n\nnomoresense[.]com\n8f924f3cbe5d8fe3ecb7293478901f1a\n516051b4cab1be74d32a6c446eabac7fc354904f\n6b646641c823414c2ee30ae8b91be3421e4f13fa98e2d99272956e61eecfc5a1\n\n\nnomoresense[.]com\nac6a2f1eafaae9f6598390d1017dd76c\n1c637c2ded5d3a13fd9b56c35acf4443f308be52\nf9f649cb5de27f720d58aa44aec6d0419e3e89f453730e155067506ad3ece638\n\n\nronoliffuion[.]com\n881485ac77859cf5aaa8e0d64fbafc5f\n51be660a3bdaab6843676e9d3b2af8444e88bbda\n36d89f0455c95f9b00a8cea843003d0b53c4e33431fe57b5e6ec14a6c2e00e99\n\n\nbluespiredice[.]com\n \n \n \n\n\ndremmfyttrred[.]com\ne4a42cbda39a20134d6edcf9f03c44ed\nafda13d5365b290f7cdea701d00d05b0c60916f8\n47f962063b42de277cd8d22550ae47b1787a39aa6f537c5408a59b5b76ed0464\n\n\ndremmfyttrred[.]com\naa949d1a7ebe5f878023c6cfb446e29b\n06057d773ad04fda177f6b0f6698ddaa47f7168a\n594ade1fb42e93e64afc96f13824b3dbd942a2cdbc877a7006c248a38425bbc1\n\n\ndremmfyttrred[.]com\n338476c2b0de4ee2f3e402f3495d0578\n03916123864aa034f7ca3b9d45b2e39b5c91c502\na67df0a8b32bdc5f9d224db118b3153f66518737e702314873b673c914b2bb5c\n\n\nms-online-store[.]com\n \n \n \n\n\nber6vjyb[.]com\n46fe07c07fd0f45ba45240ef9aae2a44\nb918f97c7c6ebc9594de3c8f2d9d75ecc292d02b\nc0f8aeeb2d11c6e751ee87c40ee609aceb1c1036706a5af0d3d78738b6cc4125\n\n\njirostrogud[.]com\n89c8afc5bbd34f160d8a2b7218b9ca4a\n16ecf30ff8c7887037a17a3eaffcb17145b69160\n5cc8c9f2c9cee543ebac306951e30e63eff3ee103c62dadcd2ce43ef68bc7487\n\n\njirostrogud[.]com\n5da364a8efab6370a174736705645a52\n792623e143ddd49c36f6868e948febb0c9e19cd3\n80b9c5ec798e7bbd71bbdfffab11653f36a7a30e51de3a72c5213eafe65965d9\n\n\nfuanshizmo[.]com\n \n \n \n\n\nqweastradoc[.]com\nee1ccb6a0e38bf95e44b73c3c46268c5\n62f5a16d1ef20064dd78f5d934c84d474aca8bbe\n0e3a14638456f4451fe8d76fdc04e591fba942c2f16da31857ca66293a58a4c3\n\n\nqweastradoc[.]com\n82d4025b84cf569ec82d21918d641540\nbb32c940f9ca06e7e8533b1d315545c3294ee1a0\nc042ad2947caf4449295a51f9d640d722b5a6ec6957523ebf68cddb87ef3545c\n\n\nqweastradoc[.]com\ndbecfe9d5421d319534e0bfa5a6ac162\n9e7a2464f53ce74d840eb84077472bc29fd1ba05\nc9b874d54c18e895face055eeb6faa2da7965a336d70303d0bd6047bec27a29d\n\n\nqweastradoc[.]com\nb7fed593e8eb3646f876367b56725e6c\n44090a7858eceb28bc111e1edd2f0dc98047afb2\nff8c8c8bfba5f2ba2f8003255949678df209dbff95e16f2f3c338cfa0fd1b885\n\n\nhiperfdhaus[.]com\n8e2b823aac6c9e11fcabecb1d8c19adf\n77ad34334a370d85ca5e77436ed99f18b185eee3\na30e1f87b78d1cd529fbe2afdd679c8241d3baab175b2f083740263911a85304\n\n\nhiperfdhaus[.]com\n8a94163ddf956abd0ea92d89db0034e5\nabc96032071adeb6217f0a5ba1aff55dc11f5438\nb95a764820e918f42b664f3c9a96141e2d7d7d228da0edf151617fabdd9166cf\n\n\nguerdofest[.]com\n65fb9572171b903aa31a325f550d8778\nd8bd44b7a8f136e29b31226f4edf566a4223266c\nd5bbcaa0c3eeea17f12a5cc3dbcaffff423d00562acb694561841bcfe984a3b7\n\n\nnefosferta[.]com\nd9d85bdb6a3ac60a8ba6776c661dbace\n78e38e522b1765efb15d0585e13c1f1301e90788\n092910024190a2521f21658be849c4ac9ae6fa4d5f2ecd44c9055cc353a26875\n\n\nnefosferta[.]com\n20643549f19bed9a6853810262622755\nc8227dcc1cd6ecc684de8c5ea9b16e3b35f613f1\n1ef8cdbd3773bd82e5be25d4ba61e5e59371c6331726842107c0f1eb7d4d1f49\n\n\nnefosferta[.]com\ne9299fc9b7daa0742c28bfc4b03b7b25\n77360abc473dc65c8bdd73b6459b9ea8fddb6f1d\n22e3f4602a258e92a0b8deb5a2bd69c67f4ac3ca67362a745178848a9da7a3cc\n\n\nnefosferta[.]com\n775fb391db27e299af08933917a3acda\neaaa5e68956a3a3f6113e965199f479e10ae9956\n2d50b03a92445ba53ae147d0b97c494858c86a56fe037c44bc0edabb902420f7\n\n\nnefosferta[.]com\nf4045710c99d347fe6dfa2c0fcadde29\nb7bffdbbaf817d149bbd061070a2d171449afbfc\n32ae88cddeeeec255d6d9c827f6bffc7a95e9ea7b83a84a79ff793735a4b4ed7\n\n\nnefosferta[.]com\n587acecdb9491e0897d1067eb02e7c8d\na9eb1ac4b85d17da3a2bae5835c7e862d481c189\n55d1480cd023b74f10692c689b56e7fd6cc8139fb6322762181daead55a62b9e\n\n\nnefosferta[.]com\n0bae65245e5423147fce079de29b6136\nf24232330e6f428bfbb6b9d8154db1c4046c2fc2\n6210a9f5a5e1dc27e68ecd61c092d2667609e318a95b5dade3c28f5634a89727\n\n\nnefosferta[.]com\n5022a85b39a75ebe2bc0411d7b058b2e\na9040ac0e9f482454e040e2a7d874ddc50e6f6ce\n68a86858b4638b43d63e8e2aaec15a9ebd8fc14d460dd74463db42e59c4c6f89\n\n\nnefosferta[.]com\n6a2f114a8995dbeb91f766ac2390086e\nedac3cf9533b6f7102f6324fadb437a0814cc680\n72813522a065e106ac10aa96e835c47aa9f34e981db20fa46a8f36c4543bb85d\n\n\nnefosferta[.]com\ne9115cc3280c16f9019e0054e059f4b8\ndad01b0c745649c6c8b87dbeb7ab549ed039515d\n7a64bc69b60e3cd3fd00d4424b411394465640f499e56563447fe70579ccdd00\n\n\nnefosferta[.]com\nb54cc9a3dd88e478ea601dfd5b36805e\n318fdfec4575d1530a41c80274aa8caae7b7f631\n7c607eca4005ba6415e09135ef38033bb0b0e0ff3e46d60253fc420af7519347\n\n\nnefosferta[.]com\nf129c12b1bda7426f6b31682b42ee4b0\n5bb804153029c97fe23517ae5428a591c3c63f28\n7c79ec3f5c1a280ffdf19d0000b4bfe458a3b9380c152c1e130a89de3fe04b63\n\n\nnefosferta[.]com\nf68aa4c92dd30bd5418f136aaf6c07d6\naa56f43e39d114235a6b1d5f66b593cc80325fa4\n7e39dcd15307e7de862b9b42bf556f2836bf7916faab0604a052c82c19e306ca\n\n\nnefosferta[.]com\nacac995cee8a6a75fa79eb41bdffa53f\n971a00a392b99f64a3886f40b6ef991e62f0fe2f\n97bae3587f1d2fd35f24eb214b9dd6eed95744bed62468d998c7ef55ff8726d4\n\n\nnefosferta[.]com\n36057710279d9f0d023cb5613aa76d5e\ne4dd1f8fc4e44c8fd0e25242d994c4b59eed6939\n97d0844ce9928e32b11706e06bf2c4426204d998cb39964dd3c3de6c5223fff0\n\n\nnefosferta[.]com\n37e6904d84153d1435407f4669135134\n1dcd85f7364ea06cd595a86e3e9be48995d596e9\nbf3c7f0ba324c96c9a9bff6cf21650a4b78edbc0076c68a9a125ebcba0e523c9\n\n\nnefosferta[.]com\n4f3916e7714f2a32402c9d0b328a2c91\n87a692e3592f7b997c7d962919e243b665f2be36\nc3743a8c944f5c9b17528418bf49b153b978946838f56e5fca0a3f6914bee887\n\n\nnefosferta[.]com\nd9daaa0df32b0bb01a09e500fc7f5881\nf9cb839adba612db5884e1378474996b4436c0cd\nc3b3640ddf53b26f4ebd4eedf929540edb452c413ca54d0d21cc405c7263f490\n\n\nnefosferta[.]com\nc87fb9b9f6c343670bed605420583418\nf05cf0b026b2716927dac8bcd26a2719ea328964\nc6c4f690f0d15b96034b4258bdfaf797432a3ec4f73fbc920384d27903143cb0\n\n\nnefosferta[.]com\n2be64efd0fa7739123b26e4b70e53c5c\n318fdfec4575d1530a41c80274aa8caae7b7f631\ned38c454575879c2546e5fccace0b16a701c403dfe3c3833730d23b32e41f2fe\n\n\n\n \n\n\n\nTable 5: Truebot IOCs Connected to Russia, and Panama Locations\n \n \n \n\n\n\n\n Malicious Domain\nIP Addresses\nFiles\nSHA256\n\n\nDremmfyttrred[.]com\n \n \n \n\n\n \n45.182.189[.]103\n \n \n\n\n \n94.142.138[.]61\n \n \n\n\n \n172.64.155[.]188\n \n \n\n\n \n104.18.32[.]68\n \n \n\n\n \n \nUpdate[.]exe\n \n\n\n \n \nDocument_26_apr_2443807[.]exe\n \n\n\n \n \n3ujwy2rz7v[.]exe\n \n\n\n \n \n \nfe746402c74ac329231ae1b5dffa8229b509f4c15a0f5085617f14f0c1579040\n\n\ndroogggdhfhf[.]com\n \n3LXJyA6Gf[.]exe\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\n\n\n\n \nMITRE ATT&CK TACTICS AND TECHNIQUES\nSee Tables 6-16 for all referenced cyber threat actor tactics and techniques for enterprise environments in this advisory. For assistance with mapping malicious cyber activity to the MITRE ATT&CK framework, see CISA and MITRE ATT&CK’s Best Practices for MITRE ATT&CK Mapping and CISA’s Decider Tool.\n\n\n\nTable 6: Initial Access\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nReplication Through Removable Media\nT1091\nCyber threat actors use removable media drives to deploy Raspberry Robin malware.\n\n\nDrive-by Compromise\nT1189\nCyber threat actors embed malicious links or attachments within web domains to gain initial access.\n\n\nExploit Public-Facing Application\nT1190\nCyber threat actors are exploiting Netwrix vulnerability CVE-2022-31199 for initial access with follow-on capabilities of lateral movement through remote code execution.\n\n\nPhishing\nT1566.002\nTruebot actors can send spear phishing links to gain initial access.\n\n\n\n \n\n\n\nTable 7: Execution\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nCommand and Scripting Interpreter\nT1059\n\nCyber threat actors have been observed dropping cobalt strike beacons as a reverse shell proxy to create persistence within the compromised network.\nCyber threat actors use FlawedGrace to receive PowerShell commands over a C2 channel to deploy additional tools.\n\n\n\nShared Modules\nT1129\nCyber threat actors can deploy malicious payloads through obfuscated share modules.\n\n\nUser Execution: Malicious Link\nT1204.001\nCyber threat actors trick users into clicking a link by making them believe they need to perform a Google Chrome software update.\n\n\n\n \n\n\n\nTable 8: Persistence\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nHijack Execution Flow: DLL Side-Loading\n1574.002\nCyber threat actors use Raspberry Robin, among other toolsets to side-load DLLs to maintain persistence.\n\n\n\n \n\n\n\nTable 9: Privilege Escalation\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nBoot or Logon Autostart Execution: Print Processors\nT1547.012\nFlawedGrace malware manipulates print spooler functions to achieve privilege escalation.\n\n\n\n \n\n\n\nTable 10: Defense Evasion\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nObfuscated Files or Information\nT1027\nTruebot uses a .JSONIP extension (e.g., IgtyXEQuCEvAM.JSONIP), to create a GUID.\n\n\nObfuscated Files or Information: Binary Padding\nT1027.001\nCyber threat actors embed around one gigabyte of junk code within the malware string to evade detection protocols.\n\n\nMasquerading: Masquerade File Type\nT1036.008\nCyber threat actors hide Truebot malware as legitimate appearing file formats.\n\n\nProcess Injection\nT1055\nTruebot malware has the ability to load shell code after establishing a C2 connection.\n\n\nIndicator Removal: File Deletion\nT1070.004\n\nTruebot malware implements self-deletion TTPs throughout its attack cycle to evade detection.\nTeleport exfiltration tool deletes itself after it has completed exfiltrating data to the C2 station.\n\n\n\nModify Registry\nT1112\nFlawedGrace is able to modify registry programs that control the order that documents are loaded to a print que.\n\n\nReflective Code Loading\nT1620\n\nTruebot malware has the capability to load shell code and deploy various tools to stealthily navigate an infected network.\n \n\n\n\n\n \n\n\n\nTable 11: Credential Access\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nOS Credential Dumping: LSASS Memory\nT1003.001\nCyber threat actors use cobalt strike to gain valid credentials through LSASS memory dumping.\n\n\n\n \n\n\n\nTable 12: Discovery\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nSystem Network Configuration Discovery\nT1016\nTruebot malware scans and enumerates the affected system’s domain names.\n\n\nProcess Discovery\nT1057\nTruebot malware enumerates all running processes on the local host.\n\n\nSystem Information Discovery\nT1082\n\nTruebot malware scans and enumerates the OS version information, and processor architecture.\nTruebot malware enumerates the affected system’s computer names.\n\n\n\nSystem Time Discovery\nT1124\nTruebot has the ability to discover system time metrics, which aids in enables synchronization with the compromised system’s internal clock to facilitate scheduling tasks.\n\n\nSoftware Discovery: Security Software Discovery\nT1518.001\nTruebot has the ability to discover software security protocols, which aids in defense evasion.\n\n\nDebugger Evasion\nT1622\nTruebot malware scans the compromised environment for debugger tools and enumerates them in effort to evade network defenses.\n\n\n\n \n\n\n\nTable 13: Lateral Movement\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nExploitation of Remote Services\nT1210\nCyber threat actors exploit CVE-2022-31199 Netwrix Auditor vulnerability and use its capabilities to move laterally within a compromised network.\n\n\nUse Alternate Authentication Material: Pass the Hash\nT1550.002\nCyber threat actors use cobalt strike to authenticate valid accounts\n\n\nRemote Service Session Hijacking\nT1563.001\nCyber threat actors use cobalt strike to hijack remote sessions using SSH and RDP hijacking methods.\n\n\nRemote Service Session Hijacking: RDP Hijacking\nT1563.002\nCyber threat actors use cobalt strike to hijack remote sessions using SSH and RDP hijacking methods.\n\n\nLateral Tool Transfer\nT1570\nCyber threat actors deploy additional payloads to transfer toolsets and move laterally.\n\n\n\n \n\n\n\nTable 14: Collection\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nData from Local System\nT1005\n\nTruebot malware checks the current version of the OS and the processor architecture and compiles the information it receives.\nTruebot gathers and compiles compromised system’s host and domain names.\n\n\n\nScreen Capture\nT1113\nTruebot malware takes snapshots of local host data, specifically processor architecture data, and sends that to a phase 2 encoded data string.\n\n\n\n \n\n\n\nTable 15: Command and Control\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nApplication Layer Protocol\nT1071\nCyber threat actors use teleport exfiltration tool to blend exfiltrated data with network traffic.\n\n\nNon-Application Protocol\nT1095\nCyber threat actors use Teleport and FlawedGrace to send data over custom communication protocol.\n\n\nIngress Transfer Tool\nT1105\nCyber threat actors deploy various ingress transfer tool payloads to move laterally and establish C2 connections.\n\n\nEncrypted Channel: Asymmetric Cryptography\nT1573.002\nCyber threat actors use Teleport to create an encrypted channel using AES.\n\n\n\n \n\n\n\nTable 16: Exfiltration\n \n \n\n\n\n\nTechnique Title\nID\nUse\n\n\nScheduled Transfer\nT1029\nTeleport limits the data it collects and syncs with outbound organizational data/network traffic.\n\n\nData Transfer Size Limits\nT1030\nTeleport limits the data it collects and syncs with outbound organizational data/network traffic.\n\n\nExfiltration Over C2 Channel\nT1048\n\nCyber threat actors blend exfiltrated data with network traffic to evade detection.\nCyber threat actors use the Teleport tool to exfiltrate data over a C2 protocol.\n\n\n\n\n \nDETECTION METHODS\nCISA and authoring organizations recommend that organizations review and implement the following detection signatures, along with: Win/malicious_confidence100% (W), Trojan:Win32/Tnega!MSR, and Trojan.Agent.Truebot.Gen, as well as YARA rules below to help detect Truebot malware.\nDetection Signatures\n\nFigure 2: Snort Signature to Detect Truebot Malware\n\n\nalert tcp any any -> any any (msg:”TRUEBOT: Client HTTP Header”; sid:x; rev:1; flow:established,to_server; content:”Mozilla/112.0 (compatible|3b 20 4d 53 49 45 20 31 31 2e 30 3b 20 57 69 6e 64 6f 77 73 20 4e 54 20 31 30 2e 30 30 29|”; http_header; nocase; classtype:http-header; metadata:service http;)\n\n\n\n \nYARA Rules\nCISA developed the following YARA to aid in detecting the presence of Truebot Malware.\n\nFigure 3: YARA Rule for Detecting Truebot Malware\n\n\n\nrule CISA_10445155_01 : TRUEBOT downloader\n{\nmeta:\nAuthor = \"CISA Code & Media Analysis\"\nIncident = \"10445155\"\nDate = \"2023-05-17\"\nLast_Modified = \"20230523_1500\"\nActor = \"n/a\"\nFamily = \"TRUEBOT\"\nCapabilities = \"n/a\"\nMalware_Type = \"downloader\"\nTool_Type = \"n/a\"\nDescription = \"Detects TRUEBOT downloader samples\"\nSHA256 = \"7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\"\nstrings:\n$s1 = { 64 72 65 6d 6d 66 79 74 74 72 72 65 64 2e 63 6f 6d }\n$s2 = { 4e 73 75 32 4f 64 69 77 6f 64 4f 73 32 }\n$s3 = { 59 69 50 75 6d 79 62 6f 73 61 57 69 57 65 78 79 }\n$s4 = { 72 65 70 6f 74 73 5f 65 72 72 6f 72 2e 74 78 74 }\n$s5 = { 4c 6b 6a 64 73 6c 66 6a 33 32 6f 69 6a 72 66 65 77 67 77 2e 6d 70 34 }\n$s6 = { 54 00 72 00 69 00 67 00 67 00 65 00 72 00 31 00 32 }\n$s7 = { 54 00 55 00 72 00 66 00 57 00 65 00 73 00 54 00 69 00 66 00 73 00 66 }\ncondition:\n5 of them\n}\n\n\n\n\n\nAdditional YARA rules for detecting Truebot malware can be referenced from GitHub.[9]\n\nINCIDENT RESPONSE\nThe following steps are recommended if organizations detect a Truebot malware infection and compromise:\n\nQuarantine or take offline potentially affected hosts.\nCollect and review artifacts such as running processes/services, unusual authentications, and recent network connections.\nProvision new account credentials.\nReimage compromised host.\nReport the compromise to CISA via CISA’s 24/7 Operations Center (report@cisa.gov or 888-282-0870) or contact your local FBI field office. State, local, tribal, or territorial government entities can also report to MS-ISAC (SOC@cisecurity.org or 866-787-4722).\n\nMITIGATIONS\nCISA and the authoring organizations recommend organizations implement the below mitigations, including mandating phishing-resistant multifactor authentication (MFA) for all staff and services.\nFor additional best practices, see CISA’s Cross-Sector Cybersecurity Performance Goals (CPGs). The CPGs, developed by CISA and the National Institute of Standards and Technology (NIST), are a prioritized subset of IT and OT security practices that can meaningfully reduce the likelihood and impact of known cyber risks and common TTPs. Because the CPGs are a subset of best practices, CISA and co-sealers recommend software manufacturers implement a comprehensive information security program based on a recognized framework, such as the NIST Cybersecurity Framework (CSF).\n\nApply patches to CVE-2022-31199\nUpdate Netwrix Auditor to version 10.5\n\nNetwrix recommends using their Auditor application only on internally facing networks. System owners that don't follow this recommendation, and use the application in externally facing instances, are at increased risk to having CVE-2022-31199 exploited on their systems.\nReduce threat of malicious actors using remote access tools by:\n\nImplementing application controls to manage and control execution of software, including allowlisting remote access programs.\n\nApplication controls should prevent installation and execution of portable versions of unauthorized remote access and other software. A properly configured application allowlisting solution will block any unlisted application execution. Allowlisting is important because antivirus solutions may fail to detect the execution of malicious portable executables when the files use any combination of compression, encryption, or obfuscation.\n\n\n\nSee the National Security Agency’s Cybersecurity Information sheet, Enforce Signed Software Execution Policies, and additional guidance below:\n\nStrictly limit the use of RDP and other remote desktop services. If RDP is necessary, rigorously apply best practices, for example [CPG 2.W]:\n\nAudit the network for systems using RDP.\nClose unused RDP ports.\nEnforce account lockouts after a specified number of attempts.\nApply phishing-resistant multifactor authentication (MFA).\nLog RDP login attempts.\n\n\nDisable command-line and scripting activities and permissions [CPG 2.N].\nRestrict the use of PowerShell by using Group Policy, and only grant to specific users on a case-by-case basis. Typically, only those users or administrators who manage the network or Windows operating systems (OSs) should be permitted to use PowerShell [CPG 2.E].\nUpdate Windows PowerShell or PowerShell Core to the latest version and uninstall all earlier PowerShell versions. Logs from Windows PowerShell prior to version 5.0 are either non-existent or do not record enough detail to aid in enterprise monitoring and incident response activities [CPG 1.E, 2.S, 2.T].\nEnable enhanced PowerShell logging [CPG 2.T, 2.U].\n\nPowerShell logs contain valuable data, including historical OS and registry interaction and possible IOCs of a cyber threat actor’s PowerShell use.\nEnsure PowerShell instances, using the latest version, have module, script block, and transcription logging enabled (enhanced logging).\nThe two logs that record PowerShell activity are the PowerShell Windows Event Log and the PowerShell Operational Log. The authoring organizations recommend turning on these two Windows Event Logs with a retention period of at least 180 days. These logs should be checked on a regular basis to confirm whether the log data has been deleted or logging has been turned off. Set the storage size permitted for both logs to as large as possible.\n\n\nConfigure the Windows Registry to require User Account Control (UAC) approval for any PsExec operations requiring administrator privileges to reduce the risk of lateral movement by PsExec.\nReview domain controllers, servers, workstations, and active directories for new and/or unrecognized accounts [CPG 4.C].\nAudit user accounts with administrative privileges and configure access controls according to the principle of least privilege (PoLP) [CPG 2.E].\nReduce the threat of credential compromise via the following:\n\nPlace domain admin accounts in the protected users’ group to prevent caching of password hashes locally.\nImplement Credential Guard for Windows 10 and Server 2016 (Refer to Microsoft: Manage Windows Defender Credential Guard for more information). For Windows Server 2012R2, enable Protected Process Light for Local Security Authority (LSA).\nRefrain from storing plaintext credentials in scripts.\n\n\nImplement time-based access for accounts set at the admin level and higher [CPG 2.A, 2.E]. For example, the Just-in-Time (JIT) access method provisions privileged access when needed and can support enforcement of the principle of least privilege (as well as the Zero Trust model). This is a process where a network-wide policy is set in place to automatically disable admin accounts at the Active Directory (AD) level when the account is not in direct need. Individual users may submit their requests through an automated process that grants them access to a specified system for a set timeframe when they need to support the completion of a certain task.\n\nIn addition, CISA, FBI, MS-ISAC, and CCCS recommend network defenders apply the following mitigations to limit potential adversarial use of common system and network discovery techniques and to reduce the impact and risk of compromise by ransomware or data extortion actors:\n\nDisable File and Printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nImplement a recovery plan to maintain and retain multiple copies of sensitive or proprietary data and servers in a physically separate, segmented, and secure location (e.g., hard drive, storage device, or the cloud).\nMaintain offline backups of data and regularly maintain backup and restoration (daily or weekly at minimum). By instituting this practice, an organization minimizes the impact of disruption to business practices as they can retrieve their data [CPG 2.R]. \nRequire all accounts with password logins (e.g., service account, admin accounts, and domain admin accounts) to comply with National Institute for Standards and Technology (NIST) standards for developing and managing password policies.\n\nUse longer passwords consisting of at least 15 characters [CPG 2.B].\nStore passwords in hashed format using industry-recognized password managers.\nAdd password user “salts” to shared login credentials.\nAvoid reusing passwords [CPG 2.C].\nImplement multiple failed login attempt account lockouts [CPG 2.G].\nDisable password “hints.”\nRefrain from requiring password changes more frequently than once per year.Note: NIST guidance suggests favoring longer passwords instead of requiring regular and frequent password resets. Frequent password resets are more likely to result in users developing password “patterns” cyber criminals can easily decipher.\nRequire administrator credentials to install software.\n\n\nRequire phishing-resistant multifactor authentication for all services to the extent possible, particularly for webmail, virtual private networks, and accounts that access critical systems [CPG 2.H].\nKeep all operating systems, software, and firmware up to date. Timely patching is one of the most efficient and cost-effective steps an organization can take to minimize its exposure to cybersecurity threats. Organizations should patch vulnerable software and hardware systems within 24 to 48 hours of vulnerability disclosure. Prioritize patching known exploited vulnerabilities in internet-facing systems [CPG 1.E].\nSegment networks to prevent the spread of ransomware. Network segmentation can help prevent the spread of ransomware by controlling traffic flows between—and access to various subnetworks, restricting further lateral movement [CPG 2.F].\nIdentify, detect, and investigate abnormal activity and potential traversal of the indicated ransomware with a networking monitoring tool. To aid in detecting ransomware, implement a tool that logs and reports all network traffic, including lateral movement activity on a network. Endpoint detection and response (EDR) tools are particularly useful for detecting lateral connections, as they have insight into common and uncommon network connections for each host [CPG 3.A].\nInstall, regularly update, and enable real time detection for antivirus software on all hosts.\nDisable unused ports [CPG 2.V].\nConsider adding an email banner to emails received from outside your organization [CPG 2.M].\nEnsure all backup data is encrypted, immutable (i.e., cannot be altered or deleted), and covers the entire organization’s data infrastructure [CPG 2.K, 2.L, 2.R].\n\nVALIDATE SECURITY CONTROLS\nIn addition to applying mitigations, CISA recommends exercising, testing, and validating your organization's security program against the threat behaviors mapped to the MITRE ATT&CK for Enterprise framework in this advisory. CISA recommends testing your existing security controls inventory to assess how they perform against the ATT&CK techniques described in this advisory.\nTo get started:\n\nSelect an ATT&CK technique described in this advisory (see Tables 5-13).\nAlign your security technologies against the technique.\nTest your technologies against the technique.\nAnalyze your detection and prevention technologies’ performance.\nRepeat the process for all security technologies to obtain a set of comprehensive performance data.\nTune your security program, including people, processes, and technologies, based on the data generated by this process.\n\nCISA recommends continually testing your security program, at scale, in a production environment to ensure optimal performance against the MITRE ATT&CK techniques identified in this advisory.\nRESOURCES\n\nNIST: NVD - CVE-2022-31199\nStopransomware.gov (A whole-of-government approach with one central location for U.S. ransomware resources and alerts.)\n#StopRansomware Guide\nCISA: Implement Phishing-Resistant MFA\nCISA: Guide to Securing Remote Access Software\nCISA and MS-ISAC: Joint Ransomware Guide\nCISA: Cross-Sector Cybersecurity Performance Goals\nCL0P Ransomware Uses Truebot Malware for Access to Networks\nField Offices – FBI\nNSA – Zero Trust Security Model\n\nREFERENCES\n[1] Bishop Fox: Netwrix Auditor Advisory[2] Talos Intelligence: Breaking the Silence - Recent Truebot Activity[3] The DFIR Report: Truebot Deploys Cobalt Strike and FlawedGrace[4] MAR-10445155-1.v1 .CLEAR Truebot Activity Infects U.S. and Canada Based Networks[5] Red Canary: Raspberry Robin Delivery Vector[6] Microsoft: Raspberry Robin Worm Part of a Larger Ecosystem Pre-Ransomware Activity[7] Telsy: FlawedGrace RAT[8] VMware Security Blog: Carbon Black’s Truebot Detection[9] GitHub: DFIR Report - Truebot Malware YARA Rule\nAdditional Sources\nAlarming Surge in TrueBot Activity Revealed with New Delivery Vectors (thehackernews.com)Truebot Analysis Part 1Truebot Analysis Part 2Truebot Analysis Part 3Truebot Exploits Netwrix VulnerabilityTrueBot malware delivery evolves, now infects businesses in the US and elsewhere Malpedia-Silence DownloaderPrinter spooling: what is it and how to fix it? | PaperCut\nACKNOWLEDGEMENTS\nVMware Carbon Black and Mandiant contributed to this CSA.\nDISCLAIMER\nThe information in this report is being provided “as is” for informational purposes only. CISA and authoring agencies do not endorse any commercial product or service, including any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring by CISA, and co-sealers.\n",
  "cves": [
    "CVE-2022-31199",
    "CVE-2022-3199",
    "CVE-2023-34362"
  ],
  "techniques": [
    "T1566",
    "T1550",
    "T1113",
    "T1071",
    "T1204",
    "T1622",
    "T1091",
    "T1204.001",
    "T1547",
    "T1574",
    "T1570",
    "T1547.012",
    "T1563.001",
    "T1210",
    "T1016",
    "T1573",
    "T1563.002",
    "T1055.001",
    "T1518.001",
    "T1003.001",
    "T1095",
    "T1036.008",
    "T1057",
    "T1055",
    "T1189",
    "T1566.002",
    "T1005",
    "T1027",
    "T1059",
    "T1518",
    "T1112",
    "T1563",
    "T1030",
    "T1129",
    "T1550.002",
    "T1003",
    "T1620",
    "T1082",
    "T1027.009",
    "T1573.002",
    "T1105",
    "T1204.002",
    "T1029",
    "T1190",
    "T1027.001",
    "T1070",
    "T1124",
    "T1048",
    "T1036",
    "T1070.004"
  ],
  "advisory": "aa23-187a",
  "title": "Increased Truebot Activity Infects U.S. and Canada Based Networks | CISA",
  "source": "cybersecurity-advisories",
  "id": "6ae1d4f6a94f3bd3bc4ba2040982624267427e2c664901044d3fe9c5d50838dc"
}