{
  "markdown": "\n\n\n\n\n\n\nNotification\n\nThis report is provided \"as is\" for informational purposes only. The Department of Homeland Security (DHS) does not provide any warranties of any kind regarding any information contained herein. The DHS does not endorse any commercial product or service referenced in this bulletin or otherwise.\nThis document is marked TLP:WHITE--Disclosure is not limited. Sources may use TLP:WHITE when information carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction. For more information on the Traffic Light Protocol (TLP), see http://www.us-cert.gov/tlp.\n\nSummary\n\nDescription\nThis Malware Analysis Report (MAR) is the result of analytic efforts between Department of Homeland Security (DHS), the Federal Bureau of Investigation (FBI), and the Department of Defense (DoD). Working with U.S. Government partners, DHS, FBI, and DoD identified Trojan malware variants used by the North Korean government. This malware variant has been identified as CROWDEDFLOUNDER. The U.S. Government refers to malicious cyber activity by the North Korean government as HIDDEN COBRA. For more information on HIDDEN COBRA activity, visit https[:]//www[.]us-cert.gov/hiddencobra.\n\n\t\t\tDHS, FBI, and DoD are distributing this MAR to enable network defense and reduce exposure to North Korean government malicious cyber activity.\n\n\t\t\tThis MAR includes malware descriptions related to HIDDEN COBRA, suggested response actions and recommended mitigation techniques. Users or administrators should flag activity associated with the malware and report the activity to the Cybersecurity and Infrastructure Security Agency (CISA) or the FBI Cyber Watch (CyWatch), and give the activity the highest priority for enhanced mitigation.\n\n\t\t\tThis report analyzes a Themida packed 32-bit Windows executable, which is designed to unpack and execute a Remote Access Trojan (RAT) binary in memory. This application is designed to accept arguments during execution or can be installed as a service with command line arguments. It is designed to listen as a proxy for incoming connections containing commands or can connect to a remote server to receive commands.\nFor a downloadable copy of IOCs, see MAR-10265965-3.v1.stix.\nSubmitted Files (1)\na2a77cefd2faa17e18843d74a8ad155a061a13da9bd548ded6437ef855c14442 (F2B9D1CB2C4B1CD11A8682755BCC52...)\n\nFindings\n\na2a77cefd2faa17e18843d74a8ad155a061a13da9bd548ded6437ef855c14442\nTags\ntrojan\nDetails\n\n\n\nName\nF2B9D1CB2C4B1CD11A8682755BCC52FA\n\n\nSize\n1658880 bytes\n\n\nType\nPE32 executable (GUI) Intel 80386, for MS Windows\n\n\nMD5\nf2b9d1cb2c4b1cd11a8682755bcc52fa\n\n\nSHA1\n579884fad55207b54e4c2fe2644290211baec8b5\n\n\nSHA256\na2a77cefd2faa17e18843d74a8ad155a061a13da9bd548ded6437ef855c14442\n\n\nSHA512\nb047a4275f0fa7c0025945800acbffb5be1d327160a135c6ba8ff54352be603cbb47fff71f180ab1a915229778b7a883ed19e1d6a954ab82435913ed95c40752\n\n\nssdeep\n24576:darngxIJfX2+8mGrvs5pdUIPv3eAUW/Y8w9ejjERAjYrNFtI937sTR7R5NwrzD:da7gx2B81gdVXvfAnHRFtIl7k7RPwr\n\n\nEntropy\n7.958686\n\n\n\nAntivirus\n\n\n\nAhnlab\nTrojan/Win32.Xpacked\n\n\nAntiy\nTrojan/Win32.BlueNoroff\n\n\nAvira\nTR/Crypt.TPM.Gen\n\n\nBitDefender\nTrojan.GenericKD.41987817\n\n\nClamAV\nWin.Trojan.Agent-7376505-0\n\n\nCyren\nW32/Trojan.SXNN-1599\n\n\nESET\nWin32/NukeSped.CL trojan\n\n\nEmsisoft\nTrojan.GenericKD.41987817 (B)\n\n\nIkarus\nTrojan.Win32.NukeSped\n\n\nK7\nTrojan ( 0040f4ef1 )\n\n\nMcAfee\nTrojan-NukeSped.a\n\n\nMicrosoft Security Essentials\nTrojan:Win32/Thcsim\n\n\nNANOAV\nTrojan.Win32.BlueNoroff.ggbrdv\n\n\nNetGate\nTrojan.Win32.Malware\n\n\nSophos\nTroj/Agent-BCXR\n\n\nSymantec\nTrojan Horse\n\n\nTrendMicro\nTROJ_THCSIM.A\n\n\nTrendMicro House Call\nTROJ_THCSIM.A\n\n\nVirusBlokAda\nBScope.TrojanPSW.Predator\n\n\nZillya!\nTrojan.NukeSped.Win32.184\n\n\n\nYARA Rules\nNo matches found.\nssdeep Matches\nNo matches found.\nPE Metadata\n\n\n\nCompile Date\n2017-02-20 05:45:37-05:00\n\n\nImport Hash\nbaa93d47220682c04d92f7797d9224ce\n\n\n\nPE Sections\n\n\n\nMD5\nName\nRaw Size\nEntropy\n\n\na7295799f336e3a6e8b61fe4f93e2251\nheader\n4096\n0.812374\n\n\n2db23f163210140d797f67ed1ec1f08e\n \n156160\n7.983767\n\n\nd41d8cd98f00b204e9800998ecf8427e\n.rsrc\n0\n0.000000\n\n\nefcb51d4d8a55d441d194e80899bb2b0\n.idata\n512\n1.308723\n\n\nd5443c2d2f51ba6c31a5fc9c35af7a2f\n \n512\n0.240445\n\n\n8eea01ecbee2f6234d68b27d4e05585a\nhtusmqub\n1497088\n7.954958\n\n\n6b71d93792bb677f0a09dbe70e6df1a2\nijybpcqb\n512\n3.636986\n\n\n\nDescription\nThis application is a Themida packed 32-bit Windows executable, which is designed to unpack and execute a RAT binary in memory. This application is designed to accept arguments during execution or can be installed as a service with command line arguments. When executed, the application is designed to open the Windows Firewall on the victim’s machine to allow for incoming and outgoing connections from the victim system. The firewall is modified using a \"netsh firewall add portopening\" command (Figure 2). Static analysis indicates this malware may be utilized to listen as a proxy for incoming connections containing commands or can connect to a remote server to receive commands. The following command line arguments are utilized to control the RAT functionality:\n\n\t\t\t--Begin RAT command line arguments--\n\n\t\t\t-p: You can use the -p command line argument to force the malware to listen on a specific port. Example: malware.exe -p 8888\n\n\t\t\t-h: You can use the -h CLI to force the malware to connect to a remote host and port. Example: malware.exe -h <url_string>:8888\n\n\t\t\tNote: <url_string> can be either a fully qualified domain name or an Internet Protocol (IP) address.\n\n\t\t\t--End RAT command line arguments--\n\n\t\t\tThe RAT uses a rotating exclusive or (XOR) cryptographic algorithm to secure its data transfers and command-and-control (C2) sessions (Figure 1). The malware is designed to accept instructions from the remote server to perform the following functions:\n\n\t\t\t--Begin functions performed by the malware--\n\t\t\tDownload and upload files\n\t\t\tExecute secondary payloads\n\t\t\tExecute shell commands\n\t\t\tTerminate running processes\n\t\t\tDelete files\n\t\t\tSearch files\n\t\t\tSet file attributes\n\t\t\tCollect device information from installed storage devices (disk free space and their type)\n\t\t\tList running processes information\n\t\t\tCollect and send information about the victim's system\n\t\t\tSecurely download malicious DLLs and inject them into remote processes\n\t\t\t--End functions performed by the malware--\n\n\t\t\tThe -h argument is utilized to force the RAT to connect to a C2 server and the CURL library (Version 7.49.1) will be used for data transfers. Note: A rotating XOR cipher will be used to secure all C2 traffic sent and received from the external C2 server. Although the malware appears to expect a numeric IP address with the -h argument, it will also accept a string Uniform Resource Locator (URL) value. If a URL string is provided (i.e. domain.com) the malware will then query this address using the Win32 API getaddrinfo(). If this call succeeds, an IP address will be returned and the malware will attempt to connect to that IP address. If the call to getaddrinfo() fails the malware will hash this domain using the MD5 hashing algorithm, resulting in a 16 byte hash value. The malware will then take bytes 4 through 8 of this hash value and XOR them with a four byte value. The resultant four byte value will then be treated as a numeric IP address. The malware will then attempt to connect to this newly generated IP address. Note: all of the command line executables referenced within this product generate and connect to an IP address generated from the provided URL string if the call to getaddrinfo() against the provided URL fails.\nScreenshots\n \n\nFigure 1 - XOR based cipher utilized by RAT to secure traffic between itself and the operator/C2 server.\n\n \n\nFigure 2 - Malware loading the command to open the firewall.\n\n \n\nFigure 3 - This structure is utilized to parse the proxy port or remote C2 server from the command line arguments.\n\n\nRecommendations\n\nCISA recommends that users and administrators consider using the following best practices to strengthen the security posture of their organization's systems. Any configuration changes should be reviewed by system owners and administrators prior to implementation to avoid unwanted impacts.\n\nMaintain up-to-date antivirus signatures and engines.\nKeep operating system patches up-to-date.\nDisable File and Printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nRestrict users' ability (permissions) to install and run unwanted software applications. Do not add users to the local administrators group unless required.\nEnforce a strong password policy and implement regular password changes.\nExercise caution when opening e-mail attachments even if the attachment is expected and the sender appears to be known.\nEnable a personal firewall on agency workstations, configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious e-mail attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to sites with unfavorable content.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs, etc.).\nScan all software downloaded from the Internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate Access Control Lists (ACLs).\n\nAdditional information on malware incident prevention and handling can be found in National Institute of Standards and Technology (NIST) Special Publication 800-83, \"Guide to Malware Incident Prevention & Handling for Desktops and Laptops\".\n\nContact Information\n\n\n1-888-282-0870\nNCCICCustomerService@us-cert.gov (UNCLASS)\nus-cert@dhs.sgov.gov (SIPRNET)\nus-cert@dhs.ic.gov (JWICS)\n\nCISA continuously strives to improve its products and services. You can help by answering a very short series of questions about this product at the following URL: https://us-cert.gov/forms/feedback/\n\nDocument FAQ\n\nWhat is a MIFR? A Malware Initial Findings Report (MIFR) is intended to provide organizations with malware analysis in a timely manner. In most instances this report will provide initial indicators for computer and network defense. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nWhat is a MAR? A Malware Analysis Report (MAR) is intended to provide organizations with more detailed malware analysis acquired via manual reverse engineering. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nCan I edit this document? This document is not to be edited in any way by recipients. All comments or questions related to this document should be directed to the CISA at 1-888-282-0870 or soc@us-cert.gov.\nCan I submit malware to CISA? Malware samples can be submitted via three methods:\n\nWeb: https://malware.us-cert.gov\nE-Mail: submit@malware.us-cert.gov\nFTP: ftp.malware.us-cert.gov (anonymous)\n\nCISA encourages you to report any suspicious activity, including cybersecurity incidents, possible malicious code, software vulnerabilities, and phishing-related scams. Reporting forms can be found on CISA's homepage at www.us-cert.gov.\n\n\n\n\n\n\n\n\nRevisions\n\nFebruary 14, 2020: Initial Version\n",
  "cves": [
    "CVE-2022-47966",
    "CVE-2022-42475"
  ],
  "techniques": [],
  "advisory": "ar20-045c",
  "title": "MAR-10265965-3.v1 – North Korean Trojan: CROWDEDFLOUNDER | CISA",
  "source": "analysis-reports",
  "id": "a452a49c0f1d464e71c699957e073ec4fa91f98fafe2606f6933a6c128dd079b"
}