{
  "markdown": "\n\n\n\n\n\n\n\n \n\nNotification\n\nThis report is provided \"as is\" for informational purposes only. The Department of Homeland Security (DHS) does not provide any warranties of any kind regarding any information contained herein. The DHS does not endorse any commercial product or service referenced in this bulletin or otherwise.\nThis document is marked TLP:WHITE--Disclosure is not limited. Sources may use TLP:WHITE when information carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction. For more information on the Traffic Light Protocol (TLP), see http://www.us-cert.gov/tlp.\n\nSummary\n\nDescription\nOne Microsoft Word Open Extensible Markup Language (XML) Format Document file (DOCX file) was submitted for analysis. The file attempts to download a Microsoft Word template from a Uniform Resource Locator (URL). The URL was not active at the time of analysis.\nFor a downloadable copy of IOCs, see MAR-10285677-2.v1.stix.\nSubmitted Files (1)\n7d2b9f391588cc07d9ba78d652819d32d3d79e5a74086b527c32126ad88b5015 (7d2b9f391588cc07d9ba78d652819d...)\nDomains (1)\ncrphone.mireene.com\n\nFindings\n\n7d2b9f391588cc07d9ba78d652819d32d3d79e5a74086b527c32126ad88b5015\nTags\nCVE-2017-0199downloadertrojan\nDetails\n\n\n\nName\n7d2b9f391588cc07d9ba78d652819d32d3d79e5a74086b527c32126ad88b5015\n\n\nSize\n225448 bytes\n\n\nType\nMicrosoft Word 2007+\n\n\nMD5\na4388c4d0588cd3d8a607594347663e0\n\n\nSHA1\nb066369bbd48b7858f2c1eed1e78d85c8ae4cdb6\n\n\nSHA256\n7d2b9f391588cc07d9ba78d652819d32d3d79e5a74086b527c32126ad88b5015\n\n\nSHA512\n6cb4ade649094cf14735830627497826f40fabb400308cfc9ebe4c262dd6dd49185baab877d5393a67df2516b3f99a7b5ab8f958d7ccddb5c0838b48814532f1\n\n\nssdeep\n6144:PMtCBStDIwnddEwBj6U19akUWzZECImdzxGdakUWzZECImdzxGdm:ktCBPwnddEwJ6Umk0ChGck0ChGs\n\n\nEntropy\n7.965669\n\n\n\nAntivirus\n\n\n\nAhnlab\nDOC/Downloader\n\n\nAntiy\nTrojan[Exploit]/MSOffice.CVE-2017-0199\n\n\nAvira\nEXP/CVE-2017-0199.joxaz\n\n\nBitDefender\nTrojan.GenericKD.42863619\n\n\nESET\nDOC/TrojanDownloader.Agent.CF trojan\n\n\nEmsisoft\nTrojan.GenericKD.42863619 (B)\n\n\nIkarus\nExploit.CVE-2017-0199\n\n\nMcAfee\nTrojan-FRVP!201AEB7EC56D\n\n\nMicrosoft Security Essentials\nExploit:O97M/CVE-2017-0199!MTB\n\n\nNANOAV\nExploit.Xml.CVE-2017-0199.equmby\n\n\nSophos\nTroj/DocDl-XXQ\n\n\nSymantec\nW97M.Downloader\n\n\nVir.IT eXplorer\nW97M.Downloader.CBT\n\n\n\nYARA Rules\nNo matches found.\nssdeep Matches\nNo matches found.\nRelationships\n\n\n\n7d2b9f3915...\nConnected_To\ncrphone.mireene.com\n\n\n\nDescription\nThis file is a Microsoft Word DOCX file (Figure 1). One of the XML files, \"settings.xml.rels\" (Figure 2), contains a target for a template located at the following URL:\n\n\t\t\t--Begin URL--\n\t\t\thxxp[:]//crphone.mireene[.]com/plugin/editor/Templates/normal.php?name=web\n\t\t\t--End URL--\n\n\t\t\tIf a user opens the document in Word, the document entices the user to \"Enable Macros\". This technique is used to trick the user, because the document does not contain macros and will attempt to load the template from the external network location. The URL was not available at the time of analysis.\nScreenshots\n \n\nFigure 1 - Screenshot of the DOCX file.\n\n \n\nFigure 2 - This XML file contains an external location to a URL to download a suspicious Microsoft Word template.\n\n\n\ncrphone.mireene.com\nTags\ncommand-and-control\nURLs\n\nhxxp[:]//crphone.mireene.com/plugin/editor/Templates/normal.php?name=web\n\nWhois\nDomain Name: MIREENE.COM\n\t\t\tRegistry Domain ID: 118139791_DOMAIN_COM-VRSN\n\t\t\tRegistrar WHOIS Server: whois.doregi.com\n\t\t\tRegistrar URL: http://www.doregi.com\n\t\t\tUpdated Date: 2017-02-23T02:39:15Z\n\t\t\tCreation Date: 2004-04-24T02:46:25Z\n\t\t\tRegistry Expiry Date: 2021-04-24T02:46:25Z\n\t\t\tRegistrar: HANGANG Systems, Inc. dba Doregi.com\n\t\t\tRegistrar IANA ID: 87\n\t\t\tRegistrar Abuse Contact Email: abuse@doregi.com\n\t\t\tRegistrar Abuse Contact Phone: +82.7071631100\n\t\t\tDomain Status: clientTransferProhibited https://icann.org/epp#clientTransferProhibited\n\t\t\tName Server: NS1.MIREENE.COM\n\t\t\tName Server: NS2.MIREENE.COM\n\t\t\tDNSSEC: unsigned\n\t\t\tURL of the ICANN Whois Inaccuracy Complaint Form: https://www.icann.org/wicf/\n\t\t\t>>> Last update of whois database: 2020-04-27T11:39:43Z <<<\nRelationships\n\n\n\ncrphone.mireene.com\nConnected_From\n7d2b9f391588cc07d9ba78d652819d32d3d79e5a74086b527c32126ad88b5015\n\n\n\nDescription\nThe file attempts to download a potential Microsoft word template from the domain.\n\nRelationship Summary\n\n\n\n\n7d2b9f3915...\nConnected_To\ncrphone.mireene.com\n\n\ncrphone.mireene.com\nConnected_From\n7d2b9f391588cc07d9ba78d652819d32d3d79e5a74086b527c32126ad88b5015\n\n\n\n\nRecommendations\n\nCISA recommends that users and administrators consider using the following best practices to strengthen the security posture of their organization's systems. Any configuration changes should be reviewed by system owners and administrators prior to implementation to avoid unwanted impacts.\n\nMaintain up-to-date antivirus signatures and engines.\nKeep operating system patches up-to-date.\nDisable File and Printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nRestrict users' ability (permissions) to install and run unwanted software applications. Do not add users to the local administrators group unless required.\nEnforce a strong password policy and implement regular password changes.\nExercise caution when opening e-mail attachments even if the attachment is expected and the sender appears to be known.\nEnable a personal firewall on agency workstations, configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious e-mail attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to sites with unfavorable content.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs, etc.).\nScan all software downloaded from the Internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate Access Control Lists (ACLs).\n\nAdditional information on malware incident prevention and handling can be found in National Institute of Standards and Technology (NIST) Special Publication 800-83, \"Guide to Malware Incident Prevention & Handling for Desktops and Laptops\".\n\nContact Information\n\n\n1-888-282-0870\nNCCICCustomerService@us-cert.gov (UNCLASS)\nus-cert@dhs.sgov.gov (SIPRNET)\nus-cert@dhs.ic.gov (JWICS)\n\nCISA continuously strives to improve its products and services. You can help by answering a very short series of questions about this product at the following URL: https://us-cert.gov/forms/feedback/\n\nDocument FAQ\n\nWhat is a MIFR? A Malware Initial Findings Report (MIFR) is intended to provide organizations with malware analysis in a timely manner. In most instances this report will provide initial indicators for computer and network defense. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nWhat is a MAR? A Malware Analysis Report (MAR) is intended to provide organizations with more detailed malware analysis acquired via manual reverse engineering. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nCan I edit this document? This document is not to be edited in any way by recipients. All comments or questions related to this document should be directed to the CISA at 1-888-282-0870 or soc@us-cert.gov.\nCan I submit malware to CISA? Malware samples can be submitted via three methods:\n\nWeb: https://malware.us-cert.gov\nE-Mail: submit@malware.us-cert.gov\nFTP: ftp.malware.us-cert.gov (anonymous)\n\nCISA encourages you to report any suspicious activity, including cybersecurity incidents, possible malicious code, software vulnerabilities, and phishing-related scams. Reporting forms can be found on CISA's homepage at www.us-cert.gov.\n\n\n\n\n\n\n\n\nRevisions\n\nMay 12, 2020: Initial Version\n",
  "cves": [
    "CVE-2017-0199",
    "CVE-2022-47966",
    "CVE-2022-42475"
  ],
  "techniques": [],
  "advisory": "ar20-133g",
  "title": "MAR-10285677-2.v1 | CISA",
  "source": "analysis-reports",
  "id": "d82862a7cb9cb04292bb66ecb20a2348f6574fbaada4961b19ff8baee278182e"
}