{
  "markdown": "\n\n \n\n\n\n\n\nNotification\n\nThis report is provided \"as is\" for informational purposes only. The Department of Homeland Security (DHS) does not provide any warranties of any kind regarding any information contained herein. The DHS does not endorse any commercial product or service referenced in this bulletin or otherwise.\nThis document is marked TLP:WHITE--Disclosure is not limited. Sources may use TLP:WHITE when information carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction. For more information on the Traffic Light Protocol (TLP), see http://www.cisa.gov/tlp.\n\nSummary\n\nDescription\nCISA received two (2) files for analysis. The files are Pulse Secure Common Gateway Interface (CGI) scripts that have been modified. The primary purpose of these system modifications is to provide a remote operator Command and Control (C2) access over a compromised device running the modified scripts. This analysis is derived from malicious files found on Pulse Connect Secure devices.\nFor a downloadable copy of IOCs, see: MAR-10334057-2.v1.WHITE.stix.\nSubmitted Files (2)\n55800aa55e96ed160dcef2dcc0797085c2d6c9f70b522eed3d269e2f3268014e (tnchcupdate.cgi)\n814b430126795b4b06c0b5c3c4919c7a55be441f45756282b0754e3517141f93 (healthcheck.cgi)\n\nFindings\n\n814b430126795b4b06c0b5c3c4919c7a55be441f45756282b0754e3517141f93\nTags\nwebshell\nDetails\n\n\n\nName\nhealthcheck.cgi\n\n\nSize\n9272 bytes\n\n\nType\nPerl script text executable\n\n\nMD5\nb817140c6e511e1a6254c19aa855c0b4\n\n\nSHA1\nc8280f0b4391087327138cf14886e6fe48ed102a\n\n\nSHA256\n814b430126795b4b06c0b5c3c4919c7a55be441f45756282b0754e3517141f93\n\n\nSHA512\n485b7346261f74113a7809e6a010bc4baf1a2dc09fc03df64b36144c02a255e5cfd2bbc3458de15b3551213a690c090f83c06065cca6910e4995ceef3c86d2b1\n\n\nssdeep\n192:XzwJNuIYj7rcCOk1QrhMeWyOUV9AWojcZiOQiQsfinnoK9Cih1pa+7yiPhm:XzwJwrXWOUV9AWojoiOubQ\n\n\nEntropy\n5.116529\n\n\n\nAntivirus\n\n\n\nSymantec\nHacktool.Webshell\n\n\n\nYARA Rules\nNo matches found.\nssdeep Matches\n\n\n\n97\n85f74424fb4c7dba9f2e9c60a95c8a226a97f7dfc277f5ce6f34862a9f500226\n\n\n97\nc445cab266549820d54168cb8e5078811d574682edce7edb973b3d833128f4e3\n\n\n\nDescription\nThis file is a Pulse Secure CGI script with malicious code patched to the end of the file (Figure 1, 2 and 3).\n\n\t\t\tIf the system receives a POST request that match any one of the following three conditions it will trigger the malicious code. Otherwise, it defaults to the original Pulse Secure application.\n\n\t\t\tCondition 1: The attacker submits a RC4 encrypted and base64 encoded shell command under the 'cert' parameter. The command is base64 decoded and RC4 decrypted before it is executed. The command's output is sent to the attacker.\n\n\n\t\t\tCondition 2: The attacker provides input to two parameters: 'img' and 'name', then it calls the function (sub c), which only processes input to the 'img' parameter. The input is base64 decoded and RC4 decrypted, then it is written to a file named tmp. The file is then RC4 encrypted and base64 encoded before being sent to the attacker.\n\n\t\t\tCondition 3: The attacker submits RC4 encrypted and base64 encoded shell commands under the 'name' parameter, leaving the parameter 'img' blank. The shell command is base64 decoded and RC4 decrypted before it is executed, the command output is RC4 encrypted and base64 encoded before sending to the attacker.\n\n\t\t\tThe following functions describe the encryption scheme employed by the malware (Figure 1).\n\n\t\t\tsub r: This function generates random bytes to be used in (sub a) for encryption.\n\n\t\t\tsub a: First it calls the (sub r) function to obtain a random six bytes ($k), which is prepended to the hard coded passphrase ($ph) and forms the RC4 encryption key to encrypt the string ($st). The encrypted string is then base64 encoded.\n\n\t\t\tsub b: First, it base64 decodes the input string. The decoded string ($s) is separated into the first six bytes ($k) and the rest without the first six bytes ($en). The first six bytes ($k) is prepended to the hard coded passphrase ($ph) and forms the RC4 decryption key ($k.$ph) to decrypt the string ($en).\nScreenshots\n \n\nFigure 1 - Screenshot of the patched in malicious code at the end of healthcheck.cgi. This section contains the encryption scheme employed by the malware.\n\n \n\nFigure 2 - Screenshot of the patched in malicious code at the end of healthcheck.cgi, continued from Figure 1. This screenshot contains function (sub c) which is called under condition 2 and function (sub d) which is called under condition 1.\n\n \n\nFigure 3 - Screenshot of the patched in malicious code at the end of healthcheck.cgi, continued from Figure 1. This screenshot contains function (sub e) which is called under condition 3 and the function (sub f) which decides the execution of functions (sub c, d and e) depending on the input parameters.\n\n\n\n55800aa55e96ed160dcef2dcc0797085c2d6c9f70b522eed3d269e2f3268014e\nTags\nwebshell\nDetails\n\n\n\nName\ntnchcupdate.cgi\n\n\nSize\n27958 bytes\n\n\nType\nPerl script text executable\n\n\nMD5\nb0106374ad72e0e63c73d4013cd1284a\n\n\nSHA1\nd864f76565f48a545c5ac8067a65a761402faad5\n\n\nSHA256\n55800aa55e96ed160dcef2dcc0797085c2d6c9f70b522eed3d269e2f3268014e\n\n\nSHA512\n7a4e4430d87f7178a3c302d8d4fc0cb63683858ca04de6d4da739bfa1839c85e8d6681d1646705b11dc1e94f1e3543d4779d35c968079cac0b293b90b3fa6019\n\n\nssdeep\n384:X/XaWMIVzjJVreteR03LD/AxrYjVRzptulRvU71F2K9gjOTU:X/Xa94jJVrete2gxrYj34vU7/2K2CU\n\n\nEntropy\n4.919695\n\n\n\nAntivirus\nNo matches found.\nYARA Rules\nNo matches found.\nssdeep Matches\n\n\n\n99\n779d5410b6974cacacfdcddd68e7dac2409ea7957b9be4ae049466bd550de63c\n\n\n99\nc964594ed0afaf64611514eb53f14ee5ab95e25da986dca9e28586bfc053da16\n\n\n\nDescription\nThis file is a modified version of a Pulse Secure Perl CGI file (Figure 4). It is designed to perform an initial check to determine whether data was passed into the web application within a parameter named \"id\". If this parameter is provided, the code will extract its contents and execute them on the target system using the system() function. If no \"id\" parameter is passed to the application, the code will simply execute the main() function of the original Pulse Secure application.\nScreenshots\n \n\nFigure 4 - Screenshot of the malicious code patched-in to the end-of-file.\n\n\nRecommendations\n\nCISA recommends that users and administrators consider using the following best practices to strengthen the security posture of their organization's systems. Any configuration changes should be reviewed by system owners and administrators prior to implementation to avoid unwanted impacts.\n\nMaintain up-to-date antivirus signatures and engines.\nKeep operating system patches up-to-date.\nDisable File and Printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nRestrict users' ability (permissions) to install and run unwanted software applications. Do not add users to the local administrators group unless required.\nEnforce a strong password policy and implement regular password changes.\nExercise caution when opening e-mail attachments even if the attachment is expected and the sender appears to be known.\nEnable a personal firewall on agency workstations, configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious e-mail attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to sites with unfavorable content.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs, etc.).\nScan all software downloaded from the Internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate Access Control Lists (ACLs).\n\nAdditional information on malware incident prevention and handling can be found in National Institute of Standards and Technology (NIST) Special Publication 800-83, \"Guide to Malware Incident Prevention & Handling for Desktops and Laptops\".\n\nContact Information\n\n\n1-888-282-0870\nCISA Central (UNCLASS)\nCISA SIPR (SIPRNET)\nCISA IC (JWICS)\n\nCISA continuously strives to improve its products and services. You can help by answering a very short series of questions about this product at the following URL: https://us-cert.cisa.gov/forms/feedback/\n\nDocument FAQ\n\nWhat is a MIFR? A Malware Initial Findings Report (MIFR) is intended to provide organizations with malware analysis in a timely manner. In most instances this report will provide initial indicators for computer and network defense. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nWhat is a MAR? A Malware Analysis Report (MAR) is intended to provide organizations with more detailed malware analysis acquired via manual reverse engineering. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nCan I edit this document? This document is not to be edited in any way by recipients. All comments or questions related to this document should be directed to the CISA at 1-888-282-0870 or CISA Central.\nCan I submit malware to CISA? Malware samples can be submitted via three methods:\n\nWeb: https://malware.us-cert.gov\nE-Mail: submit@malware.us-cert.gov\nFTP: ftp.malware.us-cert.gov (anonymous)\n\nCISA encourages you to report any suspicious activity, including cybersecurity incidents, possible malicious code, software vulnerabilities, and phishing-related scams. Reporting forms can be found on CISA's homepage at www.cisa.gov.\n\n\n\n\n\n\n\n\nRevisions\n\nJuly 21, 2021: Initial Version\n",
  "cves": [
    "CVE-2022-42475",
    "CVE-2022-47966"
  ],
  "techniques": [],
  "advisory": "ar21-202d",
  "title": "MAR-10334057-2.v1: Pulse Connect Secure | CISA",
  "source": "analysis-reports",
  "id": "c3c1f8a3ec2a73447698d9a6dffab3d701f3ed0637510b80da53273c41e7963c"
}