{
  "markdown": "\n\n\n\n\nNotification\nThis report is provided \"as is\" for informational purposes only. The Department of Homeland Security (DHS) does not provide any warranties of any kind regarding any information contained herein. The DHS does not endorse any commercial product or service referenced in this bulletin or otherwise.\nThis document is marked TLP:CLEAR--Recipients may share this information without restriction. Sources may use TLP:CLEAR when information carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright rules, TLP:CLEAR information may be shared without restriction. For more information on the Traffic Light Protocol (TLP), see http://www.cisa.gov/tlp.\nSummary\nDescription\nCISA received one Windows Portable Executable (PE) file for analysis. The file is a variant of TrueBot malware. It is designed to collect system information and report it to a command-and-control (C2). The bot is also capable of downloading and executing additional payloads.\nFor more information about this compromise, see Joint Cybersecurity Advisory Increased Truebot Activity Infects U.S. and Canada Based Networks.\nDownload the PDF version of this report:\n\n\nMAR-10445155-1.v1 Truebot Activity Infects U.S. and Canada Based Networks\n(PDF,       315.39 KB\n  )\n\n\nFor a downloadable copy of IOCs, see\n\n\nAA23-187A STIX XML\n(XML,       204.54 KB\n  )\n\n\nFor a downloadable copy of IOCs associated with this MAR in JSON format, see\n\n\nMAR-10445155-1.v1 STIX JSON\n(JSON,       16.51 KB\n  )\n\n\nSubmitted Files (1)\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7 (3LXJyAv6Gf.exe)\nDomains (2)\ndremmfyttrred[.]com\ndroogggdhfhf[.]com\nFindings\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\nTags\ntrojan\nDetails\n\n\n\nName\n3LXJyAv6Gf.exe\n\n\nSize\n1200732656 bytes\n\n\nType\nPE32+ executable (GUI) x86-64, for MS Windows\n\n\nMD5\n5588286a702e0c36c8318be0b164fa8c\n\n\nSHA1\n5449f3f141958de2d1140bc8323f5ac95c203287\n\n\nSHA256\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\n\n\nSHA512\n105e72e1f1e3af8942e0e77e1294f74cd0518f7d601e4e2f20f7ed9db3cd1c67739c31e085e028eafe0394af74b2fbeb6ffbffb67d7731023a04c53a6784924e\n\n\nssdeep\n25165824:d1AuQ/FFyK8db8kdjeyPpiMh5gbiwcfYjh+dkfaeLq4H/LLhtf:Q/FoK8rteknh54ZcfvdkfpnLhtf\n\n\nEntropy\n7.999996\n\n\n\nAntivirus\n\n\n\nESET\na variant of Win64/Agent.BVF trojan\n\n\n\nYARA Rules\n\nrule CISA_10445155_01 : TRUEBOT downloader\n\t\t\t\t{\n\t\t\t\t   meta:\n\t\t\t\t       Author = \"CISA Code & Media Analysis\"\n\t\t\t\t       Incident = \"10445155\"\n\t\t\t\t       Date = \"2023-05-17\"\n\t\t\t\t       Last_Modified = \"20230523_1500\"\n\t\t\t\t       Actor = \"n/a\"\n\t\t\t\t       Family = \"TRUEBOT\"\n\t\t\t\t       Capabilities = \"n/a\"\n\t\t\t\t       Malware_Type = \"downloader\"\n\t\t\t\t       Tool_Type = \"n/a\"\n\t\t\t\t       Description = \"Detects TRUEBOT downloader samples\"\n\t\t\t\t       SHA256 = \"7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\"\n\t\t\t\t   strings:\n\t\t\t\t       $s1 = { 64 72 65 6d 6d 66 79 74 74 72 72 65 64 2e 63 6f 6d }\n\t\t\t\t       $s2 = { 4e 73 75 32 4f 64 69 77 6f 64 4f 73 32 }\n\t\t\t\t       $s3 = { 59 69 50 75 6d 79 62 6f 73 61 57 69 57 65 78 79 }\n\t\t\t\t       $s4 = { 72 65 70 6f 74 73 5f 65 72 72 6f 72 2e 74 78 74 }\n\t\t\t\t       $s5 = { 4c 6b 6a 64 73 6c 66 6a 33 32 6f 69 6a 72 66 65 77 67 77 2e 6d 70 34 }\n\t\t\t\t       $s6 = { 54 00 72 00 69 00 67 00 67 00 65 00 72 00 31 00 32 }\n\t\t\t\t       $s7 = { 54 00 55 00 72 00 66 00 57 00 65 00 73 00 54 00 69 00 66 00 73 00 66 }\n\t\t\t\t   condition:\n\t\t\t\t       5 of them\n\t\t\t\t}\n\nssdeep Matches\nNo matches found.\nRelationships\n\n\n\n7d75244449...\nConnected_To\ndremmfyttrred[.]com\n\n\n7d75244449...\nConnected_To\ndroogggdhfhf[.]com\n\n\n\nDescription\nThis artifact is a variant of the TrueBot downloader. The file is padded with over one gigabyte (Gb) of junk code, designed to hinder analysis. When the bot is executed on the system, it will check the current Operating System (OS) version (RtlGetVersion) and the processor architecture (GetNativeSystemInfo). From this information the bot will create a unique ID for the compromised system. It will store the ID in C:\\ProgramData as a randomly named 13 character file with a .JSONIP extension, e.g. ‘IgtyXEQuCEvAM.JSONIP’.\n\n\t\t\tThe malware proceeds to enumerate all running processes on the system. The bot configuration contains a list of common Windows processes that are excluded from its list. The remaining process names are concatenated into a base64 encoded string. The malware specifically looks for the presence of the following disassembly and debugging tools:\n\n\t\t\t—Begin Disassembly & Debugging Tools—\n\t\t\tIDA Pro\n\t\t\tProcess Monitor\n\t\t\tProcessHacker\n\t\t\tProcess Explorer\n\t\t\tCFF Explorer\n\t\t\tResource Hacker\n\t\t\tCheatengine-x86_64\n\t\t\tOllyDbg\n\t\t\tRadare2\n\t\t\tX64dbg\n\t\t\tWinDbg\n\t\t\tZeta Debugger\n\t\t\tRock Debugger\n\t\t\tObsidian debugger\n\t\t\t—End Disassembly & Debugging Tools—\n\n\t\t\tThe presence of these tools does not change the execution of the malware. They are also concatenated into a base64 encoded string and sent along with the system information.\n\n\t\t\tNext, the malware will collect the ComputerName and Domain name of the system. All of the collected information and the unique ID is sent to a hard-coded Uniform Resource Locator (URL) in a POST request using a unique User-agent string:\n\n\t\t\t—Begin POST Request—\n\t\t\tPOST\n\t\t\tdremmfyttrred[.]com/dns.php\n\t\t\tContent-type: application/x-www-form-urlencoded\n\t\t\tMozilla/112.0 (compatible; MSIE 11.0; Windows NT 10.00)\n\t\t\t—End POST Request—\n\n\t\t\tThe malware uses a second obfuscated domain to accept commands and receive additional payloads. The configuration contains two base64 encoded strings that the malware will decode and run through a string operation to generate a unique hexadecimal string. The hexadecimal string is decoded using the embedded RC4 key ‘YiPumybosaWiWexy’. The following URL was decoded from the strings:\n\n\t\t\t—Begin Decoded URL—\n\t\t\tdroogggdhfhf[.]com/gate.php\n\t\t\t—End Decoded URL—\ndremmfyttrred[.]com\nTags\ncommand-and-control\nHTTP Sessions\n\nPOST\n\t\t\t\tdremmfyttrred[.]com/dns.php\n\t\t\t\tContent-type: application/x-www-form-urlencoded\n\t\t\t\tMozilla/112.0 (compatible; MSIE 11.0; Windows NT 10.00)\n\nRelationships\n\n\n\ndremmfyttrred[.]com\nConnected_From\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\n\n\n\nDescription\n3LXJyA6Gf.exe attempts to send the collected system information to this domain.\ndroogggdhfhf[.]com\nTags\ncommand-and-control\nRelationships\n\n\n\ndroogggdhfhf[.]com\nConnected_From\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\n\n\n\nDescription\n3LXJyA6Gf.exe receives commands and payloads from this domain.\nRelationship Summary\n\n\n\n7d75244449...\nConnected_To\ndremmfyttrred[.]com\n\n\n7d75244449...\nConnected_To\ndroogggdhfhf[.]com\n\n\ndremmfyttrred[.]com\nConnected_From\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\n\n\ndroogggdhfhf[.]com\nConnected_From\n7d75244449fb5c25d8f196a43a6eb9e453652b2185392376e7d44c21bd8431e7\n\n\n\nRecommendations\nCISA recommends that users and administrators consider using the following best practices to strengthen the security posture of their organization's systems. Any configuration changes should be reviewed by system owners and administrators prior to implementation to avoid unwanted impacts.\n\nMaintain up-to-date antivirus signatures and engines.\nKeep operating system patches up-to-date.\nDisable File and Printer sharing services. If these services are required, use strong passwords or Active Directory authentication.\nRestrict users' ability (permissions) to install and run unwanted software applications. Do not add users to the local administrators group unless required.\nEnforce a strong password policy and implement regular password changes.\nExercise caution when opening e-mail attachments even if the attachment is expected and the sender appears to be known.\nEnable a personal firewall on agency workstations, configured to deny unsolicited connection requests.\nDisable unnecessary services on agency workstations and servers.\nScan for and remove suspicious e-mail attachments; ensure the scanned attachment is its \"true file type\" (i.e., the extension matches the file header).\nMonitor users' web browsing habits; restrict access to sites with unfavorable content.\nExercise caution when using removable media (e.g., USB thumb drives, external drives, CDs, etc.).\nScan all software downloaded from the Internet prior to executing.\nMaintain situational awareness of the latest threats and implement appropriate Access Control Lists (ACLs).\n\nAdditional information on malware incident prevention and handling can be found in National Institute of Standards and Technology (NIST) Special Publication 800-83, \"Guide to Malware Incident Prevention & Handling for Desktops and Laptops\".\nContact Information\n\n1-888-282-0870\nCISA Central (UNCLASS)\nCISA SIPR (SIPRNET)\nCISA IC (JWICS)\n\nCISA continuously strives to improve its products and services. You can help by answering a very short series of questions about this product at the following URL: https://us-cert.cisa.gov/forms/feedback/\nDocument FAQ\nWhat is a MIFR? A Malware Initial Findings Report (MIFR) is intended to provide organizations with malware analysis in a timely manner. In most instances this report will provide initial indicators for computer and network defense. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nWhat is a MAR? A Malware Analysis Report (MAR) is intended to provide organizations with more detailed malware analysis acquired via manual reverse engineering. To request additional analysis, please contact CISA and provide information regarding the level of desired analysis.\nCan I edit this document? This document is not to be edited in any way by recipients. All comments or questions related to this document should be directed to the CISA at 1-888-282-0870 or CISA Central.\nCan I submit malware to CISA? Malware samples can be submitted via three methods:\n\nWeb: https://malware.us-cert.gov\nE-Mail: submit@malware.us-cert.gov\nFTP: ftp.malware.us-cert.gov (anonymous)\n\nCISA encourages you to report any suspicious activity, including cybersecurity incidents, possible malicious code, software vulnerabilities, and phishing-related scams. Reporting forms can be found on CISA's homepage at www.cisa.gov.\n\n\n\n\n\n\n",
  "cves": [
    "CVE-2022-47966",
    "CVE-2022-42475"
  ],
  "techniques": [],
  "advisory": "ar23-187a",
  "title": "MAR-10445155-1.v1 Truebot Activity Infects U.S. and Canada Based Networks | CISA",
  "source": "analysis-reports",
  "id": "4f75ded81418338bd3c7b668db9521a8fd5a933d517b47b016a459a95f1c85d3"
}