{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Motorola Solutions\nEquipment: ACE1000\nVulnerabilities: Use of Hard-coded Cryptographic Key, Use of Hard-coded Credentials, Insufficient Verification of Data Authenticity\n\nCISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to manipulate the RTU configuration, cause a denial-of-service condition, or achieve remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ACE1000, a remote terminal unit, are affected:\n\nMotorola Solutions ACE1000: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nThe affected product ships with a hardcoded SSH private key and initialization scripts (such as /etc/init.d/sshd_service) only generate a new key if no such file yet exists. As such, this hard-coded key is likely to be used by default. This could allow an attacker to remotely execute code, manipulate configuration, or cause a denial-of-service condition.\nCVE-2022-30271 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.2.2    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product SSH service is controlled by five preconfigured accounts, all of which come with default hard-coded credentials. This could allow an attacker to manipulate configuration, remotely execute code, and cause a denial-of-service condition.\nCVE-2022-30270 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nThe affected device communicates with an XRT Lan-to-radio gateway by means of an embedded client. Credentials for accessing this gateway are stored after being encrypted with the tiny encryption algorithm (TEA) in ECB mode using a hardcoded key, which could allow an attacker to manipulate the device configuration.\nCVE-2022-30274 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.2.4    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nThe affected product allows for custom application installation via STS software, the C toolkit, or the ACE1000 Easy Configurator. Application images were found to have no authentication (in the form of firmware signing) and only relied on insecure checksums for regular integrity checks. This could allow an authenticated attacker to run remote code execution or cause a denial-of-service condition.\nCVE-2022-30269 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:H).\n3.2.5    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nAn attacker capable of communicating with and authenticating to a Motorola ACE1000 RTU via SSH or Web UI could push malicious firmware images to the RTU, which could allow firmware manipulation, remote code execution, and a denial-of-service condition.\nCVE-2022-30272 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:H/UI:N/S:U/C:N/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forescout Technologies reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMotorola Solutions recommends the following:\nWhile individual remediation steps are specified, note all vulnerabilities listed above can be resolved by upgrading the ACE1000 to MC-EDGE intelligent RTU.\nCVE-2022-30269: To remediate, use the “Secured Download and Installation for ACE1000” procedure.\nCVE-2022-30272: To remediate, use the “Secured Download and Installation for ACE1000” procedure.\nCVE-2022-30271: To remediate, manually rotate the private key using the “ACE1000 SSH Key Rotation” process.\nCVE-2022-30270: To remediate, users should change their password manually. This process can be found in the ACE1000 user guide.\nCVE-2022-30274: Upgrade to MOTOTRBO Capacity Max.\nFor user guide and procedural information mentioned within this report, use the Contact Us form and select “Other” for Product Interest and request the manual for IoT products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-30272",
    "CVE-2022-30271",
    "CVE-2022-30270",
    "CVE-2022-30274",
    "CVE-2022-30269"
  ],
  "techniques": [],
  "advisory": "icsa-22-179-06",
  "title": "Motorola Solutions ACE1000 | CISA",
  "source": "ics-advisories",
  "id": "6ace43bfb3675a3fa7c77266162b6123fda5bfe6a1e525d1ce5f9d313eaf8cc8"
}