{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Emerson\nEquipment: ROC800-Series RTU; including ROC800, ROC800L, and DL8000 Preset Controllers\nVulnerability: Authentication Bypass\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition or gain unauthorized access to data or control of the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products are affected:\n\nROC809 & ROC827— All firmware versions, all hardware series\nROC809L & ROC827L— All firmware versions\nDL8000— All firmware versions, all hardware series\n\nThe Series 1 ROC800 and DL8000 became obsolete in 2008 when the Series 2 was introduced.\n3.2 VULNERABILITY OVERVIEW\n3.2.1 Authentication Bypass By Primary Weakness CWE-305\nROC800-Series RTU devices are vulnerable to an authentication bypass, which could allow an attacker to gain unauthorized access to data or control of the device and cause a denial-of-service condition.\nCVE-2023-1935 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Multiple Sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: USA\n\n3.4 RESEARCHER\nEmerson reported this vulnerability to CISA.\n4. MITIGATIONS\nEmerson ROC800-Series RTU firmware updates can be applied to patch the authentication vulnerability:\n\nROC800 Series 2—3.91 firmware or later at SupportNet Portal (login required)\nROC800 Series 1—Update hardware to Series 2 with 3.91 firmware or later\nROC800L Series 2—1.71 firmware or later at SupportNet Portal (login required)\nDL8000 Series 2—2.60 firmware or later at SupportNet Portal (login required)\nDL8000 Series 1—Update hardware to Series 2 with 2.60 firmware or later\n\nBefore installing firmware into the RTU, validate the MD5/SHA256 Hashes published by Emerson on SupportNet match the firmware image confirming it is genuine and unmodified.\nEmerson recommends users follow guidance in the ROC800-Series Remote Operations Controller Instruction Manual under section 1.11 Secure Gateway D301766X012.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-1935"
  ],
  "techniques": [],
  "advisory": "icsa-23-206-03",
  "title": "Emerson ROC800 Series RTU and DL8000 Preset Controller | CISA",
  "source": "ics-advisories",
  "id": "2994a2a4efb0a4cf37aedd68a36537e5beff21f3157aa7e03df24746456fcdd6"
}