{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.0\nATTENTION: High attack complexity\nVendor: Hitachi Energy\nEquipment: FOXMAN-UN, UNEM Products\nVulnerability: Improper Output Neutralization for Logs\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could permit an attacker to access sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of FOXMAN-UN and UNEM, network management system toolsets, are affected:\n\nFOXMAN-UN: Version R16A\nFOXMAN-UN: Version R15B\nFOXMAN-UN: Version R15A\nUNEM: Version R16A\nUNEM Version R15B\nUNEM: Version R15A\n\nThe following version and sub-versions of FOXMAN-UN and UNEM, network management system toolsets, are affected:\n\nFOXMAN-UN: Version R14B \nFOXMAN-UN: Version R14A \nFOXMAN-UN: Version R11B \nFOXMAN-UN: Version R11A \nFOXMAN-UN: Version R10C \nFOXMAN-UN: Version R9C \nUNEM: Version R14B \nUNEM: Version R14A \nUNEM: Version R11B \nUNEM: Version R11A \nUNEM: Version R10C \nUNEM: Version R9C \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER OUTPUT NEUTRALIZATION FOR LOGS CWE-117\nThe affected product is vulnerable to an improper output neutralization for logs, which could allow an attacker to forge log entries or inject malicious content into logs.\nCVE-2023-1711 has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:H/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nRecommended Mitigations for the following FOXMAN-UN and UNEM products: \n\nFOXMAN-UN: Version R16A, update to FOXMAN-UN R16B when released or apply general mitigation factors.\nFOXMAN-UN: Version R15B, update to FOXMAN-UN R16B when released or apply general mitigation factors.\nFOXMAN-UN: Version R15A, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nFOXMAN-UN: Version R14B, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nFOXMAN-UN: Version R14A, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nFOXMAN-UN: Version R11B, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nFOXMAN-UN: Version R11A, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nFOXMAN-UN: Version R10C, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nFOXMAN-UN: Version R9C, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nUNEM: Version R16A, update to UNEM R16B when released or apply general mitigation factors.\nUNEM: Version R15B, update to UNEM R16B when released or apply general mitigation factors.\nUNEM: Version R15A, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nUNEM: Version R14B, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nUNEM: Version R14A, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nUNEM: Version R11B, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nUNEM: Version R11A, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nUNEM: Version R10C, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\nUNEM: Version R9C, this is an end-of-life version thus no fix will be provided. Apply general mitigation factors.\n\nHitachi Energy recommends the following general mitigation factors and security practices: \n\nConfigure firewalls to protect process control networks from attacks originating from outside the network.\nPhysically protect process control systems from direct access by unauthorized personnel.\nAvoid directly connecting control systems to the internet.\nSeparate process control networks from other networks using a firewall system with a minimal number of exposed ports.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving emails.\nPortable computers and removable storage media should be carefully scanned for viruses before connecting to a control system.\nEnforce proper password policies and processes.\n\nFor more information, see Hitachi Energy advisories 8DBD000155 and 8DBD000166.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2023-1711"
  ],
  "techniques": [],
  "advisory": "icsa-23-178-01",
  "title": "Hitachi Energy FOXMAN-UN and UNEM Products | CISA",
  "source": "ics-advisories",
  "id": "df9c6bde43ec24333b1947a7780f5284211a5ff13c07cae9098e482926c905d4"
}