{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: Low attack complexity\nVendor: Horner Automation\nEquipment: Cscape\nVulnerabilities: Improper Input Validation, Improper Access Controls\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow code execution in the context of the current process or locally escalate privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Cscape, a control system application programming software, are affected:\n\nCscape: All versions prior to 9.90 SP4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe affected application lacks proper validation of user-supplied data when parsing project files. This could lead to memory corruption. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-22678 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER ACCESS CONTROL CWE-284\nThe affected product is configured by default to be installed for all users, which allows full permissions, including read/write access. This may allow unprivileged users to modify the binaries and configuration files and lead to local privilege escalation.\nCVE-2021-22682 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov of Claroty reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHorner Automation recommends affected users update to the latest version of Cscape (Version 9.90 SP4).\nUsers with questions regarding their specific Cscape installations should contact their local Horner Automation service support team at either:\n\ntechsppt@heapg.com (+1-317-916-4274)\ntech.support@hornerirl.ie (+353-(0)21-4321266 ext. 202) outside of the Americas\n\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nOnly use project files from trust sources.\nEnsure the least-privilege user principle is followed.\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-22678",
    "CVE-2021-22682"
  ],
  "techniques": [],
  "advisory": "icsa-21-112-01",
  "title": "Horner Automation Cscape | CISA",
  "source": "ics-advisories",
  "id": "e98a11d3b03bc5ff8714463839ecdc38ccf717b4e3012415a576c8ee707064b1"
}