{
  "markdown": "\nCVSS v3 6.8\nATTENTION: Remotely exploitable.\nVendor: Rockwell Automation\nEquipment: ControlLogix 5580 and CompactLogix 5380\nVulnerability: Resource Exhaustion\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on April 4, 2017, and is being released to the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following versions of ControlLogix 5580 and CompactLogix 5380, programmable automation controllers, are affected:\n\nControlLogix 5580 controllers V28.011, V28.012, and V28.013,\nControlLogix 5580 controllers V29.011,\nCompactLogix 5380 controllers V28.011, and\nCompactLogix 5380 controllers V29.011.\n\nIMPACT\nSuccessful exploitation of this vulnerability could cause the device that the attacker is accessing to become unavailable.\nMITIGATION\nRockwell Automation recommends updating to the latest version of ControlLogix 5580 controllers, Version 30.011 or later, which is available at the following location:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?Keyword=1756-L8&crumb=112\nRockwell Automation recommends updating to the latest version of CompactLogix 5380 controllers, Version 30.011 or later, which is available at the following location:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?Keyword=5069-L&crumb=112\nFor more information on this vulnerability and more detailed mitigation instructions, please see Rockwell Automation’s advisory labeled ControlLogix 5580 and CompactLogix 5380 Programmable Automation Controller Denial of Service, Version 1.0, April 4, 2017, at the following location: \nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1041420\nAs well as Rockwell Automation’s security page:\nhttp://www.rockwellautomation.com/security/overview.page\nICS-CERT and Rockwell Automation recommend that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nBlock all traffic to EtherNet/IP or other CIP protocol-based devices from outside the Manufacturing Zone by blocking or restricting access to Port 2222/TCP and UDP and Port 44818/TCP and UDP using proper network infrastructure controls, such as firewalls, UTM devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation Products, see Knowledgebase Article ID 898270 which is available at the following location:\n\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/898270\n\nMinimize network exposure for all control system devices and/or systems, and help confirm that they are not accessible from the Internet.\nLocate control system networks and devices behind firewalls, and use best practices when isolating them from the business network. The Common Plant-wide Ethernet (CPwE) guide provides recommendations for deploying a plant-wide architecture: Industrial Firewalls within a CPwE Architecture\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nRESOURCE EXHAUSTION CWE-400\n\nThis vulnerability may allow an attacker to cause a denial of service condition by sending a series of specific CIP-based commands to the controller.\nCVE-2017-6024 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Food and Agriculture, Transportation Systems, and Water\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Milwaukee, Wisconsin\n",
  "cves": [
    "CVE-2017-6024"
  ],
  "techniques": [],
  "advisory": "icsa-17-094-05",
  "title": "Rockwell Automation ControlLogix 5580 and CompactLogix 5380 | CISA",
  "source": "ics-advisories",
  "id": "093086aab77231030f0d1546d7807f1637f61017a734a423cca83d102ed43813"
}