{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3,8\nATTENTION: Low skill level to exploit\nVendor: Emerson\nEquipment: OpenEnterprise SCADA Software\nVulnerability: Inadequate Encryption Strength\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker access to credentials held by OpenEnterprise used for accessing field devices and external systems.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nEmerson reports that the vulnerability affects the following products: \n\nOpenEnterprise All versions through 3.3.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INADEQUATE ENCRYPTION STRENGTH CWE-326\nInadequate encryption may allow the credentials used by OpenEnterprise to access field devices and external systems to be obtained. \nCVE-2020-16235 has been assigned to this vulnerability. A CVSS v3 base score of 3.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Healthcare and Public Health, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRoman Lozko of Kaspersky reported this vulnerability to Emerson.\n4. MITIGATIONS\nEmerson recommends all users upgrade to OpenEnterprise 3.3, Service Pack 6 (3.3.6), to resolve this issue. OpenEnterprise Service Packs are available to users with access to the Emerson SupportNet system (login required). Details will be found in the downloads area.\nPlease send any questions via a SupportNet ticket or by contacting Emerson at US 800-537-9313. For users outside of the United States, please use international toll-free numbers.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-16235"
  ],
  "techniques": [],
  "advisory": "icsa-20-238-02",
  "title": "Emerson OpenEnterprise | CISA",
  "source": "ics-advisories",
  "id": "ff5cb4981e7dcbbec1a104054ab1b6fa889c8ddbf6b0f91599c72982d2966b02"
}