{
  "markdown": "\nOVERVIEW\nThis advisory is a follow-up to the ICS-ALERT titled ICS-ALERT-15-203-01 FCA Uconnect VulnerabilityICS-CERT ALERT, https://ics-cert.us-cert.gov/alerts/ICS-ALERT-15-203-01, web site last accessed September 17, 2015. that was published July 22, 2015, on the NCCIC/ICS-CERT web site.\nChris Valasek of IOActive and Dr. Charlie Miller of Twitter discovered an unauthorized remote access to Fiat-Chrysler Automobile US (FCA US) LLC Uconnect telematics infotainment system manufactured by Harman-Kardon. They had been coordinating with FCA US LLC for nearly 9 months before releasing information about this remote exploit publicly. FCA US LLC released a security notice and a firmware patch to owners of vehicles with the Uconnect feature on July 16, 2015. Subsequently, FCA US LLC launched two recall campaigns on July 23, 2015, and on September 5 where owners of vehicles were mailed USB sticks containing the updated software. The details of the exploit were released several weeks later at BlackHat 2015 and DefCon23 conventions held in early August in Las Vegas, Nevada.\nChris Valasek and Dr. Charlie Miller confirmed a missing authorization vulnerability in FCA Uconnect RA3/RA4 radio manufactured by Harman-Kardon. FCA US LLC has produced a patch that mitigates this vulnerability and worked with Sprint, the network provider to disable access to the vulnerable port. Prior to the Blackhat conference, the researchers have tested the patch to confirm that it mitigates the vulnerability.\nAFFECTED PRODUCTS\nThe following UConnect 8.4AN/RA3/RA4 infotainment systems are affected:\n\n2013-2015 Ram 1500/2500/3500/4500/5500,\n2013-2015 Dodge Viper,\n2014/15 Jeep Cherokee/Grand Cherokee,\n2014/15 Dodge Durango,\n2015 Chrysler 200/300,\n2015 Dodge Challenger,\n2015 Dodge Charger, and\n2015 Jeep Renegade.\n\nIMPACT\nThe UConnect Infotainment system has direct access to the controls of the vehicle. A malicious party connecting to the UConnect infotainment system could without any form of authentication gain access to the UConnect system. From this connection, the malicious party could take control of connected control units and send commands to the various control systems within the vehicle with the potential to affect:\n\nInformation to be displayed within the car (e.g., tachometer); and\nVehicle control systems, including brakes, steering, and A/C fans.\n\nImpact to individual vehicles depends on many factors that are unique to the features and make of the vehicle. ICS-CERT recommends that owners evaluate the impact of this vulnerability based on their own vehicle.\nBACKGROUND\nHarman-Kardon is a division of Harman International Industries and manufactures home and car audio equipment and is headquartered in Stanford, Connecticut.\nFCA US LLC is a North American automaker that maintains offices in several countries around the world and is headquartered in Auburn Hills, Michigan.\nThe affected products, Uconnect 8.4AN/RA3/RA4, are vehicle-based infotainment systems. According to FCA, the Uconnect systems are integrated in certain Chrysler, Dodge, Jeep, and Ram makes of vehicles. FCA estimates that these products are used primarily in the United States and Europe.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nMISSING AUTHENTICATIONCWE-862: Missing Authorization, http://cwe.mitre.org/data/definitions/862.html, web site last accessed September 17, 2015.\n\nThe UConnect infotainment system allowed an unauthenticated connection from other access points on the Sprint Network. After the release of the information on this vulnerability, Sprint blocked access to the vulnerable ports. A malicious party could then issue commands through the infotainment system to other components within the vehicle.\nCVE-2015-5611NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-5611, web site last accessed September 17, 2015. has been assigned to this vulnerability. A CVSS v2 base score of 8.3 has been assigned; the CVSS vector string is (AV:A/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, https://nvd.nist.gov/cvss.cfm?version=2&vector=AV:A/AC:L/Au:N/C:C/I:C/A:C, web site last accessed September 17, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is no longer exploitable remotely because of Sprint’s reconfiguration on the cellular network. The software within the system is still vulnerable until patched.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability is difficult. Connections to the vulnerable UConnect systems are currently unreachable because of port screening by Sprint. This decreases the likelihood of a successful exploit.\nMITIGATION\nFCA has issued a voluntary recall of 1.4 million impacted vehicles to patch the software of the UConnect Infotainment system.\nIn addition, Sprint has disabled traffic to the vulnerable port on its network.\nLetter to the National Highway and Transportation Safety Administrationhttp://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM483033/RCAK-15V461-4967.pdf\nPart 573 Safety Recall Reporthttp://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM483036/RCLRPT-15V461-9407.pdf\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nIf the Wi-Fi is used, encrypt the Wi-Fi with the WPA2 encryption option.\nMinimize network exposure for all connected devices and/or systems, and ensure that they are not accessible from the Internet.\nDo not insert media (e.g., USB, SD card or CD) of unknown origin into your vehicle.  Only use devices that came from a trusted source.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2015-5611"
  ],
  "techniques": [],
  "advisory": "icsa-15-260-01",
  "title": "Harman-Kardon Uconnect Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "c1732c14f68cf1b298713b52b5fe9d4e5548a2839b3d6c6cecbfbaa736c4c6f9"
}