{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: Multiple Air Conditioning Systems\nVulnerability: Incorrect Implementation of Authentication Algorithm\n\n2. RISK EVALUATION\nAn attacker could exploit this vulnerability by impersonating administrators to disclose configuration information of the air conditioning system in order to tamper with operation information and system configuration.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports this vulnerability affects the following air conditioning systems:\n\nAir Conditioning System / Centralized Controllers affected:\n\nG-50A: Version 2.50 to Version 3.35\nGB-50A: Version 2.50 to Version 3.35\nAG-150A-A: Versions 3.20 and prior\nAG-150A-J: Versions 3.20 and prior\nGB-50ADA-A: Versions 3.20 and prior\nGB-50ADA-J: Versions 3.20 and prior\nEB-50GU-A: Versions 7.09 and prior\nEB-50GU-J: Versions 7.09 and prior\nAE-200A: Versions 7.93 and prior\nAE-200E: Versions 7.93 and prior\nAE-50A: Versions 7.93 and prior\nAE-50E: Versions 7.93 and prior\nEW-50A: Versions 7.93 and prior\nEW-50E: Versions 7.93 and prior\nTE-200A: Versions 7.93 and prior\nTE-50A: Versions 7.93 and prior\nTW-50A: Versions 7.93 and prior\nCMS-RMD-J: Versions 1.30 and prior\n\n\nAir Conditioning System / Expansion Controllers are affected:\n\nPAC-YG50ECA: Versions 2.20 and prior\n\n\n\nTo learn how to determine the version number of equipment, please see publication number 2021-004 from Mitsubishi Electric.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT IMPLEMENTATION OF AUTHENTICATION ALGORITHM CWE-303\nWeb functions of Mitsubishi Electric air conditioning systems have a privilege escalation vulnerability due to incorrect implementation of the authentication algorithm. This vulnerability may allow an attacker to impersonate an administrator and tamper with information (e.g., operation information and configuration of the air conditioning system).\nCVE-2021-20593 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:C/C:L/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nChizuru Toyama of TXOne IoT/ICS Security Research Labs, working with Trend Micro’s Zero Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric has created the following versions to address the issue, and recommends users update to one of the following versions below or newer:\n\nAir Conditioning System/Centralized Controllers:\n\nG-50A: Version 3.37 or later\nGB-50A: Version 3.37 or later\nAG-150A-A: Version 3.21 or later\nAG-150A-J: Version 3.21 or later\nGB-50ADA-A: Version 3.21 or later\nGB-50ADA-J: Version 3.21 or later\nEB-50GU-A: Version 7.10 or later\nEB-50GU-J: Version 7.10 or later\nAE-200A: Version 7.95 or later\nAE-200E: Version 7.95 or later\nAE-50A: Version 7.95 or later\nAE-50E: Version 7.95 or later\nEW-50A: Version 7.95 or later\nEW-50E: Version 7.95 or later\nTE-200A: Version 7.95 or later\nTE-50A: Version 7.95 or later\nTW-50A: Version 7.95 or later\nCMS-RMD-J: Version 1.40 or later\n\n\nAir Conditioning System / Expansion Controllers:\n\nPAC-YG50ECA: Version 2.21 or later\n\n\n\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risks associated with this vulnerability:\n\nUse a VPN router, etc. when connecting the air conditioning system to the Internet.\nUse an antivirus software computer on systems used to connect conditioning systems.\nRestrict the access to air conditioning systems from untrusted networks and hosts.\nChange default usernames and passwords.\n\nPlease contact a distributor or Mitsubishi Electric representative for available updates. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-20593"
  ],
  "techniques": [],
  "advisory": "icsa-21-182-04",
  "title": "Mitsubishi Electric Air Conditioning System | CISA",
  "source": "ics-advisories",
  "id": "cbdb42ddb01e123a3dc8d78898195c0e9cd3ee840cae777a7de85ad4e8d2fff5"
}