{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.8\nVendor: Rittal \nEquipment: CMC III \nVulnerability: Improper Access Control \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to open control cabinets secured with Rittal locks. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRittal reports this vulnerability affects the following control cabinet locks:  \n\nCMC III \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER ACCESS CONTROL CWE-284 \nA malicious actor can clone access cards used to open control cabinets secured with Rittal CMC III locks. \nCVE-2022-40633 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Communications, Critical Manufacturing, Energy, Information Technology \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nAlpha Strike Labs by Limes Security reported this vulnerability to CISA. \n4. MITIGATIONS\nAccording to Rittal, the CMC III and the CMC compact products are end-of-life and no longer supported; security gaps will be addressed in their next generation product.   \nRittal plans to notify all known users of the issue. They recommend a PIN pad be added for a two-step authentication process. Users should contact Rittal support for further information. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should: \n\nSecure physical access cards. \nRestrict physical access to areas where control cabinets are kept. \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-40633"
  ],
  "techniques": [],
  "advisory": "icsa-23-061-03",
  "title": "Rittal CMC III Access systems | CISA",
  "source": "ics-advisories",
  "id": "4852b5a3a3fb430dd9adcb3270aea2ab4a5bfb80650771459f41c27c7de098ba"
}