{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: Emerson\nEquipment: OpenEnterprise SCADA Server\nVulnerability: Heap-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute code on an OpenEnterprise SCADA Server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of OpenEnterprise SCADA Server are affected:\n\nOpenEnterprise Server 2.83 is affected if Modbus or ROC Interfaces have been installed and are in use\nOpenEnterprise 3.1 through 3.3.3, all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nA specially crafted script could execute code on the OpenEnterprise Server.\nCVE-2020-6970 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Chemical, Transportation, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRoman Lozko of Kaspersky ICS CERT reported this vulnerability to Emerson; Emerson provided the report to CISA.\n4. MITIGATIONS\nEmerson recommends all users upgrade to OpenEnterprise 3.3, Service Pack 4 (3.3.4), to resolve this issue. OpenEnterprise Service Packs are available to users with access to the Emerson SupportNet system (login required). Details will be found in the downloads area.\nPlease send any questions via a SupportNet ticket or by contacting Emerson at US 800-537-9313. For users outside of the United States, please use international toll-free numbers.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-6970"
  ],
  "techniques": [],
  "advisory": "icsa-20-049-02",
  "title": "Emerson OpenEnterprise | CISA",
  "source": "ics-advisories",
  "id": "2049df4dcadebb3bd009993c13fbfb29afab2d9553fd5d874d111e2d4bddfc63"
}