{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Simcenter STAR-CCM+\nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\n Simcenter STAR-CCM+ contains an information disclosure vulnerability when using the Power-on-Demand public license server. Successful exploitation of this vulnerability could give an attacker access to a system’s host, user, and display name.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n The following versions of Simcenter STAR-CCM+ are affected:\n\nSimcenter STAR-CCM+: All versions\n\n3.2 VULNERABILITY OVERVIEW\n 3.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE 200\nAffected applications expose user, host, and display names when the public license server is used; this could allow an attacker to retrieve this information.\nCVE-2022-34659 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Multiple\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\n Siemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations that customers can apply to reduce risk:\n\nSet the environmental variable STARLICENSEHIDE to 1. This will send the string “unknown” for the user, host, and display name instead of the real values. The setting is supported since version V8.04 (June 2013) of Simcenter STAR-M+.\nAvoid using sensitive or personal data in user, host, and display names.\n\nSiemens recommends users configure the environment according to Siemen’s operational guidelines for Industrial Security General Security Recommendations.\nSiemens recommends users follow the General Security Recommendations.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and following the recommendations in the product manuals.  \nSiemens has additional information on Industrial Security on its webpage.\nFor more information see Siemens Security Advisory SSA-555707.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-34659"
  ],
  "techniques": [],
  "advisory": "icsa-22-223-01",
  "title": "Siemens Simcenter STAR-CCM+ | CISA",
  "source": "ics-advisories",
  "id": "1d104ba89fc9a48d0cadb541aecadb33e6ff12b735c47e49919bd27f1809da6d"
}