{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATICS PCS neo (Admin Console), SINTEPLAN, TIA Portal\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-104-16 Siemens TIA Administrator that was published April 14, 2022, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker to cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nTIA Administrator in the following Siemens products is affected:    \n\nSIMATICS PCS neo (Administration Console): All versions prior to v3.1 SP1\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSINETPLAN: All versions\nTIA Portal: Versions 15, 15.1, 16, and 17\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe affected system cannot properly process specially crafted packets sent to Port 8888/TCP. A remote attacker could exploit this vulnerability to cause a denial-of-service condition. The affected devices must be restarted manually.\nCVE-2022-27194 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nPeter Cheng of Elex Feigong Research reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens recommends applying the following updates:\n\nSIMATICS PCS neo (Administration Console): Update to v3.1 SP1 or later\n\n--------- Begin Update A Part 2 of 2 ---------\n\nSINETPLAN: Update TIA Administrator to v1.0 SP7 or later\nTIA Portal: Versions 15, 15.1, 16, and 17: Update TIA Administrator to v1.0 SP7 or later\n\n--------- End Update A Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict access to Port 8888/TCP to localhost (default)\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to the Siemens operational guidelines for industrial security and follow the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-711829\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-27194"
  ],
  "techniques": [],
  "advisory": "icsa-22-104-16",
  "title": "Siemens TIA Administrator (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0902900e7f8a88437345834081f1d4468708647ab9929970ce6e57f7b00165ff"
}