{
  "markdown": "\n1. EXECUTIVE SUMMARY\n--------- Begin Update A Part 1 of 3 ---------\n\nCVSS v3 8.1\n\n--------- End Update A Part 1 of 3 ---------\n\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SINAMICS Medium Voltage Products\nVulnerability: Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain full remote access to the HMI.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following SINAMICS products with telnet enabled on SIMATIC comfort HMI Panels:\n\nSINAMICS GH150: All versions\nSINAMICS GL150 (with option X30): All versions\nSINAMICS GM150 (with option X30): All versions\nSINAMICS SH150: All versions\nSINAMICS SL150: All versions\nSINAMICS SM120: All versions\nSINAMICS SM150: All versions\nSINAMICS SM150i: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe Telnet service of the HMI Comfort Panels system component in affected SINAMICS products does not require authentication, which may allow a remote attacker to gain access to the device if the service is enabled. Telnet is disabled by default.\n--------- Begin Update A Part 2 of 3 ---------\nCVE-2020-15798 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n--------- End Update A Part 2 of 3 ---------\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Critical Manufacturing, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\n---------Begin Update A Part 3 of 3 ---------\nOnly HMI image versions prior to v16 Update 3a are affected. Siemens recommends updating the following products to v16 Update 4 or later:\n\nSINAMICS GH150\nSINAMICS GL150 (with option X30)\nSINAMICS GM150 (with option X30)\nSINAMICS SH150\nSINAMICS SM120\n\nAs only SIMATIC HMI image versions prior to v15 SP1 Update 6 are affected, update the HMI panel image as included in your installation of the following products to v15 SP1 Update 6 or later version.\n\nSINAMICS SL150\nSINAMICS SM150\nSINAMICS SM150i\n\n--------- End Update A Part 3 of 3 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDisable Telnet on the HMI Panels if enabled. If this is not possible, defense-in-depth should be used. Note: By default, Telnet is disabled.\nFollow SINAMICS MV industrial security guidelines\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor additional information see Siemens Security Advisory SSA-752103\nFor more details regarding the telnet authentication vulnerability in SIMATIC HMI Comfort Panels, refer to Siemens Security Advisory SSA-520004\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a attack complexity.\n",
  "cves": [
    "CVE-2020-15798"
  ],
  "techniques": [],
  "advisory": "icsa-21-131-13",
  "title": "Siemens SINAMICS Medium Voltage Products Telnet (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0c7feff61f88ad562b889f16aa8577c5bdb12434b3c0c8118861980d11163198"
}