{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.3\nATTENTION: Low attack complexity\nVendor: Delta Electronics\nEquipment: DOPSoft\nVulnerability: Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-244-01 Delta Electronics DOPSoft that was published September 01, 2022, on the ICS webpage on cisa.gov/ICS. \n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain sensitive information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of DOPSoft, a software supporting the DOP-100 series HMI screens, are affected:\n\nDOPSoft: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS READ CWE-125\nTwo out-of-bounds read conditions may occur due to the affected product not properly sanitizing input while processing specific project files, which may allow unauthorized information disclosure. \nCVE-2022-2966 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n4.4 RESEARCHER\nNatnael Samson (@NattiSamson) working with Trend Micro’s Zero Day Initiative reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A part 1 of 1 ---------\nDelta Electronics recommends users either update to DOPSoft v4.00.16 or later or migrate to DIAScreen in DIAStudio v1.1.2 or later. \n--------- End Update A part 1 of 1 ---------\nDelta Electronics recommends users to migrate to DIAScreen in DIAStudio v1.1.2 or later.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nOnly use project files from trusted sources.\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-2966"
  ],
  "techniques": [],
  "advisory": "icsa-22-244-01",
  "title": "Delta Electronics DOPSoft (Update A) | CISA",
  "source": "ics-advisories",
  "id": "e946c934ce5d3d9da6d202537567d892f31b8ceadf1d0fab55f5894e03e62ace"
}