{
  "markdown": "\nOVERVIEW\nThis updated advisory is a follow-up to the original advisory titled ICSA-14-205-02 Siemens SIMATIC WinCC Vulnerabilities that was published July 24, 2014, on the NCCIC/ICS-CERT web site.\nResearchers Sergey Gordeychik, Alexander Tlyapov, Dmitry Nagibin, and Gleb Gritsai of Positive Technologies identified four of five vulnerabilities in the Siemens SIMATIC WinCC application. An anonymous researcher identified the remaining vulnerability. Siemens has produced an update that mitigates these vulnerabilities.\nAll but one of the reported vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATIC WinCC: all versions prior to Version 7.3, and\nSIMATIC PCS7 (as WinCC is incorporated): all versions prior to Version 8.1.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow an attacker to obtain unauthorized access to sensitive data and allow unauthorized privilege escalation.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSiemens is a multinational company headquartered in Munich, Germany. Siemens develops products mainly in the Energy, Healthcare and Public Health, and Transportation Systems sectors.\nSIMATIC WinCC is a supervisory control and data acquisition (SCADA) system that is used to monitor and control physical processes involved in industry and infrastructure. This software is used in many industries, including food and beverage, water and wastewater, oil and gas, and chemical.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nFORCED BROWSINGCWE-425: Direct Request (‘Forced Browsing’), http://cwe.mitre.org/data/definitions/425.html, web site last accessed July 24, 2014.\n\nThe SIMATIC WinCC WebNavigator server at Port 80/TCP and Port 443/TCP could allow unauthenticated access to sensitive data with specially crafted HTTP requests.\nCVE-2014-4682NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-4682, web site last accessed October 07, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 5.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:P/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:P/I:N/A:N, web site last accessed July 24, 2014.\n\nSESSION FIXATIONCWE-384: Session Fixation, http://cwe.mitre.org/data/definitions/384.html, web site last accessed July 24, 2014.\n\nExisting access control settings of the WinCC WebNavigator server at Port 80/TCP and Port 443/TCP could allow remote authenticated users to escalate their privileges in WinCC.\nCVE-2014-4683NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-4683, web site last accessed October 07, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 4.9 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:S/C:P/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:S/C:P/I:P/A:N, web site last accessed July 24, 2014.\n\nIMPROPER PRIVILEGE MANAGEMENTCWE-269: Improper Privilege Management, http://cwe.mitre.org/data/definitions/269.html, web site last accessed July 24, 2014.\n\nThe database server of SIMATIC WinCC could allow authenticated users to escalate their privileges in the database if a specially crafted command is sent to the database server at Port 1433/TCP.\nCVE-2014-4684NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-4684, web site last accessed October 07, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 6.0 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:S/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:S/C:P/I:P/A:P, web site last accessed July 24, 2014.\n\nPERMISSIONS, PRIVILEGES, AND ACCESS CONTROLSCWE-264: Permissions, Privileges, and Access Controls, http://cwe.mitre.org/data/definitions/264.html, web site last accessed July 24, 2014.\n\nAccess permissions on system objects could allow a local user to obtain limited escalated privileges within the operating system.\nCVE-2014-4685NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-4685, web site last accessed October 07, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 4.6 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:N/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:N/C:P/I:P/A:P, web site last accessed July 24, 2014.\n\nHARD-CODED CRYPTOGRAPHIC KEYCWE-321: Use of Hard-coded Cryptographic Key, http://cwe.mitre.org/data/definitions/321.html, web site last accessed July 24, 2014.\n\nA hard-coded cryptographic key could allow privilege escalation in the WinCC Project administration application if network communication on Port 1030/TCP of a legitimate user can be captured.\nCVE-2014-4686NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-4686, web site last accessed October 07, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:P/I:P/A:P, web site last accessed July 24, 2014.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely except for vulnerability CVE-2014-4685, which requires an attacker to have local access to the system.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a moderate to low skill would be able to exploit these vulnerabilities.\nMITIGATION\nSiemens has released SIMATIC WinCC V7.3, which fixes the five vulnerabilities, and recommends upgrading as soon as possible. The updated software can be ordered via the customer support web site at the following location:\nhttps://mall.industry.siemens.com/mall/de/de/Catalog/Products/10042373?tree=CatalogTree\n--------- Begin Update A Part 1 of 1 --------\nAdditional information about SIMATIC WinCC V7.3 is available at the following location:\nhttp://support.automation.siemens.com/WW/view/en/97493192\nSiemens has released SIMATIC PCS7 V8.1, which fixes the five vulnerabilities, and recommends upgrading as soon as possible. The updated software can be ordered via the customer support web site at the following location:\nhttps://mall.industry.siemens.com/mall/de/de/Catalog/Products/10042373?tree=CatalogTree\nAdditional information about the new SIMATIC PCS7 V8.1 is available at the following location:\nhttp://support.automation.siemens.com/WW/view/en/98161292\nUntil the updates can be deployed, Siemens advises asset owners to apply the following steps to mitigate the risk:\n--------- End Update A Part 1 of 1 ----------\n\nLimit the WebNavigator server access to trusted networks and clients,\nEnsure that the WebNavigator clients authenticate themselves against the WebNavigator server (e.g., use client certificates),\nRestrict access to the WinCC database server at Port 1433/TCP to trusted entities,\nDeactivate all unnecessary OS users on WinCC server,\nRun WinCC server and engineering stations within a trusted network, or\nEnsure that the WinCC server and the engineering stations communicate via encrypted channels only (e.g., establish a VPN tunnel).\n\nSIMATIC WinCC V7.3 introduces the feature “Encrypted Communications.” The feature allows operators to add an extra layer of security to protect server communication. Siemens strongly recommends activating this feature.\nAdditional information can be found in the Siemens’ Security Advisory, SSA-214365 available at:\nhttp://www.siemens.com/cert/advisories/\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2014-4685",
    "CVE-2014-4684",
    "CVE-2014-4683",
    "CVE-2014-4686",
    "CVE-2014-4682"
  ],
  "techniques": [],
  "advisory": "icsa-14-205-02a",
  "title": "Siemens SIMATIC WinCC Vulnerabilities (Update A) | CISA",
  "source": "ics-advisories",
  "id": "ad7746dba563e1eb35491f1541ad22ce030a2f584a2e7d588072220454b7d2c4"
}