{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: Mitsubishi Electric\nEquipment: FA Engineering Software\nVulnerabilities: Out-of-bounds Read, Integer Underflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-350-05 Mitsubishi Electric FA Engineering Software that was published December 16, 2021, on the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of FA Engineering Software, an engineering software suite, are affected:\n\nGX Works2: Versions 1.606G and prior\nMELSOFT Navigator: Versions 2.84N and prior\n\n--------- Begin Update B Part 1 of 2 ---------\n\nEZSocket: Versions 5.4 and prior\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS READ CWE-125\nWhen a valid user opens a malicious project file specially crafted by an attacker, the software reads data outside of the intended buffer, allowing an attacker to potentially cause a denial-of-service condition in the software.\nCVE-2021-20606 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n4.2.2    INTEGER UNDERFLOW CWE-191\nWhen a valid user opens a malicious project file specially crafted by an attacker, the product subtracts one value from another, such that the result is less than the minimum allowable integer value, which produces a value that is not equal to the correct result.\nCVE-2021-20607 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n5. MITIGATIONS\nMitsubishi Electric recommends that users download and update the latest version of each software product:\n\nGX Works2, Version 1.610L or later\nMELSOFT Navigator, Version 2.86Q or later\n\n--------- Begin Update B Part 2 of 2 ---------\n\nEZSocket, Version 5.5 or later.  Mitsubishi Electric will provide the fixed version of EZSocket directly to the partner companies.\n\n--------- End Update B Part 2 of 2 ---------\nMitsubishi Electric has included the following directions for users looking to update to the fixed software version:\n\nUnzip the downloaded file (zip format).\nExecute the file “setup.exe” located in the folder unzipped and install it.\n\nFor customers who use the software for which the fixed version has not been released or who are not able to immediately update the software, Mitsubishi Electric recommends the following mitigation measures to minimize the risk of being exploited these vulnerabilities:\n\nEnsure malicious attackers cannot access project files that are stored in your computer/server via untrusted network or host.\nInstall an antivirus software in your personal computer running the software.\nDo not open the project files, such as those attached to e-mail sent from an untrusted sender.\nPlease execute procedures below for GX Works2 project files read from PLC via “Batch Read” function of MELSOFT Navigator or EZSocket.\n\nWith GX Works2 1.610L or later, open the project file that is read from PLC via “Batch Read” function of MELSOFT Navigator or EZSocket.\nEnable the option [Enable the security check for the project] ([Options] -> [Project] -> [Common Setting]) and save the project.\n\n\n\nFor specific update instructions and additional details see the Mitsubishi Electric advisory. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2021-20606",
    "CVE-2021-20607"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-05",
  "title": "Mitsubishi Electric FA Engineering Software (Update B) | CISA",
  "source": "ics-advisories",
  "id": "29b000097ff5257da5a61dff2a994786b98979525e6179b4e8cfbcef1d65da46"
}