{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens Healthineers, a subsidiary of Siemens\nEquipment: syngo fastView\n\n--------- Begin Update A Part 1 of 2 --------\n\nVulnerabilities: Out-of-bounds Write, Write-what-where Condition\n\n--------- End Update A Part 1 of 2 --------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-350-16 Siemens Healthineers syngo fastView that was published December 16, 2021, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to a crash of the application or arbitrary code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of syngo fastView, a software for digital imaging and communications, are affected:\n\nSyngo fastView: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application lacks proper validation of user-supplied data when parsing DICOM files, which could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-40367 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application lacks proper validation of user-supplied data when parsing BMP files, which could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-42028 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- Begin Update A Part 2 of 2 --------\n4.2.3    WRITE-WHAT-WHERE CONDITION CWE-123\nThe affected application lacks proper validation of user-supplied data when parsing BMP files. This could result in a write-what-where condition and an attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-45465 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- End Update A Part 2 of 2 --------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nTran Van Khang - khangkito (VinCSS) working with Trend Micro Zero Day Initiative reported these vulnerabilities to Siemens and CISA.\n5. MITIGATIONS\nSiemens Healthineers has identiﬁed the following speciﬁc workarounds and mitigations that customers can apply to reduce the risk:\n\nDownload syngo fastView only from the SHS official page.\nAvoid opening untrusted files from unknown sources in syngo fastView.\nRemove syngo fastView after viewing the required files.\n\nFor additional information, please refer to Siemens Healthineers’ Security Advisory SHSA-688797\nIn addition, Siemens Healthineers recommends the following:\n\nEnsure appropriate backups and system restoration procedures are in place.\nSecurely delete any backup files that are no longer needed.\nFor specific patch and remediation guidance information contact a Siemens Healthineers Customer Service Engineer, portal, or the Regional Support Center.\n\nFor further inquiries on security vulnerabilities in Siemens Healthineers products and solutions, please contact Siemens Healthineers.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-40367",
    "CVE-2021-45465",
    "CVE-2021-42028"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-16",
  "title": "Siemens Healthineers syngo fastView (Update A) | CISA",
  "source": "ics-advisories",
  "id": "5f3d87cbcda99b5362a2bc26822fac2983f5bb77de7fef3e38bb971160232307"
}