{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Low attack complexity\nVendor: Hitachi Energy\nEquipment: MicroSCADA X SYS600, MicroSCADA Pro\nVulnerability: Improper Use of Validation Framework\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized user to execute administrator level scripts.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hitachi Energy's MicroSCADA Pro/X SYS600 products are affected:\n\nSYS600: 10.4 and earlier\nSYS600: 9.4 FP2 Hotfix 4 and earlier\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER USE OF VALIDATION FRAMEWORK CWE-1173\nAn input validation vulnerability exists in the Monitor Pro interface of MicroSCADA Pro and MicroSCADA X SYS600. An authenticated user could launch an administrator level remote code execution regardless of the authenticated user's role.\nCVE-2022-3388 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi Energy released the following recommended immediate actions:\nFor SYS600 9.x:\n\nUpdate to version SYS600 9.4 FP2 Hotfix 5 or up-grade to at least SYS600 version 10.4.1.\nA requirement to install SYS600 9.4 FP2 Hotfix 5 is to have at least the SYS600 9.4 FP2 Hotfix 4 installed.\n\nFor SYS600 10.x:\n\nUpdate to at least SYS600 version 10.4.1 Or apply general mitigation factors from Hitachi Energy.\n\nFor more information, see Hitachi Energy's Cybersecurity Advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nNovember 29, 2022: Initial Publication\nNovember 09, 2023: Update A - Update to Affected Product Versions, CWE, & Recommended Immediate Actions\n\n",
  "cves": [
    "CVE-2022-3388"
  ],
  "techniques": [],
  "advisory": "icsa-22-333-03",
  "title": "Hitachi Energy MicroSCADA Pro/X SYS600 Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c87a8a4639e18eb741b9aa08230b60e3f754e7fefdf195434473d9f581e851fc"
}