{
  "markdown": "\nOVERVIEW\nThis advisory was originally posted to the US-CERT secure Portal library on March 3, 2015, and is being released to the NCCIC/ICS-CERT web site.\nIvan Sanchez of NullCode & Evilcode Team has identified multiple DLL Hijacking vulnerabilities in a software component included with Rockwell Automation’s FactoryTalk View Studio product. Rockwell Automation determined a similar vulnerability also affects the FactoryTalk Services Platform used with other FactoryTalk-branded software. Rockwell Automation has produced a patch that mitigates the vulnerabilities in the affected products.\nAFFECTED PRODUCTS\nThe following FactoryTalk software is affected:\n\nFactoryTalk Services Platform, all versions prior to 2.71.00, and\nFactoryTalk View Studio Version 8.00.00 and all versions prior.\n\nIMPACT\nExploitation of DLL Hijack vulnerabilities gives an attacker access to the system with the same privilege level as the application that utilizes the malicious DLL.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nRockwell Automation, which is a US-based company, provides industrial automation control and information products worldwide across a wide range of industries.\nThe affected products, FactoryTalk Services Platform and FactoryTalk View Studio, are used in the design and operation of a variety of industrial control systems. According to Rockwell Automation, the software products are applied across several sectors including Chemical, Commercial Facilities, Critical Manufacturing, Energy, Government Facilities, Water and Wastewater Systems, and others. The products are used globally.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENTCWE-427: Uncontrolled Search Path Element, http://cwe.mitre.org/data/definitions/427.html, web site last accessed March 19, 2015.\n\nA successful exploit of these vulnerabilities requires the local user to load a crafted DLL on the victim machine. The View Studio Clean Utility Application loads the DLL and gives the attacker access at the same privilege level as the application.\nCVE-2014-9209NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-9209, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to these vulnerabilities. A CVSS v2 base score of 6.9 has been assigned; the CVSS vector string is (AV:L/AC:M/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:M/Au:N/C:C/I:C/A:C, web site last accessed March 19, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities are not exploitable remotely without user interaction. The exploits are only triggered when a local user runs the vulnerable application, and it loads the malformed DLL file.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nCrafting a working exploit for these vulnerabilities would be difficult. Social engineering is required to convince the user to accept the malformed file. This further decreases the likelihood of a successful exploit.\nMITIGATION\nRockwell Automation recommends users log into their web site, review their advisory notice, and apply patch software located at:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/646323\nICS-CERT recommends that users utilize least privilege measures, including running the operating system and applications with non-administrative accounts and escalating privileges only as required to perform necessary operations.\nICS-CERT encourages asset owners to take additional defensive measures to protect against these and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (www.ics-cert.org).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed March 19, 2015. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed March 19, 2015. for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2014-9209"
  ],
  "techniques": [],
  "advisory": "icsa-15-062-02",
  "title": "Rockwell Automation FactoryTalk DLL Hijacking Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "d379d4732eb0ba2ea916cfedda728dc1504b97cb0c7c0d130cf7e55db58e4496"
}