{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens \nEquipment: SINEMA Remote Connect Server\nVulnerabilities: Incorrect Authorization\\\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow authenticated unprivileged user accounts to access unauthorized functionality.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SINEMA Remote Connect Server are affected:\n\nSINEMA Remote Connect Server: All versions prior to v3.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT AUTHORIZATION CWE-863\nThe webserver could allow unauthorized actions via special URLs for unprivileged users. The settings of the Unified Management Component (UMC) authorization server could be changed to add a rogue server by an attacker authenticating with unprivileged user rights. \nCVE-2020-25239 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    INCORRECT AUTHORIZATION CWE-863\nUnprivileged users can access services when guessing the URL. An attacker could impact availability, integrity, and gain information from logs and templates of the service. \nCVE-2020-25240 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends updating to v3.0 or later and has identified the following specific workarounds and mitigations that customers can apply to reduce risk:\n\nCheck that all settings are as expected when applying templates.\nConfigure a syslog server for logs.\nEnsure all accounts (including unprivileged) are trusted.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals. \nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information refer to Siemens security advisory SSA-731317\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-25239",
    "CVE-2020-25240"
  ],
  "techniques": [],
  "advisory": "icsa-21-068-04",
  "title": "Siemens SINEMA Remote Connect Server | CISA",
  "source": "ics-advisories",
  "id": "0c768a62ea1e6a079eb58c31ee37af3c8fb7dcadfa5331d4af7dcffad4e361ff"
}