{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: Relion 670, 650, and SAM600-IO\nVulnerabilities: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled “ICSA-21-096-01 Hitachi ABB Power Grids Multiple Products” published April 6, 2021 on the ICS webpage at cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could reboot the device regularly, resulting in a denial-of-service condition. The primary functionality of the device is not available during the reboot phase.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update B Part 1 of 2 --------- \nHitachi Energy reports the vulnerability affects the following products with IEC 61850 interfaces: \n\nRelion 670 series: Versions 1.1, 1.2.3, 2.0, 2.1, 2.2.2, 2.2.3\nRelion 670/650 series:  Version 2.2.0\nRelion 670/650/SAM600-IO series: Version 2.2.1\nRelion 650 series: Versions 1.1, 1.2, 1.3\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1 IMPROPER INPUT VALIDATION CWE-20\nAn attacker with access to the IEC 61850 network and knowledge of how to reproduce the attack—as well as the IP addresses of the different IEC 61850 access points (of IEDs/products)—can force the device to reboot, which renders the device inoperable for approximately 60 seconds.  This vulnerability affects only products with IEC 61850 interfaces.\nCVE-2021-27196 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n4.4 RESEARCHER\nMarkus Mahrla, GAI NetConsult GmbH and Lars Lengersdorf, Amprion GmbH reported this vulnerability to Hitachi Energy.\n5. MITIGATIONS\n--------- Begin Update B Part 2 of 2 ---------\nHitachi Energy recommends users apply relevant updates at their earliest convenience. Users should contact Hitachi Energy to acquire firmware for a specific product version. Hitachi Energy has created the new versions to address this vulnerability:\n\nRelion 670 series version 1.1: Follow recommendation as listed in the Hitachi Energy advisory 9AKK107991A8932 mitigation section or upgrade to the latest product version.\nFor upgrades, contact your local Hitachi Energy associates.\nRelion 670 series version 1.2.3: Fixed in revision 670 1.2.3.20\nRelion 670 series version 2.0: Fixed in revision 670 2.0.0.13\nRelion 670 series version 2.1: Fixed in revision 670 2.1.0.5\nRelion 670/650 series version 2.2.0: Fixed in revision 670 2.2.0.13\nRelion 670/650/SAM600-IO series version 2.2.1: Fixed in revision 670 2.2.1.6\nRelion 670 series version 2.2.2: Fixed in revision 670 2.2.2.3\nRelion 670 series version 2.2.3: Fixed in revision 670 2.2.3.2\nRelion 650 series version 1.1: Follow recommendation as listed in the Hitachi Energy advisory 9AKK107991A8932 mitigation section or upgrade to the latest product version.\nFor upgrades, contact your local Hitachi Energy associates.\nRelion 650 series version 1.2: Follow recommendation as listed in the Hitachi Energy advisory 9AKK107991A8932 mitigation section or upgrade to product version 1.3.\nFor upgrades, contact your local Hitachi Energy associates.\nRelion 650 series version 1.3: Fixed in revision 650 1.3.0.7\n\nHitachi Energy recommends the following security practices and firewall configurations to help protect a process control network from attacks originating outside the network:\n\nPhysically protect process control systems from unauthorized direct access.\nDo not directly connect control systems networks to the internet.\nSeparate process control systems from other networks using a firewall system with a minimal number of open ports.\nDo not use process control systems for internet surfing, instant messaging, or email.\nCarefully scan portable computers and removable storage media prior to connecting to a control system for malware.\nEnsure that only authorized personnel have access to the system configuration files.\n\nMore information on recommended practices can be found in the cybersecurity deployment guidelines for each product version.\nFor more information, see Hitachi Energy advisory 9AKK107991A8932.\n--------- End Update B Part 2 of 2 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27196"
  ],
  "techniques": [],
  "advisory": "icsa-21-096-01",
  "title": "Hitachi Energy Relion 670, 650 and SAM600-IO (Update B) | CISA",
  "source": "ics-advisories",
  "id": "a314c93b19633e6feb2cece9efc781fd0a388cf1122d4c4f46198fd6aaa3c691"
}