{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Teamcenter\nVulnerability: Use of Hard-coded Credentials\n\n2. UPDATE\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-167-13 Siemens Teamcenter that was published June 16, 2022, to the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to remote code execution with elevated permissions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Teamcenter, a product lifecycle management software, are affected:\n\nTeamcenter v12.4: All versions prior to v12.4.0.13\nTeamcenter v13.0: All versions prior to v13.0.0.9\nTeamcenter v13.1: All versions prior to v13.1.0.9\n\n--------- Begin Update A Part 1 of 4 ---------\n\nTeamcenter V13.2, all versions prior to V13.2.0.9\n\n--------- End Update A Part 1 of 4 ---------\n\nTeamcenter V13.3, all versions prior to V13.3.0.3\n\n--------- Begin Update A Part 2 of 4 ---------\n\nTeamcenter V14.0, all versions prior to V14.0.0.2\n\n--------- End Update A Part 2 of 4 ---------\nThis vulnerability only affects software using the Java EE Server Manager HTML Adaptor, which is not installed by default.\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nJava EE Server Manager HTML Adaptor in Teamcenter contains default hardcoded credentials. Access to the application allows users to perform a series of actions that could potentially lead to remote code execution with elevated permissions.\nCVE-2022-31619 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nHan Lee and Matthias Kaiser from Apple Information Security reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has released updates for several affected products and recommends updating to the latest versions. Siemens is preparing further updates and recommends specific countermeasures for products where updates are not, or not yet, available.\n\nTeamcenter V12.4: Update to V12.4.0.13 or later\nTeamcenter V13.0: Update to V13.0.0.9 or later\nTeamcenter V13.1: Update to V13.1.0.9 or later\n\n--------- Begin Update A Part 3 of 4 ---------\n\nTeamcenter V13.2: Update to V13.2.0.9 or later\n\n--------- End Update A Part 3 of 4 ---------\n\nTeamcenter V13.3: Update to V13.3.0.3 or later\n\n--------- Begin Update A Part 4 of 4 ---------\n\nTeamcenter V14.0, Update to V14.0.0.2 or later\n\n--------- End Update A Part 4 of 4 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nHarden the application’s host to prevent local access by untrusted personnel\nLimit access to Port 8082/TCP to specific IP addresses (e.g., with a firewall)\nJava EE Server Manager HTML Adaptor is obsolete. It is recommended to use Teamcenter Management Console for Server Manager administration\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-220589\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-31619"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-13",
  "title": "Siemens Teamcenter (Update A) | CISA",
  "source": "ics-advisories",
  "id": "353c6bdb05cc1656fe5fc2b682b5a3167237a1663e760c0152ccbc12e0282791"
}