{
  "markdown": "\nCVSS v3 8.6\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Rockwell Automation\nEquipment: Allen-Bradley MicroLogix 1400 Controllers\nVulnerability: Buffer Overflow\nAFFECTED PRODUCTS\nThe following versions of MicroLogix 1400 Controllers, a PLC, are affected:\n\nMicroLogix 1400 Controllers, Series B and C Versions 21.002 and earlier\n\nRockwell Automation reports that the following catalogs are affected:\n\n1766-L32AWA\n1766-L32AWAA\n1766-L32BWA\n1766-L32BWAA\n1766-L32BXB\n1766-L32BXBA\n\nIMPACT\nSuccessful exploitation of this vulnerability could cause the device that the attacker is accessing to become unresponsive to Modbus TCP communications and affect the availability of the device.\nMITIGATION\nRockwell Automation encourages affected users to upgrade to the latest version of available firmware, FRN 21.003, which can be obtained from:\nhttps://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?famID=30&crumb=112\nRockwell Automation also suggests that Modbus TCP can be disabled if it is not necessary in the implementation of the device to mitigate the vulnerability.\nFor more information, Rockwell Automation has released a security bulletin that can be accessed using valid credentials at:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1070883\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nBUFFER COPY WITHOUT CHECKING SIZE OF INPUT ('CLASSIC BUFFER OVERFLOW') CWE-120\n\nThe stack-based buffer overflow vulnerability has been identified, which may allow remote code execution.\nCVE-2017-16740 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\nRESEARCHER\nThiago Alves of the University of Alabama reported the vulnerability to Rockwell Automation and ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sector(s): Critical Manufacturing, Food and Agriculture, and Water and Wastewater Systems.\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Wisconsin\n",
  "cves": [
    "CVE-2017-16740"
  ],
  "techniques": [],
  "advisory": "icsa-18-009-01",
  "title": "Rockwell Automation Allen-Bradley MicroLogix 1400 Controllers | CISA",
  "source": "ics-advisories",
  "id": "3ae8b23d3a2633b1e92fd04f0b8013a90924b3d1688452bca4f2967867e43cd1"
}