{
  "markdown": "\nOVERVIEW\nAriele Calgaviano working with Zero Day Initiative has identified a heap-based memory corruption vulnerability and a stack buffer overflow vulnerability in Eaton’s ELCSoft programming software. Eaton has released a revision to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following ELCSoft programming software versions are affected:\n\nELCSoft Version 2.4.01 and earlier.\n\nIMPACT\nAn attacker may be able to exploit these vulnerabilities to execute arbitrary code on the target system.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nEaton is a US-based company that maintains offices worldwide.\nThe affected product, ELCSoft programming software, is used to configure all Eaton ELC programmable logic controllers deployed by power grid operators to apply protection and communications support for overcurrent devices such as reclosers and circuit breakers. According to Eaton, this product is used primarily in the Energy sector. Eaton estimates this product is used worldwide. While the ELC controllers themselves do not exhibit this vulnerability, the PCs used to configure the logic in the ELC exhibit this vulnerability when running the ELCSoft editor.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nHEAP-BASED BUFFER OVERFLOWCWE-122: Heap-based Buffer Overflow, http://cwe.mitre.org/data/definitions/122.html, web site last accessed June 30, 2016.\n\nA proof-of-concept file can be run after page heap is turned on for elcsoft.exe.\nCVE-2016-4509NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-4509, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.0 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:C/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:L/UI:N/S:C/C:L/I:L/A:L, web site last accessed June 30, 2016.\n\nSTACK-BASED BUFFER OVERFLOWCWE-121: Stack-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121.html, web site last accessed June 30, 2016.\n\nThe ELCSimulator copies the input network packet into a fixed size stack buffer without checking if it will fit.\nCVE-2016-4512NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-4512, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed June 30, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nEaton has released a revision that mitigates these vulnerabilities. The revision can be downloaded at:\nhttps://eatonfilesharing.box.com/s/r4ulykfay2x5nlai9pqijivdh1zyks98.\nEaton states the current firmware needs to be uninstalled prior to loading the update.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-4512",
    "CVE-2016-4509"
  ],
  "techniques": [],
  "advisory": "icsa-16-182-01",
  "title": "Eaton ELCSoft Programming Software Memory Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "3cf0a224304d7533007bcbfca7f48e1b51e35961a5bbab2dbf18e24f55cca39b"
}