{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Econolite\nEquipment: EOS\nVulnerability: Improper Access Control, Use of Weak Hash\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-23-026-02 Econolite EOS that was published January 26, 2023.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in a remote unauthenticated attacker gaining full control over traffic lights.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of EOS, a traffic control software, are affected:\n--------- Begin Update A Part 1 of 4 --------- \n\n\nEOS: Versions prior to 3.2.23\n\n\n--------- End Update A Part 1 of 4 --------- \n4.2 VULNERABILITY OVERVIEW\n4.2.1 IMPROPER ACCESS CONTROL CWE-284\n--------- Begin Update A Part 2 of 4 ---------\nEconolite EOS versions prior to 3.2.23 lack a password requirement for gaining “READONLY” access to log files and certain database and configuration files. One such file contains tables with MD5 hashes and usernames for all defined users in the control software, including administrators and technicians.\n--------- End Update A Part 2 of 4 ---------\nCVE-2023-0451 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). \n4.2.2 USE OF WEAK HASH CWE-328\n--------- Begin Update A Part 3 of 4 --------- \nEconolite EOS versions prior to 3.2.23 use a weak hash algorithm for encrypting privileged user credentials. A configuration file that is accessible without authentication uses MD5 hashes for encrypting credentials, including those of administrators and technicians.\n--------- End Update A Part 3 of 4 ---------\nCVE-2023-0452 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Transportation \nCOUNTRIES/AREAS DEPLOYED: United States and Canada \nCOMPANY HEADQUARTERS LOCATION: United States \n\n4.4 RESEARCHER\nRustam Amin reported these vulnerabilities to CISA. \n5. MITIGATIONS\n--------- Begin Update A Part 4 of 4 ---------\nEconolite recommends users update their affected products to the latest version. Customers are strongly encouraged to download the latest software updates through https://www.econolite.com/support.\nCustomers may also contact Econolite by sending an email to support@econolite.com or calling the Support line at (800) 225-6480 or reaching out to their local Account Manager or Distributor.\nEconolite also recommends that customers follow best practices for network security and access control for all safety-critical equipment and minimize exposure by restricting access to equipment on the open public internet.\n--------- End Update A Part 4 of 4 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2023-0451",
    "CVE-2023-0452"
  ],
  "techniques": [],
  "advisory": "icsa-23-026-02",
  "title": "Econolite EOS (Update A) | CISA",
  "source": "ics-advisories",
  "id": "f95bd090e71644b981412317430fa78853b521434739f08b5234f219c5996c44"
}