{
  "markdown": "\nCVSS v3 9.4\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available\nVendor: PDQ Manufacturing, Inc.\nEquipment: LaserWash, Laser Jet and ProTouch\nVulnerabilities: Improper Authentication, Missing Encryption of Sensitive Data\nAFFECTED PRODUCTS\nThe following versions of LaserWash, Laser Jet, and ProTouch, in-bay automatic car wash systems are affected:\n\nLaserWash G5 and G5 S Series all versions,\nLaserWash M5, all versions,\nLaserWash 360 and 360 Plus, all versions,\nLaserWash AutoXpress and AutoExpress Plus, all versions,\nLaserJet, all versions,\nProTouch Tandem, all versions,\nProTouch ICON, all versions, and\nProTouch AutoGloss, all versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow a remote attacker to gain unauthorized access to the affected system and to issue unexpected commands to impact the intended operation of the system.\nMITIGATION\nPDQ Manufacturing, Inc. (“PDQ”) has validated the vulnerabilities and is developing product fixes for the affected systems. In the interim, PDQ. has identified compensating controls to limit the exploitability of the affected systems.\nPDQ recommends that users apply the following controls:\n\nAlways make sure any PDQ equipment is not accessible from the Internet; it should be behind a secure firewall.\nWhenever a machine or router is received and installed, always change the default password from the factory settings to a new password unique to the machine. If an existing site is still using the factory default passwords on a machine or router, immediately change the default password to a new, unique, strong password.\nAlways set up the system network (router or Wi-Fi) with its security features enabled such that they require a username and password to be able to access the machine network.\nDo not set up the site router with “port forwarding” enabled. This can effectively expose the system to the Internet and may permit an unauthorized person to reach the machine login screen.\nDo not share passwords or write them down in an accessible place where unauthorized users may find them.\n\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nAffected web-server does not properly verify that provided authentication information is correct.\nCVE-2017-9630 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n\nMISSING ENCRYPTION OF SENSITIVE DATA CWE-311\n\nUsername and password are transmitted insecurely.\nCVE-2017-9632 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nRESEARCHER\nBilly Rios and Jonathan Butts of WhiteScope and independent security researcher Terry McCorkle reported the vulnerabilities. \nBACKGROUND\nCritical Infrastructure Sector(s): Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: De Pere, Wisconsin \n",
  "cves": [
    "CVE-2017-9632",
    "CVE-2017-9630"
  ],
  "techniques": [],
  "advisory": "icsa-17-208-03",
  "title": "PDQ Manufacturing, Inc. LaserWash, Laser Jet and ProTouch | CISA",
  "source": "ics-advisories",
  "id": "d4346055b4294236720857166885e46cef729aa0032db32eb1b345220b12ee67"
}