{
  "markdown": "\nCVSS V3 8.8\nATTENTION: Remotely exploitable/low skill level to exploit\nVendor: Schneider Electric\nEquipment: homeLYnk Controller, LSS100100\nVulnerability: Cross-site Scripting, Command Injection\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-019-01 Schneider Electric homeLYnk Controller that was published January 19, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following products:\n\nhomeLYnk Controller, LSS100100, all versions prior to V1.5.0\n\nIMPACT\nAn attacker may be able to exploit this vulnerability to cause execution of java script code.\nMITIGATION\n--------- Begin Update A Part 1 of 2 --------\nSchneider Electric has made firmware that fixes these vulnerabilities available for download at:\nhttp://www.schneider-electric.com/en/download/document/FW1_5_1-hL/\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Schneider Electric security notification SEVD-2017-011-01 at the following location:\nhttp://www.schneider-electric.com/ww/en/download/document/SEVD-2017-011-01,\nand security notification SEVD-2017-052-02 at the following location:\nhttp://www.schneider-electric.com/ww/en/download/document/SEVD-2017-052-02\n--------- End Update A Part 1 of 2 ----------\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nCROSS-SITE SCRIPTING CWE-79\n\nThe homeLYnk controller is susceptible to a cross-site scripting attack. User inputs can be manipulated to cause execution of java script code.\nCVE-2017-5157 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n--------- Begin Update A Part 2 of 2 --------\n\nCOMMAND INJECTION CWE-77\n\nThe homeLYnk controller has network features that can be manipulated via specially crafted POST requests. This vulnerability requires user interaction to be exploited.\nCVE-2017-7689 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- End Update A Part 2 of 2 ----------\nRESEARCHER\nMohammed Shameem reported this issue to Schneider Electric.\nBACKGROUND\nCritical Infrastructure Sector: Commercial Facilities\nCountries/Areas Deployed: United States\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2017-5157",
    "CVE-2017-7689"
  ],
  "techniques": [],
  "advisory": "icsa-17-019-01a",
  "title": "Schneider Electric homeLYnk Controller (Update A) | CISA",
  "source": "ics-advisories",
  "id": "1cad27405279fb363e6cddd7a133ae6ab23e4334433de48367752eb7af5b1dbe"
}