{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.3\nATTENTION: Exploitable remotely/Low attack complexity\nVendor: alpitronic\nEquipment: Hypercharger EV charger\nVulnerability: Use of Default Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in an attacker disabling the device, bypassing payment, or accessing payment data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hypercharger EV charger, a high power charging station, are affected:\n\nHypercharger EV charger: all versions\n\n3.2 Vulnerability Overview\n3.2.1 USE OF DEFAULT CREDENTIALS CWE-1392\nIf misconfigured, the charging devices can expose a web interface protected by authentication. If the default credentials are not changed, an attacker can use public knowledge to access the device as an administrator.\nCVE-2024-4622 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:H).\nA CVSS v4 score has been calculated for CVE-2024-4622. A base score of 8.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:L/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Italy\n\n3.4 RESEARCHER\nHanno Böck reported these vulnerabilities to CISA.\n4. MITIGATIONS\nalpitronic recommends users change the default credentials for all charging devices.\nalpitronic advises that the interface should be connected only to internal segregated and access-controlled networks and not exposed to the public internet/web.\nWhen informed of these vulnerabilities, alpitronic, in conjunction with and/or on behalf of affected clients, disabled the interface on any exposed devices and all clients were contacted directly and reminded that the interface is not intended to be visible on the public Internet and that default passwords should be changed.\nalpitronic are also applying mitigations to all devices in the field and to new devices in production. New devices will come with unique passwords. Devices using the default password will be automatically assigned new unique passwords, or at first access if the device has not yet been installed. Devices with the default passwords already changed will not be affected. New passwords can be obtained by scanning the QR-Code inside the charger or in DMS portal hyperdoc. Contact Hypercharger support with any questions about newly assigned passwords.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nMay 9, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-4622"
  ],
  "techniques": [],
  "advisory": "icsa-24-130-02",
  "title": "alpitronic Hypercharger EV Charger | CISA",
  "source": "ics-advisories",
  "id": "e33eb396e1e299fa298defe460cc69e7bc0309ea2342fe66b6daec0976c1aeba"
}