{
  "markdown": "\nOverview\nIndependent researcher Carlos Mario Peñagos Hollman identified a DLL Hijack vulnerability in WellinTech’s KingView application. WellinTech has created a patch that resolves the vulnerability. Mr. Hollman has tested the patch and verified that it resolves the vulnerability.\nAffected Products\nThe following product and version are affected:\n\nWellinTech KingView 6.53\n\nImpact\nA successful exploit of this vulnerability could lead to arbitrary code execution.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nWellinTech is a software development company specializing in the automation and control industry based in Beijing, China, with branches in United States, Japan, Singapore, Europe, and Taiwan.\nAccording to the WellinTech website, the KingView product is a Windows-based control, monitoring, and data collection application deployed across several industries including power, water, building automation, mining, and other sectors.\nVulnerability Characterization\nVulnerability Overview\nUncontrolled Search Path Elementhttp://cwe.mitre.org/data/definitions/427.html , website last accessed May 01, 2012\nAn attacker may place a malicious DLL in a directory where it will be loaded before the valid DLL. An attacker must have access to the host file system to exploit this vulnerability. If exploited, this vulnerability may allow execution of arbitrary code.\nCVE-2012-1819 has been assigned to this vulnerability.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable but may require the use of social engineering to exploit.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker requires a moderate skill level to exploit this vulnerability.\nMitigation\nWellinTech has developed a patch to resolve this issue. The WellinTech advisory and the KingView product patch can be found here: http://en.wellintech.com/news/detail.aspx?contentid=168.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2012-1819"
  ],
  "techniques": [],
  "advisory": "icsa-12-122-01",
  "title": "WellinTech KingView DLL Hijack Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "bb504139ed0334918377c0ae6e180241d11f64be80259e6e472468b66b33f3c1"
}