{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ABB\nEquipment: Relion 670 Series\nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to read and delete files on the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Relion 670 series, a protection and control device, are affected:\n\nRelion 670 series versions 1p1r26 and prior\nRelion 670 series versions 1.2.3.17 and prior\nRelion 670 series versions 2.0.0.10 and prior (RES670 2.0.0.4 and prior)\nRelion 670 series versions 2.1.0.1 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nAn attacker could use specially crafted paths in a specific request to read or delete files from the device outside the intended directory.\nCVE-2019-18253 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nKirill Nesterov of Kaspersky Lab reported this vulnerability to ABB.\n4. MITIGATIONS\nABB recommends users update to the following or later versions at earliest convenience if IEC 61850 is used:\n\nRelion 670 series version 1p1r27\nRelion 670 series version 1.2.3.18\nRelion 670 series version 2.0.0.11 (RES670 2.0.0.5)\nRelion 670 series version 2.1.0.2\n\nUpdates can be ordered by email at: sa.t-supportline@se.abb.com\nThe only known workaround for this vulnerability is to disable IEC 61850 protocol when not in use. If this is not possible, ABB recommends having a proper security architecture that divides the system in different security zones, and revising the firewall configurations to limit the usage of MMS protocol to the relevant upper networks.\nIEC 61850 MMS protocol uses Port 102/TCP.\nABB also recommends that these and other proper security practices and firewall configurations (including VPN) be implemented to help protect a process control network from attacks originating outside the network:\n\nProcess control systems are physically protected from direct access by unauthorized personnel.\nProcess control systems have no direct connections to the Internet.\nProcess control systems are separated from other networks by means of a firewall system that has a minimal number of ports/services exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving e-mails.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\nIf IEC 61850 protocol isn’t used, make sure it is disabled. This removes the vulnerability.\n\nFor more information see the ABB Cybersecurity Advisory 1MRG024910\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-18253"
  ],
  "techniques": [],
  "advisory": "icsa-19-330-01",
  "title": "ABB Relion 670 Series | CISA",
  "source": "ics-advisories",
  "id": "ce6c568bc4eb40a13cc713be2509692cae1c774df923daff39198610989a78ed"
}