{
  "markdown": " MatrikonOPC Improper Input Validation \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryMatrikonOPC Improper Input Validation===================================== Last Revised September 06, 2018 Alert Code ICSA\\-14\\-010\\-01OVERVIEW-------- This advisory was originally posted to the US\\-CERT secure Portal library on January 10, 2014, and is now being released to the NCCIC/ICS\\-CERT web site. Adam Crain of Automatak and independent researcher Chris Sistrunk have identified an improper input validation vulnerability in the MatrikonOPC SCADA DNP3 OPC Server application. MatrikonOPC has produced a patch that mitigates this vulnerability. The researchers have tested the patch to validate that it resolves the vulnerability. This vulnerability could be exploited remotely.AFFECTED PRODUCTS----------------- The following MatrikonOPC versions are affected:* MatrikonOPC SCADA DNP3 OPC Server Version 1\\.2\\.2\\.0 and older.IMPACT------ An attacker could potentially use this vulnerability to craft an exploit to cause a denial\\-of\\-service (DoS) loop in the MatrikonOPC Server for DNP3 Windows service. This requires a reboot of the system to restart DNP3 communications. After the service has been put into the DoS condition, the configuration tool experiences a read access violation. Impact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- MatrikonOPC is an Edmonton, Canada\\-based company that maintains offices in several countries around the world, including the United States, Canada, Germany, Russia, Australia, Singapore, Norway, Brazil, UK, India, Spain, Portugal, and Costa Rica. The affected product, SCADA DNP3 OPC Server, is Microsoft Windows\\-based software that facilitates connectivity to multiple DNP3 compliant devices such as remote terminal units, programmable logic circuits, and meters. According to MatrikonOPC, the SCADA DNP3 OPC Server is deployed across several sectors including chemical and energy. MatrikonOPC products are used primarily in the US, Canada, and UK.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### IMPROPER INPUT VALIDATIONCWE\\-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20\\.html, Web site last accessed February 11, 2014\\. The susceptible versions of MatrikonOPC contain a specific vulnerability that may cause the server to exit and communications to stop. This only happens after the server (master station) successfully connects to a device (outstation) and that device returns a malformed DNP3 packet. The process never recovers and cannot be shut down. The Windows operating system on the master station would have to be rebooted to reestablish communications. After the service has been put in a DoS condition, the configuration tool experiences a read access violation on further reboots. CVE\\-2013\\-2829NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2013\\-2829, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7\\.1 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:M/Au:N/C:N/I:N/A:C, Web site last accessed February 11, 2014\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY An attacker with a moderate skill would be able to exploit this vulnerability.MITIGATION---------- MatrikonOPC recommends that customers obtain and install the patch as follows:* Visit http://www.opcsupport.com/ics/support/default.asp?deptID\\=4590,* Click on the Product Advisory section, and read the posted security notification.* Contact OPC Support to obtain the new version of the OPC server for DNP3\\.* Install the new version of the OPC Server for DNP3\\. The researchers suggest the following mitigation:* Block DNP3 traffic from traversing onto business or corporate networks through the use of an IPS or firewall with DPN3\\-specific rule sets. NCCIC/ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. NCCIC/ICS\\-CERT also provides a section for control systems security recommended practices on the NCCIC/ICS\\-CERT Web page at [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . NCCIC/ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the NCCIC/ICS\\-CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B—Targeted Cyber Intrusion Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the NCCIC/ICS\\-CERT Web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC/ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* MatrikonOPC-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-14-010-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2013-2829"
  ],
  "techniques": [],
  "advisory": "icsa-14-010-01",
  "title": "MatrikonOPC Improper Input Validation | CISA",
  "source": "ics-advisories",
  "id": "9f2af740281f9aec886cc293ca70fcfa4c9f74958dc245d614e3c746e2228fa9"
}