{
  "markdown": "\nCVSS v3 7.3\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Fuji Electric\nEquipment: Monitouch V-SFT\nVulnerabilities: Stack-Based Buffer Overflow, Heap-Based Buffer Overflow, Improper Privilege Management\nAFFECTED PRODUCTS\nThe following versions of Monitouch V-SFT, a screen configuration software, are affected:\n\nMonitouch V-SFT, versions prior to Version 5.4.43.0\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow remote code execution or cause the software that the attacker is accessing to crash. The improper privilege management vulnerability could allow an attacker with local access to escalate privileges.\nMITIGATION\nFuji Electric has released a new version of Monitouch V-SFT, Version 5.4.43.0, to fix these vulnerabilities. Users can download the update at the following location:\nhttp://proself.hakko-elec.co.jp/public/qAW0wAxKdQoAj_0BP8ddt6DJIYPCHSIrxFA09Q5YfPMd\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nThe stack-based buffer overflow vulnerability has been identified, which may cause a crash or allow remote code execution.\nCVE-2017-9659 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n\nHEAP-BASED BUFFER OVERFLOW CWE-122\n\nA heap-based buffer overflow vulnerability has been identified, which may cause a crash or allow remote code execution.\nCVE-2017-9660 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n\nIMPROPER PRIVILEGE MANAGEMENT CWE-269\n\nMonitouch V-SFT is installed in a directory with weak access controls by default, which could allow an authenticated attacker with local access to escalate privileges.\nCVE-2017-9662 has been assigned to this vulnerability. A CVSS v3 base score of 4.5 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:L).\nRESEARCHER\nIndependent researchers Fritz Sands and kimiya working with Trend Micro’s Zero Day Initiative identified these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Japan\n",
  "cves": [
    "CVE-2017-9662",
    "CVE-2017-9660",
    "CVE-2017-9659"
  ],
  "techniques": [],
  "advisory": "icsa-17-222-04",
  "title": "Fuji Electric Monitouch V-SFT | CISA",
  "source": "ics-advisories",
  "id": "ea0501467835c737ebde0de709f6ba721a8d835ce4b37c313d1f7585c279aae9"
}