{
  "markdown": "\nCVSS v3 8.2\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: Industrial products using the Discovery Service of the OPC UA protocol stack by the OPC foundation\nVulnerability: Improper Restriction of XML External Entity Reference\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following industrial products, which use the Discovery Service of the OPC UA protocol stack by the OPC foundation:\n\nSIMATIC PCS 7\n\nV7.1 and earlier versions\nV8.0: All versions\nV8.1: All versions\n\n\nSIMATIC WinCC:\n\nV7.0: All versions\nV7.2: All versions\nV7.3: All versions\nV7.4: All versions prior to V7.4 SP1\n\n\nSIMATIC WinCC Runtime Professional:\n\nV13: All versions\nV14: All versions prior to V14 SP1\n\n\nSIMATIC NET PC Software: All versions\nSIMATIC IT Production Suite: All versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to access various resources.\nMITIGATION\nSiemens provides fixes for the following products and recommends users upgrade to the newest version:\n\nSIMATIC PCS 7:\n\nAll versions prior to V9.0: Follow FAQ:\n\n\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109749461\n\nSIMATIC WinCC:\n\nV7.4: Update to V7.4 SP1\n\n\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746038\n\nAll other versions: Follow FAQ to turn off the service after commissioning:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109749461\n\nSIMATIC WinCC Runtime Professional:\n\nUpdate to V14 SP1\n\n\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746276\n\nAll other versions: Follow FAQ to turn off the service after commissioning:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109749461\n\nSIMATIC NET PC Software:\n\nFollow FAQ to turn off the service after commissioning:\n\n\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109749461\nSiemens is preparing further updates and recommends the following mitigations in the meantime:\n\nTurn off the Discovery Service or block it on the local firewall,\nApply cell protection concept,\nUse VPN for protecting network communication between cells, and\nApply Defense in Depth.\n\nSiemens recommends users protect network access with appropriate mechanisms such as firewalls, segmentation, and VPNs. Siemens also advises that users configure the operational environment according to Siemens’ Operational Guidelines for Industrial Security:\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-535640 at the following location:\nhttp://www.siemens.com/cert/advisories\nThe OPC Foundation also published a security bulletin for this vulnerability:\nhttps://opcfoundation-onlineapplications.org/faq/SecurityBulletins/OPC_Foundation_Security_Bulletin_CVE-2017-12069.pdf\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE ('XXE') CWE-611\n\nBy sending specially crafted packets to the OPC Discovery Server at Port 4840/TCP, an attacker might cause the system to access various resources chosen by the attacker.\nCVE-2017-12069 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:H).\nRESEARCHER\nSergey Temnikov of Kaspersky Lab reported this vulnerability to Siemens.\nBACKGROUND\nCritical Infrastructure Sectors: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-12069"
  ],
  "techniques": [],
  "advisory": "icsa-17-243-01",
  "title": "Siemens industrial products using the Discovery Service of the OPC UA protocol stack by the OPC foundation | CISA",
  "source": "ics-advisories",
  "id": "5cdbb64a5ca93a968f340508769a061afce331896cac7803a2632580003b1985"
}