{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.3\nATTENTION: Low attack complexity  \nVendor: Siemens \nEquipment: SINUMERIK ONE and SINUMERIK MC \nVulnerability: Insufficiently Protected Credentials \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow attackers to discover the private key of a given CPU product family via an offline attack against a single CPU from the family. Attackers could then use this knowledge to extract confidential configuration data from projects.  \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SINUMERIK CNC systems are affected: \n\nSINUMERIK ONE All Versions \nSINUMERIK MC All Versions \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522 \nAll versions of Siemens SINUMERIK ONE and SINUMERIK MC use an insecure method to store authentication credentials, which are therefore susceptible to being retrieved. \nCVE-2022-38465 has been assigned to this vulnerability. A CVSS v3 base score of 9.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing  \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA. \n4. MITIGATIONS\nSiemens identified the following specific workarounds and mitigations that customers can apply to reduce the risk: \n\nExpose the communication between the S7-1500 CPU and the HMI of the affected products only to trusted network environments. \nProtect access to the TIA Portal project and SINUMERIK NCU (including related memory cards) from unauthorized actors. \n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals. \nFor more information, see Siemens security advisory SSA-568428 in HTML or CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.  \n",
  "cves": [
    "CVE-2022-38465"
  ],
  "techniques": [],
  "advisory": "icsa-22-314-04",
  "title": "Siemens SINUMERIK ONE and SINUMERIK MC | CISA",
  "source": "ics-advisories",
  "id": "eab0f4aff37d4cd75f12e997c2b108f0dfec615f722d5d4c52d56118302f5f96"
}