{
  "markdown": "\nOverview\nICS-CERT has received a report from independent security researchers Billy Rios and Terry McCorkle concerning a vulnerability that affects ICONICS GENESIS32 and BizViz products. This vulnerability includes a crash in the Security Login controls used by GENESIS32 due to a buffer overflow. ICONICS has validated the researchers’ claims for the multiple versions of GENESIS32 and BizViz.\nICS-CERT has coordinated these vulnerability reports with ICONICS and they have released a patch that addresses the vulnerability. The researchers have validated that the patches mitigate the reported vulnerability.\nAffected Products\nAccording to ICONICS, this vulnerability exists in several versions of two ICONICS products. The products and versions affected are:\n\nGENESIS32 – Versions 8.05, 9.0, 9.1 and 9.2\nBizViz – Versions 8.05, 9.0, 9.1 and 9.2\n\nImpact\nA successful exploit of this vulnerability could cause a buffer overflow resulting in a denial of service and potential remote code execution.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on the environment, architecture, and product implementation.\nBackground\nICONICS is a US-based company that maintains offices in several countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia.\nThe affected products, GENESIS32 and BizViz, are web-based SCADA systems. According to ICONICS, GENESIS32 is deployed across several sectors including manufacturing, building automation, oil and gas, water and wastewater, electric utilities, and others. ICONICS estimates that these products are primarily used in the United States and Europe with a small percentage in Asia.\nVulnerability Characterization\nVulnerability Overview\nExploitation of this vulnerability requires creation of a specially crafted password that exceeds a specified length and contains executable code.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo known exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a low skill level can create the denial of service whereas it would require a more skilled attacker to execute arbitrary code.\nMitigation\nThe patch and ICONICS whitepaper are available from the ICONICS website. ICONICS has two mitigations available for this vulnerability:\n\nCustomers can upgrade their product to Version 9.22.\nCustomers with Version 9.21 can apply the patch included with the Version 9.21 Security Updatesdownload, which is available on ICONICS website: http://www.iconics.com/certs. ICONICS has included a “readme” file with the download that provides instructions for applying the patch.\n\nIn addition to the patch, ICONICS has also released an updated version of their “Whitepaper on Security Vulnerabilities” that includes details of this vulnerability.\nICS-CERT encourages asset owners to minimize network exposure for all control system devices. Critical devices should not directly face the Internet. Locate control system networks and remote devices behind firewalls and isolate them from the business network. When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS CERT for tracking and correlation against other incidents.\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.The Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-182-02",
  "title": "ICONICS Login ActiveX Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "bad85f1b7e51796c1efb0c50eeacf1d3ab32538f8f2c3f2d8f3c456c17b2d54b"
}