{
  "markdown": "\nOVERVIEW\nIndependent researcher Billy Rios has identified a heap-based buffer overflow in the Philips Xper application. Philips has produced an update that mitigates this vulnerability. Philips has tested the update and verified that it resolves the vulnerability.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Xper Information Management versions are affected:\nNote: the following products are only affected if the XperConnect Broker is used in line.\n\nXper Information Management Physiomonitoring 5 system components,\nXper Information Management Vascular Monitoring 5 system components, and\nXper Information Management (Flex Cardio product line) servers and workstations.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code with administrator-level privileges, affecting the availability, integrity, and confidentiality of the system.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS‑CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nPhilips is a global company that maintains offices in several countries around the world, including countries in Africa, Asia, Europe, Latin America, Middle East, and North America.\nThe affected product, Xper, is a Cardio Physiomonitoring system. According to Philips, Xper is deployed across the Healthcare and Public Health sector. Philips estimates that these products are used primarily in the United States and Europe with a small percentage in Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nHEAP-BASED BUFFER OVERFLOWCWE-122: Heap-based Buffer Overflow,  http://cwe.mitre.org/data/definitions/122.html, Web site last accessed October 04, 2013.\n\nThe Xper Connect broker listens to Port 6000/TCP by default. By sending an HTTP request outside the bounds of the buffer to Port 6000/TCP, an attacker can cause a heap-based buffer resulting in loss of confidentiality, integrity, and availability.\nCVE-2013-2808NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2013-2808, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 9.3 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:C/I:C/A:C, Web site last accessed October 04, 2013.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a medium skill would be able to exploit this vulnerability.\nMITIGATION\nPhilips has released an update, XperConnect 1.5.4.053 SP2, that mitigates this vulnerability. Philips has tested the update and verified that it resolves the vulnerability.\nThis update is available at the Philips Web site:\nhttp://www.healthcare.philips.com/us_en/incenter/\nICS‑CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.CSSP Recommended Practices, http://ics-cert.us-cert.gov/content/recommended-practices, Web site last accessed October 04, 2013. ICS‑CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Mitigation Strategies,Targeted Cyber Intrusion Detection and Mitigation Strategies, http://ics-cert.us-cert.gov/tips/ICS-TIP-12-146-01B, Web site last accessed October 04, 2013. that is available for download from the ICS-CERT Web page (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS‑CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2013-2808"
  ],
  "techniques": [],
  "advisory": "icsa-13-277-01",
  "title": "Philips Xper Buffer Overflow Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "3c11469ec044d6bccab18586c0fec90293fc9ed41a11a77d8323601514d896b9"
}