{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ENTTEC\nEquipment: Datagate MK2, Storm 24, Pixelator\nVulnerability: Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could reboot this device allowing a continual denial of service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nENTTEC reports that the vulnerability affects the following products and versions:\n\nDatagate MK2 all firmware prior to 70044_update_05032019-482,\nStorm 24 all firmware prior to 70050_update_05032019-482, and\nPixelator all firmware prior to 70060_update_05032019-482\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nAn unauthenticated user can initiate a remote reboot, which may be used to cause a denial of service condition.\nCVE-2019-6542 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Australia\n\n3.4 RESEARCHER\nAnkit Anubhav of NewSky Security reported this vulnerability to NCCIC.\n4. MITIGATIONS\nENTTEC recommends users upgrade to the March 2019 revB firmware or later which can be downloaded from the following links:\nDatagate MK2 70044_update_05032019-482:\nhttps://www.enttec.com/product/controls/dmx-ethernet-lighting-control/advanced-lighting-data-control/\nStorm 24 70050_update_05032019-482:\nhttps://www.enttec.com/product/controls/dmx-ethernet-lighting-control/ethernet-to-dmx-converter/\nPixelator 70060_update_05032019-482:\nhttps://www.enttec.com/product/controls/addressable-led-pixel-control/24-port-ethernet-pixel-controller/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-6542"
  ],
  "techniques": [],
  "advisory": "icsa-19-085-03",
  "title": "ENTTEC Lighting Controllers | CISA",
  "source": "ics-advisories",
  "id": "323c8610c479b70a1e0c6e095f659fbb20f02fe62767379db283f272eccbf0c5"
}