{
  "markdown": "\nOverview\nIndependent researcher Luigi Auriemma reported a stack overflow vulnerability in Version 2.07.00 of the Sielco Sistemi WinLog Lite and Winlog Pro HMI software.\nSielco Sistemi has developed an update (Version 2.07.01) to address this vulnerability. The researcher has verified that the update is effective in correcting this vulnerability.\nAffected Products\nThis vulnerability affects all versions of Sielco Sistemi’s WinLog Lite and WinLog Pro prior to Version 2.07. 00.\nImpact\nWinlog is used in building automation, monitoring systems, and food production in 16 countries around the world. Sielco Sistemi is based in Italy.\nWhile a successful exploit of this vulnerability could lead to arbitrary code execution, the impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.\nBackground\nWinlog is a SCADA/HMI software package for the supervision of industrial and civil plants. It can connect to PLCs, controllers, motor drives, and I/O modules.\nVulnerability Characterization\nVulnerability Overview\nThe Winlog system can act as a server by enabling the \"Run TCP/IP server\" option. The server listens on TCP port 46823. A specially crafted packet from a remote attacker can cause a stack overflow possibly allowing an attacker to execute arbitrary code.\nVulnerability Details\nExploitability\nThis vulnerability is exploitable from a remote machine.\nExistence of Exploit\nThis exploit code and vulnerability details are publicly available.\nDifficulty\nA high level of skill is needed to exploit this vulnerability.\nMitigation\nICS-CERT recommends that users of Sielco Sistemi’s Winlog system take the following mitigation steps:\n\nUpdate Winlog Lite and WinLog Pro to the latest Version (2.07.01).www.sielcosistemi.com/download/WinlogLite_Setup.exewww.sielcosistemi.com/download/Winlog_Setup_SF.exeFor additional information, customers can contact Sielco Sistemi’s support.\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet. Control system networks and remote devices should be located behind firewalls and be isolated from the business network. If remote access is required, secure methods such as Virtual Private Networks (VPNs) should be used.\n\nOrganizations should follow their established internal procedures if any suspected malicious activity is observed and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations that proper impact analysis and risk assessment should be performed prior to taking defensive measures.\nThe Control System Security Program also provides a recommended practices section for control systems on the US-CERT website. Several recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-017-02",
  "title": "Sielco Sistemi WinLog Stack Overflow | CISA",
  "source": "ics-advisories",
  "id": "e9afaad4d77a68dac088b1fc299bd2db87f28e42fba2545e8cb5bb38ffd2d91a"
}