{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: AVEVA Software, LLC\nEquipment: SuiteLink Server\nVulnerabilities: Heap-based Buffer Overflow, Null Pointer Dereference, Improper Handling of Exceptional Conditions\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause the SuiteLink Server to crash. It may be possible to achieve remote code execution, but no proof-of-concept currently exists.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAVEVA reports the following products ship a vulnerable version of the SuiteLink Server and are affected:\n\nAVEVA System Platform 2020 R2 P01 and all prior versions\nAVEVA InTouch 2020 R2 P01 and all prior versions\nAVEVA Historian 2020 R2 P01 and all prior versions\nAVEVA Communication Drivers Pack 2020 R2 and all prior versions\nAVEVA Operations Integration Core 3.0 and all prior versions\nAVEVA Data Acquisition Servers all versions\nAVEVA Batch Management 2020 and all prior versions\nAVEVA MES 2014 R2 and all prior versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nHeap-based buffer overflow in SuiteLink server while processing commands 0x05/0x06\nCVE-2021-32959 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    NULL POINTER DEREFERENCE CWE-476\nNull pointer dereference in SuiteLink server while processing commands 0x03/0x10\nCVE-2021-32963 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    NULL POINTER DEREFERENCE CWE-476\nNull pointer dereference in SuiteLink server while processing commands 0x04/0x0a\nCVE-2021-32979 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    NULL POINTER DEREFERENCE CWE-476\nNull pointer dereference in SuiteLink server while processing command 0x07\nCVE-2021-32971 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.5    NULL POINTER DEREFERENCE CWE-476\nNull pointer dereference in SuiteLink server while processing command 0x0b\nCVE-2021-32987 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.6    IMPROPER HANDLING OF EXCEPTIONAL CONDITIONS CWE-755\nImproper handling of exceptional conditions in SuiteLink server while processing command 0x01\nCVE-2021-32999 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nSharon Brizinov of Claroty reported these vulnerabilities to AVEVA.\n4. MITIGATIONS\nAVEVA recommends organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nUsers with affected versions of these products should apply the corresponding security update. Note a subset of the updates requires activation-based licensing.\nPlease see AVEVA security bulletin AVEVA-2021-003 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-32987",
    "CVE-2021-32959",
    "CVE-2021-32971",
    "CVE-2021-32999",
    "CVE-2021-32963",
    "CVE-2021-32979"
  ],
  "techniques": [],
  "advisory": "icsa-21-231-01",
  "title": "AVEVA SuiteLink Server | CISA",
  "source": "ics-advisories",
  "id": "b7d12b9a39a418af144e2d96b0cd2aa4973295719e0e95a2c3879a780ebaf281"
}