{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Snap One \nEquipment: Wattbox WB-300-IP -3  \nVulnerabilities: Improper Restriction of Excessive Authentication Attempts, Heap-based Buffer Overflow, Plaintext Storage of a Password, Insufficient Verification of Data Authenticity \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to remote code execution on the device, password brute force, and bricking of the device.  \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Snap One Wattbox WB-300-IP-3, a surge protector, are affected: \n\nWattbox WB-300-IP-3: versions WB10.9a17 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307 \nSnap One Wattbox WB-300-IP-3 versions WB10.9a17 and prior could bypass the brute force protection, allowing multiple attempts to force a login. \nCVE-2023-24020 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). \n3.2.2 HEAP-BASED BUFFER OVERFLOW CWE-122\nSnap One Wattbox WB-300-IP-3 versions WB10.9a17 and prior are vulnerable to a heap-based buffer overflow, which could allow an attacker to execute arbitrary code or crash the device remotely. \nCVE-2023-23582 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L). \n3.2.3 PLAINTEXT STORAGE OF A PASSWORD CWE-256 \nSnap One Wattbox WB-300-IP-3 versions WB10.9a17 and prior store passwords in a plaintext file when the device configuration is exported via Save/Restore–>Backup Settings, which could be read by any user accessing the file.  \nCVE-2023-22389 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N). \n3.2.4 INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345 \nSnap One Wattbox WB-300-IP-3 versions WB10.9a17 and prior use a proprietary local area network (LAN) protocol that does not verify updates to the device. An attacker could upload a malformed update file to the device and execute arbitrary code. \nCVE-2023-22315 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nUri Katz of Claroty Research reported these vulnerabilities to CISA. \n4. MITIGATIONS\nSnap One has released the following updates for the affected products: \n\nVersion WB10.B929 (login required) \n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.  \n\n\n",
  "cves": [
    "CVE-2023-22315",
    "CVE-2023-24020",
    "CVE-2023-22389",
    "CVE-2023-23582"
  ],
  "techniques": [],
  "advisory": "icsa-23-026-03",
  "title": "Snap One Wattbox WB-300-IP-3 | CISA",
  "source": "ics-advisories",
  "id": "615cfac6744b0bafd32aeca0755d6e0b7c0d40823d6719abe217ce60f2dfc4aa"
}