{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: JT2Go and Teamcenter Visualization\nVulnerabilities: Out-of-Bounds Write, Use of Uninitialized Variable, Out-of-Bounds Read, Off-by-One Error, Use-after-Free\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead the application to crash or potentially lead to arbitrary code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of JT2Go and Teamcenter Visualization software tools are affected:\n\nJT2Go: All versions prior to v13.2.0.5\nTeamcenter Visualization: All versions prior to v13.2.0.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nOne of the DLL files associated with this product contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PDF files, which could allow an attacker to execute remote code.\nCVE-2021-44001 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS WRITE CWE-787\nOne of the DLL files associated with this product contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted JT files, which could allow an attacker to execute remote code.\nCVE-2021-44002 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    USE OF UNINITIALIZED VARIABLE CWE-457\nOne of the DLL files associated with this product is vulnerable to use of uninitialized memory while parsing user supplied TIFF files, which could allow an attacker to cause a denial-of-service condition.\nCVE-2021-44003 has been assigned to this vulnerability. A CVSS v3 base score of 4.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N).\n3.2.4    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing TIFF files, which could be leveraged to leak information.\nCVE-2021-44004 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.5    OUT-OF-BOUNDS WRITE CWE-787\nOne of the DLL files associated with this product contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted TIFF files, which could allow an attacker to execute remote code.\nCVE-2021-44005 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.6    OUT-OF-BOUNDS WRITE CWE-787\nOne of the DLL files associated with this product contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted TIFF files, which could allow an attacker to execute remote code.\nCVE-2021-44006 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.7    OFF-BY-ONE ERROR CWE-193\nOne of the DLL files associated with this product contains an off-by-one error in the heap while parsing specially crafted TIFF files, which could allow an attacker to cause a denial-of-service condition.\nCVE-2021-44007 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L).\n3.2.8    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing TIFF files, which could be leveraged to leak information.\nCVE-2021-44008 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.9    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing TIFF files, which could be leveraged to leak information.\nCVE-2021-44009 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.10    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing TIFF files, which could be leveraged to leak information.\nCVE-2021-44010 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.11    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing specially crafted JT files, which could be leveraged to leak information.\nCVE-2021-44011 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.12    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing specially crafted JT files, which could be leveraged to leak information.\nCVE-2021-44012 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.13    OUT-OF-BOUNDS WRITE CWE-787\nOne of the DLL files associated with this product contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted JT files, which could allow an attacker to execute remote code.\nCVE-2021-44013 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.14    USE-AFTER-FREE CWE-416\nOne of the DLL files associated with this product contains a use-after-free vulnerability that could be triggered while parsing specially crafted JT files, which could allow an attacker to execute remote code.\nCVE-2021-44014 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.15    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing specially crafted CGM files, which could be leveraged to leak information.\nCVE-2021-44015 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.16    OUT-OF-BOUNDS READ CWE-125\nOne of the DLL files associated with this product contains an out-of-bounds read past the end of an allocated buffer when parsing specially crafted TIFF files, which could be leveraged to leak information.\nCVE-2021-44017 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMat Powell of Trend Micro’s Zero Day Initiative and Jin Huang from ADLab reported these vulnerabilities.\n4. MITIGATIONS\nSiemens recommends updating to the latest versions, specifically:\n\nJT2Go: Update to v13.2.0.5 or later version.\nTeamcenter Visualization: Update to v13.2.0.5 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nAvoid opening untrusted files from unknown sources in JT2Go and Teamcenter Visualization\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals. Additional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nPlease see Siemens security advisory SSA-595101 for more information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-44002",
    "CVE-2021-44009",
    "CVE-2021-44004",
    "CVE-2021-44015",
    "CVE-2021-44017",
    "CVE-2021-44001",
    "CVE-2021-44010",
    "CVE-2021-44011",
    "CVE-2021-44006",
    "CVE-2021-44008",
    "CVE-2021-44012",
    "CVE-2021-44014",
    "CVE-2021-44013",
    "CVE-2021-44007",
    "CVE-2021-44003",
    "CVE-2021-44005"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-10",
  "title": "Siemens JT2Go and Teamcenter Visualization | CISA",
  "source": "ics-advisories",
  "id": "2db53d0d403d38c526caa94eec781cb93393c01e65481c473e93fd0a1231beea"
}