{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Mitsubishi Electric Corporation\nEquipment: GOT and Tension Controller\nVulnerability: Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-343-02 Mitsubishi Electric GOT and Tension Controller (Update A) that was published May 11, 2021, to the ICS webpage on www.cisa.gov/uscert/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow malicious attackers to cause deterioration of communication performance or cause a denial-of-service condition of the TCP communication functions of the products requiring a re-boot of the device to recover.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nMitsubishi Electric reports that the vulnerability affects the following human-machine interface (GOT) and Tension Controller products: \n\nGOT2000 series, GT21 model:\n\nGT2107-WTBD versions v01.39.000 and earlier\nGT2107-WTSD versions v01.39.000 and earlier\nGT2104-RTBD versions v01.39.000 and earlier\nGT2104-PMBD versions v01.39.000 and earlier\nGT2103-PMBD versions v01.39.000 and earlier\n\n\nGOT SIMPLE series, GS21 model:\n\nGS2110-WTBD versions v01.39.000 and earlier\nGS2107-WTBD versions v01.39.000 and earlier\nGS2110-WTBD-N versions v01.39.000 and earlier\nGS2107-WTBD-N versions v01.39.000 and earlier\n\n\n\n--------- Begin Update B Part 1 of 2 ---------\n\nTension Controller: \n\nLE7-40GU-L Screen package data for CC-Link IEF Basic v1.00\nLE7-40GU-L Screen package data for MODBUS/TCP v1.00\nLE7-40GU-L Screen package data for SLMP v1.00\n\n\n\nRefer to the user manual to determine which version is in use. The latest version of the manual of GOT is available at the Mitsubishi Electric Global Website. Contact a Mitsubishi Electric representative for the latest version of the Tension Controller manual.\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS READ CWE-125\nThere is an out-of-bounds read vulnerability that may allow attackers to cause deterioration in communication performance or cause a denial-of-service condition of the TCP communication functions of the products by sending specially crafted packets.\nCVE-2020-5675 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update B Part 2 of 2 ---------\nMitsubishi Electric has fixed the basic system application for GOT2000 series GT21 model or GOT SIMPLE series GS21 model, which is shipped with GT Designer3 (2000) versions 1.255R or later.\nTo apply version v01.40.000 or later to GOT2000 series GT21 model or GOT SIMPLE series GS21 model, use the following update procedure:\n\nDownload the fixed version of MELSOFT GT Designer3(2000) and install into the PC. Please contact a Mitsubishi Electric representative about MELSOFT GT Designer3(2000).\nStart the MELSOFT GT Designer3 (GOT2000) and open the project data used in affected products.\nSelect Write to GOT from Communication menu to write the required package data to the GOT.\nPlease refer to the GT Designer3 (GOT2000) Screen Design Manual.\nAfter writing the required package data to the GOT, refer to the publication from Mitsubishi Electric to learn how to confirm if using the updated version.\n\nMitsubishi Electric has provided the following procedure to update the tension controller to Version 1.01 or later:\n\nContact a Mitsubishi Electric representative for the fixed version of the screen package data.\nInstall the engineering tool (“Data Transfer Tool” or “GT Designer 3 (GOT2000)”) in your PC. Contact a Mitsubishi Electric representative for the latest engineering tool.\nConnect LE7-40GU-L and your PC with a USB cable.\nWrite the screen package data to LE7-40GU-L using the “GOT write” function of the engineering tool.\nAfter writing is completed, restart LE7-40GU-L.\nRefer to the publication from Mitsubishi Electric to learn how to confirm if using the updated version.\n\n--------- End Update B Part 2 of 2 ---------\nUntil the update can be applied, Mitsubishi Electric asks that users restrict access to the product only from trusted networks and hosts.\nPlease refer to the Mitsubishi Electric website for details.\nAdditional information about the vulnerability or Mitsubishi Electric recommendations is available by contacting a Mitsubishi Electric representative.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-5675"
  ],
  "techniques": [
    "T2000",
    "T2103",
    "T2107",
    "T2104"
  ],
  "advisory": "icsa-20-343-02",
  "title": "Mitsubishi Electric GOT and Tension Controller (Update B) | CISA",
  "source": "ics-advisories",
  "id": "c292142cb68e1bbf702b2695226bdb887da3162861eeadc5b6959139af7eac6c"
}