{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Daikin Holdings Singapore Pte Ltd.\nEquipment: SVMPC1, SVMPC2\nVulnerabilities: Use of Hard-coded Password, Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could disclose sensitive information to the affected devices and can give an attacker full control of the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Daikin Holdings Singapore Pte Ltd. SVMPC1 and SVMPC2, both an office and remote controller, are affected:\n\nSVMPC1: Version 2.1.22 and prior \nSVMPC2: Version 1.2.3 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED PASSWORD CWE-259\nThis vulnerability allows a remote attacker to obtain user login credentials, login to SVMPC, and fully control the system.\nCVE-2022-41653 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER ACCESS CONTROL CWE-284\nThis vulnerability allows remote attackers with access to the local area network (LAN) to disclose sensitive information stored by the affected product without requiring authentication.\nCVE-2022-38355 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n3.4 RESEARCHER\nChizuru Toyama from TXOne Networks reported these vulnerabilities to CISA.\n4. MITIGATIONS\nDaikin Holdings Singapore Pte Ltd. has released an update that will automatically install if the SVM controller is enabled. No user operation is required. \nIf the SVM controller has a disabled internet access setting, Daikin recommends users enable the internet access setting in the SVM controller; the product will automatically download once connected to the internet. \nFor more information, see the Daikin Holdings Singapore Pte Ltd. security advisory: SVM Vulnerability Information\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-38355",
    "CVE-2022-41653"
  ],
  "techniques": [],
  "advisory": "icsa-22-284-02",
  "title": "Daikin Holdings Singapore | CISA",
  "source": "ics-advisories",
  "id": "ce035c3e44ba45b1ba5adb9afcd8d401929696490f0822425759ce71ee4cfc4b"
}