{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Siemens SIMATIC Industrial Products\nVulnerabilities: Operation on a Resource after Expiration or Release, Missing Release of Memory after Effective Lifetime\n\n2. UPDATE INFORMATION\nThis advisory update is a follow-up to the original advisory titled ICSA-22-041-01 Siemens Industrial Products (Update A) that was published February 10, 2022, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthenticated attacker to cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Siemens Industrial Products with SIMATIC Firmware, a software platform, are affected:\n\nSIMATIC Drive Controller family: All versions prior to v2.9.4\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions\n\n ------- Begin Update B Part 1 of 3 -------\n\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 Ready4Linux: All versions\nSIMATIC ET 200SP Open Controller CPU 1515SP PC (incl. SIPLUS variants): All versions\n\n------- End Update B Part 1 of 3 ------- \n\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): Version 4.5.0 and all following versions prior to v4.5.2\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): Version 2.9.2 and all following versions prior to v2.9.4\nSIMATIC S7-1500 Software Controller: All versions\nSIMATIC S7-PLCSIM Advanced:  All versions v4.0 SP1\nTIM 1531 IRC (incl. SIPLUS NET variants): Version 2.2 and all following versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OPERATION ON A RESOURCE AFTER EXPIRATION OR RELEASE CWE-672\nAn unauthenticated attacker could cause a denial-of-service condition in a PLC when sending specially prepared packets over Port 102/TCP. A restart of the affected device is needed to restore normal operations. \nCVE-2021-37185 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    OPERATION ON A RESOURCE AFTER EXPIRATION OR RELEASE CWE-672\nAn unauthenticated attacker could cause a denial-of-service condition in a PLC when sending specially prepared packets over Port 102/TCP. A restart of the affected device is needed to restore normal operations. \nCVE-2021-37204 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.3    MISSING RELEASE OF MEMORY AFTER EFFECTIVE LIFETIME CWE-401\nAn unauthenticated attacker could cause a denial-of-service condition in a PLC when sending specially prepared packets over Port 102/TCP. A restart of the affected device is needed to restore normal operations. \nCVE-2021-37205 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nGao Jian assisted the coordinated disclosure of these vulnerabilities with Siemens.\n5. MITIGATIONS\nSiemens is preparing updates and recommends specific countermeasures for products where updates are not, or not yet available:\n\nSIMATIC Drive Controller family: Update to v2.9.4 or later version\n\n------- Begin Update B Part 2 of 3 -------\n\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): Update to v21.9.4 or later version\n\n------- End Update B Part 2 of 3 -------\n\nSIMATIC S7-1200 CPU family: Update to v4.5.2 or later version\nSIMATIC S7-1500 CPU family: Update to v2.9.4 or later version\n\n------- Begin Update B Part 3 of 3 -------\n\nSIMATIC S7-1500 Software Controller: Update to v21.9.4 or later version\n\n------- End Update B Part 3 of 3 -------\n\nSIMATIC s7-PLCSIM Advanced: Update to v4.0 SP1 or later version\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and following the recommendations in the product manuals.  \nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens Security Advisory SSA-838121\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2021-37185",
    "CVE-2021-37205",
    "CVE-2021-37204"
  ],
  "techniques": [],
  "advisory": "icsa-22-041-01",
  "title": "Siemens SIMATIC Industrial Products (Update B) | CISA",
  "source": "ics-advisories",
  "id": "488c5754baf12785b3127f8fbe0e61118c8991ba8cf2d6a1c684a4146d342bed"
}