{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.4\nATTENTION: Exploitable remotely\nVendor: Siemens\n\n--------- Begin Update A Part 1 of 3 ---------\n\nEquipment: Climatix POL909 (AWM and AWB modules)\n\n--------- End Update A Part 1 of 3 ---------\n\nVulnerability: Missing Encryption of Sensitive Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow sensitive data disclosure or modification of data in transit.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Climatix POL909 (AWM module), an advanced web module, are affected:\n\nClimatix POL909 (AWM module): All versions prior to v11.34\n\n--------- Begin Update A Part 2 of 3 ---------\n\nClimatix POL909 (AWB module): All versions prior to v11.34\n\n--------- End Update A Part 2 of 3 ---------\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nThe web server of affected devices transmits data without TLS encryption. This could allow an unauthenticated remote attacker in a man-in-the-middle position to read sensitive data, such as administrator credentials, or modify data in transit.\nCVE-2021-40366 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nChizuru Toyama of TXOne IoT/ICS Security Research Labs and Siemens reported this vulnerability to CISA.\n4. MITIGATIONS\n--------- Begin Update A Part 3 of 3 ---------\nSiemens recommends users update the following software to the latest version:\n\nClimatix POL909 (AWB module): Update to v11.34 or later version.\nClimatix POL909 (AWM module): Update to v11.34 or later version.\n\nFor specific update information, please refer to Siemens Security Advisory SSA-252466\n--------- End Update A Part 3 of 3 ---------\nSiemens has not identified any additional specific workarounds or mitigations.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals. \nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor additional information, please refer to Siemens Security Advisory SSA-703715\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-40366"
  ],
  "techniques": [],
  "advisory": "icsa-21-315-09",
  "title": "Siemens Climatix POL909 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "5b0df3ba825583562b9358f61c3c28e78b763c94ce1b85a14c9b65bfcbb85917"
}