{
  "markdown": "\nCVSS v3 7.2\nVendor: Sielco Sistemi\nEquipment: Winlog SCADA Software\nVulnerability: Uncontrolled Search Path Element\nAFFECTED PRODUCTS\nThe following Sielco Sistemi products are affected:\n\nWinlog Lite SCADA Software, versions prior to Version 3.02.01, and\nWinlog Pro SCADA Software, versions prior to Version 3.02.01\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to load a malicious DLL and execute code on the affected system with the same privileges as the application that loaded the malicious DLL.\nMITIGATION\nSielco Sistemi has released new versions of the Winlog Lite and Winlog Pro SCADA software that mitigate the uncontrolled search path element vulnerability.\nThe most current versions of Winlog Lite and Winlog Pro SCADA software are available here:\nhttps://www.sielcosistemi.com/en/download/public/download.html\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n1.Do not click web links or open unsolicited attachments in email messages.\n2.Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\n3.Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENT (CWE-427)\n\nAn uncontrolled search path element (DLL Hijacking) vulnerability has been identified. Exploitation of this vulnerability could give an attacker access to the system with the same level of privilege as the application that utilizes the malicious DLL.\nCVE-2017-5161 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:H/UI:R/S:C/C:H/I:H/A:H).\nRESEARCHER\nResearcher Karn Ganeshen identified this vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Communications, Critical Manufacturing, Energy, Water and Wastewater\nCountries Deployed: Deployed worldwide\nCompany Headquarters Location: Italy\n",
  "cves": [
    "CVE-2017-5161"
  ],
  "techniques": [],
  "advisory": "icsa-17-038-01",
  "title": "Sielco Sistemi Winlog SCADA Software | CISA",
  "source": "ics-advisories",
  "id": "e80a9fb5b0cf4768d51807b3237c757a2fc918035ce5bcf646a3525c7f52e3e8"
}