{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: Modicon Controllers\nVulnerability: Improper Check for Unusual or Exceptional Conditions\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Modicon Controllers, a PLC and PAC controller for industrial control systems, are affected:\n\nModicon M340: Firmware versions prior to v3.01\nModicon M580: Firmware versions prior to v2.80\nModicon Quantum: All firmware versions\nModicon Premium: All firmware versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER CHECK FOR UNUSUAL OR EXCEPTIONAL CONDITIONS CWE-754\nAn attacker could create a denial-of-service condition by sending a specific crafted Modbus frame to the affected device.\nCVE-2019-6819 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nZhang Xiaoming, Zhang Jiawei, Sun Zhonghao and Luo bing of CNCERT/CC reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSchneider Electric has recommended the following to mitigate this vulnerability.\nModicon M340 – The vulnerability is fixed in v3.01 and is available for download below:\n\nBMXP3420302 and CL and H: https://www.schneider-electric.com/en/download/document/BMXP3420302_Firmwares/\nBMXP342020 and H: https://www.schneider-electric.com/en/download/document/BMXP342020_Firmwares/\nBMXP342000: https://www.schneider-electric.com/en/download/document/BMXP342000_Firmwares/\nBMXP341000 and H: https://www.schneider-electric.com/en/download/document/BMXP341000_Firmwares/\nBMXP3420102 and CL: https://www.schneider-electric.com/en/download/document/BMXP3420102_Firmwares/\nBMXP3420302 and H: https://www.schneider-electric.com/en/download/document/BMXP3420302_Firmwares/\n\nModicon M580 – The vulnerability is fixed in v2.80 and is available for download below:\n\nBMEP584040, BMEP584040S, BMEH584040 and C: https://www.schneider-electric.com/en/download/document/M580_BMEP584040_SV2.80/\nBMEP586040 and C: https://www.schneider-electric.com/en/download/document/M580_BMEP586040_SV2.80/\nBMEH586040 and C: https://www.schneiderelectric.com/en/download/document/M580_BMEH586040_SV2.80/\nBMEP581020 and H: https://www.schneiderelectric.com/en/download/document/M580_BMEP581020_SV2.80/\nBMEP582020 and H: https://www.schneiderelectric.com/en/download/document/M580_BMEP582020_SV2.80/\nBMEP582040 and H: https://www.schneiderelectric.com/en/download/document/M580_BMEP582040_SV2.80/\nBMEP583020: https://www.schneiderelectric.com/en/download/document/M580_BMEP583020_SV2.80/\nBMEP583040: https://www.schneiderelectric.com/en/download/document/M580_BMEP583040_SV2.80/\nBMEP584020: https://www.schneiderelectric.com/en/download/document/M580_BMEP584020_SV2.80/\nBMEP585040 and C: https://www.schneiderelectric.com/en/download/document/M580_BMEP585040_SV2.80/\nBMEP582040S: https://www.schneiderelectric.com/en/download/document/M580_BMEP582040S_SV2.80/\nBMEH582040 and C: https://www.schneiderelectric.com/en/download/document/M580_BMEP582040_SV2.80\n\nSchneider Electric’s Modicon Quantum controllers have reached the end of their life and are no longer commercially available. They have been replaced by the Modicon M580 ePAC controller, Schneider Electric’s most current product. Schneider Electric recommends users migrate to the Modicon M580 ePAC.\nTo mitigate risks associated with this Modbus vulnerability, users should immediately set up network segmentation and implement a firewall to block all unauthorized access to Port 502/TCP.\nSchneider Electric general security recommendations:\n\nLocate control and safety system networks and remote devices behind firewalls, and isolate them from the business network.\nPhysical controls should be in place so no unauthorized persons have access to the ICS and safety controllers, peripheral equipment, or the ICS and safety networks.\nAll controllers should reside in locked cabinets and never be left in the “Program” mode.\nAll programming software should be kept in locked cabinets and should never be connected to any network other than the network for the intended devices.\nAll methods of mobile data exchange with the isolated network (e.g., CDs, USB drives, etc.) should be scanned before use in the terminals or any node connected to these networks.\nLaptops that have connected to any other network besides the intended network should never be allowed to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nFor more information, please see Schneider Electric advisory: SEVD-2019-134-05\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-6819"
  ],
  "techniques": [],
  "advisory": "icsa-19-183-01",
  "title": "Schneider Electric Modicon Controllers | CISA",
  "source": "ics-advisories",
  "id": "beeb27b15aecece7df32569714b256034677e666872b340bdc34f0473957e368"
}