{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: MZ Automation GmbH\nEquipment: libIEC61850\nVulnerabilities: Buffer Overflow, Access of Resource Using Incompatible Type, NULL Pointer Dereference\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device being accessed, and buffer overflow conditions could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of libIEC61850, IEC 61850 implementation software, are affected:\n\nlibIEC61850 Versions 1.4 and prior\nlibIEC61850 Version 1.5 prior to commit a3b04b7bc4872a5a39e5de3fdc5fbde52c09e10e\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product does not sanitize input before memcpy is used, which could allow an attacker to crash the device or remotely execute arbitrary code.\nCVE-2022-2970 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow, which could allow an attacker to crash the device or remotely execute arbitrary code.\nCVE-2022-2972 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE 843\nThe affected product accesses a resource using an incompatible type, which could allow an attacker to crash the server with a malicious payload.\nCVE-2022-2971 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.4    NULL POINTER DEREFERENCE CWE-476\nThe affected product uses a NULL pointer in certain situations. which could allow an attacker to crash the server.\nCVE-2022-2973 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nVera Mens of Claroty Research reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMZ Automation recommends users update to the latest version: libIEC61850.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-2971",
    "CVE-2022-2970",
    "CVE-2022-2972",
    "CVE-2022-2973"
  ],
  "techniques": [],
  "advisory": "icsa-22-251-01",
  "title": "MZ Automation libIEC61850 | CISA",
  "source": "ics-advisories",
  "id": "bf2956646ceb5595e931fafb7c9fc90fef738a0c5e49ee0f325700d6ea2f569e"
}