{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Bently Nevada, a Baker Hughes subsidiary\nEquipment: 3500\nVulnerability: Use of Password Hash with Insufficient Computational Effort\n\n2. REPOSTED INFORMATION\nThis advisory was originally posted to the HSIN ICS library on August 19, 2021, and is being released to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker access to system credentials.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following software versions are affected:\n\nSystem 1 6.x, Part No. 3060/00, Versions 6.98 and prior, Released Dec 2020\nSystem 1, Part No. 3071/xx & 3072/xx, Versions 21.1 HF1 and prior, Released July 2021\n3500 Rack Configuration, Part No. 129133-01, Versions 6.4 and prior, Released May 2020\n3500/22M Firmware, Part No. 288055-01, Versions 5.05 and prior, Released May 2021\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORT CWE-916\nThe affected products utilize a weak encryption algorithm for storage and transmission of sensitive data, which may allow an attacker to more easily obtain credentials used for access.\nCVE-2021-32997 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nRon Brash and Nicolas Harsey from Verve Industrial reported this vulnerability to CISA.\n5. MITIGATIONS\nTo address this vulnerability, Bently Nevada recommends users obtain 3500 Rack Configuration Version 6.6 or higher from Bently Nevada, which now includes a feature to set enhanced password security. For users that have their 3500 System(s) connected to Bently Nevada's System 1 software, enhanced password security is supported for System 1 Version 21.2 and higher. Using enhanced password security on the 3500 system will break communications with any earlier version of System 1 below Version 21.2\nIf users are unable to install the latest version of 3500, Bently Nevada recommends implementing the following temporary mitigations:\n\nUse a unique password for each device.\nOnly install affected devices on a secured network.\nBently Nevada product users with a valid Maintenance & Support Agreement may submit questions to Bently Nevada.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2021-32997"
  ],
  "techniques": [],
  "advisory": "icsa-21-231-02",
  "title": "Baker Hughes Bently Nevada 3500 | CISA",
  "source": "ics-advisories",
  "id": "a7ff3388706aa2823d6abbedbdf98f28a45d9fed57b141907f01f177f3983d31"
}