{
  "markdown": "\nCVSS v3 7.8\nATTENTION: Low skill level to exploit.\nVendor: Beckhoff\nEquipment: TwinCAT\nVulnerability: Untrusted Pointer Dereference\nAFFECTED PRODUCTS\nBeckhoff reports that the vulnerability affects the following TwinCAT PLC products:\n\nTwinCAT 3.1 Build 4022.4 or prior,\nTwinCAT 2.11 R3 2259 or prior, and\nTwinCAT 3.1 C++ / Matlab (TC1210/TC1220/TC1300/TC1320).\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow local attackers to escalate privileges.\nMITIGATION\nBeckhoff recommends users update to the newest version and recompile Matlab modules after updating.\nPlease see Beckhoff Security Advisory 2018-001 at the following location for more information:\nhttps://download.beckhoff.com/download/Document/product-security/Advisories/advisory-2018-001.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRestrict machine access to only those who need it.\nDon’t share usernames or passwords.\nMonitor and respond to suspicious behavior.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\nVULNERABILITY OVERVIEW\n\nUNTRUSTED POINTER DEREFERENCE CWE-822\n\nSeveral kernel drivers lack proper validation of user-supplied pointer values. An attacker who is able to execute code on the target may be able to exploit this vulnerability to obtain SYSTEM privileges.\nCVE-2018-7502 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nSteven Seeley of Source Incite reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2018-7502"
  ],
  "techniques": [],
  "advisory": "icsa-18-081-02",
  "title": "Beckhoff TwinCAT | CISA",
  "source": "ics-advisories",
  "id": "31526ce40b1a61700f8f8402d2944975c949a44e631a45a4d101095e37d4a10c"
}