{
  "markdown": "\nCVSS v3 7.1\nATTENTION: Remotely Exploitable/low skill level to exploit.\nVendor: Belden\nEquipment: Hirschmann GECKO\n--------- Begin Update A Part 1 of 5 --------\nVulnerabilities: Path Traversal, Server-Side Request Forgery, Cross-Site Request Forgery, Information Exposure\n--------- End Update A Part 1 of 5 --------\n\nUPDATE INFORMATION\n\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-026-02 Belden Hirschmann GECKO that was published January 26, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following GECKO switch versions are affected:\n\nHirschmann GECKO Lite Managed switch, Version 2.0.00 and prior versions.\n\nIMPACT\n--------- Begin Update A Part 2 of 5 --------\nSuccessful exploitation of these vulnerabilities may allow a remote attacker to access a copy of the configuration file of an affected device without authenticating, exposing sensitive information.\n--------- End Update A Part 2 of 5 --------\nMITIGATION\n--------- Begin Update A Part 3 of 5 --------\nBelden has released a software version, Version 02.0.01, to address the identified vulnerabilities, which is available at the following location:\nhttps://www.e-catalog.beldensolutions.com/link/57078-24455-402707-402708/en/conf/0\n--------- End Update A Part 3 of 5 --------\nBelden recommends that users update to the newest software version. As an interim compensating control, Belden specifies that users can reboot affected devices after each configuration download, preventing the vulnerable state.\n--------- Begin Update A Part 4 of 5 --------\nFor additional information, please review Belden’s security bulletins, BSECV-2016-5 and BSECV-2017-7, which are available at the following locations:\nhttps://www.belden.com/resourcecenter/security/upload/Belden-Security-Bulletin-BSECV-2016-5.pdf\nhttp://www.belden.com/docs/upload/Belden_Security_Bulletin_BSECV_2017_7.pdf\n--------- End Update A Part 4 of 5 --------\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are remotely exploitable.\nVULNERABILITY OVERVIEW\n\nPATH TRAVERSAL CWE-22\n\nAfter an administrator downloads a configuration file, a copy of the configuration file, which includes hashes of user passwords, is saved to a location that is accessible without authentication.\nCVE-2017-5163 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- Begin Update A Part 5 of 5 --------\n\nSERVER-SIDE REQUEST FORGERY (SSRF) CWE-918\n\nWeb server receives a request, but does not sufficiently verify that the request is being sent to the expected destination.\nCVE-2017-6036 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N ).\n\nCROSS-SITE REQUEST FORGERY (CSRF) CWE-352\n\nWeb application does not sufficiently verify that requests were provided by user who submitted request.\nCVE-2017-6038 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:L).\n\nINFORMATION EXPOSURE CWE-200\n\nNon-sensitive information can be obtained anonymously.\nCVE-2017-6040 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n--------- End Update A Part 5 of 5 --------\nRESEARCHER\nDavy Douhine of RandoriSec identified these vulnerabilities.\n\nBACKGROUND\nCritical Infrastructure Sector(s): Multiple sectors\nCountries Deployed: Worldwide\nCompany Headquarters Location: St. Louis, Missouri\n\n",
  "cves": [
    "CVE-2017-6036",
    "CVE-2017-5163",
    "CVE-2017-6038",
    "CVE-2017-6040"
  ],
  "techniques": [],
  "advisory": "icsa-17-026-02a",
  "title": "Belden Hirschmann GECKO (Update A) | CISA",
  "source": "ics-advisories",
  "id": "270e8e2b7629d6bbb23d267ed2e217ade9b80e57ad14ded3cf47e391a9fe91c6"
}