{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely \nVendor: Mitsubishi Electric \nEquipment: GOT2000 Series \nVulnerability: Improper Input Validation \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition by sending a specially crafted command. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Mitsubishi Electric GOT2000 Series products are affected: \n\nGT27 Model: FTP server versions 01.39.000 and prior \nGT25 Model: FTP server versions 01.39.000 and prior \nGT23 Model: FTP server versions 01.39.000 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER INPUT VALIDATION CWE-20 \nThe affected GOT2000 Series devices with FTP server versions 01.39.000 and prior are vulnerable to improper input validation, which could allow an attacker to cause a denial-of-service condition by sending a specially crafted command. \nCVE-2022-40266 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan \n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA. \n4. MITIGATIONS\nMitsubishi Electric recommends users update to the latest software versions: \n\nGT27 Model: Update to FTP server versions 01.47.000 or later \nGT25 Model: Update to FTP server versions 01.47.000 or later  \nGT23 Model: Update to FTP server versions 01.47.000 or later \n\nThe following steps were provided by Mitsubishi Electric to assist users in applying the update: \n1. Download the fixed version of GT Designer3 Version1 (GOT2000) and install on a compatible device. \n\nUsers should contact Mitsubishi Electric for GT Designer3 Version1 (GOT2000). \n\n2. Start the GT Designer3 Version1 (GOT2000) and open the project data used in affected products. \n3. Select [Write to GOT] from [Communication] menu to write the required package data to the GOT.\n\nUsers can refer to the GT Designer3 Version1 (GOT2000) Screen Design Manual (SH-081220ENG). “COMMUNICATING WITH GOT” \n\n4. After writing the required package data to the GOT, refer to the <How to check the versions in use> and ensure the software has been updated to the fixed versions. \nMitsubishi Electric also recommends users to take steps to mitigate risk of vulnerability exploitation:  \n\nWhen internet access is required, use a virtual private network (VPN) or other secure means to prevent unauthorized access. \nOnly use products inside a local area network (LAN).  \nBlock access from untrusted networks and hosts. \nInstall antivirus software on the host where products are installed.  \nSet strong passwords to prevent unauthorized login. \nUse the IP filter function*1 to control IP address access to the host machine with installed software \n\n*1: GT Designer3 (GOT2000) Screen Design Manual (SH-081220ENG). “5.4.3 Setting the IP filter” \n\n\n\nUsers should refer to Mitsubishi Electric’s security advisory for further information. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity. \n",
  "cves": [
    "CVE-2022-40266"
  ],
  "techniques": [],
  "advisory": "icsa-22-333-01",
  "title": "Mitsubishi Electric GOT2000 | CISA",
  "source": "ics-advisories",
  "id": "ecad6af1a26d370ec5d03026ffb8df851afe1617645b90ce5ae704a38567055c"
}