{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Low skill level to exploit\nVendor: Hitachi ABB Power Grids\nEquipment: eSOMS\nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain access to unauthorized information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi ABB Power Grids reports this vulnerability affects the following eSOMS products: \n\neSOMS Version 6.0 prior to 6.0.4.2.2\neSOMS Version 6.1 prior to 6.1.4\neSOMS versions prior to 6.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nA vulnerability exists in the eSOMS reporting function that could allow an unauthorized user to gain access to report data if the URL used to access the report is discovered. \nCVE-2021-26845 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi ABB Power Grids reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi ABB Power Grids has published an advisory for eSOMS and recommends users to update affected products as soon as possible. The following mitigations were developed to address the vulnerability: \n\neSOMS version 6.0.4.2.2\neSOMS version 6.1.4\neSOMS version 6.3\n\nFor additional information and support, contact a product provider or Hitachi ABB Power Grids service organization. For contact information, see Hitachi ABB Power Grids contact-centers.\nRecommended security practices and firewall configurations can help protect an organization network from attacks that originate from outside the network. Such practices include ensuring critical systems are physically protected from direct access by unauthorized personnel, have no direct connections to the Internet, and are separated from other networks by means of a firewall that has a minimal number of ports exposed, and others that must be evaluated case by case. Critical systems should not be used for Internet surfing, instant messaging, or receiving e-mails. Portable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2021-26845"
  ],
  "techniques": [],
  "advisory": "icsa-21-077-02",
  "title": "Hitachi ABB Power Grids eSOMS | CISA",
  "source": "ics-advisories",
  "id": "fcea8f7e39240c04887f826c6892efd9ca42e51199c3a32f088b017cc31ebefa"
}