{
  "markdown": "\nCVSS V3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit\nVendor: PHOENIX CONTACT\nEquipment: mGuard\nVulnerability: Software update changes password to default\nAFFECTED PRODUCTS\nPHOENIX CONTACT reports that the vulnerability affects the following mGuard products:\n\nOnly devices that have been updated to Version 8.4.0 are affected.\n\nIMPACT\nThis vulnerability could allow an attacker to log into the system with administrative privileges.\nMITIGATION\nPHOENIX CONTACT recommends users update to Version 8.4.1 (or higher, if applicable). If an update to Version 8.4.0 already has been performed, please change the “admin” password via WebUI or command line. If SSH or HTTPS access was possible from untrusted sources after an update to Version 8.4.0, please flash the device and exchange all private keys and passphrases in the configuration.\nTo view the advisory published by PHOENIX CONTACT, navigate to the product page on www.phoenixcontact.com and then find the document in the “various” section of the product download page.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nRESOURCE INJECTION CWE-99\n\nWhen updating an mGuard device to Version 8.4.0 via the update-upload facility, the update will succeed, but it will reset the password of the admin user to its default value.\nCVE-2017-5159 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nThis vulnerability was discovered by PHOENIX CONTACT.\n\nBACKGROUND\n\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-5159"
  ],
  "techniques": [],
  "advisory": "icsa-17-017-01",
  "title": "PHOENIX CONTACT mGuard | CISA",
  "source": "ics-advisories",
  "id": "aae21f247e0871804c095a3fd90ebb34271a2dc0b0bfc8892e6e265d64365bab"
}