{
  "markdown": " 7\\-Technologies Interactive Graphical SCADA \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS Advisory7\\-Technologies Interactive Graphical SCADA=========================================== Last Revised April 18, 2013 Alert Code ICSA\\-11\\-353\\-01Overview-------- ICS\\-CERT originally released Advisory ICSA\\-11\\-353\\-01P on the US\\-CERT secure portal on December 19, 2011\\. This web page release was delayed to allow users time to download and install the update. Researcher Kuang\\-Chun Hung of Security Research and Service Institute\\-\\-Information and Communication Security Technology Center (ICST) has identified an unsafe search path vulnerability in the 7\\-Technologies (7T) IGSS Interactive Graphical SCADA System. 7T produced a patch that fixes this vulnerability. ICST tested this patch and verified that it fully resolves this vulnerability.Affected Products----------------- The following 7T Interactive Graphical SCADA System versions are affected:* All versions prior to V9\\.0\\.0\\.11291\\.Impact------ Successful exploitation of this vulnerability may allow an attacker using social engineering to execute arbitrary code and gain the same privileges as the user that is currently logged into the system. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.Background---------- 7T, based in Denmark, creates monitoring and control systems that are primarily used in the United States, Europe, and South Asia. According to the [7T website](http://www.7t.dk/)  , IGSS has been deployed in over 28,000 industrial plants in 50 countries worldwide. 7T Interactive Graphical SCADA system software is used to control and monitor programmable logic controllers in industrial processes across multiple sectors including energy, manufacturing, oil and gas, and water.Vulnerability Characterization------------------------------### Vulnerability Overview To successfully exploit this vulnerability, an attacker would need to place a malicious DLL in the search path of an executable program.[CVE\\-2011\\-4053](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4053)  has been assigned to this vulnerability.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable but may require social engineering.#### Existence of Exploit No known public exploits specifically target this vulnerability.#### Difficulty An attacker with a low skill level can execute this DLL hijack attack.Mitigation---------- 7T developed a patch to address this vulnerability and provided the following options for updating their systems:1. In the IGSSMaster application select the menu “Information and support” and click “Update IGSS Software.” This will automatically download and install the updated module. This is the preferred method for updating the IGSS installation when the host computer has Internet access.2. Go to the www.igss.com website, select the menu item \"Download \\=\\> Licensed Versions\" and click the link \"Program updates (General)\" for Version 9\\. This will download a .zip file containing all current updates for IGSS Version 9\\. Once the progupdatesv90\\.zip file is downloaded, manually unpack the .zip file and copy the contents to the \\\\IGSS\\\\ directory within the IGSS installation folder at the end\\-user’s computer. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.1. Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.2. Locate control system networks and remote devices behind firewalls, and isolate them from the business network.3. When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks:1. Do not click web links or open unsolicited attachments in e\\-mail messages2. Refer to [*Recognizing and Avoiding Email Scams*](/reading_room/emailscams_0905.pdf) for more information on avoiding e\\-mail scams.3. Refer to [*Avoiding Social Engineering and Phishing Attacks*](/cas/tips/ST04-014.html) or more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* 7\\-Technologies-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-353-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-4053"
  ],
  "techniques": [],
  "advisory": "icsa-11-353-01",
  "title": "7-Technologies Interactive Graphical SCADA | CISA",
  "source": "ics-advisories",
  "id": "068f642d874d555bc1d4097ab9c214633279056e64029c44f048bb0ef5c2152e"
}