{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SIMATIC S7-1200 Devices\nVulnerability: Improper Authentication\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-222-09 Siemens SIMATIC S7-1200 that was published August 10, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\n--------- Begin Update A Part 1 of 2 --------- \nSuccessful exploitation of this vulnerability could allow an attacker using TIA Portal v13 or later versions to bypass authentication and download arbitrary programs to the PLC.\n--------- End Update A Part 1 of 2 --------- \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC are affected:\n\nS7-1200 CPU family (incl. SIPLUS variants): Version 4.5.0\n\n4.2 VULNERABILITY OVERVIEW\n--------- Begin Update A Part 2 of 2 --------- \n4.2.1    IMPROPER AUTHENTICATION CWE-287\nAffected devices fail to authenticate against configured passwords when provisioned using TIA Portal v13. This could allow an attacker using TIA Portal v13 or later versions to bypass authentication and download arbitrary programs to the PLC. The vulnerability does not occur when TIA Portal v13 SP1 or a later version was used to provision the device.\nCVE-2021-37172 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n--------- End Update A Part 2 of 2 ---------  \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nJian Gao reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has released updates for the following products:\n\nS7-1200 CPU family (incl. SIPLUS variants): Update to v4.5.1 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nUpdate to TIA Portal v13 SP1 or any later version before provisioning S7-1200 v4.5.0 devices.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-830194\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-37172"
  ],
  "techniques": [],
  "advisory": "icsa-21-222-09",
  "title": "Siemens SIMATIC S7-1200 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "502e99a74ad7efc85de92de7acbce06dadadea659204c40f4d13608ccdbfbb1a"
}