{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.1\n\nATTENTION: Low skill level to exploit\nVendor: McAfee\nEquipment: SINAMICS PERFECT HARMONY GH180\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nThese files can be executed to compromise the HMI, and by extension, the drive system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens has analyzed the vulnerability and has determined this vulnerability applies to the following HMIs:\n\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR32 with option A30 (HMIs 12 inch or larger)\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR42 with option A30 (HMIs 12 inch or larger)\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR52 with option A30 (HMIs 12 inch or larger\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR325 (High Availability)\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR32 with option A30 (HMIs 12 inch or larger) where the HMI is operating under Microsoft Windows XP\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR42 with option A30 (HMIs 12 inch or larger) where the HMI is operating under Microsoft Windows XP\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR52 with option A30 (HMIs 12 inch or larger) where the HMI is operating under Microsoft Windows XP\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR325 (High Availability) where the HMI is operating under Microsoft Windows XP.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nHMIs with this vulnerability can be compromised via local attack using removable USB storage devices to transfer malicious files. The executable files from a hard drive solidified by MACC (McAfee Application and Change Control) can be executed on the system that did not generate the inventory. \nCVE-2018-6690 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Healthcare and Public Health, Transportation, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMcAfee reported this vulnerability to Siemens.\n4. MITIGATIONS\nMcAfee has issued Security Bulletin SB10250 to address this vulnerability in MACC. SINAMICS PERFECT HARMONY GH180 Drives with HMIs produced between November 4, 2015 and October 9, 2018, use MACC as part of their software package, if option A30 was part of the order.\nFor compatibility reasons, Siemens advises the installation of MACC 8.2.0 instead of Version 8.0.0, hotfix 5 as mentioned in SB10250.\nFor the following products, Siemens recommends users upgrade to MACC v8.2.0 or greater using recommendations from McAfee to fix the vulnerability. \n\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR32 with option A30 (HMIs 12 inch or larger)\nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR42 with option A30 (HMIs 12 inch or larger) \nSINAMICS PERFECT HARMONY GH180 Drives: Serial numbers beginning MLFB 6SR52 with option A30 (HMIs 12 inch or larger)\n\nThe update can be located here:\nhttps://kc.mcafee.com/corporate/index?page=content&id=SB10250\nFor the remaining products, and until updates can be applied, Siemens recommends the following workarounds to reduce risk:\nFor the remaining products, and until updates can be applied, Siemens recommends the following workarounds to reduce risk:\n\nProtect local access to the drive.\nEnsure USB based storage media is blank and malware free before connecting to the drive.\nApply cell protection concept and implement defense-in-depth.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security (Download: https://www.siemens.com/cert/operational-guidelines-industrial-security), and following the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: \nhttps://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-674165 on their website: \nhttps://www.siemens.com/cert/advisories\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-6690"
  ],
  "techniques": [],
  "advisory": "icsa-18-345-01",
  "title": "McAfee SINAMICS PERFECT HARMONY GH180 | CISA",
  "source": "ics-advisories",
  "id": "af4b49791c99c06c986812b9073ec440d240f5d4b317241f451ad2e91b75076b"
}