{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls\nEquipment: Software House C•CURE 9000 and American Dynamics victor Video Management System\nVulnerability: Cleartext Storage of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to access credentials used for access to the application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products are affected:\n\nSoftware House C•CURE 9000: Version 2.70\nAmerican Dynamics victor Video Management System: Version 5.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nDuring installation or upgrade to C•CURE 9000 v2.70 and victor Video Management System v5.2, the credentials of the user performing the installation or upgrade are saved in a file. The install log file persists after the installation.\nCVE-2020-9045 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Financial Services, Government Facilitates, Healthcare and Public Health, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls recommends the following:\n\nFor Software House C•CURE 9000: Users should upgrade to Version 2.80 or later.\nFor American Dynamics victor Video Management System: Users should upgrade to Version 5.3 \nDelete the log files from c:\\programdata\\tyco\\installertemp and change the password for the windows account.\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2020-4 v1\n\nFor questions concerning this product, contact Johnson Controls Global Product Security; email: productsecurity@jci.com\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-9045"
  ],
  "techniques": [],
  "advisory": "icsa-20-142-01",
  "title": "Johnson Controls Software House C-CURE 9000 and American Dynamics victor VMS | CISA",
  "source": "ics-advisories",
  "id": "609926648457b506dd2ec9a21d17bb74bbf912f1f205906229430b6a6dd69fb4"
}