{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: EN100 Ethernet Communication Module and SIPROTEC 5 relays\nVulnerabilities: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-347-02 Siemens EN100 Ethernet Communication Module and SIPROTEC 5 Relays that was published December 13, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause a denial-of-service condition of the network functionality of the device, compromising the availability of the system.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the vulnerabilities affect the following versions of the EN100 Ethernet Communication Module and SIPROTEC 5 relays:\n\nFirmware variant IEC 61850 for EN100 Ethernet module: All versions prior to v4.33\nFirmware variant PROFINET IO for EN100 Ethernet module: All versions\nFirmware variant Modbus TCP for EN100 Ethernet module: All versions\nFirmware variant DNP3 TCP for EN100 Ethernet module: All versions\n\n--------- Begin Update A Part 1 of 2 --------\n\n\nFirmware variant IEC104 for EN100 Ethernet module: All versions prior to v1.22\n\n\n--------- End Update A Part 1 of 2 --------\n\nFirmware variant IEC104 for EN100 Ethernet module: All versions\nSIPROTEC 5 relays with CPU variants CP300 and CP100 and the respective Ethernet communication modules: All versions prior to v7.80\nSIPROTEC 5 relays with CPU variants CP200 and the respective Ethernet communication modules: All versions prior to v7.58\n\nSome products are only affected by one of the two vulnerabilities. Please see Siemens advisory SSA-635129 for additional details.\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets to Port 102/TCP could cause a denial-of-service condition in the affected products. A manual restart is required to recover the EN100 module functionality of SIPROTEC 4 and SIPROTEC Compact relays.Successful exploitation requires an attacker with network access to send multiple packets to the affected products or modules. As a precondition, the IEC 61850-MMS communication needs to be activated on the affected products or modules. No user interaction or privileges are required to exploit the vulnerability.\nCVE-2018-11451 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets to Port 102/TCP could cause a denial-of-service condition in the EN100 communication module if oscillographs are running. A manual restart is required to recover the EN100 module functionality.Successful exploitation requires an attacker with network access to send multiple packets to the EN100 module. As a precondition, the IEC 61850-MMS communication needs to be activated on the affected EN100 modules. No user interaction or privileges are required to exploit the security vulnerability.\nCVE-2018-11452 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nVictor Nikitin, Vladislav Suchkov, and Ilya Karpov from ScadaX reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens has released updates for several affected products. Siemens is working on updates for the remaining affected products, and recommends specific countermeasures until fixes are available.\n\nFirmware variant IEC 61850 for EN100 Ethernet module: Update to v4.33https://support.industry.siemens.com/cs/us/en/view/109745821.\n\n--------- Begin Update A Part 2 of 2 --------\n\n\nFirmware variant IEC104 for EN100 Ethernet module: Update to v1.22 https://support.industry.siemens.com/cs/us/en/view/109745821\n\n\n--------- Begin Update A Part 2 of 2 --------\n\nSIPROTEC 5 relays with CPU variants CP300 and CP100 and the respective Ethernet communication modules: Update to firmware Version 7.80 for the device types listed in SSA-635129.\nSIPROTEC 5 relays with CPU variants CP200 and the respective Ethernet communication modules: Update to firmware Version 7.58 for the device types listed in SSA-635129.\n\nThe firmware version for the communications modules can also be found on each device’s download page. Applying the update causes the device / module / program to undergo a single restart cycle.\nSiemens strongly recommends applying the provided security updates using the corresponding tooling and documented procedures made available with the product. If supported by the product, an automated means to apply the security updates across multiple product instances may be used. Siemens strongly recommends prior validation of any security update before being applied, and supervision by trained staff of the update process in the target environment.\nUntil updates can be applied, Siemens recommends blocking access to Port 102/TCP with an external firewall.\nAs a general security measure Siemens strongly recommends protecting network access with appropriate mechanisms (e.g. firewalls, segmentation, VPN). It is advised that users configure the environment according to Siemens operational guidelines in order to run the devices in a protected IT environment.\nSiemens recommended security guidelines to secure substations can be found at:\nhttps://www.siemens.com/gridsecurity\nAdditional information on industrial security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-635129 on their website:\nhttps://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-11452",
    "CVE-2018-11451"
  ],
  "techniques": [],
  "advisory": "icsa-18-347-02",
  "title": "Siemens EN100 Ethernet Communication Module and SIPROTEC 5 Relays (Update A) | CISA",
  "source": "ics-advisories",
  "id": "72e84df55e9204d8f5f24435a8ce6a0cd23045e83125f590ea0ccdc22a8975f9"
}