{
  "markdown": "\nCVSS v3 8.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: Ruggedcom ROS, SCALANCE\nVulnerability: Improper Access Control\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-17-271-01A Siemens Ruggedcom ROS, SCALANCE that was published October 10, 2017, on the NCCIC/ICS-CERT website.\nAFFECTED PRODUCTS\n--------- Begin Update B Part 1 of 2 --------\nSiemens reports that the vulnerability affects the following devices using the Ruggedcom Discovery Protocol (RCDP):\n\nRUGGEDCOM ROS for RSL910 devices: All versions prior to ROS v5.0.1\nRUGGEDCOM ROS for all other devices: All versions prior to ROS v4.3.4\nSCALANCE XB-200/XC-200/XP-200/XR300-WG: All versions between v3.0 and v3.0.2\nSCALANCE XR-500/XM-400: All versions between v6.1 and 6.1.1\n\n--------- End Update B Part 1 of 2 ----------\nIMPACT\nSuccessful exploitation of this vulnerability could allow users of networks adjacent to the targeted device to perform unauthorized administrative actions.\nMITIGATION\n--------- Begin Update B Part 2 of 2 --------\nSiemens provides new versions to mitigate this vulnerability and recommends users update to the newest version.\n\nRUGGEDCOM ROS for RSL910 devices: Install V5.0.1\nRUGGEDCOM ROS for all other devices: Install V4.3.4\n\nThe firmware updates for the Ruggedcom ROS-based devices can be obtained by contacting the Ruggedcom support team at:\nhttps://support.industry.siemens.com/my/us/en/requests\n\nSCALANCE XB-200/XC-200/XP-200/XR300-WG: Install V3.0.2\n\nhttps://support.industry.siemens.com/cs/de/en/view/109754174\n\nSCALANCE XR-500/XM-400: Install V6.1\n\nhttps://support.industry.siemens.com/cs/ww/de/view/109755475\n--------- End Update B Part 2 of 2 ----------\nSiemens is preparing updates for the remaining affected products and recommends that users manually deactivate RCDP according to the instructions in the user guide. The user guide can be found on the Siemens web site at the following location:\nhttps://support.industry.siemens.com/cs/ww/en/view/109748693\nAs a general security measure, Siemens advises configuring the IT environment according to Siemens operational guidelines in order to run the devices in a protected manner.\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-856721 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER ACCESS CONTROL CWE-284\n\nAfter initial configuration, the RCDP is still able to write to the device under certain conditions, potentially allowing users located in the adjacent network of the targeted device to perform unauthorized administrative actions.\nCVE-2017-12736 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nSiemens reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Energy, Healthcare and Public Health, and Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-12736"
  ],
  "techniques": [],
  "advisory": "icsa-17-271-01b",
  "title": "Siemens Ruggedcom ROS, SCALANCE (Update B) | CISA",
  "source": "ics-advisories",
  "id": "eaac69558b845c69a9990804ca1a494648685d2f2181d6161d31dceed7f542e3"
}