{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Schneider Electric\nEquipment: Enerlin'X Com’X 510\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow elevation of privileges, which could result in unintended disclosure of device configuration information to any authenticated user.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Enerlin'X Com’X 510 energy servers are affected:\n\nEnerlin'X Com’X 510: All versions prior to v6.8.4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThis vulnerability may allow disclosure of device configuration information to any authenticated user when a specially crafted request is sent to the device.\nCVE-2021-22769 has been assigned to this vulnerability. A CVSS v3 base score of 8.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nMaxim Rupp reported this vulnerability to CISA.\n4. MITIGATIONS\nSchneider Electric recommends the following:\n\nIf the Guest account password on the device remains set to the default value, users should immediately change the account password to one that is unique and has a strong value.\nUsers who have configured their Com’X 510 device to access remote SMTP, FTP, or HTTPS services should immediately change access passwords on the affected services and update the Com’X configuration.\n\nTo further reduce the risk, apply v6.8.4 or later of the Enerlin’X Com’X 510 firmware.\nFor additional information on this vulnerability, see Schneider Electric’s security notification SEVD-2021-159-06\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-22769"
  ],
  "techniques": [],
  "advisory": "icsa-21-168-01",
  "title": "Schneider Electric Enerlin'X Com’X 510 | CISA",
  "source": "ics-advisories",
  "id": "355cd9a1446c7b9dafdd99f9657ca776dd54c240afecb9188d6fedb8cff8c459"
}