{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC CP 1543-1 (incl. SIPLUS variants) and SIMATIC CP 1545-1\nVulnerability: Cleartext Storage of Sensitive Information\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-132-10 Siemens SIMATIC CP that was published September 14, 2021, to the ICS webpage at cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to read sensitive information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC, a communication processor, are affected:\n\nSIMATIC CP 1543-1 (incl. SIPLUS variants): All versions prior to v3.0\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMATIC CP 1545-1: All versions prior to v1.1\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nAn attacker with access to the subnet of the affected device could retrieve sensitive information stored in cleartext.\nCVE-2021-33716 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nSiemens recommends applying updates where applicable:\n\nSIMATIC CP 1545-1: Update to v1.1 or later\n\n--------- End Update A Part 2 of 2 ---------\nFor SIMATIC CP 1543-1 (incl. SIPLUS variants), Siemens recommends affected users update to v3.0 or later and migrate the TIA Portal engineering project to v17. After migrating the project successfully, compilation and download to the device is required. See this product’s Siemens Product Support entry for more information.\nFor SIMATIC CP 1545-1, Siemens has not identified any additional specific workarounds or mitigations.\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information about this issue, please see Siemens Security Advisory SSA-535997\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-33716"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-06",
  "title": "Siemens SIMATIC CP (Update A) | CISA",
  "source": "ics-advisories",
  "id": "4a2b8545f5e9f783f28a500997a7943aa64e811b05b14fffd5bb4dbb5a1ced87"
}