{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Siemens \nEquipment: SCALANCE SC-600 Family \nVulnerability: Out-of-bounds Write, Use After Free, Allocation of Resources Without Limits or Throttling \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a denial-of-service condition, corrupt memory, or potentially execute custom code. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SCALANCE SC-600 Family, a software management platform, are affected: \n\nSCALANCE SC622-2C (6GK5622-2GS00-2AC2): Versions prior to 3.0 \nSCALANCE SC626-2C (6GK5626-2GS00-2AC2): Versions prior to 3.0 \nSCALANCE SC632-2C (6GK5632-2GS00-2AC2): Versions prior to 3.0 \nSCALANCE SC636-2C (6GK5636-2GS00-2AC2): Versions prior to 3.0 \nSCALANCE SC642-2C (6GK5642-2GS00-2AC2): Versions prior to 3.0 \nSCALANCE SC646-2C (6GK5646-2GS00-2AC2): Versions prior to 3.0 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 OUT-OF-BOUNDS WRITE CWE-787 \nSiemens SCALANCE SC-600 Family versions prior to 3.0; the zlib before 1.2.12 allows memory corruption when deflating (i.e., when compressing) if the input has a plethora of distant matches. \nCVE-2022-25032 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.2 USE AFTER FREE CWE-416\nSiemens SCALANCE SC-600 Family versions prior to 3.0 is vulnerable to a use-after-free in Busybox 1.35-x's awk applet. The vulnerability could cause a denial of service and possible code execution when processing a crafted awk pattern in the copyvar function. \nCVE-2022-30065 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.3 ALLOCATION OF RESOURCES WITHOUT LIMITS OR THROTTLING CWE-770\nSiemens SCALANCE SC-600 Family versions prior to 3.0: \n\nA malicious server can serve excessive amounts of \"Set-Cookie:\" headers in an HTTP response to curl and curl stores all of them. \nA sufficiently large amount of (big) cookies submit subsequent HTTP requests to this or other servers to which the cookies match, create requests that become larger than the threshold that curl uses internally to avoid sending large requests and instead returns an error. \nThis may cause a denial-of-service state and might remain for as long as the same cookies are kept, match and haven't expired. \n\nCVE-2022-32205 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.4 ALLOCATION OF RESOURCES WITHOUT LIMITS OR THROTTLING CWE-770\nSiemens SCALANCE SC-600 Family versions prior to 3.0 supports \"chained\" HTTP compression algorithms—meaning that a server response can be compressed multiple times and potentially with different algorithms, allowing a malicious server to insert a virtually unlimited number of compression steps and spending enormous amounts of allocated heap memory that cause out of memory errors. \nCVE-2022-32206 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA. \n4. MITIGATIONS\nSiemens has prepared a fix and recommends updating to the following: \n\nSCALANCE SC622-2C (6GK5622-2GS00-2AC2): Version 3.0 or later\nSCALANCE SC626-2C (6GK5626-2GS00-2AC2): Version 3.0 or later\nSCALANCE SC632-2C (6GK5632-2GS00-2AC2): Version 3.0 or later \nSCALANCE SC636-2C (6GK5636-2GS00-2AC2): Version 3.0 or later \nSCALANCE SC642-2C (6GK5642-2GS00-2AC2): Version 3.0 or later \nSCALANCE SC646-2C (6GK5646-2GS00-2AC2): Version 3.0 or later \n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends  configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals. \nFor more information, see Siemens Security Advisory SSA-333517 in HTML or CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2022-25032",
    "CVE-2022-30065",
    "CVE-2022-32206",
    "CVE-2022-32205"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-18",
  "title": "Siemens SCALANCE SC-600 Family | CISA",
  "source": "ics-advisories",
  "id": "9fa3e8ba3a346fecbdd08fd66be36f4668c477dc3de987af9387f21df3b61265"
}