{
  "markdown": "\nCVSS v3 8.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: TeleControl Server Basic\nVulnerabilities: Authentication Bypass Using an Alternate Path or Channel, Permissions, Privileges, and Access Controls, Resource Exhaustion\nAFFECTED PRODUCTS\nThe following versions of TeleControl Server Basic, a monitoring platform, are affected:\n\nTeleControl Server Basic versions prior to V3.1\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow for escalation of privileges to perform administrative actions.\nMITIGATION\nSiemens recommends that users install the latest version of TeleControl Server Basic which can be found at:\nhttps://support.industry.siemens.com/cs/ww/en/view/109755199\nSiemens has also identified other mitigations that affected users can take:\n\nIf TeleControl Server Basic is operated in standalone mode, then users can close Port 8000/TCP on the Windows firewall to mitigate vulnerabilities CVE-2018-4835 and CVE-2018-4836.\nIf TeleControl Server Basic is operated in redundancy mode, then users can use the Windows firewall to restrict access to Port 8000/TCP to the second TeleControl Server Basics’ IP address to mitigate vulnerabilities CVE-2018-4835 and CVE-2018-4836.\nUsers can use the Windows firewall to close Ports 80/TCP and 443/TCP to mitigate vulnerability CVE-2018-4837.\n\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-65145 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm (link is external)\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nAUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\n\nAn attacker with network access to Port 8000/TCP could bypass the authentication mechanism gaining access to limited information.\nCVE-2018-4835 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nPERMISSIONS, PRIVILEGES, AND ACCESS CONTROLS CWE-264\n\nAn authenticated attacker with network access to Port 8000/TCP could escalate privileges and perform administrative operations.\nCVE-2018-4836 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n\nUNCONTROLLED RESOURCE CONSUMPTION ('RESOURCE EXHAUSTION') CWE-400\n\nAn attacker with access to the TeleControl Server Basic’s webserver (Ports 80/TCP or 443/TCP) could cause a Denial-of-Service condition on the web server. The remaining functionality of the TeleControl Server Basic is not affected by the Denial-of-Service condition.\nCVE-2018-4837 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\nRESEARCHER\nSiemens ProductCERT reported the vulnerabilities to NCCIC.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-4837",
    "CVE-2018-4837",
    "CVE-2017-4835",
    "CVE-2017-4836",
    "CVE-2018-4836",
    "CVE-2018-4835"
  ],
  "techniques": [],
  "advisory": "icsa-18-030-02",
  "title": "Siemens TeleControl Server Basic | CISA",
  "source": "ics-advisories",
  "id": "ec4e0ee5e5541d3ab5833f4d3771972d7d3c4ec33b2588b6b37eaed6d0d0c65a"
}