{
  "markdown": "\nOverview\nICS-CERT originally released advisory “ICSA-11-335-01P - 7-Technologies Data Server Denial of Service” in the US-CERT secure portal on December 01, 2011. This web page release was delayed to allow users time to download and install the update.\nSecurity researcher UCQ from the Cyber Defense Institute, Inc. has identified a buffer overflow vulnerability in the 7-Technologies (7T) IGSS Data Server application.\nICS-CERT has coordinated with 7T, which has produced a patch to resolve this vulnerability. The Cyber Defense Institute, Inc. has tested the patch and confirmed that it resolves the reported vulnerability.\nAffected Products\nVersion 9.0.0.11200 of 7T IGSS Data Server is affected.\nImpact\nSuccessful exploitation of this vulnerability can allow an attacker to execute a remote denial of service (DoS) against the 7T data server on the targeted host computer, resulting in adverse application conditions.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\n7T, based in Denmark, creates monitoring and control systems that are used primarily in the United States, Europe, and South Asia. According to the 7T website, IGSS has been deployed in over 28,000 industrial plants in 50 countries worldwide.\nThe 7T IGSS human-machine interface (HMI) is used to control and monitor programmable logic controllers (PLCs) in industrial processes across multiple sectors including energy, manufacturing, oil and gas, and water.\nVulnerability Characterization\nVulnerability Overview\nThis vulnerability can be exploited by sending a specially crafted packet to Port 12401/TCP. A successful exploit will cause a buffer overflow that can result in a remote DoS against the 7T Data Server application on the targeted host.\nCVE-2011-4050 has been assigned to this vulnerability.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a moderate skill level can exploit this vulnerability.\nMitigation\n7T has developed a patch to address this vulnerability and has provided the following options to customers who wish to update their systems:\n\nIn the IGSSMaster application, select the menu item “Information and Support” and click “Update IGSS Software.” This will automatically download and install the updated module. This is the preferred method for updating the IGSS installation when the host computer has Internet access.\nAccess the update either by using the direct link or the instructions below: Direct link: http://www.7t.dk/igss/igssupdates/v90/progupdatesv90.zip\n\nInstructions: Browse to the 7T IGSS website. From the “Download” menu select the “Licensed Versions” option. From this page, select the Version 9 “Program updates (General)” to download a ZIP file containing all current updates for IGSS Version 9. Once the ZIP file (progupdatesv90.zip) has downloaded, manually unpack the ZIP file, and copy the entire contents to the \\IGSS\\ directory within the IGSS installation folder on the end user’s computer.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind a properly configured firewall, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2011-4050"
  ],
  "techniques": [],
  "advisory": "icsa-11-335-01",
  "title": "7-Technologies Data Server Denial of Service | CISA",
  "source": "ics-advisories",
  "id": "b8702d676fa99dc2517de26ec10dcec74d9f85cfb4aeb479556ae62d53124b96"
}