{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens Mobility\nEquipment: CoreShield One-Way Gateway (OWG) Software\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to leverage the default installation for Windows versions of the CoreShield (OWG) software, which sets insecure file permissions that could result in local escalation of privileges to local administrator.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CoreShield OWG software, which enable unidirectional exchange of information between network zones, are affected:\n\nCoreShield OWG Software: All versions prior to 2.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe default installation sets insecure file permissions, which could allow a local attacker to escalate privileges to local administrator.\nCVE-2022-38466 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nAbian Blome and Michael Messner from Siemens Energy reported this vulnerability to Siemens Mobility.\n4. MITIGATIONS\nSiemens Mobility recommends users update CoreShield OWG software to version 2.2 or later.\nSiemens Mobility has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nInstall CoreShield OWG software on a dedicated machine.\nMigrate the operating system (OS) of the affected machines to Linux.\nRemove modify and write permissions from the installed executables for local users.\n\nFor more information see Siemens Security Advisory in HTML or CSAF.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-38466"
  ],
  "techniques": [],
  "advisory": "icsa-22-258-01",
  "title": "Siemens Mobility CoreShield OWG Software | CISA",
  "source": "ics-advisories",
  "id": "61a3f518516356fa574006009eaef19da7ef1104755cdec4bf4c9be1e7ad21ca"
}