{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE W1750D\nVulnerabilities: Improper Restriction of Operations Within the Bounds of a Memory Buffer, Command Injection, Path Traversal\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-315-06 Siemens SCALANCE W1750D that was published November 11, 2022, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute code on the affected devices, read arbitrary files, or create a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SCALANCE W1750D, a wireless access point, are affected:\n\nSCALANCE W1750D: All versions prior to v8.7.1.3\n\n--------- Begin Update A part 1 of 3 ---------\n\nSCALANCE W1750D: Versions from 8.7.1.3 to those prior to v8.7.1.9 (only affected by CVE-2021-37727, CVE-2021-37730, and CVE-2021-37734)\n\n--------- End Update A part 1 of 3 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nA remote buffer overflow vulnerability was discovered in HPE Aruba Instant (IAP). Successful exploitation could allow for unauthenticated remote code execution, potentially resulting in the execution of arbitrary code as a privileged user on the underlying system.\nCVE-2021-37726 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nA remote arbitrary command execution vulnerability was discovered in HPE Aruba Instant (IAP) command line interface. Successful exploitation could result in the ability to execute arbitrary commands as a privileged user on the underlying OS, potentially compromising the system.\nCVE-2021-37727 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nA remote arbitrary command execution vulnerability was discovered in HPE Aruba Instant (IAP) command line interface. Successful exploitation could result in the ability to execute arbitrary commands as a privileged user on the underlying OS, potentially compromising the system.\nCVE-2021-37730 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.4    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nA remote arbitrary command execution vulnerability was discovered in HPE Aruba Instant (IAP) web-based management user interface. Successful exploitation could result in the ability to execute arbitrary commands as a privileged user on the underlying OS, potentially compromising the system.\nCVE-2021-37732 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.5    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nAn authenticated arbitrary file read access vulnerability was discovered in Aruba Instant Access Points. Successful exploitation could lead to an attacker reading any file off the underlying filesystem, including system sensitive files.\nCVE-2021-37734 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n4.2.6    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nA remote denial of service vulnerability was discovered in Aruba Instant through the command line interface. Successful exploitation could create a denial-of-service condition, leading to a temporary loss of service until the next reboot.\nCVE-2021-37735 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends upgrading their products to the latest version:\n\nSCALANCE W1750D: Update to v8.7.1.3 or later.\n\n--------- Begin Update A part 2 of 3 ---------\n\nSCALANCE W1750D: Update to v8.7.1.9 or later\n\n--------- End Update A part 2 of 3 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nBlock access to the Aruba Instant Command Line Interface from all untrusted users.\nBlock access to the Aruba Instant web-based management interface from all untrusted users.\nEnable the Enhanced PAPI Security feature, where available, to prevent exploitation of these vulnerabilities. For assistance from the Siemens Technical Assistance Center (TAC), please contact Siemens (login required).\nBlock access for Aruba Instant device on Port UDP/8211 from all untrusted users.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\n--------- Begin Update A part 3 of 3 ---------\nFor more information see Siemens Security Advisory SSA-917476 in HTML or CSAF.\n--------- End Update A part 3 of 3 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-37732",
    "CVE-2021-37727",
    "CVE-2021-37730",
    "CVE-2021-37734",
    "CVE-2021-37735",
    "CVE-2021-37726"
  ],
  "techniques": [],
  "advisory": "icsa-21-315-06",
  "title": "Siemens SCALANCE W1750D (Update A) | CISA",
  "source": "ics-advisories",
  "id": "1cb934ff5b4523b8bf629c6f081ddde2bdc3913685660a017cd9b21d64c4bdd8"
}