{
  "markdown": "\nOVERVIEW\nIvan Sanchez from Nullcode Team has identified a handling of exceptional conditions vulnerability in PACTware Consortium’s PACTware application. PACTware Consortium has produced a new service pack that mitigates this vulnerability. Ivan Sanchez has tested the new version to validate that it resolves the vulnerability.\nAFFECTED PRODUCTS\nThe following PACTware versions are affected:\n\nPACTware Version 4.1, Service Pack 3.\n\nIMPACT\nSuccessful exploitation of this vulnerability could crash the application.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nPACTware Consortium is a union of international companies that develop a common software for operating field instruments. PACTware Consortium is based in Germany.\nThe affected product, PACTware, is a fieldbus-independent software for operating field instruments. According to PACTware Consortium, PACTware is deployed across most sectors. PACTware Consortium estimates that PACTware is used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER CHECK OR HANDLING OF EXCEPTIONAL CONDITIONSCWE-703: Improper Check or Handling of Exceptional Conditions, http://cwe.mitre.org/data/definitions/703.html, web site last accessed June 25, 2015.\n\nUploading a specially crafted file could result in an internal error that is not handled correctly, which may cause the application to crash.\nCVE-2015-0989NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0989, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 1.2 has been assigned; the CVSS vector string is (AV:L/AC:H/Au:N/C:N/I:N/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:H/Au:N/C:N/I:N/A:P, web site last accessed June 25, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not exploitable remotely and cannot be exploited without user interaction.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult. Social engineering is required to convince the user to accept the malformed file. Additional user interaction is needed to load the malformed file. This decreases the likelihood of a successful exploit.\nMITIGATION\nPACTware Consortium has released a new service pack of the PACTware application that resolves the vulnerability. PACTware Consortium recommends upgrading to PACTware Version 4.1, Service Pack 4.\nContact PACTware Consortium for Service Pack 4. PACTware Consortium’s contact information is available at the following URL:\nhttp://www.pactware.com/en/contact.html\nPACTware Consortium’s main download page is at the following URL:\nhttp://www.pactware.com/en/downloads/pactware.html\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should consider the following:\n\nDo not upload untrusted files to the PACTware application without verifying the integrity of files.\nInteract with and only obtain files, software, and software patches from trustworthy highly reputable sources.\nLimit access to those assets using the PACTware application to authorized personnel.\nRestrict network access to assets using the PACTware application, as appropriate.\nEnsure that employees with access to the PACTware application are fully aware of the ongoing potential for social engineering attacks and are trained to identify and protect themselves from social engineering attacks.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed June 25, 2015. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed June 25, 2015. for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2015-0989"
  ],
  "techniques": [],
  "advisory": "icsa-15-176-02",
  "title": "PACTware Exceptional Conditions Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "37b2dd0ee6367f852bac0add8e6f310c546ad9847873ec0207011fd2b660af57"
}