{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SINEMA Remote Connect Server\nVulnerabilities: Improper Restriction of Excessive Authentication Attempts, Information Exposure, Cross-Site Request Forgery, Use of Password Hash with Insufficient Computational Effort\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker unauthorized access to the web interface, improper access to privileged user and device information, and may allow successful CSRF attacks.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SINEMA Remote Connect Server are affected:\n\nSINEMA Remote Connect Server versions prior to 2.0 SP1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\nThe web interface has no means to prevent password guessing attacks. This vulnerability could be exploited by an attacker with network access to the vulnerable software, requiring no privileges and no user interaction. Exploitation could allow full access to the web interface.\nCVE-2019-13918 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    INFORMATION EXPOSURE CWE-200\nSome pages that should only be accessible by a privileged user can also be accessed by a nonprivileged user. This vulnerability could be exploited by an attacker with network access and valid credentials for the web interface. No user interaction is required. Exploitation could allow an attacker to access information they should not be able to read. The information affected by this vulnerability does not include passwords.\nCVE-2019-13919 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.2.3    CROSS-SITE REQUEST FORGERY CWE-352\nSome parts of the web application are not protected against cross-site request forgery (CSRF) attacks. This vulnerability could be exploited by an attacker who is able to trigger requests of a logged-in user to the application. Exploitation could allow switching the connectivity state of a user or a device.\nCVE-2019-13920 has been assigned to this vulnerability. A CVSS v3 base score of 3.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:C/C:N/I:L/A:N).\n3.2.4    USE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORT CWE-916\nAn attacker with administrative privileges can obtain the hash of a connected device’s password. The security vulnerability could be exploited by an attacker with network access to the SINEMA Remote Connect Server and administrative privileges.\nCVE-2019-13922 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:H/UI:N/S:C/C:N/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Agriculture and Food, Chemical, Critical Manufacturing Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nHendrik Derre and Tijl Deneut from HOWEST reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens recommends users upgrade to Versions 2.0 SP1 or later for the affected products.\nThe v2.0 SP1 update can be obtained at the following location:\nhttps://support.industry.siemens.com/cs/ww/en/view/109770899\nFor more information on these vulnerabilities and associated software updates, please see Siemens’ security advisory SSA-884497 at: https://www.siemens.com/cert/advisories.\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict network access to the SINEMA Remote Connect web interface\nDo not access links from untrusted sources while logged in at SINEMA Remote Connect\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-13920",
    "CVE-2019-13918",
    "CVE-2019-13919",
    "CVE-2019-13922"
  ],
  "techniques": [],
  "advisory": "icsa-19-260-02",
  "title": "Siemens SINEMA Remote Connect Server | CISA",
  "source": "ics-advisories",
  "id": "38b61ac90b7983ad97527274eb2e4623e4bceae506e66fd41bc2ba8c0410ca18"
}