{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: LOGO! CMR2020, LOGO! CMR2040 and SIMATIC RTU 3000 family\nVulnerabilities: Incorrect Calculation of Buffer Size, Improper Certificate Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker with access to any of the interfaces of an affected device to impact the availability or to communicate with invalid certificates.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LOGO! CMR and SIMATIC RTU 3000 are affected:\n\nLOGO! CMR2020 all versions prior to v2.2\nLOGO! CMR2040 all versions prior to v2.2\nSIMATIC RTU 3000 family all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT CALCULATION OF BUFFER SIZE CWE-131\nThe calculations performed in the third-party component Mbed TLS are not limited. Supplying overly large parameters could lead to denial-of-service condition when generating Diffie-Hellman key pairs.\nCVE-2020-36475 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    IMPROPER CERTIFICATE VALIDATION CWE-295\nThe affected product is vulnerable to a stack-based buffer overflow, which may allow an attacker to remotely execute arbitrary code.\nCVE-2020-36478 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nFor LOGO! CMR2020, Siemens recommends affected users update to v2.2 or later. \nFor LOGO! CMR2040, Siemens recommends affected users update to v2.2 or later.\nFor the SIMATIC RTU 3000 family, Siemens recommends affected users use the certificate projection feature to pin the valid certificates of external servers providing services to the RTU/CMR devices. Refer to the product manual for further information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-36475",
    "CVE-2020-36478"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-20",
  "title": "Siemens LOGO! CMR and SIMATIC RTU 3000 | CISA",
  "source": "ics-advisories",
  "id": "5f4e1a7f5fe5c543e0e8f619609c62936af0f509202b9715e1ee26472ccfc6d7"
}