{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: Kinetix 5500 EtherNet/IP Servo Drive\nVulnerabilities: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could create a denial-of-service condition or allow attackers unauthorized access to the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Kinetix 5500 EtherNet/IP Servo Drive, an industrial control router, are affected:\n\nKinetix 5500 devices manufactured between May 2022 and January 2023: Version 7.13\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER ACCESS CONTROL CWE-284\nRockwell Automation Kinetix 5500 devices manufactured between May 2022 and January 2023 running Version 7.13 have telnet and file transfer protocol (FTP) ports open by default. This could allow an attacker access to the device.\nCVE-2023-1834 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater, Chemical, Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation recommends users upgrade the firmware of their affected devices to version 7.14 or later.\nRockwell Automation recommends users follow their security best practices.\nFor additional information, refer to Rockwell Automation’s Security Bulletin.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-1834"
  ],
  "techniques": [],
  "advisory": "icsa-23-131-09",
  "title": "Rockwell Automation Kinetix 5500 | CISA",
  "source": "ics-advisories",
  "id": "2ab645a86d1274d364d844a16bbb90c59cdd5d6ad54daa945a58e1685c7524d3"
}