{
  "markdown": "\nOVERVIEW\nThis advisory was originally posted to the US-CERT secure Portal library on October 24, 2013, and is now being released to the NCCIC/ICS-CERT Web site.\nAdam Crain of Automatak and independent researcher Chris Sistrunk have identified an improper input validation in Catapult Software’s DNP3 Driver software. Catapult Software has produced an updated software version that mitigates this vulnerability. Adam Crain and Chris Sistrunk tested the updated software to validate that it resolves the vulnerability.\nThis driver is used with General Electric (GE) Intelligent Platform’s Proficy iFIX and CIMPLICITY products. Please see ICSA-13-297-02 GE Proficy DNP3 Improper Input Validation for specific GE mitigations.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Catapult Software product is affected:\n\nCatapult Software DNP driver (“DNP”): Version 7.20.56, and\nProficy human-machine interface/supervisory control and data acquisition (HMI/SCADA) – iFIX or CIMPLICITY servers with the vulnerable I/O Driver installed (this includes iFIX or CIMPLICITY installations that are part of Proficy Process Systems).\n\nIMPACT\nThe use of this driver can cause the human-machine interface (HMI) to be put into a denial‑of‑service (DoS) condition by sending a specially crafted transmission control protocol (TCP) packet from the outstation on an IP-based network. If the device is connected via a serial connection, the same attack can be accomplished with physical access to the outstation. The device must be shut down and restarted to recover from the DoS.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nCatapult Software is based in New Zealand and specializes in SCADA/HMI software development.\nThe affected product, DNP 3.0 driver, was designed to be used with GE Intelligent Platforms’ iFIX and CIMPLICITY products, which are Web-based SCADA/HMI systems. According to Catapult Software, the driver and SCADA systems are deployed across several sectors, including oil and gas, water and wastewater, and electric utilities.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\nAs this vulnerability affects Internet Protocol-connected and Serial-connected devices, two CVSS scores have been calculated.\n\nIMPROPER INPUT VALIDATION-IP-BASEDCWE-20: Improper Input Validation,  http://cwe.mitre.org/data/definitions/20.html, Web site last accessed November 19, 2013.\n\nThe Catapult Software DNP3 driver, used in the GE iFIX and CIMPLICITY products, does not validate input correctly. An attacker could cause the software to go into an infinite loop by sending a specifically crafted TCP packet, causing the process to crash.\nCVE-2013-2811NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2013-2811, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7.1 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:N/I:N/A:C, Web site last accessed November 19, 2013.\n\nIMPROPER INPUT VALIDATION-SERIAL-BASECWE-20: Improper Input Validation,  http://cwe.mitre.org/data/definitions/20.html, Web site last accessed November 19, 2013.\n\nThe Catapult Software DNP3 driver, used in the GE iFIX and CIMPLICITY products, does not validate input correctly. An attacker could cause the software to go into an infinite loop, causing the process to crash. The system must be restarted manually to clear the condition.\nThe following scoring is for serial-connected devices.\nCVE- 2013-2823NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2013-2823, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 4.7 has been assigned; the CVSS vector string is (AV:L/AC:M/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:M/Au:N/C:N/I:N/A:C, Web site last accessed November 19, 2013.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability can be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a moderate skill would be able to exploit this vulnerability.\nMITIGATION\nAn updated driver is available from Catapult Software. Installing Version 7.20.60 (GE IP 7.20k) of the DNP driver or newer will address this issue. The driver is available for download by registering for support at http://catapultsoftware.com/support.\nIn addition, the driver update is also available from GE at http://support.ge-ip.com.\nThe researchers suggest blocking DNP3 traffic from traversing onto business or corporate networks through the use of an IPS or firewall with DNP3-specific rule sets to add an additional layer of protection.\nNCCIC/ICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nNCCIC/ICS-CERT also provides a section for control systems security recommended practices on the NCCIC/ICS-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.CSSP Recommended Practices, http://ics-cert.us-cert.gov/content/recommended-practices, Web site last accessed November 19, 2013. NCCIC/ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC/ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Detection and Mitigation Strategies,Target Cyber Intrusion Detection and Mitigation Strategies, http://ics-cert.us-cert.gov/tips/ICS-TIP-12-146-01B, Web site last accessed November 19, 2013. that is available for download from the NCCIC/ICS-CERT Web page (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC/ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2013-2811",
    "CVE-2013-2823"
  ],
  "techniques": [],
  "advisory": "icsa-13-297-01",
  "title": "Catapult Software DNP3 Driver Improper Input Validation | CISA",
  "source": "ics-advisories",
  "id": "9f96e2917bd56b483a53ae4be23dc0ec5a385bc46da2ce8112f6f6d9c41eeaee"
}