{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Fujitsu Limited\nEquipment: Real-time Video Transmission Gear \"IP series\"\nVulnerability: Use Of Hard-Coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in an attacker logging into the web interface using the obtained credentials. The attacker could initialize or reboot the products, terminating the video transmission.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Real-time Video Transmission Gear \"IP series\", a hosted web application, are affected:\n\nReal-time Video Transmission Gear \"IP series\" IP-HE950E: firmware versions V01L001 to V01L053\nReal-time Video Transmission Gear \"IP series\" IP-HE950D: firmware versions V01L001 to V01L053\nReal-time Video Transmission Gear \"IP series\" IP-HE900E: firmware versions V01L001 to V01L010\nReal-time Video Transmission Gear \"IP series\" IP-HE900D: firmware versions V01L001 to V01L004\nReal-time Video Transmission Gear \"IP series\" IP-900E / IP-920E: firmware versions V01L001 to V02L061\nReal-time Video Transmission Gear \"IP series\" IP-900D / IP-900ⅡD / IP-920D: firmware versions V01L001 to V02L061\nReal-time Video Transmission Gear \"IP series\" IP-90: firmware versions V01L001 to V01L013\nReal-time Video Transmission Gear \"IP series\" IP-9610: firmware versions V01L001 to V02L007\n\n3.2 Vulnerability Overview\n3.2.1 Use Of Hard-Coded Credentials CWE-798\nThe credentials of Fujitsu Limited Real-time Video Transmission Gear \"IP series\" for factory testing may be obtained by reverse engineering and other methods.\nCVE-2023-38433 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Government Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nFujitsu Limited reported this vulnerability to JPCERT/CC.\n4. MITIGATIONS\nFujitsu Limited recommends updating the firmware to the latest version, which can be downloaded here.\nFujitsu Limited recommends placing the products on a secure network as a workaround.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2023-38433"
  ],
  "techniques": [],
  "advisory": "icsa-23-248-01",
  "title": "Fujitsu Limited Real-time Video Transmission Gear \"IP series\" | CISA",
  "source": "ics-advisories",
  "id": "c7876b8fd105c942f8f13a1dce73d8c3ea10c4e0dc7b6197993fcd0698866ad1"
}