{
  "markdown": "\nOVERVIEW\nSiemens has reported two improper input validation vulnerabilities discovered separately by Prof. Dr. Hartmut Pohl of softScheck GmbH and Arne Vidström of Swedish Defence Research Agency (FOI) in Siemens’ SIMATIC S7-1200 PLC. Siemens has produced a new version that mitigates these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following SIMATIC S7-1200 PLC versions are affected:\n\nSIMATIC S7-1200 PLC family: all versions before V4.0.0.\n\nIMPACT\nAttackers could use these vulnerabilities to perform a denial-of-service attack.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS‑CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSiemens is a multinational company headquartered in Munich, Germany.\nProducts in the Siemens SIMATIC S7-1200 PLC family have been designed for discrete and continuous control in Critical Infrastructure Sectors such as Chemical, Critical Manufacturing, and Food and Agriculture.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATIONCWE-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20.html, web site last accessed March 20, 2014.\n\nSpecially crafted packets sent on Port 161/UDP (SNMP) cause the device to go into defect mode.\nCVE-2013-2780NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2013-2780, web site last accessed March 20, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 7.8 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:N/I:N/A:C, web site last accessed March 20, 2014.\n\nIMPROPER INPUT VALIDATIONCWE-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20.html, web site last accessed March 20, 2014.\n\nSpecially crafted packets sent on Port 102/TCP (ISO-TSAP) cause the device to go into defect mode. Further research has identified multiple instances of this vulnerability.\nCVE-2013-0700NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2013-0700, web site last accessed March 20, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 7.8 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:N/I:N/A:C, web site last accessed March 20, 2014.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nSiemens has provided the SIMATIC S7-1200 PLC product release V4.0.0 to resolve these vulnerabilities available at:\nhttp://support.automation.siemens.com/WW/view/en/86567043.\nSiemens recommends running the affected software components in a protected network environment and to configure the environment according to operational guidelines.Operational Guidelines for Industrial Security, http://www.industry.siemens.com/topics/global/en/industrial-security/Documents/operational_guidelines_industrial_security_en.pdf, web site last accessed March 20, 2014.\nFor more information regarding this issue or any other security issue involving Siemens products, please see the Siemens ProductCERT security advisory page at: www.siemens.com/cert/advisories.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2013-2780",
    "CVE-2013-0700"
  ],
  "techniques": [],
  "advisory": "icsa-14-079-01",
  "title": "Siemens SIMATIC S7-1200 Improper Input Validation Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "e42abd2f04945b49a98359e0610c9feb60057ec4ffd6cab95da96c5bebd91a0e"
}