{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available \nVendor: Advantech \nEquipment: iView \nVulnerability: SQL Injection \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to acquire credentials. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Advantech iView management software are affected: \n\nVersion 5.7.04.6469 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89 \nAdvantech iView versions 5.7.04.6469 and prior are vulnerable to a SQL injection that could disclose sensitive product information to an unauthorized user. \nCVE-2022-3323 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). \n3.3 BACKGROUND\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors \nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States \nCOMPANY HEADQUARTERS LOCATION: Taiwan \n3.4 RESEARCHER\nTenable reported this vulnerability to Advantech. Trend Micro’s Zero Day Initiative reported this vulnerability to CISA. \n4. MITIGATIONS\nAdvantech recommends users update to iView v5.7.04.6583. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-3323"
  ],
  "techniques": [],
  "advisory": "icsa-22-342-01",
  "title": "Advantech iView | CISA",
  "source": "ics-advisories",
  "id": "4a21087105febbe503a9b6dd521410e0f3de1b3e55285eea88085ca04b3348f7"
}