{
  "markdown": " Yokogawa FAST/TOOLS XML External Entity \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryYokogawa FAST/TOOLS XML External Entity======================================= Last Revised September 05, 2018 Alert Code ICSA\\-14\\-343\\-01OVERVIEW-------- Timur Yunusov, Alexey Osipov, and Ilya Karpov of Positive Technologies Inc. have identified an XML external entity processing vulnerability in the Yokogawa FAST/TOOLS application. Yokogawa has produced a service pack that mitigates this vulnerability.AFFECTED PRODUCTS----------------- The following Yokogawa FAST/TOOLS versions are affected:* FAST/TOOLS Versions R9\\.01 though R9\\.05 SP1IMPACT------ An attacker who exploits this vulnerability could cause data from the WebHMI server to be sent to an outside machine. An exploit could also increase the load of the WebHMI server and the network. Impact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Yokogawa is a company based in Japan that maintains offices in several countries around the world, including the Americas, Europe, the Middle East, Africa, South Asia, and East Asia. The affected products, FAST/TOOLS, are a web\\-based real\\-time operations management and visualization software suite. According to Yokogawa, these products are deployed across several sectors, including the petroleum and natural gas segments of the energy sector.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### EXTERNAL ENTITY REFERENCECWE\\-611: Improper Restriction of XML External Entity Reference ('XXE'), http://cwe.mitre.org/data/definitions/611\\.html web site last accessed December 09, 2014\\. To exploit this vulnerability, an attacker must intrude the WebHMI.   Please contact Yokogawa customer service for more information. CVE\\-2014\\-7251NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-7251, web site last accessed December 09, 2014\\. has been assigned to this vulnerability. A CVSS v2 base score of 2\\.4 has been assigned by the vendor; the CVSS vector string is (AV:L/AC:H/Au:S/C:P/I:N/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:L/AC:H/Au:S/C:P/I:N/A:P, web site last accessed December 09, 2014\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability can only be exploited locally.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY Crafting a working exploit for this vulnerability would be difficult.MITIGATION---------- This vulnerability is mitigated by installing service pack (R9\\.05\\-SP2\\) for the FAST/TOOLS R9\\.05\\. To activate the service pack, the computer needs to be rebooted. Older systems, using earlier revisions (R9\\.01 – R9\\.04\\) than the target revision (R9\\.05\\), should upgrade to the target revision (R9\\.05\\) and then apply the service pack. Contact Yokogawa support and services if it is difficult to upgrade the system to the target revision (R9\\.05\\). In addition, the vulnerability will be corrected and upgraded to the latest version (R10\\.01\\) of FAST/TOOLS. For questions related to this vulnerability or how to obtain the patch software, please contact Yokogawa service department or access the following URL.[https://plus.yokogawa.co.jp/gw/gw.po?c\\-id\\=000037](https://plus.yokogawa.co.jp/gw/gw.po?c-id=000037)  See Yokogawa’s security advisory (YSAR\\-14\\-0004E) for more details.[http://www.yokogawa.com/dcs/security/ysar/YSAR\\-14\\-0004E.pdf](http://www.yokogawa.com/dcs/security/ysar/YSAR-14-0004E.pdf)  Yokogawa strongly suggests all customers introduce appropriate security measures not only for the identified vulnerability but also for the overall systems. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Yokogawa-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-14-343-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2014-7251"
  ],
  "techniques": [],
  "advisory": "icsa-14-343-01",
  "title": "Yokogawa FAST/TOOLS XML External Entity | CISA",
  "source": "ics-advisories",
  "id": "2af936e807d6d7f3e6e5e8a88506bef58b536d86cf4c7e644d9bf90a6a5740e1"
}