{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.3\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Weintek \nEquipment: EasyBuilder Pro  \nVulnerability:  Path Traversal: '\\..\\filename' \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain control of the user’s machine or gain sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Weintek EasyBuilder Pro, a project management software, are affected: \n\nv6.07.01 and prior \nv6.07.02.479 and prior  \nv6.08.01.349 and prior  \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 PATH TRAVERSAL: '\\..\\FILENAME' CWE-29 \nThe listed versions for Weintek EasyBuilder Pro are vulnerable to a ZipSlip attack caused by decompiling a malicious project file. This may allow an attacker to gain control of the user’s computer or gain access to sensitive data.   \nCVE-2023-0104 has been assigned to this vulnerability. A CVSS v3 base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Taiwan \n\n3.4 RESEARCHER\nHank Chen and Mars Cheng of PSIRT and Threat Research of TXOne Networks reported this vulnerability to CISA. \n4. MITIGATIONS\nWeintek recommends users implement the following mitigation techniques: \n\nUpgrade EasyBuilder Pro to v6.07.02.480, v6.08.01.350 or later. \nUse Decompile only on trusted sources and only when needed. \n\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-0104"
  ],
  "techniques": [],
  "advisory": "icsa-23-045-01",
  "title": "Weintek EasyBuilder Pro cMT Series | CISA",
  "source": "ics-advisories",
  "id": "333b94faef24a141c43c914fff0a3095a1b2e33297359c438164b4635b54b0d4"
}