{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Siemens Industrial Products containing certain processors\nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-252-07 Siemens Industrial Products (Update E) that was published June 8, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an authenticated user to enable information disclosure via local access.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n\nSIMATIC Field PG M4: All versions.\nSIMATIC Field PG M5: All BIOS versions prior to v22.01.08\nSIMATIC Field PG M6: All BIOS versions prior to v26.01.07\nSIMATIC IPC3000 SMART: All versions\nSIMATIC IPC347E: All versions\nSIMATIC IPC427D (incl. SIPLUS variants): All versions\nSIMATIC IPC427E (incl. SIPLUS variants): All versions prior to v21.01.14\nSIMATIC IPC477D: All versions\nSIMATIC IPC477E: All versions prior to v21.01.14\nSIMATIC IPC477E Pro: All versions prior to v21.01.14\nSIMATIC IPC527G: All BIOS versions prior to v1.4.0\nSIMATIC IPC527G: All versions\nSIMATIC IPC547E: All versions\nSIMATIC IPC547G: All versions prior to R1.28.0\nSIMATIC IPC627D: All versions\nSIMATIC IPC627E: All BIOS versions prior to v25.02.06\nSIMATIC IPC647D: All versions\nSIMATIC IPC647E: All BIOS versions prior to v25.02.06\nSIMATIC IPC677D: All versions\nSIMATIC IPC677E: All BIOS versions prior to v25.02.06\nSIMATIC IPC827D: All versions\nSIMATIC IPC847D: All versions\nSIMATIC IPC847E: All BIOS versions prior to v25.02.06\n\n--------- Begin Update F Part 1 of 2 ---------\n\nSIMATIC IPC3000 SMART v2: All versions prior to v1.B\n\n--------- End Update F Part 1 of 2 ---------\n\nSIMATIC ITP1000: All BIOS versions prior to v23.01.08\nSIMOTION P320-4E: All versions\nSIMOTION P320-4S: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nIncomplete cleanup from specific special register read operations in some Intel processors may allow an authenticated user to potentially enable information disclosure via local access.\nCVE-2020-0543 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nAlyssa Milburn, Hany Ragab, Kaveh Razavi, Herbert Bos, and Cristiano Giuffrida from the VUSec group at VU Amsterdam reported this vulnerability to Intel.\n5. MITIGATIONS\nSiemens recommends updating the following products to the most current BIOS version where available:\n\nSIMATIC Field PG M5: Update BIOS to v22.01.08\nSIMATIC Field PG M6: Update BIOS to v26.01.07\nSIMATIC IPC427E, IPC477E, IPC477E Pro: Update BIOS to v21.01.14\nSIMATIC IPC527G: Update BIOS to R1.4.0\nSIMATIC IPC547G: Update BIOS to R1.28.0\nSIMATIC IPC627E, IPC647E, IPC677E, and IPC847E: Update BIOS to v25.02.06\nSIMATIC ITP1000: Update BIOS to v23.01.08\n\n--------- Begin Update F Part 2 of 2 ---------\n\nSIMATIC IPC3000 SMART v2: Update BIOS to v1.B or later version\n\n--------- End Update F Part 2 of 2 ---------\nSiemens is preparing further updates and recommends the following specific workarounds and mitigations users can apply to reduce the risk until fixes are available.\n\nAs a prerequisite for an attack, an attacker must be able to run untrusted code on affected systems. Siemens recommends limiting the possibilities to run untrusted code if possible.\nApplying a defense-in-depth concept can help to reduce the probability that untrusted code is run on the system. Siemens recommends applying the defense-in-depth concept.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security, and following the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/Industrialsecurity\nFor more information on these vulnerabilities and the associated mitigations, please see Siemens security advisory SSA-534763\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-0543"
  ],
  "techniques": [],
  "advisory": "icsa-20-252-07",
  "title": "Siemens Industrial Products (Update F) | CISA",
  "source": "ics-advisories",
  "id": "3bc4a3bceb73a08ad3e92e95b3fc8fcaa4fae37bbaa1357e6492ae20aac16817"
}