{
  "markdown": " 7\\-Technologies Termis DLL Hijacking (Update A) \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS Advisory7\\-Technologies Termis DLL Hijacking (Update A)=============================================== Last Revised May 08, 2013 Alert Code ICSA\\-12\\-025\\-02AOverview-------- ICS\\-CERT originally released Advisory ICSA\\-12\\-025\\-02P on the US\\-CERT secure portal on January 25, 2012\\. This web page release was delayed to allow users time to download and install the update. Researcher Kuang\\-Chun Hung of the Security Research and Service Institute−Information and Communication Security Technology Center (ICST) identified an uncontrolled search path element vulnerability (often called DLL hijacking), commonly referred to as DLL Hijacking, in the 7\\-Technologies (7T) TERMIS software. ICS\\-CERT has coordinated this report with 7T, and 7T has created a patch that resolves this vulnerability. ICST has confirmed this patch fully resolves the reported vulnerability.Affected Products----------------- The following products and versions are affected:* TERMIS V2\\.10 dated November 30, 2011, and any previous version.Impact------ A successful exploit of this vulnerability could lead to arbitrary code execution. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- 7T, based in Denmark, creates monitoring and control systems that are primarily used in the United States, Europe, and South Asia. 7T TERMIS software is used for district energy network management.Vulnerability Characterization------------------------------### Vulnerability Overview The 7T TERMIS software is vulnerable to DLL Hijacking.CWE\\-427: Uncontrolled Search Path Element, http://cwe.mitre.org/data/definitions/427\\.html, website last accessed February 15, 2012\\. An attacker may place a malicious DLL in a directory where it will be loaded before the valid DLL. An attacker must have access to the host file system to exploit this vulnerability. If exploited, this vulnerability may allow execution of arbitrary code.**\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin Update A Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-** [CVE\\-2012\\-0223](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2012-0223)  has been assigned to this vulnerability.**\\-\\-\\-\\-\\-\\-\\-\\-\\- End Update A Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-\\-\\-** ### Vulnerability Details#### Exploitability This vulnerability may be exploitable from a remote machine.#### Existence of Exploit No known public exploits specifically target this vulnerability.#### Difficulty An attacker requires a moderate skill level to exploit this vulnerability.Mitigation---------- 7T has developed a patch to address this vulnerability, which can be accessed here: [http://termis.s3\\.amazonaws.com/TERMIS\\_2\\.10\\_18\\-01\\-2012\\.exe](http://termis.s3.amazonaws.com/TERMIS_2.10_18-01-2012.exe)  . Users may need to uninstall an earlier version of the application before installing this update. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks:1. Do not click web links or open unsolicited attachments in e\\-mail messages.2. Refer to [*Recognizing and Avoiding Email Scams*](/reading_room/emailscams_0905.pdf) for more information on avoiding e\\-mail scams.3. Refer to [*Avoiding Social Engineering and Phishing Attacks*](/cas/tips/ST04-014.html) or more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* 7\\-Technologies-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-025-02a)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2012-0223"
  ],
  "techniques": [],
  "advisory": "icsa-12-025-02a",
  "title": "7-Technologies Termis DLL Hijacking (Update A) | CISA",
  "source": "ics-advisories",
  "id": "bafb9e5fe6c1100b664e2e28435c5606e24e94cf6e569fa3d12e5357e1b6c8d7"
}