{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: Relion 670, 650, and SAM600-IO Series\nVulnerability: Insufficient Verification of Data Authenticity\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the Intelligent Electronic Device (IED) to restart, causing a temporary denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi Energy reports this vulnerability affects the following Relion 670, 650 and SAM600-IO Series products: \n\nRelion 670/650 series version 2.2.0\nRelion 670/650/SAM600-io series version 2.2.1\nRelion 670 series version 2.2.2\nRelion 670 series version 2.2.3\nRelion 670/650 series version 2.2.4\nRelion 670/650 series version 2.2.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nThe Hitachi Energy Relion update package signature validation contains an improper access control vulnerability. A tampered update package could cause the IED to restart. After a restart, the device returns to normal operation. An attacker could exploit the vulnerability by gaining access to the system with security privileges and then attempting to update the IED with a malicious update package. Successful exploitation of this vulnerability could cause the IED to restart, causing a temporary denial-of-service condition.\nCVE-2022-3864 has been assigned to this vulnerability. A CVSS v3 base score of 4.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n3.4 RESEARCHER\nNozomi Networks Labs reported this vulnerability to Hitachi Energy.\n4. MITIGATIONS\nHitachi Energy recommends users disable Field Service Tool access and only enable it on an as-needed basis, such as for planned upgrades.\nHitachi Energy recommends the following general mitigation factors and security practices:\n\nConfigure firewalls to protect process control networks from attacks originating from outside the network.\nPhysically protect process control systems from direct access by unauthorized personnel.\nAvoid directly connecting control systems to the internet.\nSeparate process control networks from other networks via a firewall system with minimal exposed ports.\nUsers should not use process control systems for internet surfing, instant messaging, or email.\nPortable computers and removable storage media should be carefully scanned for viruses before connecting to a control system.\nEnforce proper password policies and processes.\n\nFor more information, see Hitachi security advisory 8DBD000146.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has low attack complexity.\n",
  "cves": [
    "CVE-2022-3864"
  ],
  "techniques": [],
  "advisory": "icsa-23-068-05",
  "title": "Hitachi Energy Relion 670, 650 and SAM600-IO Series | CISA",
  "source": "ics-advisories",
  "id": "36d8c12c61bed889f779c9fd75185da571bc0832350bd909fda9bcae1ee179d6"
}