{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Emerson\nEquipment: ControlWave\nVulnerabilities: Insufficient Verification of Data Authenticity\n\nCISA is aware of a public report, known as “OT:ICEFALL,” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations to reduce risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause file manipulation, remote code execution, or denial-of-service.\n3. TECHNICAL DETAILS\n\n\n3.1 AFFECTED PRODUCTS\nThe following versions of ControlWave, a programmable controller, are affected:\n\nControlWave: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nEmerson ControlWave firmware images are not signed and only rely on insecure checksums for regular integrity checks. This could allow an attacker to push malicious firmware, remote code execution, or a denial-of-service condition.\nCVE-2022-30262 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Oil & Gas, Petrochemical, Chemical, Life Sciences, Water and Wastewater, etc\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forescout Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nEmerson ControlWave firmware updates can be restricted by the following methods:\n\nA hardware switch can be set to block remote firmware download.\nSystem variable “_APPLICATION_LOCKED” can be set TRUE to disable remote firmware download.\nBefore installing firmware into the RTU, confirm the MD5/SHA256 Hashes published by Emerson on SupportNet (login required) match the firmware image, confirming it is genuine and unmodified.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-30262"
  ],
  "techniques": [],
  "advisory": "icsa-22-221-02",
  "title": "Emerson ControlWave | CISA",
  "source": "ics-advisories",
  "id": "f2c53b78e3c15a08e996d8a7bae408425b5822ef62f89d15492423ff3c3b9b08"
}