{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: NUUO\nEquipment: NVRmini2, NVRsolo\nVulnerabilities: Stack-based Buffer Overflow, Leftover Debug Code\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to achieve remote code execution and user account modification. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Nuuo NVRmini2 and NVRsolo, network video recorders, are affected:\n\nAll Versions 3.8.0 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nA stack-based buffer overflow vulnerability has been identified in which there is no bounds check when a string is passed into an input buffer. As such, a remote unauthenticated attacker can overflow the stack buffer, which could allow remote code execution.\nCVE-2018-1149 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). \n3.2.2    LEFTOVER DEBUG CODE CWE-489\nIn some cases, files exist on the file system that, when utilized, allow an unauthenticated remote attacker to gain access to and modify sensitive user information, which could allow unauthenticated remote code execution.\nCVE-2018-1150 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Financial Services, Government Facilities, Healthcare and Public Health, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nJacob Baines of Tenable discovered these vulnerabilities.\n4. MITIGATIONS\nNUUO has developed a fix for the reported vulnerabilities and recommends users update to firmware v3.9.1. The update can be downloaded at the following location:\nhttps://www.nuuo.com/DownloadMainpage.php\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-1150",
    "CVE-2018-1149"
  ],
  "techniques": [],
  "advisory": "icsa-18-284-01",
  "title": "NUUO NVRmini2 and NVRsolo | CISA",
  "source": "ics-advisories",
  "id": "3e25c3be852f77c634d888c8dfad6993ef5353b2fd035d7be333b1893fab12da"
}