{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.6\n\nATTENTION: Remotely exploitable/Low skill level to exploit\nVendor: Yokogawa\nEquipment: iDefine, STARDOM, ASTPLANNER, and TriFellows\nVulnerability: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow arbitrary code execution, or the stopping of the license management function.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAccording to Yokogawa the following products are affected:\n\nASTPLANNER: R15.01 and prior,\niDefine for ProSafe-RS: R1.16.3 and prior,\nSTARDOM: VDS R7.50 and prior and FCN/FCJ Simulator R4.20 and prior, and\nTriFellows: Version 5.04 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThis vulnerability that affects the license management function when it receives specially crafted data. An attacker could overflow the buffer by exploiting this, which may result in the license management function stopping or result in arbitrary code execution.\nCVE-2018-0651 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, and Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nYokogawa worked with JPCERT to report this vulnerability to NCCIC.\n4. MITIGATIONS\nYokogawa recommends users to update to the latest versions or apply the patch:ASTPLANNER: Update to R15.02.01 or contact support for the patch,\n\niDefine for ProSafe-RS: Update to R1.16.4,\nSTARDOM: Update to VDS R8.10 or contact support for the patch, and\nTriFellows: Update to Version 5.10 or contact support for the patch.\nSupport:\niDefine for ProSafe-RS and STARDOM users: https://contact.yokogawa.com/cs/gw?c-id=000498\nASTPLANNER and TriFellows users: https://contact.yokogawa.com/cs/gw?c-id=000497\n\nWhen Yokogawa service personnel perform system upgrade or install patches, those charges are borne by the user. Please contact support in the following section for the countermeasures regarding the affected products. Yokogawa strongly suggests all users to introduce appropriate security measures not only for the vulnerability identified, but also to the overall systems.\nRefer to Yokogawa’s security notification YSAR-18-0006 for more information, which can be located here:\nhttps://www.yokogawa.com/library/resources/white-papers/yokogawa-security-advisory-report-list/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-0651"
  ],
  "techniques": [],
  "advisory": "icsa-18-233-01",
  "title": "Yokogawa iDefine, STARDOM, ASTPLANNER, and TriFellows | CISA",
  "source": "ics-advisories",
  "id": "9ad9c1767676ddb4bff90c76a33cbe5b6560db5174ba5d6e6d2646e0b20caba4"
}