{
  "markdown": "\nOverview\nICS-CERT originally released advisory “ICSA-11-332-01P—Invensys Wonderware InBatch ActiveX Vulnerabilities” in the US-CERT secure portal on November 28, 2011. This web page release was delayed to allow users time to download and install the update.\nResearcher Kuang-Chun Hung of the Security Research and Service Institute−Information and Communication Security Technology Center (ICST) has identified three vulnerabilities in Invensys Wonderware InBatch. These vulnerabilities exist in the GUIControls, BatchObjSrv, and BatchSecCtrl ActiveX controls.\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute arbitrary code or cause a denial of service (DoS) on systems with affected versions of Wonderware InBatch Runtime Client components.\nICS-CERT has coordinated the report with the ICST and Invensys. Invensys has issued software updates that resolve these vulnerabilities. The ICST has confirmed the software updates fully resolve the reported vulnerabilities.\nAffected Products\nThe following Invensys Wonderware InBatch versions are affected:\n\n8.1 SP1, 9.0 SP2, and 9.5--InBatch Server and Runtime Clients\n9.0 and 9.0 SP1.\n\nThe affected components exist in a variety of Wonderware products including InTouch and Information Server browser clients that have downloaded converted windows that contain these controls.\nAccording to Invensys, I/A Series Batch 8.1 SP1 and Wonderware InBatch 9.5 SP1 and higher are not affected by these vulnerabilities.\nImpact\nIf successfully exploited, these vulnerabilities could allow an attacker to execute arbitrary code on systems running affected versions of the product.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nInvensys Wonderware InBatch is used in many industries worldwide including manufacturing, energy, food and beverage, chemical, and water and wastewater.\nThe InBatch Runtime Client provides an interface to the batch management system to allow operator interaction during the batch execution.\nVulnerability Characterization\nVulnerability Overview\nAffected versions of the InBatch Runtime Client components contain three buffer overflowhttp://cwe.mitre.org/data/definitions/121.html, website accessed November 28, 2011., http://cwe.mitre.org/data/definitions/122.html, website accessed November 28, 2011. vulnerabilities. These vulnerabilities could be exploited by using long string values for the properties/methods of the referenced controls. This could result in either a DoS or remote code execution running with privileges of the logged-in user.\n--------- Begin Update A Part 1 of 1 --------\nCVE-2011-4870 has been assigned to this vulnerability. Invensys has assessed the vulnerabilities using the CVSShttp://nvd.nist.gov/cvss.cfm, website last accessed January 03, 2012. Version 2.0 calculator and gives the Overall CVSS = 6.0. Click here to review the assessment.\n--------- End Update A Part 1 of 1 ----------\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable. This exploit may require social engineering.\nExistence of Exploit\nNo publicly known exploits specifically target these vulnerabilities.\nDifficulty\nAn attacker with a low skill level can create the DoS; a more skilled attacker could exploit the vulnerability to execute arbitrary code.\nMitigation\nInvensys has developed software updates to address the reported vulnerabilities. Invensys recommends that customers who are running vulnerable versions of Wonderware InBatch update their systems to either InBatch 9.0 SP2 or 9.5 on all nodes that have the InBatch client runtime and the InBatch Server installed. Installation does not require a reboot.\nCustomers can download updates from the “Software Download” section of the Invensys Customer First Support website.\nFollow the instructions in the ReadMe section for the product and component to install the software update.In addition to applying the software updates, Invensys has made additional recommendations to customers running vulnerable versions of the Invensys Wonderware InBatch product:\n\nSet the security level settings for the Internet browser to Medium−High to minimize the risk of a vulnerability exploit.\nReference the Invensys Securing Industrial Control Systems Guide for additional information on securing industrial control systems operating in a Microsoft Windows environment.\n\nTo access information related to Invensys security updates, customers can logon to the Cyber Security Updates website and the GCS Foxboro Wonderware Security Releases webpage.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2011-4870"
  ],
  "techniques": [],
  "advisory": "icsa-11-332-01a",
  "title": "Wonderware InBatch ActiveX Vulnerabilities (Update A) | CISA",
  "source": "ics-advisories",
  "id": "68525e40ebec454b3633b3502f1d505dc6a5a99fb1c2767551487030f1b06bed"
}