{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.7\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Eaton\nEquipment: Intelligent Power Manager (IPM)\nVulnerabilities: SQL Injection, Eval Injection, Improper Input Validation, Unrestricted Upload of File with Dangerous Type, Code Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow attackers to change certain settings, upload code, delete files, or execute commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nEaton reports these vulnerabilities affect the following Intelligent Power Manager products:\n\nEaton Intelligent Power Manager (IPM) – All versions prior to 1.69\nEaton Intelligent Power Manager Virtual Appliance (IPM VA) – All versions prior to 1.69\nEaton Intelligent Power Protector (IPP) – All versions prior to 1.68\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    SQL INJECTION CWE-89\nEaton Intelligent Power Manager (IPM) prior to 1.69 is vulnerable to authenticated SQL injection. A malicious user can send a specially crafted packet to exploit this vulnerability. Successful exploitation of this vulnerability can allow attackers to add users in the data base.\nCVE-2021-23276 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    EVAL INJECTION CWE-95\nEaton Intelligent Power Manager (IPM) prior to 1.69 is vulnerable to an unauthenticated eval injection vulnerability. The software does not neutralize code syntax from users before using in the dynamic evaluation call in the “loadUserFile” function under scripts/libs/utils.js. Successful exploitation can allow attackers to control the input to the function and execute attacker-controlled commands.\nCVE-2021-23277 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    IMPROPER INPUT VALIDATION CWE-20\nEaton Intelligent Power Manager (IPM) prior to 1.69 is vulnerable to an authenticated arbitrary file delete vulnerability induced due to improper input validation at server/maps_srv.js with the “removeBackground” function and server/node_upgrade_srv.js with the “removeFirmware” function. An attacker can send specially crafted packets to delete the files on the system where IPM software is installed.\nCVE-2021-23278 has been assigned to this vulnerability. A CVSS v3 base score of 8.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:C/C:N/I:H/A:H).\n3.2.4    IMPROPER INPUT VALIDATION CWE-20\nEaton Intelligent Power Manager (IPM) prior to 1.69 is vulnerable to an unauthenticated arbitrary file delete vulnerability induced due to improper input validation in meta_driver_srv.js class with the “saveDriverData” function using invalidated driverID. An attacker can send specially crafted packets to delete the files on the system where IPM software is installed.\nCVE-2021-23279 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:H).\n3.2.5    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nEaton Intelligent Power Manager (IPM) prior to 1.69 is vulnerable to an authenticated arbitrary file upload vulnerability. IPM’s maps_srv.js allows an attacker to upload a malicious NodeJS file using the “uploadBackground” function. An attacker can upload a malicious code or execute any command using a specially crafted packet to exploit the vulnerability.\nCVE-2021-23280 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.2.6    CODE INJECTION CWE-94\nEaton Intelligent Power Manager (IPM) prior to 1.69 is vulnerable to an unauthenticated remote code execution vulnerability. IPM software does not sanitize the date provided via the “coverterCheckList” function in meta_driver_srv.js class. Attackers can send a specially crafted packet to make IPM connect to rouge SNMP server and execute attacker-controlled code.\nCVE-2021-23281 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nAmir Preminger from Claroty research reported these vulnerabilities to Eaton.\n4. MITIGATIONS\nEaton has patched these security issues and new versions of the affected software are released. The latest versions can be downloaded from the locations below:\n\nEaton IPM v1.69: Download | IPM | Eaton\nEaton IPP v1.68: Download software | Power management | Eaton\n\nTo prevent the exploitation of the issues and safeguard the software from malicious entities, Eaton recommends blocking Ports 4679 and 4680 at the enterprise network or home network where Intelligent Power Manager (IPM) software is installed and used.\nPlease see Eaton vulnerability advisory number ETN-VA-2021-1000 for more information.\nEaton recommends the following general security best practices:\n\nRestrict exposure to external networks for all control system devices and/or systems and ensure they are not directly accessible from the open Internet.\nDeploy control system networks and remote devices behind barrier devices (e.g., firewalls, data diodes) and isolate them from business networks.\nRemote access to control system networks should be made available on a strict need-to-use basis. Remote access should use secure methods, such as virtual private networks (VPNs) updated to the most current version available.\nRegularly update/patch software/applications to latest versions available, as applicable.\nEnable audit logs on all devices and applications.\nDisable/deactivate unused communication channels, TCP/UDP ports and services (e.g., SNMP, FTP, BootP, DHCP, etc.) on networked devices.\nCreate security zones for devices with common security requirements using barrier devices (e.g., firewalls, data diodes).\nChange default passwords following initial startup. Use complex secure passwords or passphrases.\nPerform regular security assessments and risk analysis of networked control systems.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-23277",
    "CVE-2021-23280",
    "CVE-2021-23276",
    "CVE-2021-23281",
    "CVE-2021-23279",
    "CVE-2021-23278"
  ],
  "techniques": [],
  "advisory": "icsa-21-110-06",
  "title": "Eaton Intelligent Power Manager | CISA",
  "source": "ics-advisories",
  "id": "70360a736e2fc227c5ffc22008273798d3d8525708a0fefecfe028503fc777a1"
}