{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: Web Server on Modicon M340, Modicon Quantum and Modicon Premium Legacy\nVulnerabilities: Out-of-bounds Read, Out-of-bounds Write, Classic Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow write access and the execution of commands, which could result in data corruption or a web server crash.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports these vulnerabilities affect the following Modicon products: \n\nM340 CPUs\n\nBMX P34x, all versions\n\n\nM340 Communication Ethernet modules\n\nBMX NOE 0100 (H), all versions\nBMX NOE 0110 (H), all versions\nBMX NOC 0401, all versions\nBMX NOR 0200H, all versions\n\n\nPremium processors with integrated Ethernet COPRO\n\nTSXP574634, TSXP575634, TSXP576634, all versions\n\n\nPremium communication modules\n\nTSXETY4103, all versions\nTSXETY5103, all versions\n\n\nQuantum processors with integrated Ethernet COPRO\n\n140CPU65xxxxx, all versions\n\n\nQuantum communication modules\n\n140NOE771x1, all versions\n140NOC78x00, all versions\n140NOC77101, all versions\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nAn out-of-bounds read vulnerability exists which could cause a segmentation fault or a buffer overflow when uploading a specially crafted file on the controller over FTP. \nCVE-2020-7562 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:N/I:L/A:H).\n3.2.2    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds write vulnerability exists which could cause corruption of data, a crash, or code execution when uploading a specially crafted file on the controller over FTP. \nCVE-2020-7563 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:N/I:L/A:H).\n3.2.3    CLASSIC BUFFER OVERFLOW CWE-120\nA classic buffer overflow vulnerability exists which could cause write access and the execution of commands when uploading a specially crafted file on the controller over FTP. \nCVE-2020-7564 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:N/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Energy, Food and Agriculture, Government Facilities, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nKai Wang of Fortinet's FortiGuard Labs reported these vulnerabilities to Schneider Electric.\n4. MITIGATIONS\nSchneider Electric is establishing a remediation plan to fix these vulnerabilities in current and future versions of Modicon PAC controllers. Schneider Electric will update SEVD-2020-315-01 when the remediation is available. Until then, users should immediately apply the following mitigations to reduce the risk of exploit:\n\nDisable FTP via UnityPro / Ecostruxure Control Expert. This is disabled by default when a new application is created.\nConfigure the access control list via Ecostruxure Control Expert programming tool.\nSet up network segmentation and implement a firewall to block all unauthorized access to Port 21/TCP.\n\nSchneider Electric’s Modicon Premium and Modicon Quantum controllers have reached their end of life and are no longer commercially available. They have been replaced by the Modicon M580 ePAC controller.\nFor further information please refer to Modicon Controllers Platform - CyberSecurity, Reference Manual and SEVD-2020-315-01\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-7563",
    "CVE-2020-7562",
    "CVE-2020-7564"
  ],
  "techniques": [],
  "advisory": "icsa-21-005-01",
  "title": "Schneider Electric Web Server on Modicon M340 | CISA",
  "source": "ics-advisories",
  "id": "a24079f510742f2fb9c62204f58d30d1b469a2c236d7445b0ba6ecfbea3316d7"
}