{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.0\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available/known public exploitation\nVendor: QNAP\nEquipment: VioStor NVR\nVulnerability: OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to achieve remote code execution by exploiting NTP settings.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of QNAP VioStor NVR, are affected:\n\nVioStor NVR QVR firmware: All versions prior to 4.x\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nQNAP VioStor NVR versions prior to QVR Firmware 4.x are vulnerable to an OS command injection vulnerability that may allow an attacker to modify NTP settings in the device. This could result in remote code execution.\nCVE-2023-47565 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nChad Seaman and Larry Cashdollar of Akamai Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nQNAP has provided that users should download and apply the latest QVR Firmware.\nQNAP has stated that QVR Firmware 5.x and 4.x are both end of life.\nFor more information, see QNAP's security advisory.\nFor more information, contact QNAP Support.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA has received reports of this vulnerability being actively exploited.\nThis advisory contains a vulnerability that has an associated \"Known Exploited Vulnerabilities\" (KEV) entry. Refer to the following link to view the KEV entry: Known Exploited Vulnerabilities Catalog | CISA\n5. UPDATE HISTORY\n\nDecember 21, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-47565"
  ],
  "techniques": [],
  "advisory": "icsa-23-355-02",
  "title": "QNAP VioStor NVR | CISA",
  "source": "ics-advisories",
  "id": "ac67574869c48912dbea48a23bf18e41e0ccfaa28b6f4910978545c10aa1abea"
}