{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE\nVulnerabilities: Cross-site Request Forgery, OS Command Injection, Classic Buffer Overflow, Command Injection, Path Traversal, Missing Encryption of Sensitive Data\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-287-07 Siemens SCALANCE that was published October 14, 2021, on the ICS webpage on cisa.gov/ICS\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to inject commands or trigger buffer overflows.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SCALANCE W1750D, a software management platform, are affected:\n\nSCALANCE W1750D: All versions prior to v8.7.1.3\n\n--------- Begin Update A part 1 of 3 ---------\n\nSCALANCE W1750D: All version 8.7.1.9 and prior (Only affected by CVE-2019-5318)\nSCALANCE W1750D: All versions from 8.7.1.3 to 8.7.1.8 (Only affected by CVE-2019-5318, CVE-2020-37719, CVE-2021-37717, CVE-2021-37718, CVE-2021-37720, CVE-2021-37721, CVE-2021-37722, CVE-2021-37728)\n\n--------- End Update A part 1 of 3 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nThe web interface for RAPConsole lacks Anti-CSRF protections in place for state-changing operations. This can be exploited by an attacker to reboot the affected device if the attacker can convince a user to visit a specially crafted webpage.\nCVE-2019-5318 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:N/A:H).\n\n4.2.2    OS COMMAND INJECTION CWE-78\nAn authenticated command injection vulnerability exists in the ArubaOS command line interface. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the device running ArubaOS.\nCVE-2020-37719 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n \n4.2.3    CLASSIC BUFFER OVERFLOW CWE-120\nThere are multiple buffer overflow vulnerabilities that could lead to unauthenticated remote code execution by sending specially crafted packets destined to the PAPI (Aruba Networks AP management protocol) UDP Port (8211) of devices running ArubaOS. This may allow for denial-of-service attacks and/or remote code execution in the underlying operating system.\nCVE-2021-37716 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.4    COMMAND INJECTION CWE-77\nAn authenticated command injection vulnerability exists in the ArubaOS web-based management user interface. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the device running ArubaOS.\nCVE-2021-37717 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.5    COMMAND INJECTION CWE-77\nAn authenticated command injection vulnerability exists in the ArubaOS web-based management user interface. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the device running ArubaOS.\nCVE-2021-37718 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.6    COMMAND INJECTION CWE-77\nAn authenticated command injection vulnerability exists in the ArubaOS command line interface. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the device running ArubaOS.\nCVE-2021-37720 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.7    COMMAND INJECTION CWE-77\nAn authenticated command injection vulnerability exists in the ArubaOS command line interface. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the device running ArubaOS.\nCVE-2021-37721 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.8    COMMAND INJECTION CWE-77\nAn authenticated command injection vulnerability exists in the ArubaOS command line interface. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the device running ArubaOS.\nCVE-2021-37722 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.9    COMMAND INJECTION CWE-77\nAn authenticated command injection vulnerability exists in the ArubaOS command line interface. This vulnerability is only present in instances of the Mobility Conductor. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the Mobility Conductor running ArubaOS.\nCVE-2021-37723 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.10    COMMAND INJECTION CWE-77\nAn authenticated command injection vulnerability exists in the ArubaOS command line interface. This vulnerability is only present in instances of the Mobility Conductor. Successful exploitation of this vulnerability results in the ability to execute arbitrary commands as a privileged user on the underlying operating system. This allows an attacker to fully compromise the underlying operating system on the Mobility Conductor running ArubaOS.\nCVE-2021-37724 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.11    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nA vulnerability in the web-based management interface of ArubaOS could allow an unauthenticated remote attacker to conduct a Cross-Site Request Forgery (CSRF) attack against a vulnerable system. Successful exploitation of this vulnerability would consist of an attacker persuading an authorized user to follow a malicious link, resulting in the deletion of arbitrary files with the privilege level of the targeted user.\nCVE-2021-37725 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:H/A:N).\n4.2.12    PATH TRAVERSAL CWE-22\nAn authenticated path traversal vulnerability exists in the ArubaOS command line interface. Successful exploitation of this vulnerability results in the ability to impact the integrity of critical files on the underlying operating system. This allows an attacker to impact the availability of the ArubaOS instance and may allow for modification of sensitive data.\nCVE-2021-37728 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:H).\n4.2.13    PATH TRAVERSAL CWE-22\nAn authenticated path traversal vulnerability exists in the ArubaOS web-based management interface. Successful exploitation of this vulnerability results in the ability to impact the integrity of critical files on the underlying operating system. This allows an attacker to impact the availability of the ArubaOS instance and may allow for modification of sensitive data.\nCVE-2021-37729 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:H).\n4.2.14    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nAn authenticated local path traversal vulnerability exists in the ArubaOS web-based management interface and CLI. This vulnerability only affects physical hardware controllers such as the 9000 series and 7x00 series. Successful exploitation of this vulnerability requires physical access to the controller and results in the ability to impact the integrity and confidentiality of critical files on the underlying operating system. This allows an attacker to impact the availability of the ArubaOS instance and may allow for modification or disclosure of sensitive data.\nCVE-2021-37731 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been assigned; the CVSS vector string is (AV:P/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H/E:P/RL:O/RC:C).\n4.2.15    PATH TRAVERSAL CWE-22\nAn authenticated path traversal vulnerability exists in the ArubaOS command line interface. Successful exploitation of this vulnerability results in the ability to read arbitrary files on the underlying operating system, including sensitive system files.\nCVE-2021-37733 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n•    CRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, and Water and Wastewater Systems\n•    COUNTRIES/AREAS DEPLOYED: Worldwide\n•    COMPANY HEADQUARTERS LOCATION: Germany\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends upgrading SCALANCE W1750 to Versions 8.7.1.3 or later\n--------- Begin Update A part 2 of 3 ---------\nSCALANCE W1750D: All version 8719 and prior (only affected by CVE-2019-5318, currently no fix is planned.\nSCALANCE W1750 versions from 8.7.1.3 to 9.7.1.8 update to version 9.7.1.9 or later (only affected by CVE-2019-5318, CVE-2020-37719, CVE-2021-37717, CVE-2021-37718, CVE-2021-37720, CVE-2021-37721, CVE-2021-37722, CVE-2021-37728).\n--------- End Update A part 2 of 3 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nBlock access to the ArubaOS Command Line Interface from all untrusted users.\nBlock access to the ArubaOS web-based management interface from all untrusted users.\nBlock access to the Mobility Conductor Command Line Interface from all untrusted users.\nEnabling the Enhanced PAPI Security feature where available will prevent exploitation of these vulnerabilities. Please contact TAC for assistance if needed.\nExploitation requires physical access. Controllers in strictly controlled physical environments are at low risk.\nTo minimize the likelihood of an attacker exploiting these vulnerabilities, Aruba recommends the communication between Controller/Gateways and Access-Points be restricted either by having a dedicated Layer 2 segment/VLAN or, if Controller/Gateways and Access-Points cross Layer 3 boundaries, to have firewall policies restricting the communication of these authorized devices. In addition, enabling the Enhanced PAPI Security feature will prevent the PAPI-specific vulnerabilities above from being exploited. Contact Aruba Support for configuration assistance.\nThe RAPConsole or Local Debug (LD) homepage can be reached by users in a split or bridge role. This can be prevented by configuring an ACL to restrict access to the LD homepage, which effectively prevents this issue. Detailed instructions for ACL implementation are available.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends to configure the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\n--------- Begin Update A part 3 of 3 ---------\nFor additional information, please refer to Siemens Security Advisory SSA-280624 in HTML or CSAF.\n--------- End Update A part 3 of 3 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-37729",
    "CVE-2019-5318",
    "CVE-2021-37718",
    "CVE-2021-37731",
    "CVE-2021-37733",
    "CVE-2021-37721",
    "CVE-2021-37724",
    "CVE-2021-37722",
    "CVE-2021-37720",
    "CVE-2021-37728",
    "CVE-2020-37719",
    "CVE-2021-37723",
    "CVE-2021-37716",
    "CVE-2021-37717",
    "CVE-2021-37725"
  ],
  "techniques": [],
  "advisory": "icsa-21-287-07",
  "title": "Siemens SCALANCE (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0d0e95e2f860e5d3bc09924f532a63abf74eab332a75022697e43f557f3d64c8"
}