{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Siemens\nEquipment: Desigo CC and Cerberus DMS\nVulnerability: Use of Client-Side Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to impersonate other users or exploit the client-server protocol without being authenticated.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens management stations are affected:\n\nDesigo CC: All versions  \nDesigo CC Compact: All versions \nCerberus DMS: All versions \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF CLIENT-SIDE AUTHENTICATION CWE-603\nAll versions of Siemens Desigo CC and Cerberus DMS use client-side authentication when neither server-side authentication nor Kerberos authentication is enabled. In this configuration, attackers could impersonate other users or exploit the client-server protocol without being authenticated.\nCVE-2022-33139 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends users implement workarounds and mitigations for the affected products to reduce risk.\nAs a general security measure, Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices to run the devices in a protected IT environment.\nFor more information see, Siemens security advisory SSA-836027 in HTML or CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-33139"
  ],
  "techniques": [],
  "advisory": "icsa-22-286-16",
  "title": "Siemens Desigo CC and Cerberus DMS | CISA",
  "source": "ics-advisories",
  "id": "cadae3e7516b49f2166b4e9db08e7110cc78bc55fed60a78cdd27c7ecd3d63e1"
}