{
  "markdown": "\nOverview\nThis Advisory is a follow-up to the Alert, ICS-ALERT-11-256-06—BECKHOFF TWINCAT READ ACCESS VIOLATION, that was published September 13, 2011, on the Industrial Control Systems Cyber Emergency Response Team (ICS-CERT) web page.\nICS-CERT is aware of a public report of a read access violation vulnerability in Beckhoff’s TwinCAT Software that could lead to a denial-of-service condition. Beckhoff has produced a patch to address this vulnerability in TwinCAT Software.\nAffected Products\nAccording to Beckhoff, the following product is affected:\n\nTwinCAT versions 2.10, 2.11, 2.11R2\n\nImpact\nSuccessful exploitation of this vulnerability could result in a denial-of-service.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.\nBackground\nBeckhoff is a German-based company that provides industrial automation control and information products worldwide, across a wide range of industries.\nAccording to Beckhoff, TwinCAT is deployed across several sectors including general and special purpose machine building, manufacturing, building automation, oil and gas, water and wastewater, electric utilities, renewable energies, and others and is deployed worldwide.\nVulnerability Characterization\nVulnerability Overview\nA read access violation can occur when a specially crafted packet is sent to Port 48899\\UDP.\nCVE-2011-3486 has been assigned to this vulnerability.http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-3486, website last accessed October 06, 2011. A CVSS bse score of 5.0 has also been assigned.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nPublic exploits are known to target this vulnerability.\nDifficulty\nAn attacker with a low skill level can create the denial-of-service.\nMitigation\nBeckhoff has developed a patch to address this vulnerability. To obtain the patch and installation instructions, customers should contact Beckhoff at patch@beckhoff.com.\nIf the customer is unable to apply the patch, Beckhoff recommends that customers deploy a firewall and restrict traffic on the affected port (48899\\UDP).\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n\n",
  "cves": [
    "CVE-2011-3486"
  ],
  "techniques": [],
  "advisory": "icsa-11-279-04",
  "title": "Beckhoff TwinCAT Read Access Violation | CISA",
  "source": "ics-advisories",
  "id": "25c71870843c8eadedf06356845cc1a866964cf30d571a7937f486d93b9f3ce7"
}