{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: XMC20 and FOX61x\nVulnerabilities: Weak Password Requirements, Missing Handler\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain unauthorized access to the Data Communication Network (DCN) routing configuration and cause a disruption to the Network Management (NMS) and Network Element (NE) communication.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of XMC20 and FOX61x, multi-service network elements, are affected:\n\nXMC20: All versions prior to R15A\nFOX61x: All versions prior to R15A\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    WEAK PASSWORD REQUIREMENTS CWE-521\nThis vulnerability is a weak default credential associated with TCP Port 26. Successful exploitation of this vulnerability could allow an attacker to gain unauthorized access to the DCN routing configuration.\nCVE-2021-40333 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:L/I:H/A:H).\n3.2.2    MISSING HANDLER CWE-431\nThis vulnerability is due to the implementation of the proprietary management protocol (TCP Port 5558), in which if SSH is activated, could cause a disruption to the NMS and NE communication.\nCVE-2021-40334 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy recommends users to upgrade to the most current version of their products:\n\nXMC20: Upgrade to Version R15A\nFOX61x: Upgrade to Version R15A\n\nPlease refer to the Hitachi Energy XMC20 advisory for more details on affected module information.\nPlease refer to the Hitachi Energy FOX61x advisory for more details on affected module information.\nHitachi Energy recommends the following security practices and firewall configurations to help protect process control networks from attacks that originate from outside the network:\n\nPhysically protect process control systems from direct access by unauthorized personnel.\nDo not directly connect to the Internet.\nSeparate from other networks by means of a firewall system that has a minimal number of ports exposed.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nFor additional information and access to updated firmware, please contact the Hitachi Energy service organization.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-40333",
    "CVE-2021-40334"
  ],
  "techniques": [],
  "advisory": "icsa-21-341-02",
  "title": "Hitachi Energy XMC20 and FOX61x | CISA",
  "source": "ics-advisories",
  "id": "c8975da842f60337a07683c45086c8f2599ef043e02e6ed8cf462eaa74c9d559"
}