{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Commend\nEquipment: WS203VICM\nVulnerabilities: Argument Injection, Improper Access Control, Weak Encoding for Password\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to obtain sensitive information or force the system to restart.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nCommend reports that the following versions of WS203VICM video door station are affected:\n\nWS203VICM: version 1.7 and prior\n\n3.2 Vulnerability Overview\n3.2.1 ARGUMENT INJECTION CWE-88\nA remote, unauthenticated attacker may be able to send crafted messages to the web server of the Commend WS203VICM causing the system to restart, interrupting service.\nCVE-2024-22182 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H).\n3.2.2 IMPROPER ACCESS CONTROL CWE-284\nA remote attacker may be able to bypass access control of Commend WS203VICM by creating a malicious request.\nCVE-2024-21767 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.2.3 WEAK ENCODING FOR PASSWORD CWE-261\nA weak encoding is used to transmit credentials for WS203VICM.\nCVE-2024-23492 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities Sector\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Austria\n\n3.4 RESEARCHER\nAarón Flecha Menéndez of S21sec reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAlthough this is an end-of-life product, Commend has created new firmware version WS-CM 2.0 to address the first two issues. The new firmware can be loaded via the program \"IP Station Config\". To install the firmware, follow the instructions below:\n\nLog in to the Commend web-portal.\nDownload and extract the \"Terminals Software Package\".\nIn \"IP Station Config\", select the stations to be updated in the table.\nGo to: Menu Station > Firmware Download\nSelect the file \"WS-CM 2.0.geh\" from the folder \"WS-CM\" and click on the button Open.\n\nFor additional information, please visit CSA-2024-42 on Commend's cybersecurity website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nFebruary 20, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-21767",
    "CVE-2024-23492",
    "CVE-2024-22182"
  ],
  "techniques": [],
  "advisory": "icsa-24-051-01",
  "title": "Commend WS203VICM | CISA",
  "source": "ics-advisories",
  "id": "640a76bdd7dac46c99f18ad717115e7b9f186f36274f1c9ad30ee897ea027749"
}