{
  "markdown": "\nOverview\nThis updated advisory is a follow-up to the Alert titled “ICS-ALERT-11-256-05A—Rockwell RSLogix Overflow Vulnerability” that was published September 13, 2011, on the Industrial Control Systems Cyber Emergency Response Team (ICS-CERT) web page.\nICS-CERT is aware of a public report of an overflow vulnerability in Rockwell Automation’s RSLogix application that could lead to a denial-of-service condition.\n--------- Begin Update A Part 1 of 2 -------- \nRockwell has produced a patch that mitigates this vulnerability for all affected versions of FactoryTalk Services Platform and RSLogix 5000.\n--------- End Update A Part 1 of 2 ----------\nAffected Products\nAccording to Rockwell Automation, the following products are affected:\n\nRSLogix 5000 software Versions V17, V18, and V19\nAll FactoryTalk-branded software of specific Versions CPR9 and CPR9-SR1 through SR4.\n\nImpact\nSuccessful exploitation of this vulnerability could result in a denial-of-service.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nRockwell Automation provides industrial automation control and information products worldwide, across a wide range of industries.\nRSLogix 5000 is a programming suite used to develop interfaces within the control system environment.\nThe FactoryTalk Services Platform is a collection of production and performance management systems.\nVulnerability Characterization\nVulnerability Overview\nA Read Access violation can occur when a specially crafted packet is sent to open ports running thesoftware. The open TCP ports are as follows:\n\n1330\n1331\n1332\n4241\n4242\n4445\n4446\n5241\n6543\n9111\n60093\n49281\n\nCVE-2011-3489 has been assigned to this vulnerability in the National Vulnerability Database (NVD).http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-3489, website last accessed September 30, 2011. A CVSS base score of 5.0 has been assigned.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nPublic exploits are known to target this vulnerability.\nDifficulty\nAn attacker with a low skill level can create the denial-of-service.\nMitigation\n--------- Begin Update A Part 2 of 2 --------\nRockwell Automation recommends that concerned customers using FactoryTalk Services Platform Versions CPR9 and CPR9-SR1 through SR4 and customers using RSLogix versions V17, V18, and V19 apply patch AID 458689.\nCustomers using FactoryTalk Services Platform CPR7 and earlier, and RSLogix 5000 V16 and earlier, are not affected by this vulnerability.\nFor full patching instructions and additional information, refer to Rockwell Automation Security Advisory KB 456144.\n--------- End Update A Part 2 of 2 ----------\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n\n",
  "cves": [
    "CVE-2011-3489"
  ],
  "techniques": [],
  "advisory": "icsa-11-273-03a",
  "title": "Rockwell RSLogix Overflow Vulnerability (Update A) | CISA",
  "source": "ics-advisories",
  "id": "ecc5d19011d51c973f28c04634fa2bc2dad74dc07901ad5e7d987a7d7407e6d9"
}