{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Mendix Forgot Password Appstore module\nVulnerabilities: Improper Access Control, Improper Restriction of Excessive Authentication Attempts\n\n2. RISK EVALUATION\nThese vulnerabilities could allow a threat actor access to arbitrary user accounts.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Mendix Forgot Password Appstore, a password management module, are affected:\n\nMendix Forgot Password Appstore module: All versions v.3.3.0 through v3.5.1\nMendix Forgot Password Appstore module (Mendix 7 compatible): All versions prior to v3.2.2 (only affected by CVE-2022-26314)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected product is vulnerable to Improper Access Control, which may lead to access to a resource from an unauthorized actor.\nCVE-2022-26313 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.2.2    IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\nThe affected product is vulnerable to improper restriction of authentication attempts, which may allow an unauthenticated threat actor to efficiently brute force passwords in certain situations.\nCVE-2022-26314 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens provides the following specific mitigations:\n\nMendix Forgot Password Appstore module: Update to v3.5.1 or later\nDisable sign up as described in the Mendix documentation.\nMendix Forgot Password Appstore module (Mendix 7 compatible): Update to v3.2.2 or later version.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security, and to follow the recommendations in the product manuals.  \nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens Security Advisory SSA-134279\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-26314",
    "CVE-2022-26313"
  ],
  "techniques": [],
  "advisory": "icsa-22-069-04",
  "title": "Siemens SINEMA Mendix Forgot Password Appstore | CISA",
  "source": "ics-advisories",
  "id": "78e73b6ef2b04ed48537848c416101f0ddfd7b4ae0d75ac6569fba9716523999"
}