{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: LOGO! 8 BM\nVulnerabilities: Missing Authentication for Critical Function, Use of Hard-coded Cryptographic Key, Use of a Broken or Risky Cryptographic Algorithm, Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker the ability to make configuration and password changes, capture device keys, access confidential information, and gain full control of the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports the vulnerabilities affect the following LOGO! products:\n\nLOGO! 8 BM (incl. SIPLUS variants): All versions prior to 8.3\nLOGO! Soft Comfort: All versions prior to 8.3 (only affected by CVE-2020-25231, CVE-2020-25234)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nAn attacker who has access to a specific service may gain complete access to all services without authorization.\nCVE-2020-25228 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nAn attacker could execute replay attacks due to the usage of a static key, which may allow unauthorized password or configuration change on any affected device.\nCVE-2020-25229 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nAn attacker can use an outdated cipher mode, which may allow the extraction of the encryption key from captured communication with the device.\nCVE-2020-25230 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.4    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nAn attacker could use the affected device’s static key to decrypt program data, which may allow extraction of confidential information from protected program files.\nCVE-2020-25231 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.5    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nAn attacker could extract the communication key that is used when communicating with an affected device, which may allow confidential information disclosure.\nCVE-2020-25232 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.6    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nAn attacker may obtain the private RSA key that is used for encrypting communication with the device, which may allow confidential information disclosure.\nCVE-2020-25233 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.7    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nAn attacker could reverse engineer the user-defined functions directly from stored program files.\nCVE-2020-25234 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.2.8    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nAn attacker with access to network traffic could derive valid logins, which may allow confidential information disclosure.\nCVE-2020-25235 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nThomas Meesters from cirosec GmbH, Tobias Gebhardt, and Max Bäumler reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends users update to the latest versions:\n\nLOGO! 8 BM (incl. SIPLUS variants): Update to v8.3; A new hardware version is required in order to update\nLOGO! Soft Comfort: Update to v8.3\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nProtect access to Port 10005/TCP\nApply defense-in-depth concept, including protection concept outlined in the system manual.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security and to follow the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information, please see Siemens Security Advisory SSA-480824\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-25234",
    "CVE-2020-25230",
    "CVE-2020-25228",
    "CVE-2020-25232",
    "CVE-2020-25235",
    "CVE-2020-25233",
    "CVE-2020-25231",
    "CVE-2020-25229"
  ],
  "techniques": [],
  "advisory": "icsa-20-343-10",
  "title": "Siemens LOGO! 8 BM | CISA",
  "source": "ics-advisories",
  "id": "d96e64a1c98ee3967bf5207bb41dc3cd56fe55297c6fafc78d43d94c7c45741a"
}