{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Softing Industrial Automation, GmbH\nEquipment: OPC\nVulnerabilities: Heap-based Buffer Overflow, Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device being accessed. A buffer-overflow condition may also allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of OPC are affected:\n\nAll versions prior to the latest build of Version 4.47.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe affected product is vulnerable to a heap-based buffer overflow, which may allow an attacker to remotely execute arbitrary code. \nCVE-2020-14524 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe affected product is vulnerable to uncontrolled resource consumption, which may allow an attacker to cause a denial-of-service condition. \nCVE-2020-14522 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nUri Katz of Claroty reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSofting Industrial Automation has released an update to mitigate the reported vulnerabilities. The most up-to-date release at the time of this CISA advisory can be found on the Softing Industrial Automation website. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-14524",
    "CVE-2020-14522"
  ],
  "techniques": [],
  "advisory": "icsa-20-210-02",
  "title": "Softing Industrial Automation OPC | CISA",
  "source": "ics-advisories",
  "id": "dfb84bbf2abd8b8d5e86e56811e64ac0447590375058ad3623979bb8715c6077"
}