{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.3 \nATTENTION: Exploitable remotely/low attack complexity \nVendor: Siemens \nEquipment: SICAM A8000 CP-8000, CP-8021, CP-8022 \nVulnerability: Improper Access Control \n\n2. RISK EVALUATION\n Successful exploitation of this vulnerability could allow unauthenticated access to the web interface of the affected web server. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens has reported that this vulnerability affects the following SICAM A8000 Web Server Module products and versions: \n\nCP-8000 MASTER MODULE WITH I/O -25/+70°C (6MF2101-0AB10-0AA0): All Versions  \nCP-8000 MASTER MODULE WITH I/O -40/+70°C (6MF2101-1AB10-0AA0): All Versions \nCP-8021 MASTER MODULE (6MF2802-1AA00): All Versions \nCP-8022 MASTER MODULE WITH GPRS (6MF2802-2AA00): All Versions \n\nThe affected protocol firmware utilized with the web server modules includes the following: \n\nAGPMT0 (AGP Master)\nDNPiT1 (DNP3 TCP/IP Server)\nDNPiT2 (DNP3 TCP/IP Client)\nDNPMT0 (DNP3 Master seriell)\nDNPST0 (DNP3 Slave seriell)\nET83 (61850 Ed.1)\nET85 (61850 Ed.2)\nMBCiT0 (MODBUS TCP/IP Client)\nMBSiT0 (MODBUS TCP/IP Server)\nMODMT2 (MODBUS Master seriell)\nOPUPT0 (OPCUA Pub/Sub)\nOPUPT1 (Mindconnect)\n\n3.2 VULNERABILITY OVERVIEW\n 3.2.1 IMPROPER ACCESS CONTROL - CWE-284\nThe vulnerability could allow attackers to activate a web server module, allowing unauthorized access to its web pages. This could allow an attacker to retrieve debug-level information from the component such as internal network topology or connected systems.\nCVE-2021-46304 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\n CybExer Technologies reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens provided the following updates to the vulnerabilities for the following products affected: \n\nCP-8000 MASTER MODULE WITH I/O -25/+70°C (6MF2101-0AB10-0AA0): There is currently no fix available \nCP-8000 MASTER MODULE WITH I/O -40/+70°C (6MF2101-1AB10-0AA0): There is currently no fix available \nCP-8021 MASTER MODULE (6MF2802-1AA00): There is currently no fix available \nCP-8022 MASTER MODULE WITH GPRS (6MF2802-2AA00): There is currently no fix available \n\nSiemens has identified the following workarounds and mitigations for users to reduce risk:  \n\nOperate the affected web server module only when required and apply the security instructions provided in the updated manual. \n\nSiemens recommends users apply General Security Recommendations. \nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to the Siemens operational guidelines for industrial security and follow the recommendations in the product manuals. \nFor additional information, please refer to Siemens Security Advisory SSA-185638. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-46304"
  ],
  "techniques": [],
  "advisory": "icsa-22-223-05",
  "title": "Siemens SICAM A8000 Web Server Module | CISA",
  "source": "ics-advisories",
  "id": "ac4bdb9a13daff014897342aab971fda64730e9695b012f7b59ce817fe547a96"
}