{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Mitsubishi Electric India \nEquipment: GC-ENET-COM \nVulnerability: Signal Handler Race Condition  \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to a communication error and may result in a denial-of-service condition.  \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Mitsubishi Electric India Ethernet communication Extension unit GC-ENET-COM, are affected: \n\nMitsubishi Electric India GC-ENET-COM: Models with the beginning serial number 16XXXXXXXXX. \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 SIGNAL HANDLER RACE CONDITION CWE-364 \nA vulnerability exists in the Ethernet communication Extension unit (GC-ENET-COM) of GOC35 series due to a signal handler race condition. If a malicious attacker sends a large number of specially crafted packets, communication errors could occur and could result in a denial-of-service condition when GC-ENET-COM is configured as a Modbus TCP Server. \nCVE-2023-1285 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing  \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: India \n\n3.4 RESEARCHER\nFaruk Kazi and Parul Sindhwad of COE-CNDS lab, VJTI, Mumbai India, reported these vulnerabilities to Mitsubishi Electric India. \n4. MITIGATIONS\nMitsubishi Electric India has released the following countermeasure/mitigation: \n\nThe firmware of Extension unit GC-ENET-COM where the first 2 digits of the 11-digit serial number starting with “17” have been fixed. The firmware update in Extension unit GC-ENET-COM is only available from the vendor. Users should contact a local Mitsubishi Electric India representative. \n\nMitsubishi Electric India recommends users take the following mitigations to minimize the risk of attackers exploiting this vulnerability if the mentioned countermeasures cannot be implemented. \n\nUse a firewall, virtual private network (VPN), etc. to prevent unauthorized access when internet access is required. \nLocate control system networks and remote devices behind firewalls and isolate them from the business network to restrict access from untrusted networks and hosts. \nRestrict physical access to your computer and network equipment on the same network. \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.  \n",
  "cves": [
    "CVE-2023-1285"
  ],
  "techniques": [],
  "advisory": "icsa-23-103-15",
  "title": "Mitsubishi Electric India GC-ENET-COM | CISA",
  "source": "ics-advisories",
  "id": "fc4fcefd6f8e293254b825efb1a9fa46781f0100c1d60505b491bdebbf416cf9"
}