{
  "markdown": "\nOVERVIEW\nSiemens has identified a web security vulnerability in Siemen’s SCALANCE M-800 and S615 modules. This vulnerability was reported directly to Siemens by Alexander Van Maele and Tijl Deneut from HOWEST. Siemens has produced a new firmware version to mitigate this vulnerability.\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following products:\n\nSCALANCE M-800/S615: All versions before V4.02\n\nIMPACT\nExploitation of this vulnerability could allow an attacker in a privileged network position to obtain web session cookies under certain circumstances.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSiemens is a multinational company headquartered in Munich, Germany.\nThe affected products are SCALANCE M-800/S615 modules. SCALANCE M industrial routers are industrial-grade routers used to connect networked industrial components. This product line provides a Web interface to manage the router configuration. The SCALANCE S firewall is used to protect trusted industrial networks from untrusted networks and provides additional security functionality, e.g., VPN tunnels==2E. According to Siemens, SCALANCE M-800/S615 modules are deployed across several sectors including Chemical, Critical Manufacturing, Dams, Defense Industrial Base, Energy, Food and Agriculture, Government Facilities, Transportation Systems, and Water and Wastewater Systems. Siemens estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nSENSITIVE COOKIE IN HTTPS SESSION WITHOUT \"SECURE\" ATTRIBUTECWE-614: Sensitive Cookie in HTTPS Session Without 'Secure' Attribute, https://cwe.mitre.org/data/definitions/614.html, web site last accessed September 27, 2016.\n\nThe integrated web server delivers session cookies without the “secure” flag. Modern browsers interpreting the flag would mitigate potential data leakage in case of clear text transmission.\nCVE-2016-7090NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-7090, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been calculated; the CVSS vector string is (CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:N/A:N).CVSS Calculator, http://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:N/A:N, web site last accessed September 27, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult.\nMITIGATION\nSiemens provides firmware version V4.2 for SCALANCE M-800/S615 to mitigate this vulnerability. The firmware version can be obtained here:\nhttps://support.industry.siemens.com/cs/ww/en/view/109740858\nSiemens strongly recommends users protect network access to the management interface of SCALANCE M-800/S615 modules with appropriate mechanisms. Siemens also advises that users configure the operational environment according to Siemens overview of the operational guidelines for Industrial Security (with the cell protection concept):\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security.\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-342135 at the following location:\nhttp://www.siemens.com/cert/advisories\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-7090"
  ],
  "techniques": [],
  "advisory": "icsa-16-271-01",
  "title": "Siemens SCALANCE M-800/S615 Web Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "895cde0aca3fb4ab7d10f20a63ed1d036177c143fca78cf04695ca01eba765e4"
}