{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Exploitable on adjacent network/low attack complexity\nVendor: Honeywell\nEquipment: Saia Burgess PG5 PCD\nVulnerabilities: Authentication Bypass, Use of a Broken or Risky Cryptographic Algorithm\n\nCISA is aware of a public report known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identifies baseline mitigations for reducing risks from these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow for configuration manipulation.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Saia Burgess PG5 PCD, a PLC, are affected:\n\nSaia Burgess PG5 PCD: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS CWE-288\nThe affected product uses the S-Bus protocol with authentication functions that can be controlled by the client MAC and IP. Because UDP is stateless, an attacker that can observe traffic can also spoof the MAC and IP of an authenticated client and manipulate the controller configuration.\nCVE-2022-30319 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:L).\n3.2.2    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThe affected product uses the S-Bus “write byte” message to a specific address and supplies a hashed version of the password. The hashing algorithm is based on CRC-16 and, as such, is not cryptographically secure.\nCVE-2022-30320 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forescout Technologies reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHoneywell recommends users with affected products and unsupported products take the following steps to protect themselves:\n\nApply product updates as available.\nFollow guidance in the product security manual to ensure isolation of network segments upon which automation controllers reside.\nEnsure adequate security controls are in place between OT and IT network segments.\nDisable unnecessary accounts and services.\nFollow a least privilege approach and restrict system access to authorized personnel.\nApply defense-in-depth strategies.\nLog and monitor network traffic for suspicious activity.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-30319",
    "CVE-2022-30320"
  ],
  "techniques": [],
  "advisory": "icsa-22-207-03",
  "title": "Honeywell Saia Burgess PG5 PCD | CISA",
  "source": "ics-advisories",
  "id": "7698bdf70cf8f62fe9944ad0b730d9ce7d273a0ae194c9da632871ea44ec9034"
}