{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Tridium\nEquipment: Niagara\nVulnerabilities: Information Exposure, Improper Authorization\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a local user to escalate their privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Tridium products are affected:\n\nNiagara AX 3.8u4 (JACE 3e, JACE 6e, JACE 7, JACE-8000)\nNiagara 4.4u3 (JACE 3e, JACE 6e, JACE 7, JACE-8000)\nNiagara 4.7u1 (JACE-8000, Edge 10)\n\nNiagara Windows and Linux Supervisor installations are not impacted.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INFORMATION EXPOSURE CWE-200\nThe QNX procfs service provides access to various process information and assets, which could allow a less privileged process to gain access to a target address space. \nCVE-2019-8998 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER AUTHORIZATION CWE-285\nA specific utility may allow an attacker to gain read access to privileged files. \nCVE-2019-13528 has been assigned to this vulnerability. A CVSS v3 base score of 4.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Government Facilities, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJohannes Eger and Fabian Ullrich of the Secure Mobile Networking Lab reported CVE-2019-8998 to BlackBerry. Francisco Tacliad reported CVE-2019-13528 to CISA.\n4. MITIGATIONS\nTridium has released updates that mitigate these vulnerabilities and recommends users update to the versions identified below:\n\nNiagara AX 3.8u4: \n\nOS Dist: 2.7.402.2\nNRE Config Dist: 3.8.401.1\n\n\nNiagara 4.4u3:\n\nOS Dist: 4.4.73.38.1 NRE Config\nDist: 4.4.94.14.1\n\n\nNiagara 4.7u1:\n\nOS Dist: (JACE 8000) 4.7.109.16.1\nOS Dist (Edge 10): 4.7.109.18.1\nNRE Config Dist: 4.7.110.32.1\n\n\n\nUpdates are available by contacting the sales support channel or by contacting the Tridium support team at support@tridium.com\nAll Tridium Niagara users for all supported platforms are encouraged to update their systems with these releases to mitigate risk. For further guidance, please contact a Tridium account manager or Customer Support.\nIn addition to updating to the latest version, Tridium recommends users with affected products take the following steps:\n\nReview and validate the list of authorized users who can authenticate to Niagara.\nAllow only trained and trusted persons to have physical access to the system, including devices with connection to the system though the Ethernet port.\nIf remote connections to the network are required, consider using a VPN or other means to ensure secure remote connections into the network.\n\nFor more information please refer to:\n\nSecurity Bulletin# SB 2019-Tridium-3\nBlackBerry’s Security Advisory QNX-2019-001\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2019-13528",
    "CVE-2019-8998"
  ],
  "techniques": [],
  "advisory": "icsa-19-262-01",
  "title": "Tridium Niagara | CISA",
  "source": "ics-advisories",
  "id": "5e2489b9356c0e73d90e4892224a57c205ce52681cd7387115b3ba9e0e17d579"
}