{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC S7-300 and SIMATIC S7-400\nVulnerabilities: Information Exposure, Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-16-348-05 SIEMENS S7-300/400 PLC Vulnerabilities (Update D) that was published January 25, 2018, to the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to a denial-of-service condition or result in credential disclosure.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products are affected:\n--------- Begin Update E Part 1 of 1 ---------\n\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants) all versions\nSIMATIC S7-400 PN/DP V6 and below CPU family (incl. SIPLUS variants) all versions\nSIMATIC S7-400 PN/DP V7 CPU family (incl. SIPLUS variants) all versions\nSIMATIC S7-410 V8 CPU family (incl. SIPLUS variants) all versions (only affected by CVE-2016-9159)\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INFORMATION EXPOSURE CWE-200\nAn attacker with network access to Port 102/TCP (ISO-TSAP) or via Profibus could obtain credentials from the PLC if Protection-Level 2 is configured on the affected devices.\nCVE-2016-9159 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.2    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets sent to Port 80/TCP could cause the affected devices to go into defect mode. A cold restart is required to recover the system.\nCVE-2016-9158 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- End Update E Part 1 of 1 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nZhu WenZhe from Beijing Acorn Network Technology reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens provides the following firmware versions to resolve CVE-2016-9158:\n\nSIMATIC S7-300 CPU family: Update to v3.X.14\nSIMATIC S7-400 PN v6: Update to v6.0.6\nSIMATIC S7-400 v7 CPU family: Update to v7.0.2\nSIMATIC S7-410 v8 CPU family: Update to v8.2\n\nSiemens also recommends the following mitigations:\n\nDeactivate the web server. \nApply Protection-Level 3 read/write protection.\nApply cell protection concept.\nApply defense-in-depth strategies.\nUse VPN for protecting network communication between cells.\nFor SIMATIC S7-CPU 410 CPUs: Activate Field Interface Security in PCS 7 V9.0 and use a CP 443-1 Adv. to communicate with ES/OS in order to mitigate vulnerability 2 (CVE-2016-9159).\n\nSiemens strongly recommends users protect network access with appropriate mechanisms (e.g., firewalls, segmentation, VPN). Siemens also advises that users configure the operational environment according to Siemens’ Operational Guidelines for Industrial Security.\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-731239.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2016-9159",
    "CVE-2016-9158"
  ],
  "techniques": [],
  "advisory": "icsa-16-348-05",
  "title": "Siemens S7-300/400 PLC Vulnerabilities (Update E) | CISA",
  "source": "ics-advisories",
  "id": "c133e6532bf721ed965476a50ce28ad26aa071f449912052bf9bc286b1535b9a"
}