{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Atlas Copco\nEquipment: Power Focus 6000\nVulnerabilities: Cleartext Storage of Sensitive Information, Small Space of Random Values, Cleartext Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause a loss of sensitive information and the takeover of a user’s active session.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Power Focus 6000, a smart connected assembly product, are affected:\n\nPower Focus 6000: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nAtlas Copco Power Focus 6000 web server does not sanitize the login information stored by the authenticated user’s browser, which could allow an attacker with access to the user’s computer to gain credential information of the controller.\nCVE-2023-1897 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:H).\n3.2.2 SMALL SPACE OF RANDOM VALUES CWE-334\nAtlas Copco Power Focus 6000 web server uses a small amount of session Id numbers. An attacker could enter a session Id number to retrieve data for an active user’s session.\nCVE-2023-1898 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:H).\n3.2.3 CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nAtlas Copco Power Focus 6000 web server is not a secure connection by default, which could allow an attacker to gain sensitive information by monitoring network traffic between user and controller.\nCVE-2023-1899 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Sweden\n\n3.4 RESEARCHER\nChen Porian of OTORIO reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAtlas Copco has not responded to requests to work with CISA on mitigations for the reported vulnerabilities. Users of the affected products are encouraged to contact Atlas Copco.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a low attack complexity.\n",
  "cves": [
    "CVE-2023-1898",
    "CVE-2023-1899",
    "CVE-2023-1897"
  ],
  "techniques": [],
  "advisory": "icsa-23-159-01",
  "title": "Atlas Copco Power Focus 6000 | CISA",
  "source": "ics-advisories",
  "id": "a3f33306223f5fb467d1b9a35f0908b1e013dd09bc3259305b943450ed2451e2"
}