{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: PTC\nEquipment: Kepware KEPServerEX\nVulnerabilities: Heap-based Buffer Overflow, Stack-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-242-10 PTC Kepware KEPServerEX that was published August 30, 2022, to the ICS webpage at www.cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to crash the device or remotely execute arbitrary code.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following PTC products are affected by vulnerabilities found in Kepware KEPServerEX, a connectivity platform:\n\nKepware KEPServerEX: Versions prior to 6.12\nThingWorkx Kepware Server: Versions prior to 6.12\nThingWorkx Industrial Connectivity: All versions\nOPC-Aggregator: Versions prior to 6.12\nThingWorkx Kepware Edge: Versions 1.4 and prior\n\nThe following products are known to be vulnerable:\n\nRockwell Automation KEPServer Enterprise: Versions prior to v6.12\nGE Digital Industrial Gateway Server: Versions prior to v7.612\nSoftware Toolbox TOP Server: Versions prior to v6.12\n\t \n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nSpecifically crafted OPC UA messages transmitted to the server could allow an attacker to crash the server and leak data.\nCVE-2022-2848 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H).\n4.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nSpecifically crafted OPC UA messages transmitted to the server could allow an attacker to crash the server and remotely execute code.\nCVE-2022-2825 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nVera Mens, Uri Katz, and Sharon Brizinov of Claroty Research, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to PTC.\n5. MITIGATIONS\nPTC recommends updating to the latest versions of the following products:\n\nKepware KEPServerEX should upgrade to v6.12 or later\nThingWorx Kepware Server should upgrade to v6.12 or later\nThingWorx Industrial Connectivity should upgrade to ThingWorx Kepware Server v6.12 or later\nOPC-Aggregator should upgrade to v6.12 or later\nThingWorx Kepware Edge: Upgrade to v1.5 or later\n\nFor additional information and instructions on upgrading PTC software, refer to PTC’s security advisory (login required).\nPTC recommends upgrading the following products to their latest versions where feasible: \n--------- Begin Update A part 1 of 1 ---------\n\nRockwell Automation KEPServer Enterprise should upgrade to v13.01.00 or later\n\n--------- End Update A part 1 of 1 ---------\n\nGE Digital Industrial Gateway Server should upgrade to v7.612 or later\nSoftware Toolbox TOP Server should upgrade to v6.12 or later\n\nUsers of these products should reach out to the associated vendors for any additional information or assistance with these products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-2848",
    "CVE-2022-2825"
  ],
  "techniques": [],
  "advisory": "icsa-22-242-10",
  "title": "PTC Kepware KEPServerEX (Update A) | CISA",
  "source": "ics-advisories",
  "id": "bdde41f516f9512518321e3435f329daf845281d131889e887cf10d380ea7ff1"
}