{
  "markdown": " All Bachmann M1 System Processor Modules \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryAll Bachmann M1 System Processor Modules======================================== Last Revised July 22, 2021 Alert Code ICSA\\-21\\-026\\-021\\. EXECUTIVE SUMMARY---------------------* **CVSS v3 7\\.2*** **ATTENTION:**  Exploitable remotely/low attack complexity* **Vendor:**  Bachmann Electronic, GmbH* **Equipment:**  All M\\-Base Controllers* **Vulnerability**  : Use of Password Hash with Insufficient Computational Effort2\\. REPOSTED INFORMATION------------------------ This updated advisory is a follow\\-up to the advisory titled ICSA\\-21\\-026\\-02P All Bachmann M1 System Processor Modules, posted to the HSIN ICS library on January 26, 2021\\. This advisory is now being released to the ICS webpage on us\\-cert.cisa.gov.3\\. RISK EVALUATION------------------- Successful exploitation of this vulnerability could allow an unauthenticated remote attacker to gain access to the password hashes of the controller if Security Level 4 is not in use as recommended. In the recommended Security Level 4 setting, an authenticated remote attacker could get access to user credentials.4\\. TECHNICAL DETAILS---------------------### 4\\.1 AFFECTED PRODUCTS* All M\\-Base Operating Systems and Middleware versions since MSYS v1\\.06\\.14 are affected, which include the following M1 Hardware Controllers:\t+ MX207, MX213, MX220, MC206, MC212, MC220, MH230\\. This list indicates actively supported controllers.* MC205, MC210, MH212, ME203, CS200, MP213, MP226, MPC240, MPC265, MPC270, MPC293, MPE270, CPC210\\. This list indicates End\\-of\\-Life controllers.### 4\\.2 VULNERABILITY OVERVIEW#### 4\\.2\\.1 [USE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORT CWE\\-916](https://cwe.mitre.org/data/definitions/916.html) The affected M\\-Base Controllers use weak cryptography to protect device passwords. Security Level 0 is set at default from the manufacturer, which could allow an unauthenticated remote attacker to gain access to the password hashes. Security Level 4 is susceptible if an authenticated remote attacker or an unauthenticated person with physical access to the device reads and decrypts the password to conduct further attacks.[CVE\\-2020\\-16231](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2020-16231)  has been assigned to this vulnerability. A CVSS v3 base score of 7\\.2 has been calculated; the CVSS vector string is ( [AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H)  ).### 4\\.3 BACKGROUND* **CRITICAL INFRASTRUCTURE SECTORS:**  Energy, Transportation Systems* **COUNTRIES/AREAS DEPLOYED:**  Worldwide* **COMPANY HEADQUARTERS LOCATION:**  Austria### 4\\.4 RESEARCHER Ron Brash of Verve Industrial reported this vulnerability to CISA.5\\. MITIGATIONS--------------- Bachmann recommends its direct users and original equipment manufacturers (OEM) update to Version 4\\.49\\-P1, which is available under item number 00036634\\-90\\. To obtain Version 3\\.95R\\-P8 the end user is required to contact their key account manager or technical support agent at Bachmann. Asset owners should contact their OEM or reseller for patches. Bachmann does not provide support directly to asset owners. Please refer to the [Bachmann Customer Information Note](https://oc.bachmann.info/index.php/s/3r2LKtiG4d8Nq6C)  for more details. The password “\\_pC5\\#3fS@Y8s” is required to access. If asset owners are unable to update to the latest version or a patch is not available from the OEM or reseller, Bachmann recommends the following mitigations to be put in place:* Update the default username and password in the default Bachmann login handler for field operations.* Direct users or OEMs may utilize their own login handler (e.g., LDAP, Radius, etc.) to circumvent the default authentication handler. Security Level 4 is still recommended for field operations.* Restrict physical access to the device to authorized personnel only. Default Security Level 0 within Bachmann controllers is inherently insecure and should not be used in field operations. Security Levels 1, 2, and 3 are also not recommended for field operations. The use of Telnet, FTP, and Console access during field operations may result in the exploitation of inherent vulnerabilities such as unauthenticated access or exposure of sensitive information. Bachmann strongly recommends users apply Security Level 4, where communication with the device is limited to TLS protected services and all insecure services are disabled. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for [control systems security recommended practices](https://us-cert.cisa.gov/ics/recommended-practices)  on the ICS webpage on [us\\-cert.cisa.gov](https://us-cert.cisa.gov/ics)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](https://us-cert.cisa.gov/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . Additional mitigation guidance and recommended practices are publicly available on the [ICS webpage on us\\-cert.cisa.gov](https://us-cert.cisa.gov/ics)  in the Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](https://us-cert.cisa.gov/ics/tips/ICS-TIP-12-146-01B)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents. No known public exploits specifically target this vulnerability. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Bachmann-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-21-026-02)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2020-16231"
  ],
  "techniques": [],
  "advisory": "icsa-21-026-02",
  "title": "All Bachmann M1 System Processor Modules | CISA",
  "source": "ics-advisories",
  "id": "a60144bfce43f039b8f643c2f8de9e7e10bde130242e5939cb2d614fe6ba887f"
}