{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.7\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SIMATIC CP 1626; HMI Panel (incl. SIPLUS variants); NET PC software; STEP 7 (TIA Portal); WinCC (TIA Portal); WinCC OA; WinCC Runtime (Pro and Advanced); TIM 1531 IRC (incl. SIPLUS variant)\nVulnerability: Exposed Dangerous Method or Function\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-19-344-04 Siemens SIMATIC Products (Update B) that was posted March 10, 2020, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker already in a man-in-the-middle position to modify network traffic exchanged on Port 102/TCP.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n--------- Begin Update C Part 1 of 2 --------\n\nSIMATIC CP 1626: all versions\nSIMATIC NET PC Software v14: all versions prior to v14 SP1 Update 14\nSIMATIC NET PC Software v15: all versions\n\n--------- End Update C Part 1 of 2 --------\n\nSIMATIC HMI Panel (incl. SIPLUS variants): all versions\nSIMATIC STEP 7 (TIA Portal): all versions prior to v16\nSIMATIC WinCC (TIA Portal): all versions prior to v16\nSIMATIC WinCC OA: all versions prior to, and including, v3.15\nSIMATIC WinCC OA: all versions prior to, and including, v3.16 patch 12\nSIMATIC WinCC Runtime Advanced: all versions\nSIMATIC WinCC Runtime Professional: all versions\nTIM 1531 IRC (incl. SIPLUS NET variants): all versions prior to v2.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nAn attacker in a man-in-the-middle position could modify network traffic exchanged on Port 102/TCP. Successful exploitation requires an attacker be able to perform a man-in-the-middle attack. Subsequent exploitation of this vulnerability could compromise communication integrity of the affected system.\nCVE-2019-10929 has been assigned to this vulnerability. A CVSS v3.1 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nEli Biham, Sara Bitan, Aviad Carmel, and Alon Dankner from Faculty of Computer Science, Technion Haifa, reported this vulnerability to Siemens.\nUriel Malin and Avishai Wool from the School of Electrical Engineering, Tel-Aviv University, also reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has released updates for the following affected products and recommends users update to the new version:\n\nSIMATIC WinCC Runtime Advanced: update to v16\nSIMATIC WinCC Runtime Professional: update to v16\n\n--------- Begin Update C Part 2 of 2 --------\n\nSIMATIC NET PC Software v14: Update to v14 SP1 Update 14 or later version\n\n--------- End Update C Part 2 of 2 --------\n\nSIMATIC STEP 7 (TIA Portal): update to v16\nSIMATIC WinCC (TIA Portal): update to v16\nSIMATIC WinCC OA: update to v3.16 patch 13\nTIM 1531 IRC (incl. SIPLUS NET variants): update to v2.1\n\nSiemens is preparing further updates and recommends users apply the following specific countermeasures to reduce the risk until additional patches are available:\n\nApply defense-in-depth\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. Siemens recommends users configure their environment according to the Siemens Operational Guidelines for Industrial Security and follow the recommendations in the product manuals to operate the devices in a protected environment.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor further inquiries on security vulnerabilities in Siemens products, please contact the Siemens ProductCERT: http://www.siemens.com/cert/advisories\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-273799\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure that control system equipment is physically protected (e.g., in locked control panels).\nImplement physical access control to areas in which control system devices are located.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is required to exploit this vulnerability.\n",
  "cves": [
    "CVE-2019-10929"
  ],
  "techniques": [],
  "advisory": "icsa-19-344-04",
  "title": "Siemens SIMATIC Products (Update C) | CISA",
  "source": "ics-advisories",
  "id": "df2be9e79903ad1b0d1d4197b2803b9fd31e7ff569de17027f295a2e62ef8cdf"
}