{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: Factory Talk Activation Manager\nVulnerabilities: Cross-site Scripting, Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-18-102-02 Rockwell Automation FactoryTalk Activation Manager (Update A) that was published May 24, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to access sensitive information, rewrite content, or cause a buffer overflow that could result in remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nRockwell Automation reports these vulnerabilities affect licensing management software in the following FactoryTalk Activation Manager products:\n\nFactoryTalk Activation Manager v4.00 and v4.01\n\nShips with Wibu-Systems CodeMeter v6.50b and earlier,\n\n\nFactoryTalk Activation Manager v4.00 and earlier\n\nShips with FlexNet Publisher v11.11.1.1 and earlier.\n\n\n\nThe following products require FactoryTalk Activation Manager to store and keep track of Rockwell Automation software products and activation files. Users who recognize products from the following list are using FactoryTalk Activation Manager:\n\nArena\nEmonitor\nFactoryTalk AssetCentre\nFactoryTalk Batch\nFactoryTalk EnergyMetrix\nFactoryTalk eProcedure\nFactoryTalk Gateway\nFactoryTalk Historian Classic\nFactoryTalk Historian Site Edition (SE)\nFactoryTalk Information Server\nFactoryTalk Metrics\nFactoryTalk Transaction Manager\nFactoryTalk VantagePoint\nFactoryTalk View Machine Edition (ME)\nFactoryTalk View Site Edition (SE)\nFactoryTalk ViewPoint\nRSFieldBus\nRSLinx Classic\nRSLogix 500\nRSLogix 5000\nRSLogix5\nRSLogix Emulate 5000\nRSNetWorx\nRSView32\nSoftLogix 5800\nStudio 5000 Architect\nStudio 5000 Logix Designer\nStudio 5000 Logix Emulate\nStudio 5000 View Designer\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nA Cross-Site Scripting (“XSS”) vulnerability was found in certain versions of Wibu-Systems CodeMeter that may allow local attackers to inject arbitrary web script or HTML via a specific field in a configuration file, allowing an attacker to access sensitive information, or even rewrite the content of the HTML page.\nCVE-2017-13754 has been assigned to this vulnerability. A CVSS v3 base score of 2.7 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:C/C:N/I:L/A:N).\n4.2.2 IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nA custom string copying function of the license server manager in FlexNet Publisher does not use proper bounds checking on incoming data, allowing a remote, unauthenticated user to send crafted messages with the intent of causing a buffer overflow.\nCVE-2015-8277 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Chemical, Critical Manufacturing, Food and Agriculture, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: U.S.\n\n4.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to NCCIC.\n5. MITIGATIONS\nRockwell Automation recommends users with affected versions of CodeMeter and/or FlexNet Publisher that were installed with FactoryTalk Activation Manager to update Factory Talk Activation Manager to v4.02. If unable to update FactoryTalk Activation Manager to v4.02, update CodeMeter to a compatible version of CodeMeter that is compatible with FactoryTalk Activation Manager.\nRockwell Automation also encourages users to combine the updates above with these general security guidelines to employ multiple strategies simultaneously.\n\nBlock all traffic to EtherNet/IP or other CIP protocol-based devices from outside the Manufacturing Zone by blocking or restricting access to Port 2222/TCP and UDP and Port 44818/TCP and UDP, using proper network infrastructure controls, such as firewalls, UTM devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation Products, see Knowledgebase Article ID 898270 available at: https://rockwellautomation.custhelp.com/app/answers/detail/a_id/898270/page/1 (Login required).\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. VPN is only as secure as the connected devices.\n\n--------- Begin Update B Part 1 of 1 --------\nFor more information about these vulnerabilities and the recommended mitigations, please see Rockwell Automation Knowledgebase Advisory 1073133 available at:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1073133 (Login required)\n--------- End Update B Part 1 of 1 --------\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2017-13754",
    "CVE-2015-8277"
  ],
  "techniques": [],
  "advisory": "icsa-18-102-02",
  "title": "Rockwell Automation FactoryTalk Activation Manager (Update B) | CISA",
  "source": "ics-advisories",
  "id": "cf485f82265b73b1b545855cb80896b95f83b0ece31e98d4aa96cffd986fb63d"
}