{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Trihedral Engineering Limited\nEquipment: VTScada\nVulnerability: Resource Consumption, Cross-Site Scripting, Information Exposure\nAFFECTED PRODUCTS\nThe following versions of VTScada, an HMI SCADA software, are affected:\n\nVTScada Versions prior to 11.2.26\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could result in uncontrolled resource consumption, arbitrary code execution, or information exposure.\nMITIGATION\nTrihedral recommends that users of an affected version update to the latest version, v11.2.26. The update can be found at the following location:\nftp://ftp.trihedral.com/VTS/VTScada 11.2 Versions/VTScada 11.2.26.zip\nHelp file notes for upgrading VTScada/VTS can be found at:\nhttps://www.trihedral.com/help/Content/Op_Welcome/Wel_UpgradeNotes.htm\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED RESOURCE CONSUMPTION CWE-400\n\nThe client does not properly validate the input or limit the amount of resources that are utilized by an attacker, which can be used to consume more resources than are available.\nCVE-2017-6043 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nCROSS-SITE SCRIPTING CWE-79\n\nA cross-site scripting vulnerability may allow JavaScript code supplied by the attacker to execute within the user's browser.\nCVE-2017-6053 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n\nINFORMATION EXPOSURE CWE-548\n\nSome files are exposed within the web server application to unauthenticated users. These files may contain sensitive configuration information.\nCVE-2017-6045 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nRESEARCHER\nKarn Ganeshen discovered the vulnerabilities and has tested the patch.\nBACKGROUND\nCritical Infrastructure Sectors: Chemical, Critical Manufacturing, Communications, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCountries/Areas Deployed: North America, Europe\nCompany Headquarters Location: Bedford, Nova Scotia, Canada\n",
  "cves": [
    "CVE-2017-6043",
    "CVE-2017-6053",
    "CVE-2017-6045"
  ],
  "techniques": [],
  "advisory": "icsa-17-164-01",
  "title": "Trihedral Engineering Limited VTScada | CISA",
  "source": "ics-advisories",
  "id": "010f699a82fc3da6234e20d2c1854e8412830042344852b981aad5aca505a4cc"
}