{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Keysight\nEquipment: N8844A Data Analytics Web Service\nVulnerability: Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nKeysight reports this vulnerability affects one or more products in the following groups. There are multiple fix dates in these product groups; users are encouraged to visit Keysight's product lookup tool for details:\n\nN8844A Data Analytics Web Service: Version 2.1.7351 and prior\n5G Test SW: all versions\n89600 Vector Signal Analysis SW: versions prior to 6/20/2023\nArbitrary Waveform Generators: all versions\nAutomotive Compliance Apps: versions prior to 4/17/2023\nAXIe Embedded Controllers: versions prior to 6/2/2023\nBenchVue: all versions\nBERTs and Compliance Test SW: all versions\nBoundary Scan Analyzers: versions prior to 4/20/2023\nComponent Analysis SW: versions prior to 4/22/2023\nDevice Current Waveform Analyzers: versions prior to 4/20/2023\nENA Network Analyzers: versions prior to 4/5/2023\nEXM Wireless Test: versions prior to 4/20/2023\nIn-Circuit Parallel Testers: versions prior to 7/21/2023\nInfiniium Oscilloscopes: all versions\nInfiniiVision USB and PXIe Oscilloscope SW: versions prior to 4/17/2023\nLogic Analyzers: versions prior to 4/19/2023\nMassively Parallel Board Test Systems: all versions\nMulti-Band Vector Transceiver Solutions: all versions\nMultiport ECal SW: versions prior to 4/22/2023\nMXE EMI Test Receivers: all versions\nNoise Figure Analyzers: versions prior to 3/24/2023\nOpen RAN Studio: versions prior to 4/21/2023\nOptical Modulation Analyzers: versions prior to 4/13/2023\nOscilloscope Compliance Test SW: all versions\nPathWave Lab Operations for Connectivity: versions prior to 4/7/2023\nPathWave Measurement SW: versions prior to 3/24/2023\nPathWave Test Automation Platform (TAP): all versions\nPhase Noise Test System: versions prior to 3/15/2023\nPNA Network Analyzers: versions prior to 5/4/2023\nPrecision Source/Measure Units: versions prior to 4/20/2023\nPropsim Channel Emulators: versions prior to 5/5/2023\nPXIe Embedded Controllers: versions prior to 5/12/2023\nPXIe Network Analyzers: all versions\nPXIe Signal Analyzers and Generators: all versions\nRadar Target Simulators: all versions\nSampling Oscilloscope Compliance Test SW: all versions\nSignal Generation SW: all versions\nSignal Source Analyzers: versions prior to 7/7/2023\nUSB Network Analyzers: versions prior to 4/22/2023\nUXM 5G Wireless Test: versions prior to 3/24/2023\nVXG Signal Generators: versions prior to 4/27/2023\nVXT PXIe Transceivers: all versions\nWaveJudge Wireless Analyzer Apps: versions prior to 4/5/2023\nX-Series Signal Analyzers: all versions\n\n3.2 Vulnerability Overview\n3.2.1 Deserialization of Untrusted Data CWE-502\nKeysight N8844A Data Analytics Web Service deserializes untrusted data without sufficiently verifying the resulting data will be valid.\nCVE-2023-1967 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Government\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAn anonymous researcher working with Trend Micro Zero Day Initiative reported this vulnerability to CISA.\n4. MITIGATIONS\nKeysight has developed a mitigation for supported Keysight products that contain this vulnerability. They recommend that users install the updated versions as soon as possible. Older versions of impacted software may have this vulnerability; Keysight recommends that users discontinue the use of these older versions and uninstall them. To check whether your products are impacted, and to get the latest versions, use the Keysight Product Lookup Tool.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nApril 25, 2023: Initial Publication\nNovember 21, 2023: Update A - Added affected products and mitigations.\n\n",
  "cves": [
    "CVE-2023-1967"
  ],
  "techniques": [],
  "advisory": "icsa-23-115-01",
  "title": "Keysight N8844A Data Analytics Web Service (Update A) | CISA",
  "source": "ics-advisories",
  "id": "62691fbb5502f65524e77667998475987c803e4b0c629d8c52a0c6e98a2cb6ee"
}