{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: CODESYS, GmbH\nEquipment: CODESYS V2 Runtime Toolkit\nVulnerability: OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow the control programmer to call additional OS functions from the PLC logic utilizing the SysFile system library.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nCODESYS reports all runtime systems for Linux based on a CODESYS V2 Runtime Toolkit 32-bit full prior Version 2.4.7.55 are affected.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OS COMMAND INJECTION CWE-78\nThe CODESYS Control runtime system enables embedded or PC-based devices to operate as programmable industrial controllers. Control programs can access local or remote input/output (I/O) locations, communication interfaces such as serial ports or sockets, and local system functions such as the file system, real-time clock, and other OS functions. An attacker could exploit this vulnerability to call additional OS functions via the SysFile system library.\nCVE-2021-30187 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSergey Fedonin and Ivan Kurnak, of Positive Technologies reported this vulnerability to CODESYS.\n4. MITIGATIONS\nCODESYS GmbH has released CODESYS Runtime Toolkit 32-bit full Version 2.4.7.55 to solve the noted vulnerability issue for the affected CODESYS products.\nPlease visit the CODESYS update area for more information on how to obtain software updates.\nAs part of a security strategy, CODESYS recommends the following general defense measures to reduce the risk of exploits:\n\nUse controllers and devices only in a protected environment to minimize network exposure, ensuring they are not accessible from outside.\nUse firewalls to protect and separate the control system network from other networks.\nUse VPN (virtual private network) tunnels if remote access is required.\nActivate and apply user management and password features.\nUse encrypted communication links.\nLimit access to both development and control system by physical means, operating system features, etc.\nProtect both development and control system operations by using up to date virus detecting solutions.\n\nFor more information and general recommendations for protecting machines and plants, see also the CODESYS Security Whitepaper.\nPlease see CODESYS Advisory 2021-08 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-30187"
  ],
  "techniques": [],
  "advisory": "icsa-21-173-04",
  "title": "CODESYS Control V2 Linux SysFile library | CISA",
  "source": "ics-advisories",
  "id": "a636a565601fd64f5cc1a980d984a83b75478ef8055cc8f0296b3ff5c3bcdbdb"
}