{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: GOT2000 compatible HMI software, CC-Link IE TSN Industrial Managed Switch, MELSEC iQ-R Series OPC UA Server Module\nVulnerabilities: Infinite Loop, OS Command Injection\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-22-221-01 Mitsubishi Electric Multiple Factory Automation Products (Update B) that was published August 30, 2022, to the ICS webpage on cisa.gov/ics. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could create a denial-of-service condition or enable arbitrary code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following version of GT SoftGOT2000 is affected:\n\nGOT2000 compatible HMI software (GT SoftGOT2000): Version 1.275M \nCC-Link IE TSN Industrial Managed Switch (NZ2MHG-TSNT8F2, NZ2MHG-TSNT4): Version 03 and prior [affected by CVE-2022-0778 only] \nMELSEC iQ-R Series OPC UA Server Module (RD81OPC96): Version 08 and prior [affected by CVE-2022-0778 only] \n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    LOOP WITH UNREACHABLE EXIT CONDITION ('INFINITE LOOP') CWE-835\nA vulnerability in OpenSSL creates the potential for an infinite loop in the affected product, which could lead to a denial-of-service condition.\nCVE-2022-0778 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nA vulnerability in OpenSSL creates the potential for OS command injection in the affected product, which could lead to arbitrary code execution.\nCVE-2022-1292 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n5. MITIGATIONS\nMitsubishi Electric recommends the following mitigations for the affected products:\n\nGOT2000 compatible HMI software: Mitsubishi Electric has released a patch for these issues and recommends users update affected products to Version 1.280S or later. Users should contact Mitsubishi Electric to obtain the patch. \n\n--------- Begin Update C part 1 of 1 ---------\n\nCC-Link IE TSN Industrial Managed Switch: Mitsubishi Electric has released fixed firmware for these issues and recommends users update affected products to Version 04 or later. Users should contact Mitsubishi Electric to obtain the fixed firmware version. \n\nTo update affected CC-Link IE TSN Industrial Managed Switch products, log into the product with the web interface and go to [System] → [System Management] → [Firmware Upgrade] from the Function menu after obtaining the updated firmware file. \n\n\n\n--------- End Update C part 1 of 1 ---------\n\nCC-Link IE TSN Industrial Managed Switch: Mitsubishi Electric recommends users to log into NZ2MHG-TSNT8F2 or NZ2MHG-TSNT4 with the web interface and change the username and password from their default setting in [Account Management] on the function menu. They are also recommended to set proper access permissions for different users. \nMELSEC iQ-R Series OPC UA Server Module: Mitsubishi Electric will release fixed software for this device in the near future. Mitsubishi Electric recommends users ensure the OPC UA Client is updated to the latest version and to use legitimate certificates on the OPC UA Client side. \n\nFor instructions on how to check the product version and more information regarding contacting Mitsubishi Electric, refer to Mitsubishi Electric’s security advisory.\nMitsubishi Electric recommends users take the following precautions to minimize the risk of these vulnerabilities being exploited:\n\nWhen internet access is required, use a virtual private network (VPN) to prevent unauthorized access.\nUse the products within a LAN and block access from untrusted networks and hosts.\nFor GOT2000 compatible HMI software: Update the OPC UA server to the latest version available.\nFor GOT2000 compatible HMI software: Install antivirus software on computers running the affected software.\nRestrict physical access to computers running the affected software.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-1292",
    "CVE-2022-0778"
  ],
  "techniques": [],
  "advisory": "icsa-22-221-01",
  "title": "Mitsubishi Electric Multiple Factory Automation Products (Update C) | CISA",
  "source": "ics-advisories",
  "id": "6fc97dba01cc09662dccc58d03e0e09520da908f228c1ba4c89b3abb61e27946"
}