{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SICAM GridEdge\nVulnerability: Exposure of Resource to Wrong Sphere\n\n2. RISK EVALUATION\nThe SICAM GridEdge software contains an improper access control vulnerability, which could allow persons with local access to the host system to inject an SSH key.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SICAM GridEdge are affected:\n\nSICAM GridEdge Essential ARM (6MD7881-2AA30): All versions.\nSICAM GridEdge Essential Intel (6MD7881-2AA40): All versions prior to v2.7.3\nSICAM GridEdge Essential with GDS ARM (6MD7881-2AA10): All versions.\nSICAM GridEdge Essential with GDS Intel(6MD7881-2AA20): All versions prior to v2.7.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXPOSURE OF RESOURCE TO WRONG SPHERE CWE-668\nAffected software uses an improperly protected file to import SSH keys. Attackers with access to the filesystem of the host on which SICAM GridEdge runs can inject a custom SSH key to that file.\nCVE-2022-34464 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends updating to the latest version of its software:\n\nSICAM GridEdge Essential ARM: No fix is currently planned.\nSICAM GridEdge Essential Intel: Update to v2.7.3 or later\nSICAM GridEdge Essential with GDS ARM: Currently no fix is planned.\nSICAM GridEdge Essential with GDS Intel: Update to v2.7.3 or later\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nIf possible, restrict physical access to the device and limit access to the SSH port (22/TCP) to trusted IP addresses\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information, see Siemens Security Advisory SSA-225578\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-34464"
  ],
  "techniques": [],
  "advisory": "icsa-22-195-02",
  "title": "Siemens SICAM GridEdge | CISA",
  "source": "ics-advisories",
  "id": "4f1ae06e231e3d862c6b036ec80d7c6146f3d1fbcb29e7fcb8b7569a35aa4079"
}