{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Marel\nEquipment: Food Processing Systems\nVulnerabilities: Hard-Coded Passwords, Unrestricted Upload, Improper Access Control\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-17-094-02A Marel Food Processing Systems that was published August 17, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following Marel food processing products are affected:\n\nAll M3000 terminal-based products contain hard-coded password and unrestricted file upload vulnerabilities:\n\nGraders using M3000 terminal,\nPortioning Machines using M3000 terminal,\nFlowline systems using M3000 terminal,\nPacking systems using M3000 terminal,\nSensorX machines using M3000 terminal,\nTarget Batchers using M3000 terminal, and\nSpeedBatchers using M3000 terminal.\n\n\n\n\nAll devices operating the Pluto platform contain an access control vulnerability:\n\nGraders using Pluto platform,\nPortioning Machines using Pluto platform,\nFlowline systems using Pluto platform,\nPacking systems using Pluto platform,\nSensorX machines using Pluto platform,\nTarget Batchers using Pluto platform, and\nSpeedBatchers using Pluto platform.\n\n\n\nIMPACT\nA remote attacker may be able to gain unauthorized administrative access to affected devices.\nMITIGATION\n--------- Begin Update B Part 1 of 1 --------\nMarel has released a firewall update for the Pluto platform having version names Pluto1203 and Pluto2. The update for the firewall packages are as follows:\n\nPluto2, Version 1.0.0-gaf7c5e5-pluto2, and\nPluto1203, Version 1.0-0marel0.\n\nThese updates will restrict remote access by implementing SSH authentication.\n--------- End Update B Part 1 of 1 ----------\nMarel has created an update for Pluto-based applications, which was scheduled for release in October, 2017. This update will restrict remote access by implementing SSH authentication.\nMarel reports that all M3000 terminal based products were at end-of-life in July 2012, and, thus, will not release product fixes to address the identified vulnerabilities. Marel recommends that users upgrade these end-of-life systems.\nFurther information regarding the vulnerabilities, mitigations, and Marel’s contact information is available at the following location:\nhttp://marel.com/security-updates\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nRestrict network access to affected systems and ensure that they are not directly accessible from the Internet.\nClose all unused ports on affected systems.\nFollow good network design practices that include network separation and segmentation, use DMZs with properly configured firewalls to selectively control, and monitor all traffic passed between zones and systems.\nMonitor and log all network traffic attempting to reach the affected products for suspicious activity.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nUSE OF HARD-CODED PASSWORDS CWE-259\n\nThe end user does not have the ability to change system passwords.\nCVE-2016-9358 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nUNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\n\nThis vulnerability allows an attacker to modify the operation and upload firmware changes without detection.\nCVE-2017-6041 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nIMPROPER ACCESS CONTROL CWE-284\n\nThe affected systems using the Pluto platform do not restrict remote access.\nCVE-2017-9626 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nDaniel Lance reported these vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sector: Food and Agriculture\nCountries/Areas Deployed: United States, Europe, South America, and Asia\nCompany Headquarters Location: Iceland\n",
  "cves": [
    "CVE-2017-6041",
    "CVE-2017-9626",
    "CVE-2016-9358"
  ],
  "techniques": [],
  "advisory": "icsa-17-094-02b",
  "title": "Marel Food Processing Systems (Update B) | CISA",
  "source": "ics-advisories",
  "id": "d1c7c7c47c13b3ed106ad9527dd9bb5bbc65b105c5a1d96e2519d5c36009bdd3"
}