{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.8\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-R Series C Controller Module R12CCPU-V\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-280-04 Mitsubishi Electric MELSEC iQ-R Series C Controller Module that was published October 7, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could prevent the module from starting up. If successfully exploited, a system reset would be required for recovery.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following modules of the MELSEC iQ-R Series C Controller Module are affected:\n--------- Begin Update B Part 1 of 2 ---------\n\nR12CCPU-V: Firmware Version 16 and prior\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe potential for a denial-of-service condition exists in MELSEC iQ-R series C Controller Module due to uncontrolled resource consumption caused by an attacker sending a large number of packets to the module at start up in a short time.\nCVE-2021-20600 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nMitsubishi Electric Corporation reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update B Part 2 of 2 ---------\nMitsubishi Electric recommends users update affected devices to Firmware Version 17 or later. For specific update instructions and additional details see the Mitsubishi Electric advisory.\n--------- End Update B Part 2 of 2 ---------\nIf a System WDT error occurs at start up, there is a possibility the C Controller Module has been attacked. In this case, disconnect the LAN cable of the module and restart. After confirming the module has started normally, make a LAN connection.\nRegardless of whether the above error occurred, Mitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\nUse a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\n\nFor specific update instructions and additional details see the Mitsubishi Electric advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-20600"
  ],
  "techniques": [],
  "advisory": "icsa-21-280-04",
  "title": "Mitsubishi Electric MELSEC iQ-R Series C Controller Module (Update B) | CISA",
  "source": "ics-advisories",
  "id": "5f5efcd69aa7fd7637dba5b86263751a32ee0f2cc885fddc3754ea03735d7fdb"
}