{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.7\nATTENTION: Low attack complexity\nVendor: Rockwell Automation\nEquipment: Studio 5000 Logix Designer\nVulnerability: Code Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to download a modified program to the controller.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports this vulnerability affects the following Studio 5000 Logix Designer design, configuration hardware, and software products:\n\nControlLogix 5580 controllers\nGuardLogix 5580 controllers\nCompactLogix 5380 controllers\nCompactLogix 5480 controllers\nCompact GuardLogix 5380 controllers\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER CONTROL OF GENERATION OF CODE (CODE INJECTION) CWE-94\nAn attacker who achieves administrator access on a workstation running Studio 5000 Logix Designer could inject controller code undetectable to a user.\nCVE-2022-1159 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov and Tal Keren of Claroty reported this vulnerability to Rockwell Automation.\n4. MITIGATIONS\nRockwell Automation recommends users of the affected hardware and software take risk mitigation steps listed below. Users are encouraged, when possible, to combine this guidance with the general security guidelines for a comprehensive defense-in-depth strategy.\nThere is no direct mitigation for this vulnerability in the Logix Designer application. However, a detection method is available to determine if the user program residing in the controller is identical to what was downloaded. This user program verification can be done by the following:\n\nOn-demand using the Logix Designer application Compare Tool v9 or later\nScheduled using FactoryTalk AssetCentre v12 or later user program verification (Available Fall 2022)\n\nTo leverage these detection capabilities, users are directed to upgrade to:\n\nStudio 5000 v34 software. or later\nCorresponding versions of Logix 5580, 5380, 5480, GuardLogix 5580 and Compact GuardLogix 5380 controller firmware.\nOne of the following compare tools\n\nLogix Designer application Compare Tool v9 or later – installed with Studio 5000 Logix Designer\nFactoryTalk AssetCentre v12 or later software (Available Fall 2022)\n\n\n\nThis user program comparison must be performed on an uncompromised workstation.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-1159"
  ],
  "techniques": [],
  "advisory": "icsa-22-090-07",
  "title": "Rockwell Automation Studio 5000 Logix Designer | CISA",
  "source": "ics-advisories",
  "id": "542a636786218d5b66e08153eef9a6b04118e24779866879c9d650968f015a77"
}