{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\n\n--------- Begin Update H Part 1 of 3 ---------\n\nATTENTION: Exploitable remotely/public exploits are available\n\n--------- End Update H Part 1 of 3 ---------\n\nVendor: Treck Inc.\nEquipment: TCP/IP\nVulnerabilities: Improper Handling of Length Parameter Inconsistency, Improper Input Validation, Double Free, Out-of-bounds Read, Integer Overflow or Wraparound, Improper Null Termination, Improper Access Control\n\nCISA is aware of a public report, known as “Ripple20” that details vulnerabilities found in the Treck TCP/IP stack. CISA is issuing this advisory to provide early notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\nThe Treck TCP/IP stack may be known by other names such as Kasago TCP/IP, ELMIC, Net+ OS, Quadnet, GHNET v2, Kwiknet, or AMX.\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-168-01 Treck TCP/IP Stack (Update G) that was published Aug 20, 2020, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow remote code execution or exposure of sensitive information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe Treck TCP/IP stack is affected including:\n\nIPv4\nIPv6\nUDP\nDNS\nDHCP\nTCP\nICMPv4\nARP\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER HANDLING OF LENGTH PARAMETER INCONSISTENCY CWE-130\nImproper handling of length parameter inconsistency in IPv4/UDP component when handling a packet sent by an unauthorized network attacker. This vulnerability may result in remote code execution.\nCVE-2020-11896 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.2    IMPROPER HANDLING OF LENGTH PARAMETER INCONSISTENCY CWE-130\nImproper handling of length parameter inconsistency in IPv6 component when handling a packet sent by an unauthorized network attacker. This vulnerability may result in possible out-of-bounds write.\nCVE-2020-11897 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.3    IMPROPER HANDLING OF LENGTH PARAMETER INCONSISTENCY CWE-130\nImproper handling of length parameter inconsistency in IPv4/ICMPv4 component when handling a packet sent by an unauthorized network attacker. This vulnerability may result in out-of-bounds Read.\nCVE-2020-11898 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H).\n4.2.4    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in IPv6 component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow out-of-bounds Read and a possible Denial of Service.\nCVE-2020-11899 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:L).\n4.2.5    DOUBLE FREE CWE-415\nPossible double free in IPv4 tunneling component when handling a packet sent by a network attacker. This vulnerability may result in use after free.\nCVE-2020-11900 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n4.2.6    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in DNS resolver component when handling a packet sent by an unauthorized network attacker. This vulnerability may result in remote code execution.\nCVE-2020-11901 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.7    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in IPv6 over IPv4 tunneling component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow out-of-bounds Read.\nCVE-2020-11902 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.8    OUT-OF-BOUNDS READ CWE-125\nPossible out-of-bounds read in DHCP component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow exposure of sensitive information.\nCVE-2020-11903 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.9    INTEGER OVERFLOW OR WRAPAROUND CWE-190\nPossible integer overflow or wraparound in memory allocation component when handling a packet sent by an unauthorized network attacker may result in out-of-bounds write.\nCVE-2020-11904 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.10    OUT-OF-BOUNDS READ CWE-125\nPossible out-of-bounds read in DHCPv6 component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow exposure of sensitive information.\nCVE-2020-11905 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.11    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation CWE-20 in ethernet link layer component from a packet sent by an unauthorized user. \nCVE-2020-11906 has been assigned to this vulnerability. A CVSS v3 base score of 5.0 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.12    IMPROPER HANDLING OF LENGTH PARAMETER INCONSISTENCY CWE-130\nImproper handling of length parameter inconsistency in TCP component, from a packet sent by an unauthorized network attacker.\nCVE-2020-11907 has been assigned to this vulnerability. A CVSS v3 base score of 5.0 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.13    IMPROPER NULL TERMINATION CWE-170\nImproper null termination in DHCP component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow exposure of sensitive information.\nCVE-2020-11908 has been assigned to this vulnerability. A CVSS v3 base score of 3.1 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L).\n4.2.14    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in IPv4 component when handling a packet sent by an unauthorized network attacker.\nCVE-2020-11909 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.15    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in ICMPv4 component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow out-of-bounds Read.\nCVE-2020-11910 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.16    IMPROPER ACCESS CONTROL CWE-284\nThe affected product is vulnerable to improper access control, which may allow an attacker to change one specific configuration value.\nCVE-2020-11911 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L).\n4.2.17    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in TCP component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow out-of-bounds Read..\nCVE-2020-11912 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L).\n4.2.18    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in IPv6 component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow out-of-bounds Read.\nCVE-2020-11913 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.19    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in ARP component when handling a packet sent by an unauthorized network attacker. This vulnerability may allow out-of-bounds Read.\nCVE-2020-11914 has been assigned to this vulnerability. A CVSS v3 base score of 3.1 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Critical Manufacturing, Information Technology, Healthcare and Public Health, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nShlomi Oberman and Moshe Kol from JSOF reported these vulnerabilities to CERT/CC.\n5. MITIGATIONS\nTreck recommends users apply the latest version of the affected products (Treck TCP/IP 6.0.1.67 or later versions). To obtain patches, email security@treck.com\nFor more detailed information on the vulnerabilities and the mitigating controls, please see the Treck advisory. Additional vendors affected by the reported vulnerabilities have also released security advisories related to their affected products. Those advisories are as follows:\n\nABB\nB.Braun\nBaxter\nBD\nCareStream\nCaterpillar\nDIGI International\nEaton\nGreen Hills Software\nJohnson Controls\nMiele\nOpto 22\n\n--------- Begin Update H Part 2 of 3 ---------\n\nPepperl+Fuchs\n\n--------- End Update H Part 2 of 3 ---------\n\nRockwell\nSchneider Electric\nSmiths Medical\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n--------- Begin Update H Part 3 of 3 ---------\nThis vulnerability has a high attack complexity.\n--------- End Update H Part 3 of 3 ---------\n",
  "cves": [
    "CVE-2020-11904",
    "CVE-2020-11908",
    "CVE-2020-11901",
    "CVE-2020-11913",
    "CVE-2020-11914",
    "CVE-2020-11912",
    "CVE-2020-11903",
    "CVE-2020-11907",
    "CVE-2020-11899",
    "CVE-2020-11896",
    "CVE-2020-11905",
    "CVE-2020-11898",
    "CVE-2020-11906",
    "CVE-2020-11902",
    "CVE-2020-11909",
    "CVE-2020-11911",
    "CVE-2020-11910",
    "CVE-2020-11900",
    "CVE-2020-11897"
  ],
  "techniques": [],
  "advisory": "icsa-20-168-01",
  "title": "Treck TCP/IP Stack (Update H) | CISA",
  "source": "ics-advisories",
  "id": "f524aefe6e33f16ccb70a0ba49b81c44764f0cb4b976fc7a826bface59cefbbb"
}