{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/Low skill level to exploit\nVendor: AVEVA Software, LLC (AVEVA)\nEquipment: Wonderware License Server\nVulnerability: Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may result in remote code execution with administrative privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Wonderware License Server use the vulnerable Flexara Imgrd (Versions 11.13.1.1 and prior):\n\nWonderware License Server v4.0.13100 and prior.\n\nOnly users with the Counted Licenses feature with “ArchestrAServer.lic” in Wonderware License Server are affected.Wonderware License Server is delivered by:\n\nWonderware Information Server 4.0 SP1 and prior, and\nHistorian Client 2014 R4 SP2 P02 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nBuffer overflows in lmgrd and vendor daemon in Flexera FlexNet Publisher may allow remote attackers to execute arbitrary code via a crafted packet, resulting in remote code execution with administrator privileges.\nCVE-2015-8277 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, and Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nAn anonymous researcher reported this vulnerability to AVEVA, who then reported it to NCCIC.\n4. MITIGATIONS\nAVEVA recommends affected users install update “Hotfix Wonderware License Server VU-485744” or later, which can be downloaded from:\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=5076 (login required)\nAVEVA has published Security Bulletin LFSEC00000129. It can be found at the following location:\nhttps://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityBulletin_LFSec129.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2015-8277"
  ],
  "techniques": [],
  "advisory": "icsa-18-212-05",
  "title": "AVEVA Wonderware License Server | CISA",
  "source": "ics-advisories",
  "id": "71e1f6f3a2f69c32015d65eb59a42469aced52caa46d727779532ebdf30514ea"
}