{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Johnson Controls, Inc.\nEquipment: Metasys ADS/ADX/OAS Servers\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated user to elevate their privileges to administrator.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports this vulnerability affects the following Metasys ADS/ADX/OAS Servers:\n\nAll Metasys ADS/ADX/OAS Servers: Versions 10 and 11\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nUnder certain circumstances, an authenticated user could elevate their privileges to administrator.\nCVE-2021-36207 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls, Inc. reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls recommends upgrading to the current version of Metasys:\n\nUpdate all Metasys ADS/ADX/OAS Servers: Versions 10 with patch 10.1.5\nUpdate all Metasys ADS/ADX/OAS Servers: Versions 11 with patch 11.0.2\n\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2022-08 v1\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-36207"
  ],
  "techniques": [],
  "advisory": "icsa-22-118-01",
  "title": "Johnson Controls Metasys | CISA",
  "source": "ics-advisories",
  "id": "cc063bd02e0ebfe3057dc6a05d1eefc32de477ab4f5be8e097ee9cceea8fc363"
}