{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.8\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: SINAMICS PERFECT HARMONY GH180\nVulnerability: Protection Mechanism Failure\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized attacker with physical access to the affected device to restart the HMI with disabled security controls, which could be used to launch further attacks against the affected device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SINAMICS PERFECT HARMONY GH180, a voltage converter, are affected:\n\nAll versions of SINAMICS PERFECT HARMONY GH180 Drives:\n\nMLFB 6SR32..-. . . ..-. . . .\nMLFB 6SR4. . . -. . . ..-. . . .\nMLFB 6SR5. . . -. . . ..-. . . ., with option A30 (HMIs 12 inches or larger)\n\n\nAll versions of SINAMICS PERFECT HARMONY GH180 Drives:\n\nMLFB 6SR325.-. . . ..-. . . . (High Availability)\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PROTECTION MECHANISM FAILURE CWE-693\nThe affected device contains a vulnerability that could allow an unauthenticated attacker to restore the affected device to a point where predefined application and operating system protection mechanisms are not in place.\nCVE-2019-19278 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens PSIRT reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends that affected users contact customer support to obtain configuration changes. Detailed instructions are available through customer support. Siemens notes that no other specific mitigations or workarounds have been identified.\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on this vulnerability, please see Siemens security advisory SSA-242353\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-19278"
  ],
  "techniques": [],
  "advisory": "icsa-20-014-04",
  "title": "Siemens SINAMICS PERFECT HARMONY GH180 | CISA",
  "source": "ics-advisories",
  "id": "9faa87f50392ca2ddb7b285d2ad10a225626ebd2db58b542e495e331c1b1b6b3"
}