{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.4\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SINUMERIK Edge\nVulnerability: Improper Certificate Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to spoof a trusted entity by interfering in the communication path between the client and the intended server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SINUMERIK Edge, a hardware and software digital production support and optimization platform, are affected:\n\nSINUMERIK Edge: All versions prior to 3.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER CERTIFICATE VALIDATION CWE-295\nThe affected software does not properly validate the server certificate when initiating a TLS connection. This could allow an attacker to spoof a trusted entity by interfering in the communication path between the client and the intended server.\nCVE-2021-42027 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends users update SINUMERIK Edge to Version 3.2 or later version. Use the internal update mechanism of the devices to perform the update.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals.\nFor more information about this issue, please see Siemens security advisory SSA-523250\nFor further inquiries on security vulnerabilities in Siemens products and solutions, please contact Siemens ProductCERT.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-42027"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-09",
  "title": "Siemens SINUMERIK Edge | CISA",
  "source": "ics-advisories",
  "id": "426249c5e637b8f6cd51a70f860a9d48d3571ca93f9571f46e44f244646c166c"
}