{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely/public exploits are available\nVendor: Siemens\nEquipment: SIMATIC RF6XXR\nVulnerabilities: Improper Input Validation, Cryptographic Issues\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow access to sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerabilities affect all versions prior to 3.2.1 of the following SIMATIC RF6XXR UHF RFID products:\n\nRF615R\nRF68XR\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe SSL protocol encrypts data by using CBC mode with chained initialization vectors, which may allow a man-in-the-middle attack to obtain plaintext HTTP headers.\nCVE-2011-3389 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n\n3.2.2    CRYPTOGRAPIC ISSUES CWE-310\nLong-duration TLS sessions used with a 64-bit block cipher may allow remote attackers to obtain cleartext data.\nCVE-2016-6329 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n\n3.2.3    CRYPTOGRAPIC ISSUES CWE-310\nOutdated versions of TLS and DTLS allow statistical analysis of timing data for crafted packets, which may allow remote attackers to conduct distinguishing and plaintext-recovery attacks.\nCVE-2013-0169 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Food and Agriculture, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nWendy Parrington from United Utilities reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens recommends users upgrade to Version 3.2.1 or newer for both affected products.\n\nSiemens also recommends users restrict network access to the device.\n\nFor more information on these vulnerabilities and associated software updates, please see Siemens’ security advisory SSA-556833 at: https://www.siemens.com/cert/advisories.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nHigh skill level is needed to exploit.\n",
  "cves": [
    "CVE-2016-6329",
    "CVE-2013-0169",
    "CVE-2011-3389"
  ],
  "techniques": [],
  "advisory": "icsa-19-192-04",
  "title": "Siemens SIMATIC RF6XXR | CISA",
  "source": "ics-advisories",
  "id": "a2f84e86d2de864358e547f25edb040adfc2db073660e4e730b53181fdda7fd8"
}