{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: LOGO!\nVulnerability: Missing Authentication for Critical Function\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-161-03 Siemens LOGO! that was published June 9, 2020, to the ICS webpage on us-cert.gov\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to read and modify device configurations and obtain project files from affected devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of LOGO! are affected:\n\nLOGO!8 BM (incl. SIPLUS variants): All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product is missing authentication, which could allow an attacker with access to Port 135/TCP to read and modify the device configuration and obtain project files from the devices.\nCVE-2020-7589 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nAlexander Perez-Palma of Cisco Talos and Emanuel Almeida of Cisco Systems reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens recommends applying defense-in-depth concepts, including the protection concept outlined in the system manual.\n--------- Begin Update A Part 1 of 1 ---------\nStarting with Version 8.3 of LOGO! 8 BM, Port 135/TCP can be disabled. It is recommended to disable this port when possible.\n--------- End Update A Part 1 of 1 ---------\nSiemens recommends following their general security recommendations. As a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-817401\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-7589"
  ],
  "techniques": [],
  "advisory": "icsa-20-161-03",
  "title": "Siemens LOGO! (Update A) | CISA",
  "source": "ics-advisories",
  "id": "a1069f535996b8da3a4cb45fb3efda05258b3ce2eff8f9714d31ddac8e06b381"
}