{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: 3S-Smart Software Solutions GmbH\nEquipment: CODESYS V3 web server\nVulnerabilities: Path Traversal, Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to create a denial-of-service condition, to perform remote code execution, or to access restricted files.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following CODESYS V3 runtime systems, all versions prior to 3.5.14.10, containing the web server (CmpWebServer) are affected:\n\nCODESYS Control for BeagleBone\nCODESYS Control for emPC-A/iMX6\nCODESYS Control for IOT2000\nCODESYS Control for Linux\nCODESYS Control for PFC100\nCODESYS Control for PFC200\nCODESYS Control for Raspberry Pi\nCODESYS Control RTE V3\nCODESYS Control RTE V3 (for Beckhoff CX)\nCODESYS Control Win V3 (also part of the CODESYS Development System setup)\nCODESYS HMI V3\nCODESYS Control V3 Runtime System Toolkit\nCODESYS V3 Embedded Target Visu Toolkit\nCODESYS V3 Remote Target Visu Toolkit\n\nIn CODESYS V3, the web server is an optional part of the CODESYS runtime system.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nSpecially crafted http or https requests may allow an attacker access to files outside the restricted working directory of the controller.\nCVE-2019-13532 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nSpecially crafted http or https requests could cause a stack overflow, which may create a denial-of-service condition or allow remote code execution.\nCVE-2019-13548 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nIvan Cheyrezy of Schneider Electric reported this vulnerability to 3S-Smart Software Solutions GmbH.\n4. MITIGATIONS\n3S-Smart Software Solutions GmbH has released Versions 3.5.12.80, 3.5.14.10, and 3.5.15.0 to resolve the vulnerabilities for the affected CODESYS products.\nPlease visit the CODESYS update page for more information on how to obtain the software update: https://www.codesys.com/download/ \nUpdating to Version 3.5.14.10 or higher is recommended over Version 3.5.12.80, which does not resolve the vulnerabilities for all affected products. Further details from 3S-Smart Software Solutions GmbH can be found in a security report at the following link:\nhttps://www.codesys.com/fileadmin/data/customers/security/2019/Advisory2019-01_CDS-64543.pdf\nAs part of a security strategy, 3S-Smart Software Solutions GmbH recommends the following general defense measures to reduce the risk of exploits:\n\nUse controllers and devices only in a protected environment to minimize network exposure and ensure that they are not accessible from outside.\nUse firewalls to protect and separate the control system network from other networks.\nUse VPN (virtual private networks) tunnels if remote access is required.\n Activate and apply user management and password features.\nLimit the access to both development and control system by physical means, operating system features, etc.\nProtect both development and control system by using up-to-date virus detecting solutions. For more information and general recommendations for protecting machines and plants, see also the CODESYS security whitepaper at https://customers.codesys.com/fileadmin/data/customers/security/CODESYS-Security-Whitepaper.pdf\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-13548",
    "CVE-2019-13532"
  ],
  "techniques": [
    "T2000"
  ],
  "advisory": "icsa-19-255-01",
  "title": "3S-Smart Software Solutions GmbH CODESYS V3 Web Server | CISA",
  "source": "ics-advisories",
  "id": "3f456b80c9e3331e081ebbb85584ab6e3231dd786bdac992b472e77e682d9a5f"
}