{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Honeywell\nEquipment: IP-AK2\nVulnerability: Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to download configuration files directly through a URL without authentication, exposing configuration and authorized visitor information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of IP-AK2, Access Control Panel, are affected:\n\nIP-AK2 Access Control Panel Version 1.04.07 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe integrated web server of the affected devices could allow remote attackers to obtain web configuration data, which can be accessed without authentication over the network.\nCVE-2019-13525 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMaxim Rupp reported this vulnerability to Honeywell.\n4. MITIGATIONS\nHoneywell released new firmware Version 1.04.15 and recommends affected users contact Honeywell customer support to resolve the issue.\nHoneywell recommends users take the following defensive measures:\n\nUpgrade firmware of vulnerable instruments with help from Honeywell after sales support.\nAllow only trusted persons to physically access the target system, including devices that have connection to the system through the Ethernet port.\nIf possible, isolate target system from the Internet or create additional layers of defense to target system from the Internet by placing the affected hardware behind a firewall or into a DMZ.\nIf remote connections to the network are required, consider using a VPN or other means to ensure secure remote connections into the network where the device is located.\n\nFor additional information refer to the Honeywell Product Security Bulletin 2018-HBT.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13525"
  ],
  "techniques": [],
  "advisory": "icsa-19-297-02",
  "title": "Honeywell IP-AK2 | CISA",
  "source": "ics-advisories",
  "id": "4031515a0431e068c0d64b1f86b454ca86a5a552df5ee9847961d9b2cacaa644"
}