{
  "markdown": " Wonderware InBatch ActiveX Vulnerabilities (Update A) \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryWonderware InBatch ActiveX Vulnerabilities (Update A)===================================================== Last Revised September 06, 2018 Alert Code ICSA\\-11\\-332\\-01AOverview-------- ICS\\-CERT originally released advisory “ICSA\\-11\\-332\\-01P—Invensys Wonderware InBatch ActiveX Vulnerabilities” in the US\\-CERT secure portal on November 28, 2011\\. This web page release was delayed to allow users time to download and install the update. Researcher Kuang\\-Chun Hung of the Security Research and Service Institute−Information and Communication Security Technology Center (ICST) has identified three vulnerabilities in Invensys Wonderware InBatch. These vulnerabilities exist in the GUIControls, BatchObjSrv, and BatchSecCtrl ActiveX controls. Successful exploitation of these vulnerabilities could allow an attacker to execute arbitrary code or cause a denial of service (DoS) on systems with affected versions of Wonderware InBatch Runtime Client components. ICS\\-CERT has coordinated the report with the ICST and Invensys. Invensys has issued software updates that resolve these vulnerabilities. The ICST has confirmed the software updates fully resolve the reported vulnerabilities.Affected Products----------------- The following Invensys Wonderware InBatch versions are affected:* 8\\.1 SP1, 9\\.0 SP2, and 9\\.5\\-\\-InBatch Server and Runtime Clients* 9\\.0 and 9\\.0 SP1\\. The affected components exist in a variety of Wonderware products including InTouch and Information Server browser clients that have downloaded converted windows that contain these controls. According to Invensys, I/A Series Batch 8\\.1 SP1 and Wonderware InBatch 9\\.5 SP1 and higher are not affected by these vulnerabilities.Impact------ If successfully exploited, these vulnerabilities could allow an attacker to execute arbitrary code on systems running affected versions of the product. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.Background---------- Invensys Wonderware InBatch is used in many industries worldwide including manufacturing, energy, food and beverage, chemical, and water and wastewater. The InBatch Runtime Client provides an interface to the batch management system to allow operator interaction during the batch execution.Vulnerability Characterization------------------------------### Vulnerability Overview Affected versions of the InBatch Runtime Client components contain three buffer overflowhttp://cwe.mitre.org/data/definitions/121\\.html, website accessed November 28, 2011\\., http://cwe.mitre.org/data/definitions/122\\.html, website accessed November 28, 2011\\. vulnerabilities. These vulnerabilities could be exploited by using long string values for the properties/methods of the referenced controls. This could result in either a DoS or remote code execution running with privileges of the logged\\-in user.### **\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin Update A Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-**[CVE\\-2011\\-4870](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4870)  has been assigned to this vulnerability. Invensys has assessed the vulnerabilities using the CVSShttp://nvd.nist.gov/cvss.cfm, website last accessed January 03, 2012\\. Version 2\\.0 calculator and gives the Overall CVSS \\= 6\\.0\\. Click here to review the assessment.### **\\-\\-\\-\\-\\-\\-\\-\\-\\- End Update A Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable. This exploit may require social engineering.#### Existence of Exploit No publicly known exploits specifically target these vulnerabilities.#### Difficulty An attacker with a low skill level can create the DoS; a more skilled attacker could exploit the vulnerability to execute arbitrary code.Mitigation---------- Invensys has developed software updates to address the reported vulnerabilities. Invensys recommends that customers who are running vulnerable versions of Wonderware InBatch update their systems to either InBatch 9\\.0 SP2 or 9\\.5 on all nodes that have the InBatch client runtime and the InBatch Server installed. Installation does not require a reboot. Customers can download updates from the “Software Download” section of the [Invensys Customer First Support website](https://wdn.wonderware.com/sites/WDN/Pages/Downloads/Software.aspx)  . Follow the instructions in the ReadMe section for the product and component to install the software update. In addition to applying the software updates, Invensys has made additional recommendations to customers running vulnerable versions of the Invensys Wonderware InBatch product:* Set the security level settings for the Internet browser to Medium−High to minimize the risk of a vulnerability exploit.* Reference the Invensys Securing Industrial Control Systems Guide for additional information on securing industrial control systems operating in a Microsoft Windows environment. To access information related to Invensys security updates, customers can logon to the [Cyber Security Updates website](https://wdn.wonderware.com/sites/WDN/Pages/Security Central/default.aspx)  and the GCS Foxboro [Wonderware Security Releases webpage](http://support.ips.invensys.com/content/WDN/HTM/ww_security.asp.)  . ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks:1. Do not click web links or open unsolicited attachments in e\\-mail messages.2. Refer to [*Recognizing and Avoiding Email Scams*](/reading_room/emailscams_0905.pdf) for more information on avoiding e\\-mail scams.3. Refer to [*Avoiding Social Engineering and Phishing Attacks*](/cas/tips/ST04-014.html) for more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Invensys-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-332-01a)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-4870"
  ],
  "techniques": [],
  "advisory": "icsa-11-332-01a",
  "title": "Wonderware InBatch ActiveX Vulnerabilities (Update A) | CISA",
  "source": "ics-advisories",
  "id": "8af4e8f345e717fd1cd13d6eabb97617b63499926beedf5235ad1993dc5d9ce9"
}