{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: APOGEE and TALON\nVulnerability: Classic Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code on the device with root privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products are affected:\n\nAPOGEE MBC (PPC) (P2 Ethernet): v2.6.3 and newer\nAPOGEE MEC (PPC) (P2 Ethernet): v2.6.3 and newer\nAPOGEE PXC Compact (BACnet): All versions prior to v3.5.3\nAPOGEE PXC Compact (P2 Ethernet): v2.8 and newer\nAPOGEE PXC Modular (BACnet): All versions prior to v3.5.3\nAPOGEE PXC Modular (P2 Ethernet): v2.8 and newer\nTALON TC Compact (BACnet): All versions prior to v3.5.3\nTALON TC Modular (BACnet): All versions prior to v3.5.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT (‘CLASSIC BUFFER OVERFLOW') CWE-120\nThe web server of affected devices lacks proper bounds checking when parsing specific requests, which could lead to a buffer overflow. An unauthenticated remote attacker could exploit this vulnerability to execute arbitrary code on the device with root privileges.\nCVE-2021-27391 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nPaul Noalhyt and David Doggett from Red Balloon Security reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends updating the following products to v3.5.3 or later (login required):\n\nAPOGEE PXC Compact (BACnet)\nAPOGEE PXC Modular (BACnet)\nTALON TC Compact (BACnet)\nTALON TC Modular (BACnet)\n\nFor products not listed above Siemens has recommended the following workarounds and mitigations:\n\nContact a Siemens office for support.\nRestrict access to the device, especially to the web interface. 80/TCP and 443/TCP should only be connected to trusted IP addresses.\nDisable the integrated web server.\n\nAs a general security measure, Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices to run the devices in a protected IT environment.\nFor more information see Siemens Security Advisory SSA-944498\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27391"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-07",
  "title": "Siemens APOGEE and TALON | CISA",
  "source": "ics-advisories",
  "id": "6c0334e8ac356d4d6f9c0212ebaf9330e804ecede202602112286576b38ef0d8"
}