{
  "markdown": "\nOVERVIEW\nIndependent researcher Billy Rios has identified four vulnerabilities in Hospira’s MedNet server software. Hospira has released a new version of the MedNet software and provided mitigation recommendations that mitigate the reported vulnerabilities.\nThree of the four vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following MedNet software versions are affected:\n\nMedNet software Version 5.8 and prior versions.\n\nIMPACT\nExploitation of these vulnerabilities may allow an attacker to remotely compromise MedNet servers and push unauthorized modifications to medication libraries and pump configurations.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nHospira is a US-based company that maintains offices in several countries around the world.\nThe MedNet server software manages drug libraries, firmware updates, and configurations of Hospira intravenous pumps. The affected products are deployed across the Healthcare and Public Health Sector. Hospira estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nHARD-CODED CRYPTOGRAPHIC KEYCWE-321: Use of Hard-coded Cryptographic Key, http://cwe.mitre.org/data/definitions/321.html, web site last accessed March 31, 2015.\n\nThe MedNet software uses hard-coded cryptographic keys that could enable an attacker to intercept encrypted traffic from infusion pumps.\nCVE-2014-5403NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-5403, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:S/C:C/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:S/C:C/I:N/A:N, web site last accessed March 31, 2015.\n\nHARD-CODED PASSWORDCWE-259: Use of Hard-coded Password, http://cwe.mitre.org/data/definitions/259.html, web site last accessed March 31, 2015.\n\nThe MedNet software contains plaintext storage of passwords for the SQL database that may allow an attacker to compromise the MedNet SQL server and gain administrative access to the workstation.\nCVE-2014-5405NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-5405, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 9.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:S/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:S/C:C/I:C/A:C, web site last accessed March 31, 2015.\n\nPASSWORD IN CONFIGURATION FILECWE-260: Password in Configuration File, http://cwe.mitre.org/data/definitions/260.html, web site last accessed March 31, 2015.\n\nThe MedNet software stores clear text usernames and passwords on the local file system that were used during the installation process that may allow a malicious user to compromise the MedNet installation.\nCVE-2014-5400NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-5400, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 6.8 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:S/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:S/C:C/I:C/A:C, web site last accessed March 31, 2015.\n\nIMPROPER CONTROL OF GENERATION OF CODECWE-94: Improper Control of Generation of Code ('Code Injection'), http://cwe.mitre.org/data/definitions/94.html, web site last accessed March 31, 2015.\n\nThe MedNet software uses vulnerable versions of the JBoss Enterprise Application Platform software that may allow unauthenticated users to execute arbitrary code on the target system.\nCVE-2014-5401NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-5401, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:C/I:C/A:C, web site last accessed March 31, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThree of the four vulnerabilities could be exploited remotely. The Password in Configuration File vulnerability is locally exploitable.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nHospira has developed a new version of the MedNet software, MedNet 6.1. Hospira reports that MedNet 6.1 no longer uses hard-coded passwords, hard-coded cryptographic keys, and no longer stores passwords in clear text. Existing versions of MedNet can be upgraded to MedNet 6.1.\nHospira has produced mitigation recommendations that help mitigate the vulnerability in the vulnerable version of JBoss Enterprise Application Platform software, used in the MedNet software. This has been addressed by Hospira through issuance of the following knowledge based articles: Improving Security in Hospira MedNet 5.5 (August 2014) and Improving Security in Hospira MedNet 5.8 (August 2014). For additional information about Hospira’s new releases and mitigation recommendations, contact Hospira’s technical support at 1-800-241-4002.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMaintain layered physical and logical security to implement defense-in-depth security practices for environments operating medical devices.\nMinimize network exposure for all medical devices and/or systems, and ensure that they are not accessible from the Internet.\nProduce an MD5 checksum of key files to identify any changes to files.\nFollow good network design practices that include network separation and segmentation; use DMZs with properly configured firewalls to selectively control traffic; and monitor traffic passed between zones and systems to identify anomalous activity.\nLocate all medical devices and/or systems behind firewalls, and isolate them from the business network. Use the static nature of these isolated environments to look for anomalous activities.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2014-5401",
    "CVE-2014-5403",
    "CVE-2014-5400",
    "CVE-2014-5405"
  ],
  "techniques": [],
  "advisory": "icsa-15-090-03",
  "title": "Hospira MedNet Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "b72ba1f906ab4edf30ecefa218d027538aaa77037dc14f0ac7c377c63d7af2b5"
}