{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3 \nATTENTION: Exploitable remotely/low attack complexity\nVendor: HID Global\nEquipment: SAFE\nVulnerabilities: Modification of Assumed-Immutable Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in exposure of personal data or create a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of HID’s SAFE, a personnel and access management software, are affected:\n\nHID SAFE using the optional External Visitor Manager portal: Versions 5.8.0 through 5.11.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 MODIFICATION OF ASSUMED-IMMUTABLE DATA CWE-471 \nThe External Visitor Manager portal of HID’s SAFE versions 5.8.0 through 5.11.3 are vulnerable to manipulation within web fields in the application programmable interface (API). An attacker could log in using account credentials available through a request generated by an internal user and then manipulate the visitor-id within the web API to access the personal data of other users. There is no limit on the number of requests that can be made to the HID SAFE Web Server, so an attacker could also exploit this vulnerability to create a denial-of-service condition.\nCVE-2023-2904 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Government Facilities, Transportation, Commercial Facilities, Healthcare\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nCISA internal research reported this vulnerability to HID.\n4. MITIGATIONS\nThe External Visitor Management feature is licensed and deployed separately from the HID SAFE core software. Users not using this feature are not affected. According to HID Global, the number of affected systems is limited and all affected systems have been patched.\nPlease see HID’s security advisory for more information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-2904"
  ],
  "techniques": [],
  "advisory": "icsa-23-152-02",
  "title": "HID Global SAFE | CISA",
  "source": "ics-advisories",
  "id": "745b30b509425c716ba2be6a602e3b2e3384bdac169777c585c222113169a0bd"
}