{
  "markdown": "\nOverview\nICS-CERT has received a report from the Zero Day Initiative (ZDI) concerning a heap-based buffer overflow vulnerability in WellinTech’s Kingview HistoryServer.exe, which may allow a remote, unauthenticated attacker to execute arbitrary code. This vulnerability was reported to ZDI by independent security researcher Luigi Auriemma.\nWellinTech has produced a patch that is available for download from its website.\nAffected Products\nThe following WellinTech KingView version is affected:\n\nKingView V65.30.2010.18018\n\nImpact\nSuccessful exploitation of the heap overflow vulnerability could allow a remote attacker to cause the service to crash, and also may allow the execution of arbitrary code.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nWellinTech is a software development company specializing in the Automation and Control industry based in Beijing, China. According to WellinTech, they also have branches in United States, Japan, Singapore, Europe, and Taiwan.\nAccording to the WellinTech, KingView is a Windows-based control, monitoring and data collection application used across several sectors including power, water, building automation, mining, and other sectors.\nVulnerability Characterization\nVulnerability Overview\nAn attacker can exploit this vulnerability by sending a specially crafted packet to Port 777/TCP that exceeds a specified length and contains executable code.\nCVE-2011-4536 has been assigned to this vulnerability. A CVSS V2 base score of 10 has also been assigned.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo known exploits specifically target this vulnerability.\nDifficulty\nAn attacker would require an intermediate skill level to exploit this vulnerability.\nMitigation\nWellinTech has created a patch and instructions for installation that is available for download on its website at:\n\nEnglish: http://en.wellintech.com/news/detail.aspx?contentid=166\nChinese: http://www.kingview.com/news/detail.aspx?contentid=587\n\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nImplement network or host-based firewall rules to limit network access to Port 777/TCP.\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks  for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2011-4536"
  ],
  "techniques": [],
  "advisory": "icsa-11-355-02",
  "title": "WellinTech KingView History Server Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "66fc2d4d2efba633a0b11f6b5a263f3b3bf40ee6b7ad70f6b66ddd7fcfd72e69"
}