{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: ROX II\nVulnerabilities: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow valid users to escalate their privileges and execute arbitrary commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following ROX II products:\n\nROX II: All versions prior to v2.12.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nAn attacker with network access to Port 22/TCP and valid low-privileged user credentials for the target device could perform a privilege escalation and gain root privileges.\nCVE-2018-13801 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nAn authenticated attacker with a high-privileged user account access via SSH interface in on Port 22/TCP could circumvent restrictions and execute arbitrary operating system commands.\nCVE-2018-13802 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Healthcare and Public Health, and Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nSiemens recommends users update to the new version (v2.12.1) as soon as possible. This version can be found at the following location on the Siemens website:\nhttps://support.industry.siemens.com/cs/us/en/view/109760683\nTo reduce risk, Siemens recommends that administrators restrict network access to prevent potential attackers from accessing Port 22/TCP, if possible.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security (https://www.siemens.com/cert/operational-guidelines-industrial-security), and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity\nFor more information on these vulnerabilities and detailed instructions, please see Siemens Security Advisory SSA-493830 at the following location:\nhttp://www.siemens.com/cert/advisories/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-13801",
    "CVE-2018-13802"
  ],
  "techniques": [],
  "advisory": "icsa-18-282-03",
  "title": "Siemens ROX II | CISA",
  "source": "ics-advisories",
  "id": "00d5e22fdf73c47f8db2d780618909edcc15332e29a1333a6aace4842c12092e"
}