{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely\nVendor: Hikvision\nEquipment: Access Control and Intercom Products\nVulnerabilities: Session Fixation, Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in an attacker hijacking a session and gaining device operation permissions or result in an attacker modifying device network configuration by sending specific data packets to a vulnerable interface within the same local network.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Access Control and Intercom Products are affected:\n\n\nDS-K1T804AXX: V1.4.0_build221212 and prior.\n\n\nDS-K1T341AXX: V3.2.30_build221223 and prior.\n\n\nDS-K1T671XXX: V3.2.30_build221223 and prior.\n\n\nDS-K1T343XXX: V3.14.0_build230117 and prior.\n\n\nDS-K1T341C: V3.3.8_build230112 and prior.\n\n\nDS-K1T320XXX: V3.5.0_build220706 and prior.\n\n\nDS-KH63 Series: V2.2.8_build230219 and prior.\n\n\nDS-KH85 Series: V2.2.8_build230219 and prior.\n\n\nDS-KH62 Series: V1.4.62_build220414 and prior.\n\n\nDS-KH9310-WTE1(B): V2.1.76_build230204 and prior.\n\n\nDS-KH9510-WTE1(B): V2.1.76_build230204 and prior.\n\n\n3.2 Vulnerability Overview\n3.2.1 SESSION FIXATION CWE-384\nSome access control products are vulnerable to a session hijacking attack because the product does not update the session ID after a user successfully logs in. To exploit the vulnerability, attackers have to request the session ID at the same time a valid user logs in, and gain device operation permissions by forging the IP and session ID of an authenticated user.\nCVE-2023-28809 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2 IMPROPER ACCESS CONTROL CWE-284\nSome access control/intercom products have unauthorized modification of device network configuration vulnerabilities. Attackers can modify device network configuration by sending specific data packets to the vulnerable interface within the same local network.\nCVE-2023-28810 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Government Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: China\n\n3.4 RESEARCHER\nThese vulnerabilities were reported to HSRC by Andres Hinnosaar with the support of NATO CCDCOE and Peter Szot from Skylight Cyber. Hikvision reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHikvision recommends users download patches/updates to mitigate these vulnerabilities. The upgrade can be downloaded from the Hikvision official website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nOctober 12, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-28809",
    "CVE-2023-28810"
  ],
  "techniques": [],
  "advisory": "icsa-23-285-14",
  "title": "Hikvision Access Control and Intercom Products | CISA",
  "source": "ics-advisories",
  "id": "b69c39754be8d5bb4ca80e6863efa4ea839dcea17ba35875a3bbcfa066ed119a"
}