{
  "markdown": "\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Schneider Electric\nEquipment: SoMachine HVAC\nVulnerabilities: Buffer Overflow, DLL Hijack\nAFFECTED PRODUCTS\nThe following version of SoMachine HVAC, a PLC programming software, is affected:\n\nSoMachine HVAC Versions 2.1.0 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow arbitrary code execution and could cause the device that the attacker is accessing to crash due to a buffer overflow condition.\nMITIGATION\nSchneider Electric recommends that users of SoMachine HVAC Programming Software update to SoMachine HVAC v2.2. Users of SoMachine HVAC can access the update at the following support web site:\nhttp://www.schneider-electric.com/en/download/document/SoMachine HVAC - Programming Software for Modicon M171-M172 Logic Controllers/\nSchneider Electric’s security notice SEVD-2017-125-01 is available at the following location:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-125-01/\nSchneider Electric’s security notice SEVD-2017-125-02 is available at the following location:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-125-02/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nAlTracePrint.exe, installed by SoMachine HVAC v2.1.0 Programming Software, could be called in a way that could lead to a buffer overflow.\nCVE-2017-7965 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nImproper loading of a DLL file could allow an unauthenticated attacker the ability to execute arbitrary code on the target system.\nCVE-2017-7966 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nIndependent researcher Zhou YU reported the buffer overflow vulnerability to ICS-CERT. Schneider Electric reported to ICS-CERT that security researcher Himanshu Mehta disclosed the DLL Hijack vulnerability to them.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Dams, Defense Industrial Base, Energy, Food and Agriculture, Government Facilities, Nuclear Reactors, Materials, and Waste, Transportation Systems, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n",
  "cves": [
    "CVE-2017-7966",
    "CVE-2017-7965"
  ],
  "techniques": [],
  "advisory": "icsa-17-136-02",
  "title": "Schneider Electric SoMachine HVAC | CISA",
  "source": "ics-advisories",
  "id": "f5358b3054722c29ff0d7b65938632f0090eb7fd583d173e2fa2964161772f67"
}