{
  "markdown": "\nCVSS v3 10.0\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Schneider Electric\nEquipment: Modicon M221 PLCs and SoMachine Basic\nVulnerability: Use of Hard-Coded Cryptographic Key, Protection Mechanism Failure\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-103-02 Schneider Electric Modicon M221 PLCs and SoMachine Basic that was published April 13, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nSchneider Electric reports that these vulnerabilities affect the following PLCs and tools for configuring and developing automation machinery:\n--------- Begin Update A Part 1 of 2 --------\n\nAll Modicon M221 PLCs with firmware version up to v1.5.0.1 and associated SoMachine Basic software (up to v1.5).\n\n--------- End Update A Part 1 of 2 ----------\nIMPACT\nOne vulnerability may allow an attacker to extract a protected project file from the controller to obtain sensitive project information. The second vulnerability may allow a user with access to a protected project file to decrypt it in order to obtain sensitive information without authorization.\nMITIGATION\nSchneider Electric recommends that users store project files in secure, access-restricted locations and encrypt project files with reputable third party file encryption tools.\n--------- Begin Update A Part 2 of 2 --------\nOn June 14, 2017, Schneider Electric released firmware v1.5.1.0 and associated SoMachineBasic V1.5SP1. The new version uses an enhanced encryption mechanism and prevents M221 from returning the password. Users may download SoMachineBasic V1.5SP1 (including firmware v1.5.1.0) from the Schneider Electric web site at the following location:\nhttp://www.schneider-electric.com/en/download/document/SOMBASAP15SP1SOFT/\nor by using Schneider Electric Software Update tool.\n--------- End Update A Part 2 of 2 ----------\nSchneider Electric’s security notice SEVD-2017-097-01 is available at the following location:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-097-01/\nSchneider Electric’s security notice SEVD-2017-097-02 is available at the following location:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-097-02/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nUSE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\n\nProject files, including user-defined project passwords, are encrypted with a hardcoded password.\nCVE-2017-7574 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:L).\n\nPROTECTION MECHANISM FAILURE CWE-693\n\nAn attacker can send a specifically crafted command via Modbus over TCP port 502 to the logic controller to discover an application protection password.\nCVE-2017-7575 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:L).\nRESEARCHER\nSimon Heming, Maik Brüggemann, Hendrik Schwartke, and Ralf Spenneberg of Open Source Security discovered these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n",
  "cves": [
    "CVE-2017-7575",
    "CVE-2017-7574"
  ],
  "techniques": [],
  "advisory": "icsa-17-103-02a",
  "title": "Schneider Electric Modicon M221 PLCs and SoMachine Basic (Update A) | CISA",
  "source": "ics-advisories",
  "id": "db08f26c5b93ee1cf2ee81924976540fbef140fcf579bf9e9dedc3690c8bccc3"
}