{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.1\nATTENTION: Exploitable via adjacent network\nVendor: Johnson Controls, Inc.\nEquipment: Kantech KT1, KT2, KT400 Door Controllers\nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain access to sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products by Kantech, a subsidiary of Johnson Controls, are affected:\n\nKantech KT1 Door Controller, Rev01: Versions 2.09.01 and prior\nKantech KT2 Door Controller, Rev01: Versions 2.09.01 and prior\nKantech KT400 Door Controller, Rev01: Versions 3.01.16 and prior\n\n3.2 Vulnerability Overview\n3.2.1 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nUnder certain circumstances, when the controller is in factory reset mode waiting for initial setup, it will broadcast its MAC address, serial number, and firmware version. Once configured, the controller will no longer broadcast this information.\nCVE-2024-32754 has been assigned to this vulnerability. A CVSS v3.1 base score of 3.1 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nNational Computer Emergency Response Team (CERT) of India reported this vulnerability to Johnson Controls.\n4. MITIGATIONS\nJohnson Controls recommends users update Kantech door controllers as follows:\n\nUpdate Kantech KT1 Door Controller to at least version 3.10.12\nUpdate Kantech KT2 Door Controller to at least version 3.10.12\nUpdate Kantech KT400 Door Controller to at least version 3.03\n\nFor more detailed mitigation instructions, see Johnson Controls Product Security Advisory JCI-PSA-2024-13 v1.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. This vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nJuly 2, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-32754"
  ],
  "techniques": [],
  "advisory": "icsa-24-184-01",
  "title": "Johnson Controls Kantech Door Controllers | CISA",
  "source": "ics-advisories",
  "id": "70f3e66c808a36a5404115466ea63918d6b3dac43ccb766c5ab98f2b6d27e470"
}