{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Honeywell\nEquipment: Experion LX\nVulnerability: Missing Authentication for Critical Function\n\nCISA is aware of a public report known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow for configuration manipulation and a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Experion LX, a distributed control system (DCS), are affected:\n\nExperion LX: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product uses the EpicMo protocol that does not have authentication features, which may allow an attacker with access to this protocol over a network to manipulate firmware or cause a denial-of-service condition.\nCVE-2022-30317 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forescout Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nHoneywell has released the following mitigations:\n\nExperion LX R520.1 incorporates secure boot functionality and signed firmware images.\nR501.6, R511.5 and R520 releases have an update to incorporate the secure lock functionality. Secure lock restricts all firmware downloads to process controllers while the lock is invoked.\n\nFor more information and support, users should contact Honeywell support.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-30317"
  ],
  "techniques": [],
  "advisory": "icsa-22-242-07",
  "title": "Honeywell Experion LX | CISA",
  "source": "ics-advisories",
  "id": "75226f20905f990ed2aa57ca973d9ebc03e9f1d6afb908a71d11c25acc70e86f"
}