{
  "markdown": "\nCVSS v3 High\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: OSIsoft\nEquipment: PI ProcessBook and PI ActiveView\nVulnerability: Using components with known vulnerabilities\nAFFECTED PRODUCTS\nOSIsoft reports that the vulnerability affects the following PI products:\n\nPI ProcessBook 2015 R2 (3.6.0) and earlier, and\nPI ActiveView 2015 R2 (3.6.0) and earlier.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to remotely access arbitrary code.\nMITIGATION\nOSIsoft recommends that users upgrade installations to PI ProcessBook 2015 R2 SP1 (3.6.1) and PI ActiveView 2015 R2 SP1 (3.6.1). The upgrade removes the vulnerable components and installs Visual Basic for Applications (VBA) 7.1, which is backwards compatible, to maintain scripting capabilities. The upgrade does not completely remove all VBA 6.5 components in case other applications utilize them. If no Microsoft Office or third-party programs require VBA 6.5, remove it after the upgrade.\nFor more information about this vulnerability, how to obtain the new version, or how to install the new version, please see OSIsoft’s alert, AL00321, on their web site at the following location:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00321\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\nAffected versions contain a third-party component which contains a vulnerability.\nThe issue is rated “High” (CVSS: 7.0-10) by OSIsoft.\nRESEARCHER\nOSIsoft reported this vulnerability to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Multiple Sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-17-192-05",
  "title": "OSIsoft PI ProcessBook and PI ActiveView | CISA",
  "source": "ics-advisories",
  "id": "e1cf7462e1c8767006ed159c481f6e1908e4fb3985f895ca9244b5a7af90c6d3"
}