{
  "markdown": "\nCVSS v3 5.5\nATTENTION: Low skill level to exploit.\nVendor: Delta Electronics, Incorporated (Delta Electronics)\nEquipment: Delta Industrial Automation Screen Editor\nVulnerabilities: Stack-based Buffer Overflow, Use-after-Free, Out-of-bounds Write, Type Confusion\nAFFECTED PRODUCTS\nThe following versions of Delta Industrial Automation Screen Editor, a graphical user interface (GUI), are affected:\n\nDelta Industrial Automation Screen Editor, Version 2.00.23.00 or prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow an attacker to remotely execute arbitrary code.\nMITIGATION\nDelta Electronics recommends affected users update to the latest version of DOPSoft Version 2, which is available for download at:\nhttp://www.deltaww.com/Products/PluginWebUserControl/downloadCenterCounter.aspx?DID=9313&DocPath=1&hl=en-US.\nDelta Industrial Automation Screen Editor Version 2.00.23.00 has been removed from Delta Electronics’ web site and replaced with DOPSoft, Version 2. Delta Electronics also recommends that users restrict the interaction with the application to trusted files.\nNCCIC/ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nStack-based buffer overflow vulnerabilities caused by processing specially crafted .dpb files may allow an attacker to remotely execute arbitrary code.\nCVE-2017-16751 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n\nUSE-AFTER-FREE CWE-416\n\nSpecially crafted .dpb files could exploit a use-after-free vulnerability.\nCVE-2017-16749 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n\nOUT-OF-BOUNDS WRITE CWE-787\n\nSpecially crafted .dpb files may cause the system to write outside the intended buffer area.\nCVE-2017-16747 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n\nACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\n\nAn access of resource using incompatible type (‘type confusion’) vulnerability may allow an attacker to execute remote code when processing specially crafted .dpb files.\nCVE-2017-16745 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\nRESEARCHER\nSteven Seeley of Source Incite reported these vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-16751",
    "CVE-2017-16747",
    "CVE-2017-16745",
    "CVE-2017-16749"
  ],
  "techniques": [],
  "advisory": "icsa-18-004-01",
  "title": "Delta Electronics Delta Industrial Automation Screen Editor | CISA",
  "source": "ics-advisories",
  "id": "3c629499a6a82c8a26f7867384fc8037ced5064e48a69ea72d85c7a8879a8b7d"
}