{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SNMP Implementation of WinCC Runtime\nVulnerability: Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the SNMP service and require a manual restart of the device to resume operation of the service.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products are affected due to the SNMP implementation of WinCC Runtime:\n\nSIMATIC HMI Comfort Panels 1st Generation (incl. SIPLUS variants): All versions prior to v16 update 4\nSIMATIC HMI KTP Mobile Panels: All versions prior to v16 update 4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nSpecially crafted packets sent to Port 161/UDP can cause the SNMP service of affected devices to crash. A manual restart of the device is required to resume operation of the service. \nCVE-2019-19276 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nYounes Dragoni and Alessandro Di Pinto of Nozomi Networks reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends the following:\n\nUpdate to Version 16 update 4 or later\nDisable SNMP if this is supported by the product. Disabling SNMP fully mitigates this vulnerability.\nRestrict network access to Port 161/UDP of affected devices to trusted devices or IP addresses.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see SSA-594364\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-19276"
  ],
  "techniques": [],
  "advisory": "icsa-21-131-06",
  "title": "Siemens SNMP Implementation of WinCC Runtime | CISA",
  "source": "ics-advisories",
  "id": "b8684a492ca37dd8e74c81b85ea91beeeb7345c8d1a973df56e0129251022a61"
}