{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: OSIsoft\nEquipment: PI Integrator\nVulnerabilities: Cross-Site Scripting, Improper Authorization\nAFFECTED PRODUCTS\nThe following versions of PI Integrator, a data management platform, are affected:\n\nPI Integrator for SAP HANA 2016,\nPI Integrator for Business Analytics 2016 - Data Warehouse (All Editions),\nPI Integrator for Business Analytics 2016 - Business Intelligence (All Editions),\nPI Integrator for Business Analytics and SAP HANA SQL Utility 2016, and\nPI Integrator for Microsoft Azure 2016.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an unauthorized attacker to gain privileged access to the system. An attacker may also be able to store a malicious script in the application database.\nMITIGATION\nOSIsoft recommends that users update their software at the earliest opportunity. Users and administrators are encouraged to upgrade to PI Integrator for Business Analytics 2016 R2 or later, PI Integrator for Microsoft Azure 2016 R2 SP1 or later, or PI Integrator for SAP HANA 2017 or later for the corresponding edition.\nOSIsoft has released an alert that can be found at:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00324\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nCROSS-SITE SCRIPTING CWE-79\n\nAn attacker may be able to upload a malicious script that attempts to redirect users to a malicious web site.\nCVE-2017-9655 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:C/C:N/I:N/A:H).\n\nIMPROPER AUTHORIZATION CWE-285\n\nAn attacker is able to gain privileged access to the system while unauthorized.\nCVE-2017-9653 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nThese vulnerabilities were self-reported by OSIsoft.\nBACKGROUND\nCritical Infrastructure Sector: Multiple Sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2017-9655",
    "CVE-2017-9653"
  ],
  "techniques": [],
  "advisory": "icsa-17-220-01",
  "title": "OSIsoft PI Integrator | CISA",
  "source": "ics-advisories",
  "id": "5ce71b9312747add16054e6491ade68dbcfc391b75bd3700a13831ed7304cdbe"
}