{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.5\n\nATTENTION: Low skill level to exploit\nVendor: AVEVA\nEquipment: InduSoft Web Studio, InTouch Edge HMI\nVulnerability: Uncontrolled Search Path Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow execution of unauthorized code or commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AVEVA InduSoft Web Studio and InTouch Edge HMI are affected by a vulnerability in a third-party component, Gemalto Sentinel UltraPro encryption keys.\n\nInduSoft Web Studio versions prior to v8.1 SP3\nInTouch Edge HMI versions prior to 2017 Update 3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nThe uncontrolled search path element vulnerability allows an attacker to load and execute a malicious file from the ux32w.dll in third-party component Sentinel UltraPro.\nCVE-2019-6534 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nADLab of Venustech reported this vulnerability to NCCIC.\n4. MITIGATIONS\nAVEVA recommends that users upgrade to the latest versions located the following links:\nInduSoft Web Studio v8.1 SP3\nhttp://download.indusoft.com/81.3.0/IWS81.3.0.zip\nInTouch Edge HMI 2017 Update 3\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=52354 (login required)\nUsers who are unable to upgrade to the latest version of InduSoft Web Studio or InTouch Edge HMI, can alternatively apply Security Update LFSec131:\nhttp://www.indusoft.com/download/patches/security/LFSec131.zip \nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=52410 (login required)\nFor addition information please see AVEVA Security Bulletin LFSEC00000131:\nhttps://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityBulletin_LFSec131.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-6534"
  ],
  "techniques": [],
  "advisory": "icsa-19-078-01",
  "title": "AVEVA InduSoft Web Studio and InTouch Edge HMI | CISA",
  "source": "ics-advisories",
  "id": "5d2855c83a3a5fc1681064725f7bcc5553c8790dba35b59724758055263c3b7a"
}