{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity \nVendor: Bentley Systems\nEquipment: MicroStation Connect\nVulnerabilities: Stack-based Buffer Overflow, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may crash the device being accessed or allow remote arbitrary code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Bentley Systems MicroStation Connect, a software management platform, are affected:\n•    v10.17.0.209 and prior \n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow when a malformed design (DGN) file is parsed. This may allow an attacker to execute arbitrary code.\nCVE-2022-40201 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read when parsing DGN files, which may allow an attacker to crash the product, disclose sensitive information, or execute arbitrary code.\nCVE-2022-41613 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMichael Heinzl reported these vulnerabilities to CISA.\n4. MITIGATIONS\nBentley Systems has implemented multiple validation checks within the DGN platform when processing malformed DGNs. Bentley Systems recommends users update to the latest version of the MicroStation Connect:\n\nMicroStation Connect Update 17.1\n\nFor more information and MicroStation updates, contact Bentley Support.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2022-41613",
    "CVE-2022-40201"
  ],
  "techniques": [],
  "advisory": "icsa-22-293-01",
  "title": "Bentley Systems MicroStation Connect | CISA",
  "source": "ics-advisories",
  "id": "78c677c793410f1cb3ed7a51302ce23c22135ed157df9c345530a06e7b4fc8b6"
}