{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.7\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: B&R Industrial Automation GmbH\nEquipment: SiteManager and GateManager\nVulnerabilities: Path Traversal, Uncontrolled Resource Consumption, Information Exposure, Improper Authentication, Information Disclosure  \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow for arbitrary information disclosure, manipulation, and a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SiteManager and GateManager are affected:\n\nSiteManager all versions prior to v9.2.620236042 \nGateManager 4260 and 9250 all versions prior to v9.0.20262 \nGateManager 8250 all versions prior to v9.2.620236042 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nAn authenticated adversary can read service configuration and other sensitive information and abuse this information for malicious activities on SiteManager instances. \nCVE-2020-11641 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N).\n3.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAn authenticated adversary can repeatedly trigger a restart of SiteManager instances, thus limiting availability. \nCVE-2020-11642 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H).\n3.2.3    INFORMATION EXPOSURE CWE-200\nAn authenticated adversary can gather information about devices belonging to a foreign organization and abuse this information for malicious activities. \nCVE-2020-11643 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.2.4    IMPROPER AUTHENTICATION CWE-287\nAn authenticated adversary can fool users of foreign domains with fictional audit messages/alerts of their choice. \nCVE-2020-11644 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N).\n3.2.5    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAn authenticated adversary can repeatedly trigger a restart of GateManager instances, thus limiting their availability. \nCVE-2020-11645 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.6    INFORMATION DISCLOSURE CWE-200\nAn authenticated adversary can view information about all devices belonging to their domain and abuse this information for malicious activities. \nCVE-2020-11646 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Austria\n\n3.4 RESEARCHER\nNikolay Sokolik and Hay Mizrachi of OTORIO reported these vulnerabilities to CISA.\n4. MITIGATIONS\nB&R Industrial Automation reports the vulnerabilities have been fixed in the following versions:\n\nSiteManager v9.2.620236042\nGateManager 4260 and 9250 v9.0.20262\nGateManager 8250 v9.2.620236042\n\nThe B&R cybersecurity webpage provides further information including cybersecurity guidelines. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-11641",
    "CVE-2020-11645",
    "CVE-2020-11642",
    "CVE-2020-11643",
    "CVE-2020-11646",
    "CVE-2020-11644"
  ],
  "techniques": [],
  "advisory": "icsa-20-273-03",
  "title": "B&R Automation SiteManager and GateManager | CISA",
  "source": "ics-advisories",
  "id": "1167e1e6a0f92fc9644700fc2094cf67414eca4a5cfd14f570fcc189a039982b"
}