{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Low attack complexity\nVendor: Panasonic\nEquipment: FPWIN Pro\nVulnerability: Improper Restriction of XML External Entity Reference\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to retrieve sensitive information from the file system where affected software is installed.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPanasonic reports this vulnerability affects the following products:\n\nFPWIN Pro programming control software: All Versions 7.5.1.1 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nA specially crafted project file specifying a URI causes the XML parser to access the URI and embed the contents, which may allow an attacker to disclose information that is accessible in the context of the user executing software.\nCVE-2021-32972 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMichael Heinzl reported this vulnerability to CISA.\n4. MITIGATIONS\nPanasonic has released FPWIN Pro v7.5.2.0 to address this vulnerability.\nFor more information about this issue, please contact the Panasonic Product Security Incident Response Team.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-32972"
  ],
  "techniques": [],
  "advisory": "icsa-21-180-03",
  "title": "Panasonic FPWIN Pro | CISA",
  "source": "ics-advisories",
  "id": "19600f26fef108e928896a964c00bbd1bbcf2d065f7c194b5e15b52e05be7933"
}