{
  "markdown": "\nOverview\nICS-CERT originally released Advisory ICSA-11-243-03P on the US-CERT secure Portal on August 31, 2011. This web page release was delayed to allow users time to download and install the update.\nICS-CERT received a report from GE Intelligent Platforms and the Zero Day Initiative concerning a stack-based buffer overflow vulnerability in the GE Intelligent Platforms Proficy Historian Data Archiver.\n--------- Begin Update A Part 1 of 1 --------\nThis vulnerability was reported to ZDI by independent security researcher Luigi Auriemma.\n--------- End Update A Part 1 of 1 ----------\nICS-CERT has coordinated with GE Intelligent Platforms to validate this vulnerability, and GE Intelligent Platforms has created a patch to address the issue. ICS-CERT has verified that the patch fully resolves this issue.\nAffected Products\nThis vulnerability affects the following GE Intelligent Platforms products:\n\nProficy Historian: Versions 4.0 and prior\nProficy HMI/SCADA—CIMPLICITY: Version 8.1 (If Historian is installed)\nProficy HMI/SCADA—iFix: Versions 5.0 and 5.1 (If Historian is installed).\n\nImpact\nA vulnerability exists in Proficy Historian that could cause the Historian Data Archiver service to crash and potentially allow an attacker to take control of a system running the affected software.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nProficy Historian is a data historian that collects, archives, and distributes production information. According to GE, the Proficy Historian product is deployed across multiple industries worldwide.\nVulnerability Characterization\nVulnerability Overview\nCVE-2011-1918 has been assigned to this vulnerability.\nA stack-based buffer overflow vulnerability exists as a result of the way that the Historian Data Archiver service (ihDataArchiver.exe or ihDataArchiver_x64.exe) processes incoming TCP/IP message traffic on Port 14000/TCP.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo publicly available exploits specifically targeting this vulnerability are known to exist.\nDifficulty\nExploiting this vulnerability requires a moderate skill set.\nMitigation\nGE Intelligent Platforms has released security advisories and free product updates Software Improvement Modules (SIMS) to address recently reported security vulnerabilities in Proficy software. GE Intelligent Platforms urges all customers to follow the recommendations in the security advisories, which can be found at http://support.ge-ip.com/support/index?page=kbchannel&id=S:KB14493. A valid GE SSO ID and Customer Service Number are required to access the advisories and updates.\nThe following product updates for Proficy Historian address this issue:\n\nProficy Historian 4.0 SIM 12\nProficy Historian 3.5 SIM 17\nProficy Historian 3.1 SIM IH31_11092015699.exe\n\nNote: Proficy SIMS are cumulative. All future SIMS will include these updates.\nGE Intelligent Platforms has provided the following instructions for iFix and CIMPLICITY users:\niFIX and CIMPLICITY installations:\nOption 1: If Proficy Historian is in use, refer to the information above for Historian SIM applications and apply the appropriate SIM (update) to the installed version of Proficy Historian.\nOption 2: If Proficy Historian is not in use, uninstall Proficy Historian by following the instructions below:\n\nDouble click the Add/Remove Programs icon in the Control Panel. The Add/Remove Programs dialog box opens.\nSelect Proficy Historian, and click the Remove button.\n\nTo uninstall Historian and save the current Historian configuration and data, select Do Not Delete Archives and click Next.\nTo uninstall Historian and delete the current Historian configuration and data, select Delete Archives and click Next.\n\n\nThe uninstall proceeds and all Historian components are removed.\n\nIn addition to applying the patch or uninstalling, ICS-CERT recommends that customers using the affected product should consider taking the following proactive measures to decrease the likelihood of successful exploitation of this vulnerability.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls with properly configured rules addressing Port 14000/TCP and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) provides a recommended practices section for control system security on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2011-1918"
  ],
  "techniques": [],
  "advisory": "icsa-11-243-03a",
  "title": "GE Intelligent Platforms Proficy Historian Data Archiver Buffer Overflow Vulnerability (Update A) | CISA",
  "source": "ics-advisories",
  "id": "3913457cff4c82901a8f344f82ae3b794ada4c8f2450ec1cc171c6082ccaab13"
}