{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: 3S-Smart Software Solutions GmbH\nEquipment: CODESYS V3\nVulnerabilities: Unverified Ownership, Uncontrolled Memory Allocation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to close existing communication channels or to take over an already established user session to send crafted packets to a PLC.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAll variants of the following CODESYS V3 products in all versions prior to v3.5.14.20 that contain the CmpGateway component are affected, regardless of the CPU type or operating system:\n\nCODESYS Control for BeagleBone\nCODESYS Control for emPC-A/iMX6\nCODESYS Control for IOT2000\nCODESYS Control for Linux\nCODESYS Control for PFC100\nCODESYS Control for PFC200\nCODESYS Control for Raspberry Pi\nCODESYS Control V3 Runtime System Toolkit\nCODESYS Gateway V3\nCODESYS V3 Development System\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNVERIFIED OWNERSHIP CWE-283\nThe CODESYS Gateway does not correctly verify the ownership of a communication channel.\nCVE-2019-9010 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n\n3.2.2    UNCONTROLLED MEMORY ALLOCATION CWE-789\nA crafted communication request may cause uncontrolled memory allocations in the affected CODESYS products and may result in a denial-of-service condition.\nCVE-2019-9012  has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\n3S-Smart Software Solutions GmbH reported these vulnerabilities to CISA.\n4. MITIGATIONS\n3S-Smart Software Solutions GmbH has released v3.5.14.20 and v3.5.15.0. Each of these releases solve the noted vulnerabilities issues.\nPlease visit the CODESYS update area for more information on how to obtain the software update: https://www.codesys.com/download/\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-9012",
    "CVE-2019-9010"
  ],
  "techniques": [
    "T2000"
  ],
  "advisory": "icsa-19-213-03",
  "title": "3S-Smart Software Solutions GmbH CODESYS V3 | CISA",
  "source": "ics-advisories",
  "id": "5d3b92fd615b75b195e2ecd165d1bc146729b7e767aea229758d1e0cd4bd12f6"
}