{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: CODESYS, GmbH\nEquipment: CODESYS V2 Runtime Toolkit, CODESYS PLCWinNT\nVulnerabilities: Stack-based Buffer Overflow, Heap-based Buffer Overflow, Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may cause a heap-based buffer overflow, a stack-based buffer overflow, or a buffer over-read in the affected CODESYS products. This could result in a denial-of-service condition or allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nCODESYS reports the following CODESYS V2 runtime systems are affected, regardless of the CPU type or operating system:\n\nCODESYS Runtime Toolkit 32-bit full prior to v2.4.7.55\nCODESYS PLCWinNT prior to v2.4.7.55\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nA crafted request may cause a heap-based buffer overflow in the affected CODESYS products, resulting in a denial-of-service condition.\nCVE-2021-30186 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nA crafted request may cause a stack-based buffer overflow in the affected CODESYS products, resulting in a denial-of-service condition or remote code execution.\nCVE-2021-30188 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER INPUT VALIDATION CWE-20\nA crafted request may cause a buffer over-read in the affected CODESYS products, resulting in a denial-of-service condition.\nCVE-2021-30195 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSergey Fedonin, Denis Goryushev, and Anton Dorfman of Positive Technologies; and Yossi Reuven of SCADAfence independently reported these vulnerabilities to CODESYS.\n4. MITIGATIONS\nCODESYS GmbH has released the following product versions to solve the noted vulnerability issues for the affected CODESYS products:\n\nCODESYS Runtime Toolkit 32-bit full v2.4.7.55\nCODESYS PLCWinNT v2.4.7.55. This will also be part of the CODESYS Development System setup v2.3.9.66\n\nPlease visit the CODESYS update area for more information on how to obtain the software updates.\nAs part of a security strategy, CODESYS recommends the following general defense measures to reduce the risk of exploits:\n\nUse controllers and devices only in a protected environment to minimize network exposure, ensuring they are not accessible from outside.\nUse firewalls to protect and separate the control system network from other networks.\nUse VPN (virtual private network) tunnels if remote access is required.\nActivate and apply user management and password features.\nUse encrypted communication links.\nLimit access to both development and control system by physical means, operating system features, etc.\nProtect both development and control system operations by using up to date virus detecting solutions.\n\nFor more information and general recommendations for protecting machines and plants, see also the CODESYS Security Whitepaper.\nPlease see CODESYS Advisory 2021-06 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-30195",
    "CVE-2021-30188",
    "CVE-2021-30186"
  ],
  "techniques": [],
  "advisory": "icsa-21-173-03",
  "title": "CODESYS Control V2 communication | CISA",
  "source": "ics-advisories",
  "id": "a55cf2a1212b670e91f8d070fff59425c50f621d680e71da4a04c07bc470d88c"
}