{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Keysight Technologies, Inc.\nEquipment: N6854A Geolocation server and N6841A RF Sensor software\nVulnerabilities: Relative Path Traversal, Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to obtain arbitrary operating system files and execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version of Keysight N6854A Geolocation and server and N6841A Sensor software, a spectrum monitoring platform, are affected:\n\nKeysight N6854A and N6841A RF: Version 2.3.0 and earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    RELATIVE PATH TRAVERSAL CWE-23\nThe affected products are vulnerable to directory traversal, which may allow an attacker to obtain arbitrary operating system files.\nCVE-2022-1661 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nThe affected products are vulnerable of untrusted data due to deserialization without prior authorization/authentication, which may allow an attacker to remotely execute arbitrary code.\nCVE-2022-1660 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nrgod, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nKeysight recommends users update N6854A and N6841A RF to v2.4.0 or later.\n\nKeysight also recommends users take the following actions to help reduce risk:\nBlock incoming connection on TCP port number defined by environment variable KEYSIGHT_SMS_PORT (default: 8080)\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-1660",
    "CVE-2022-1661"
  ],
  "techniques": [],
  "advisory": "icsa-22-146-01",
  "title": "Keysight N6854A Geolocation server and N6841A RF Sensor software | CISA",
  "source": "ics-advisories",
  "id": "608cc209a17521b5204ed02b542e2dbb06fa082ebd65431573294936693bbe84"
}