{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low attack complexity\nVendor: Advantech\nEquipment: WebAccess/SCADA\nVulnerabilities: Insufficient Type Distinction\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker full control over the supervisory control and data acquisition (SCADA) server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAdvantech reports this vulnerability affect the following WebAccess/SCADA product:\n\n\nWebAccess/SCADA: version 8.4.5\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INSUFFICIENT TYPE DISTINCTION CWE-351 \nIf an attacker can trick an authenticated user into loading a maliciously crafted .zip file onto Advantech WebAccess version 8.4.5, a web shell could be used to give the attacker full control of the SCADA server. \nCVE-2023-2866 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems \nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nMarlon Luis Petry reported this vulnerability to CISA.\n4. MITIGATIONS\nAdvantech recommends users locate and delete the “WADashboardSetup.msi” file to avoid this issue.\nIf users wish to remedy this problem in version 8.4.5, they can uninstall \"WebAccess Dashboard\" from the control panel. Delete all the files:\n\n\n\\Inetpub\\wwwroot\\broadweb\\WADashboard\n\n\n\n\n\\WebAccess\\Node\\WADashboardSetup.msi\n\n\nAdvantech released a new version V9.1.4 to address the problem by not including these files.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2023-2866"
  ],
  "techniques": [],
  "advisory": "icsa-23-150-01",
  "title": "Advantech WebAccess/SCADA | CISA",
  "source": "ics-advisories",
  "id": "7ba708a98d90b3a78b0212133cf8a2ce2b6acac1b6f209bc45d6960121476a21"
}