{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n​CVSS v3 7.5\n​ATTENTION: Exploitable remotely/low attack complexity\n​Vendor: Mitsubishi Electric\n​Equipment: GT Designer3, GOT2000 Series, GOT SIMPLE Series, and GT SoftGOT2000\n​Vulnerability: Weak Encoding for Password\n\n2. RISK EVALUATION\n​Successful exploitation of this vulnerability could allow an attacker to obtain plaintext passwords by sniffing packets containing encrypted passwords and decrypting the encrypted passwords.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n​The following Mitsubishi Electric products are affected when either of the following cases apply: \n\n​The case of transferring data with GT Designer3 Version1(GOT2000) listed below and GOT2000 Series or GOT SIMPLE Series listed below with the Data Transfer Security function enabled. \n​The case of transferring data by the SoftGOT-GOT link function with GT SoftGOT2000 listed below and GOT2000 series listed below with the Data Transfer Security function enabled. \n\n\n​GT Designer3 Version1 (GOT2000): v1.295H and prior\n​GT SoftGOT2000: v1.295H and prior\n​GOT2000 (Models GT21, GT23, GT25, GT27): v01.49.000 and prior\n​GOT SIMPLE (Models GS25, GS21): v01.49.000 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 ​WEAK ENCODING FOR PASSWORD CWE-261 \n​Information disclosure vulnerability exists in the Data Transfer Security function on GT Designer3, GOT2000 Series, GOT SIMPLE Series and GT SoftGOT2000. This vulnerability allows an attacker to obtain plaintext passwords by sniffing packets containing encrypted passwords and decrypting the encrypted passwords.\n​CVE-2023-0525 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\n​CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\n​COUNTRIES/AREAS DEPLOYED: Worldwide\n​COMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\n​JINYOUNG KIM, JEONGHOON BAE, YIJOON JUNG, and HYEOKJONG YUN of “ot vulnerability” reported this vulnerability to Mitsubishi Electric.\n4. MITIGATIONS\nMitsubishi Electric recommends updating to the following mitigated version to minimize the risk of exploiting this vulnerability:\n\n​GT Designer3 Version1 (GOT2000): Update to v1.300N or later\n​GT SoftGOT2000: Update to v1.300N or later\n​GOT2000 (Models GT21, GT23, GT25, GT27): Update to v01.50.000 or later\n​GOT SIMPLE (Models GS25, GS21): Update to v01.50.000 or later\n\n​Mitsubishi Electric recommends taking applying the following mitigations to minimize the risk of exploiting this vulnerability:\n\n​Encrypt communication paths to the affected product with a VPN or other means.\n​When internet access is required, use a virtual private network (VPN) or other means to prevent unauthorized access.\n​Use the affected products within a LAN and block access from untrusted networks and hosts.\n​Prevent physical access to the network to which the product is connected.\n​Install antivirus software on your personal computer that can access the affected product.\n​Use the IP filter function to restrict the accessible IP addresses.\n\n​For details on the IP filter function, please refer to GT Designer3 (GOT2000) Screen Design Manual (SH-081220ENG), “5.4.3 Setting the IP filter.”\n\n\n\n​For update instructions and additional information, refer to Mitsubishi Electric’s security bulletin.\n​CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\n​Minimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\n​Locate control system networks and remote devices behind firewalls and isolate them from business networks.\n​When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\n​CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n​CISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n​Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n​Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n​No known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-0525"
  ],
  "techniques": [],
  "advisory": "icsa-23-215-02",
  "title": "​Mitsubishi Electric GT and GOT Series Products | CISA",
  "source": "ics-advisories",
  "id": "3216a93baa7c5df46ff30e6f1eb85c5e1846266191172c99eca5a6c21cc75698"
}