{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 6.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: HMS Industrial Networks\nEquipment: Anybus-CompactCom 30\nVulnerability: Cross-site Scripting\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition, exfiltrate data, or obtain a high degree of control over the device and subsequent systems, including remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Anybus-CompactCom 30, an industrial communication interface, are affected if they include a web server:\n\nAnybus-CompactCom 30: All versions\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe Anybus-CompactCom 30 products are vulnerable to a XSS attack caused by the lack of input sanitation checks. As a consequence, it is possible to insert HTML code into input fields and store the HTML code. The stored HTML code will be embedded in the page and executed by host browser the next time the page is loaded, enabling social engineering attacks.\nCVE-2024-6558 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\nA CVSS v4 score has also been calculated for CVE-2024-6558. A base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:L/SC:H/SI:H/SA:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Sweden\n\n3.4 RESEARCHER\nVincenzo Giuseppe Colacino of Secoore reported this vulnerability to CISA.\n4. MITIGATIONS\nHMS recommends users implement at least one of the following:\n\nAdd password protection to all webpages served by the Anybus-CompactCom 30 module.\nDisable or add the option to allow the end-user to disable the webserver in the AnybusCompactCom 30.\nMake sure these products are used locally within a secure network utilizing proper network infrastructure controls. This will help ensure that unused or unnecessary protocols from unauthorized sources are blocked.\nEnsure that control systems and devices are situated behind firewalls, ensuring their isolation from the corporate network.\nReplace the Anybus-CompactCom 30 module with a Anybus-CompactCom 40 module.\n\nFor more information see the associated HMS security advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJuly 11, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-6558"
  ],
  "techniques": [],
  "advisory": "icsa-24-193-20",
  "title": "HMS Industrial Networks Anybus-CompactCom 30 | CISA",
  "source": "ics-advisories",
  "id": "4ad3a210ac571e75b4ea5bb2425b3ab5e0fdeb27deead21d467b6cdb1197ed1f"
}