{
  "markdown": "\nOverview\nThis Advisory is a follow-up to the Alert, “ICS-ALERT-11-271-01 - ARC Informatique PcVue HMI/SCADA ActiveX Vulnerabilities.”ICS-CERT is aware of publicly and privately disclosed reports of four vulnerabilities in ARC Informatique’s PcVue application. These vulnerabilities include:\n\npotential to write memory\npossible file corruption\nremote code execution\ndenial of service.\n\nIndependent researcher Kuang-Chun Hung of Security Research and Service Institute Information and Communication Security Technology Center (ICST) privately identified a buffer overflow vulnerability in ARC Informatique’s PcVue application.Independent researcher Luigi Auriemma publicly disclosed four vulnerabilities along with proof-of-concept (PoC) exploit code, including the vulnerability privately disclosed by ICST, without coordination with ARC Informatique, ICS-CERT, or any other coordinating entity known to ICS-CERT.ARC Informatique has confirmed these vulnerabilities and has released a patch to address the issue. Researcher Kuang-Chun Hung has tested the patch and validated that it resolves these vulnerabilities.\nAffected Products\nAccording to ARC Informatique the following products are affected:\n\nPcVue-All versions from 6.xx onward\nFrontVue-All versions\nPlantVue-All versions.\n\nImpact\nSuccessful exploitation of these vulnerabilities could result in denial of service, write to memory, file corruption, or remote code execution.Impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nARC Informatique is a French-based company that develops human-machine interface/supervisory control and data acquisition (HMI/SCADA) software that is used to interface with control systems.According to ARC Informatique, PcVue is deployed across several sectors including manufacturing, building automation, chemical, banking and finance, electric utilities, and others. ARC Informatique estimates these products are used primarily in Europe but are also used in the US and around the world.\nVulnerability Characterization\nVulnerability Overview\nArbitrary Code Execution\nA malicious user can directly control the function pointer in SVUIGrd.ocx.CVE-2011-4042http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4042, NIST uses this advisory to create the CVE website report. This website will be active sometime after publication of this advisory. has been assigned to this vulnerability.\nBuffer Overflow\nAn overly large integer value input to a particular parameter in SVUIGrd.ocx will cause a buffer overflow that will allow remote attackers to execute arbitrary code and gain the privileges equivalent to currently logged in user.CVE-2011-4043http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4043, NIST uses this advisory to create the CVE website report. This website will be active sometime after publication of this advisory. has been assigned to this vulnerability.\nVulnerability Details\nBy convincing a user to view a specially crafted HTML document or HTML e-mail message, an attacker could remotely execute arbitrary code on the targeted system with the privileges of the logged-in user. The affected software does not need to be running for this vulnerability to be exploited.\nExistence of Exploit\nPublicly released PoC code exists for these vulnerabilities.\nDifficulty\nCrafting a working exploit for this vulnerability would require a moderate skill level. Exploiting the vulnerabilities would likely require social engineering to lure the target to the malicious site.\nMitigation\nARC Informatique has released a patch to their customers to address these vulnerabilities. Users of vulnerable versions of ARC Informatique’s PcVue should deploy the patch. For more information, please refer to the ARC Informatique security bulletin.\nFor more information about securing Internet Explorer web browsers with regard to ActiveX execution, please refer to the following US-CERT document Securing your Web browser.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks  for more information on social engineering attacks.\n\n\n",
  "cves": [
    "CVE-2011-4043",
    "CVE-2011-4042"
  ],
  "techniques": [],
  "advisory": "icsa-11-340-01",
  "title": "ARC Informatique PcVue HMI/SCADA ActiveX Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "2ef7e5566338173a1a0f0f1d77d10f31ac8a282832aefac6f14ef79f31ed0647"
}