{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 9.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric Corporation\nEquipment: Electrical discharge machines\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to disclose, tamper with, destroy, or delete information in the products, or cause a denial-of-service condition on the products.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports that the following electrical discharge machines are affected by this vulnerability in Microsoft Message Queuing service:\n\nWire-cut EDM MV Series MV1200S D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MV Series MV2400S D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MV Series MV4800S D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MV Series MV1200R D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MV Series MV2400R D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MV Series MV4800R D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MV Series MV1200S D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MV Series MV2400S D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MV Series MV4800S D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MV Series MV1200R D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MV Series MV2400R D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MV Series MV4800R D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MP Series MP1200 D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MP Series MP2400 D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MP Series MP4800 D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MP Series MP1200 D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MP Series MP2400 D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MP Series MP4800 D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MX Series MX900 D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MX Series MX2400 D-CUBES Series Standard system BRD-B60W000: versions B13 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nWire-cut EDM MX Series MX900 D-CUBES Series Special system BRD-B63W000 to W036: all versions\nWire-cut EDM MX Series MX2400 D-CUBES Series Special system BRD-B63W000 to W036: all versions\nSinker EDM SV-P Series SV8P D-CUBES Series Standard system BRD-M60W000: versions A12 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nSinker EDM SV-P Series SV12P D-CUBES Series Standard system BRD-M60W000: versions A12 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nSinker EDM SV-P Series SV8P D-CUBES Series Special system BRD-M63W000 to W022: all versions\nSinker EDM SV-P Series SV12P D-CUBES Series Special system BRD-M63W000 to W022: all versions\nSinker EDM SG Series SG8 D-CUBES Series Standard system BRD-M60W000: versions A12 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nSinker EDM SG Series SG12 D-CUBES Series Standard system BRD-M60W000: versions A12 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nSinker EDM SG Series SG28 D-CUBES Series Standard system BRD-M60W000: versions A12 and prior, without Special Modification Patch BRD-C62W003-A0 installed\nSinker EDM SG Series SG8 D-CUBES Series Special system BRD-BRD-M63W000 to W022: all versions\nSinker EDM SG Series SG12 D-CUBES Series Special system BRD-M63W000 to W022: all versions\nSinker EDM SG Series SG28 D-CUBES Series Special system BRD-M63W000 to W022: all versions\n\n3.2 Vulnerability Overview\n3.2.1 Improper Input Validation CWE-20\nRemote code execution vulnerability due to Microsoft Message Queuing service on Microsoft Windows exists in electrical discharge machines.\nCVE-2023-21554 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2023-21554. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends that users install the Special Modification Patch BRD-C62W003-A0 on their system. For information about how to install the update program, please contact your local service center.\nMitsubishi Electric recommends taking the mitigations listed below to minimize the risk of exploitation of this vulnerability.\n\nUse a firewall, virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\nRestrict physical access to the affected products and to personal computers and network devices that can communicate with them.\nInstall anti-virus software on personal computers that can communicate with the affected products.\n\nFor specific update instructions and additional details refer to Mitsubishi Electric advisory 2023-022.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability) has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nFebruary 20, 2024: Initial Publication\nApril 23, 2024: (Update A) Added Special Modification Patch BRD-C62W003-A0\n\n",
  "cves": [
    "CVE-2023-21554"
  ],
  "techniques": [],
  "advisory": "icsa-24-051-03",
  "title": "Mitsubishi Electric Electrical Discharge Machines (Update A) | CISA",
  "source": "ics-advisories",
  "id": "d88bd9c152166d468fd3edc7e34ce352acb338652d627d41202626b8629a437f"
}