{
  "markdown": "\nCVSS v3 10.0\nATTENTION: Remotely exploitable/low skill level to exploit\nVendor: Westermo\nEquipment: MRD-305-DIN, MRD-315, MRD-355, and MRD-455\nVulnerabilities: Cross-Site Request Forgery (CSRF), Use of Hard-Coded Credentials, and Use of Hard-Coded Cryptographic Key\nAFFECTED PRODUCTS\nThe following Westermo router models and firmware versions are affected:\n\nMRD-305-DIN versions older than 1.7.5.0, and\nMRD-315, MRD-355, MRD-455 versions older than 1.7.5.0\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to obtain hard-coded cryptographic keys, hard-coded credentials, or trick a user into submitting a malicious request, resulting in the attacker gaining unauthorized access to the device and running arbitrary code.\nMITIGATION\nWestermo recommends that users update to the latest firmware version 1.7.7.0. The new version can be downloaded at:\nhttp://www.westermo.com\nWestermo has also released a security advisory that can be found at:\nhttp://www.westermo.com/solutions/cyber-security/resource-centre\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also, recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \nVULNERABILITY OVERVIEW\n\nCROSS-SITE REQUEST FORGERY (CSRF) CWE-352\n\nThe application does not verify whether a request was intentionally provided by the user, making it possible for an attacker to trick a user into making a malicious request to the server.\nCVE-2017-12703 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nUSE OF HARD-CODED CREDENTIALS CWE-798\n\nThe device utilizes hard-coded credentials, which could allow for unauthorized local low privileged access to the device.\nCVE-2017-12709 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n\nUSE OF HARD-CODED CRYTPGRAPHIC KEY CWE-321\n\nThe device utilizes hard-coded private cryptographic keys that may allow an attacker to decrypt traffic from any other source.\nCVE-2016-5816 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:N).\nRESEARCHER\nMandar Jadhav from Qualys Security has identified the vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, and Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Sweden\n",
  "cves": [
    "CVE-2017-12709",
    "CVE-2016-5816",
    "CVE-2017-12703"
  ],
  "techniques": [],
  "advisory": "icsa-17-236-01",
  "title": "Westermo MRD-305-DIN, MRD-315, MRD-355, and MRD-455 | CISA",
  "source": "ics-advisories",
  "id": "8bb19e3fefa5b50e4e4574e1394d6472d932177d426c17809619d2842bc6ceb9"
}