{
  "markdown": "\nCVSS v3 8.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: RUGGEDCOM NMS\nVulnerabilities: Cross-Site Request Forgery, Cross-Site Scripting.\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following RUGGEDCOM monitoring products:\n\nRUGGEDCOM NMS: All versions prior to V2.1.0 (Windows and Linux).\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to perform administrative operations under certain conditions.\nMITIGATION\nSiemens provides RUGGEDCOM NMS V2.1.0 which fixes the vulnerabilities and recommends users update to the new version. Information on how to obtain the latest RUGGEDCOM software and firmware can be found at the following location on the Siemens web site:\nhttps://support.industry.siemens.com/cs/ww/en/view/109745179\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-363881 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nAs a general security measure Siemens strongly recommends protecting network access to the RUGGEDCOM NMS with appropriate mechanisms and configuring the environment according to Siemens’ operational guidelines in order to run the devices in a protected IT environment.\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nCROSS-SITE REQUEST FORGERY (CSRF) CWE-352\n\nThe web application (Ports 8080/TCP and 8081/TCP) could allow a remote attacker to perform a cross-site request forgery (CSRF) attack, potentially allowing an attacker to execute administrative operations, provided the targeted user has an active session and is induced to trigger a malicious request.\nCVE-2017-2682 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nCROSS-SITE SCRIPTING CWE-79\n\nA non-privileged user of the web application (Ports 8080/TCP and 8081/TCP) could perform a persistent cross-site scripting (XSS) attack, potentially resulting in acquisition of administrative permissions.\nCVE-2017-2683 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:N).\nBACKGROUND\nCritical Infrastructure Sectors: Energy, Healthcare and Public Health, and Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-2682",
    "CVE-2017-2683"
  ],
  "techniques": [],
  "advisory": "icsa-17-059-01",
  "title": "Siemens RUGGEDCOM NMS | CISA",
  "source": "ics-advisories",
  "id": "6379a6cec3c15eba886e9e7fc63620965a4193afc20cde2f704a8eaba58c7997"
}