{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). View CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.6\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SITOP UPS1600 10 A Ethernet/ PROFINET (6EP4134-3AB00-2AY0), SITOP UPS1600 20 A Ethernet/ PROFINET (6EP4136-3AB00-2AY0), SITOP UPS1600 40 A Ethernet/ PROFINET (6EP4137-3AB00-2AY0), SITOP UPS1600 EX 20 A Ethernet PROFINET (6EP4136-3AC00-2AY0)\nVulnerabilities: Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to cause limited impact in the affected systems.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SITOP UPS1600, an uninterruptible power supply, are affected:\n\nSITOP UPS1600 10 A Ethernet/ PROFINET (6EP4134-3AB00-2AY0): All versions prior to V2.5.4\nSITOP UPS1600 20 A Ethernet/ PROFINET (6EP4136-3AB00-2AY0): All versions prior to V2.5.4\nSITOP UPS1600 40 A Ethernet/ PROFINET (6EP4137-3AB00-2AY0): All versions prior to V2.5.4\nSITOP UPS1600 EX 20 A Ethernet PROFINET (6EP4136-3AC00-2AY0) All versions prior to V2.5.4\n\n3.2 Vulnerability Overview\n3.2.1 OUT-OF-BOUNDS WRITE CWE-787\nmstolfp in libntp/mstolfp.c in NTP 4.2.8p15 has an out-of-bounds write when adding a decimal point. An adversary may be able to attack a client ntpq process, but cannot attack ntpd.\nCVE-2023-26552 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.2 OUT-OF-BOUNDS WRITE CWE-787\nmstolfp in libntp/mstolfp.c in NTP 4.2.8p15 has an out-of-bounds write when copying the trailing number. An adversary may be able to attack a client ntpq process, but cannot attack ntpd.\nCVE-2023-26553 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.3 OUT-OF-BOUNDS WRITE CWE-787\nmstolfp in libntp/mstolfp.c in NTP 4.2.8p15 has an out-of-bounds write when adding a ‘\\0' character. An adversary may be able to attack a client ntpq process, but cannot attack ntpd.\nCVE-2023-26554 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends users to update to the latest version:\n\nSITOP UPS1600 10 A Ethernet/ PROFINET (6EP4134-3AB00-2AY0): Update to V2.5.4 or later version\nSITOP UPS1600 20 A Ethernet/ PROFINET (6EP4136-3AB00-2AY0): Update to V2.5.4 or later version\nSITOP UPS1600 40 A Ethernet/ PROFINET (6EP4137-3AB00-2AY0): Update to V2.5.4 or later version\nSITOP UPS1600 EX 20 A Ethernet PROFINET (6EP4136-3AC00-2AY0): Update to V2.5.4 or later version\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage\nFor more information see the associated Siemens security advisory SSA-238730 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities have a high attack complexity.\n5. UPDATE HISTORY\n\nJune 13, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-26554",
    "CVE-2023-26552",
    "CVE-2023-26553"
  ],
  "techniques": [],
  "advisory": "icsa-24-165-05",
  "title": "Siemens SITOP UPS1600 | CISA",
  "source": "ics-advisories",
  "id": "b4692e7d406187b0df950e5d9110a361933239fedb955d1935f0258332883ebe"
}