{
  "markdown": "\nOverview\nIndependent researcher Carlos Mario Penagos Hollmann identified a remotely exploitable, uncontrolled search path element vulnerability, commonly referred to as a DLL hijack, in Measuresoft’s ScadaPro application. Measuresoft has produced an upgrade to address this vulnerability. Mr. Hollmann has verified that the new version resolves the vulnerability.\nAffected Products\nThe following Measuresoft products are affected:\n\nScadaPro Server, prior to Version 4.0.0, and\nScadaPro Client, prior to Version 4.0.0.\n\nImpact\nSuccessful exploitation of this vulnerability may lead to arbitrary code execution.Impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nScadaPro is a supervisory control and data acquisition (SCADA) system used in the power generation, oil and gas, pharmaceuticals, and manufacturing sectors. According to Measuresoft, ScadaPro is sold in multiple countries by various third-party distributors, making total deployment difficult to quantify.Measuresoft Development Ltd. is headquartered in Louth, Ireland, with an office in Missouri City, Texas.\nVulnerability Characterization\nVulnerability Overview\nUncontrolled Search Path ElementCWE, http://cwe.mitre.org/data/definitions/427.html, Web site last accessed May 25, 2012.\nScadaPro uses a fixed or controlled search path to find resources, which could allow an unauthorized user to easily locate and exploit one or more locations. An unauthorized user could place a malicious DLL in a directory where it could be loaded before the valid DLL. An attacker must have access to the host file system to exploit this vulnerability. If exploited, this vulnerability could allow execution of arbitrary code.CVE-2012-1824NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2012-1824, NIST uses this ICS-CERT Advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 6 has been assigned; the CVSS vector string is (AV:L/AC:H/Au:S/C:C/I:C/A:C).\nVulnerability Details\nExploitability\nThis vulnerability can be remotely exploited.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a moderate skill level could be able to exploit these vulnerabilities.\nMitigation\nMeasuresoft has produced an upgrade to address this vulnerability. Links to the upgrade can be found here:\n\nScadaPro Server: http://www.measuresoft.net/download/versions.aspx?v=CB&d=Server, and\nScadaPro Client: http://www.measuresoft.net/download/versions.aspx?v=CB&d=Client.\n\nMicrosoft has also released a Security Advisory (2269637).Microsoft Security Advisory, http://technet.microsoft.com/en-us/security/advisory/2269637, Web site visited May 25, 2012.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nDo not click Web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n \n",
  "cves": [
    "CVE-2012-1824"
  ],
  "techniques": [],
  "advisory": "icsa-12-145-01",
  "title": "Measuresoft ScadaPro DLL Hijack | CISA",
  "source": "ics-advisories",
  "id": "dd06878f360427b765bacac08d17b242be81db2b45d2ecc83da10cc779374aeb"
}