{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: XHQ Operations Intelligence\nVulnerabilities: Cross-site Request Forgery, Improper Neutralization of Script-Related HTML Tags in a Web Page, Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to read or modify contents of the web application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affects the following Operations Intelligence products:\n\nXHQ: All versions prior to v6.0.0.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 CROSS-SITE REQUEST FORGERY CWE-352\nThe web interface could allow a cross-site request forgery (CSRF) attack if an unsuspecting user is tricked into accessing a malicious link.\nCVE-2019-13930 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N).\n3.2.2 IMPROPER NEUTRALIZATION OF SCRIPT-RELATED HTML TAGS IN A WEB PAGE CWE-80\nThe web interface could allow for an attacker to craft the input in an unexpected form, causing the application to behave in unexpected ways for legitimate users.\nCVE-2019-13931 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:H).\n3.2.3 IMPROPER INPUT VALIDATION CWE-20\nThe web application requests could be manipulated, causing the application to behave in unexpected ways for legitimate users.\nCVE-2019-13932 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends users update XHQ Operations Intelligence product line to v6.0.0.2 or later. To obtain the most recent version, please contact the local service organization.\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nFollow the XHQ documentation to implement a secure IIS configuration.\nAllow only HTTPS communications to XHQ.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals. Additional information on Industrial Security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity  \nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens security advisory SSA-525454 at the following location:\nhttp://www.siemens.com/cert/advisories\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-13930",
    "CVE-2019-13932",
    "CVE-2019-13931"
  ],
  "techniques": [],
  "advisory": "icsa-19-344-05",
  "title": "Siemens XHQ Operations Intelligence | CISA",
  "source": "ics-advisories",
  "id": "b39308d706d545d621132e159b90c70e1b8cd268968cc70fbb7e14036ecf107f"
}