{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: Multiple products\nVulnerability: Predictable Exact Value from Previous Values\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could be used to hijack TCP sessions and allow remote command execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the vulnerability affects the following products:\n\nQJ71MES96: all versions\nQJ71WS96: all versions\nQ06CCPU-V: all versions\nQ24DHCCPU-V: the first 5 digits of serial number 24031 and prior\nQ24DHCCPU-VG: the first 5 digits of serial number 24031 and prior\nR12CCPU-V: Version 13 and prior\nRD55UP06-V: Version 09 and prior\nRD55UP12-V: Version 01\nRJ71GN11-T2: Version 11 and prior\nRD78G4: Version 14 and prior\nRD78G8: Version 14 and prior\nRD78G16: Version 14 and prior\nRD78G32: Version 14 and prior\nRD78G64: Version 14 and prior\nRD78GHV: Version 14 and prior\nRD78GHW: Version 14 and prior\nNZ2FT-MT: all versions\nNZ2FT-EIP: all versions\nQ03UDECPU: the first 5 digits of serial number 22081 and prior\nQ04UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ06UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ10UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ13UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ20UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ26UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ50UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ100UDEHCPU: the first 5 digits of serial number 22081 and prior\nQ03UDVCPU: the first 5 digits of serial number 22031 and prior\nQ04UDVCPU: the first 5 digits of serial number 22031 and prior\nQ06UDVCPU: the first 5 digits of serial number 22031 and prior\nQ13UDVCPU: the first 5 digits of serial number 22031 and prior\nQ26UDVCPU: the first 5 digits of serial number 22031 and prior\nQ04UDPVCPU: the first 5 digits of serial number 22031 and prior\nQ06UDPVCPU: the first 5 digits of serial number 22031 and prior\nQ13UDPVCPU: the first 5 digits of serial number 22031 and prior\nQ26UDPVCPU: the first 5 digits of serial number 22031 and prior\nL02CPU(-P): the first 5 digits of serial number 22051 and prior\nL06CPU(-P): the first 5 digits of serial number 22051 and prior\nL26CPU(-P): the first 5 digits of serial number 22051 and prior\nL26CPU-(P)BT: the first 5 digits of serial number 22051 and prior\nR00CPU: Version 18 and prior\nR01CPU: Version 18 and prior\nR02CPU: Version 18 and prior\nR04CPU: Version 50 and prior\nR08CPU: Version 50 and prior\nR16CPU: Version 50 and prior\nR32CPU: Version 50 and prior\nR120CPU: Version 50 and prior\nR04ENCPU: Version 50 and prior\nR08ENCPU: Version 50 and prior\nR16ENCPU: Version 50 and prior\nR32ENCPU: Version 50 and prior\nR120ENCPU: Version 50 and prior\nR08SFCPU: Version 22 and prior\nR16SFCPU: Version 22 and prior\nR32SFCPU: Version 22 and prior\nR120SFCPU: Version 22 and prior\nR08PCPU: Version 24 and prior\nR16PCPU: Version 24 and prior\nR32PCPU: Version 24 and prior\nR120PCPU: Version 24 and prior\nR08PSFCPU: Version 05 and prior\nR16PSFCPU: Version 05 and prior\nR32PSFCPU: Version 05 and prior\nR120PSFCPU: Version 05 and prior\nFX5U(C)-**M*/** Serial number 17X**** or later: Version 1.210 and prior\nFX5U(C)-**M*/** Serial number 179**** and prior: Version 1.070 and prior\nFX5UC-32M*/**-TS: Version 1.210 and prior\nFX5UJ-**M*/**: Version 1.000\nFX5-ENET: Version 1.002 and prior\nFX5-ENET/IP: Version 1.002 and prior\nFX3U-ENET-ADP: Version 1.22 and prior\nFX3GE-**M*/**: the first 3 digits of serial number 20X and prior\nFX3U-ENET: Version 1.14 and prior\nFX3U-ENET-L: Version 1.14 and prior\nFX3U-ENET-P502: Version 1.14 and prior\nFX5-CCLGN-MS: Version 1.000\nIU1-1M20-D: all versions\nLE7-40GU-L screen package data: version 1.01 and prior\nGOT2000 Series GT21 Model: Version 01.44.000 and prior\nGS Series GS21 Model: Version 01.44.000 and prior\nGOT1000 Series GT14 Model: all versions\nFR-A800-E Series: production date December 2020 and prior\nFR-F800-E Series: production date December 2020 and prior\nFR-A8NCG: Production date August 2020 and prior\nFR-E800-EPA Series: Production date July 2020 and prior\nFR-E800-EPB Series: Production date July 2020 and prior\nConveyor Tracking Application APR-1TR3FH (Discontinued product): all versions\nConveyor Tracking Application APR-1TR6FH (Discontinued product): all versions\nConveyor Tracking Application APR-1TR12FH (Discontinued product): all versions\nConveyor Tracking Application APR-1TR20FH (Discontinued product): all versions\nConveyor Tracking Application APR-2TR3FH (Discontinued product): all versions\nConveyor Tracking Application APR-2TR6FH (Discontinued product): all versions\nConveyor Tracking Application APR-2TR12FH (Discontinued product): all versions\nConveyor Tracking Application APR-2TR20FH (Discontinued product): all versions\nMR-JE-C: all versions\nMR-J4-TM: all versions\nRJ71EN71: Version 48 and prior\nQJ71E71-100: the first 5 digits of serial number 21092 and prior\nLJ71E71-100: the first 5 digits of serial number 21092 and prior\nQJ71MT91: the first 5 digits of serial number 20082 and prior\nNZ2GACP620-60: Version 1.03D and prior\nNZ2GACP620-300: Version 1.03D and prior\nGT25-J71GN13-T2: Version 03 and prior\n\n3.2 Vulnerability Overview\n3.2.1 PREDICTABLE EXACT VALUES FROM PREVIOUS VALUES CWE-342\nThe affected products are vulnerable to impersonation of a legitimate device by a malicious actor, which may allow an attacker to remotely execute arbitrary commands.\nCVE-2020-16226 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nTa-Lun Yen of TXOne IoT/ICS Security Research Labs of Trend Micro, working with Trend Micro's Zero Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends that users take the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\nUse a firewall or VPN, etc., to prevent unauthorized access when Internet access is required.\nUse within a LAN and ensure that they are not accessible from untrusted networks and hosts.\nRestrict physical access to affected products and any network devices on the network to which the products are connected (e.g., storing in locked cabinets, attaching seals to unused Ethernet ports).\nInstall an antivirus software in your computer to access the product.\n\nMitsubishi Electric has also released the following fixed versions, some products cannot be updated to the fixed version. Please check the Mitsubishi Electric website for details.\n\nR12CCPU-V: Version 14 or later\nRD55UP06-V: Version 10 or later\nRD55UP12-V: Version 02 or later\nRJ71GN11-T2: Version 12 or later\nQ03UDECPU: the first 5 digits of serial number 22082 or later\nQ24DHCCPU-V: the first 5 digits of serial number 24032 or later\nQ24DHCCPU-VG: the first 5 digits of serial number 24032 or later\nQnUDEHCPU(n=04/06/10/13/20/26/50/100): the first 5 digits of serial number 22082 or later\nQnUDVCPU(n=03/04/06/13/26): the first 5 digits of serial number 22032 or later\nQnUDPVCPU(n=04/06/13/26): the first 5 digits of serial number 22032 or later\nLnCPU(-P)(n=02/06/26): the first 5 digits of serial number 22052 or later\nL26CPU-(P)BT: the first 5 digits of serial number 22052 or later\nRnSFCPU (n=08/16/32/120): Version 23 or later\nRnPSFCPU(n=08/16/32/120): Version 06 or later\nRnPCPU(n=08/16/32/120): Version 25 or later\nRnCPU(n=00/01/02): Version 18 and prior: Update to Version 19 or later\nRnCPU(n=04/08/16/32/120): Version 50 and prior. Please update to Version 51 or later\nRnENCPU(n=04/08/16/32/120): Versions 50 and prior: Update to Version 51 or later\nFX5U(C)-**M*/** Serial number 17X**** or later, Version 1.210 and prior: Update to Version 1.211 or later\nFX5U(C)-**M*/** Serial number 179**** and prior, Version 1.070 and prior: Update to Version 1.071 or later\nFX5UC-32M*/**-TS, Version 1.210 and prior: Update to Version 1.211 or later\nFX5UJ-**M*/**, Version 1.000: Update to Version 1.001 or later\nFX5-ENET: Version 1.003 or later\nFX5-ENET/IP: Version 1.003 or later\nFX3U-ENET-ADP: Version 1.24 or later\nFX3GE-**M*/**: the first 3 digits of serial number 20Y or later\nFX3U-ENET: Version 1.16 or later\nFX3U-ENET-L: Version 1.16 or later\nFX3U-ENET-P502: Version 1.16 or later\nFX5-CCLGN-MS: Version 1.001 or later\nFR-A800-E Series: production date January 2021 or later\nFR-F800-E Series: production date January 2021 or later\nFR-A8NCG: production date September 2020 or later\nFR-E800-EPA Series: production date August 2020 or later\nFR-E800-EPB Series: production date August 2020 or later\nRJ71EN71: Version 49 or later\nQJ71E71-100: the first 5 digits of serial number 22102 or later\nLJ71E71-100: the first 5 digits of serial number 22102 or later\nQJ71MT91: the first 5 digits of serial number 22102 or later\nNZ2GACP620-60: Version 1.04E or later\nNZ2GACP620-300: Version 1.04E or later\nLE7-40GU-L: screen package data, version 1.02 or later\nGOT2000 Series GT21 Model: Version 01.45.000 or later\nGS Series GS21 Model: Version 01.45.000 or later\nGT25-J71GN13-T2: Version 04 or later\nRD78Gn(n=4,8,16,32,64): Version 16 or later\nRD78GHV: Version 16 or later\nRD78GHW: Version 16 or later\n\nPlease contact a Mitsubishi Electric representative for more information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n5. UPDATE HISTORY\n\nSeptember 30, 2022: Update E - Previous Publication (start of new update tracking)\nJune 28, 2023: Update F - Added link to updated Mitsubishi advisory\nJune 13, 2024: Update G - Expanded Affected Products list to match current format, included physical access mitigations, moved link to Mitsubishi advisory\n\n",
  "cves": [
    "CVE-2020-16226"
  ],
  "techniques": [],
  "advisory": "icsa-20-245-01",
  "title": "Mitsubishi Electric Multiple Products (Update G) | CISA",
  "source": "ics-advisories",
  "id": "8826c8792ff27681125a125fe2ffbac5e27408639ef6432e35eb8017347a783e"
}