{
  "markdown": "\nCVSS v3 6.8\nVendor: ABB\nEquipment: TropOS\nVulnerabilities: Security Features\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-318-02 ABB TropOS that was published November 14, 2017, on the NCCIC/ICS-CERT website.\nAFFECTED PRODUCTS\nABB reports that the key reinstallation attacks (KRACK) potentially affect all TropOS broadband mesh routers and bridges operating on Mesh OS release 8.5.2 or prior.\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to decrypt, replay, and forge some frames on a WPA2 encrypted network.\nMITIGATION\n----------Begin Update A Part 1 of 1 --------\nABB has released Mesh OS version 8.5.3 to address these vulnerabilities.\nABB has released an advisory (1KHW02890) on their alerts and notification page:\nhttp://search-ext.abb.com/library/Download.aspx?DocumentID=1KHW02890&Action=Launch\n--------- End Update A Part 1 of 1 ----------\nABB is working on remedial actions for all affected products.\nABB has released an advisory (1KHW02890) on their alerts and notification page:\nhttp://search-ext.abb.com/library/Download.aspx?DocumentID=1KHW02890&Action=Launch\nThis advisory will be updated when firmware, including remedial measures, is available.\nThe TropOS mesh wireless interfaces are not vulnerable. Wired client interfaces (Ethernet, Serial) are not vulnerable. An attacker must be in physical proximity of the Wi-Fi access point and connected client to be successful. If the communication across the Wi-Fi link is encrypted at Layer 3 (e.g., SSH, SSL, HTTPS, or SNMPv3 encrypted), privacy is maintained during an otherwise successful attack. If possible, encrypt communication across the Wi-Fi link at Layer 3 using SSH, SSL, HTTPS, or SNMPv3. There is no complete workaround which allows protected Wi-Fi access to the TropOS Mesh.\nABB users with a current Complete Software Care or Complete Software + Hardware Care subscription are advised to contact ABB Wireless support on phone +1(408) 331 6800, ext. 4, or email tropos.support@nam.abb.com.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nThese vulnerabilities have been publicly disclosed. These vulnerabilities are exploitable from adjacent networks. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nSECURITY FEATURES CWE-254\n\nAn industry-wide vulnerability exists in the WPA2 key management algorithm devices that use IEEE 802.11w, including the TropOS broadband mesh routers listed above. The vulnerability may allow an attacker to decrypt, replay, and forge some frames on a WPA2 encrypted network.\nThe following CVEs have been assigned to this group of vulnerabilities:\nCVE-2017-13077: reinstallation of the pairwise key in the four-way handshake,\nCVE-2017-13078: reinstallation of the group key in the four-way handshake,\nCVE-2017-13079: reinstallation of the integrity group key in the four-way handshake,\nCVE-2017-13080: reinstallation of the group key in the group key handshake,\nCVE-2017-13081: reinstallation of the integrity group key in the group key handshake,\nCVE-2017-13082: accepting a retransmitted fast BSS transition reassociation request and reinstalling the pairwise key while processing it,\nCVE-2017-13084: reinstallation of the STK key in the PeerKey handshake,\nCVE-2017-13086: reinstallation of the tunneled direct-link setup (TDLS) PeerKey (TPK) key in the TDLS handshake,\nCVE-2017-13087: reinstallation of the group key (GTK) when processing a wireless network management (WNM) sleep mode response frame, and\nCVE-2017-13088: reinstallation of the integrity group key (IGTK) when processing a wireless network management (WNM) sleep mode response frame.\nA CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\nRESEARCHER\nMathy Vanhoef, of the Katholieke Universiteit Leuven in Belgium, discovered this vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Switzerland\n",
  "cves": [
    "CVE-2017-13088",
    "CVE-2017-13081",
    "CVE-2017-13082",
    "CVE-2017-13078",
    "CVE-2017-13079",
    "CVE-2017-13084",
    "CVE-2017-13080",
    "CVE-2017-13077",
    "CVE-2017-13086",
    "CVE-2017-13087"
  ],
  "techniques": [],
  "advisory": "icsa-17-318-02a",
  "title": "ABB TropOS (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0724397b2d9a7a2cc05eb70d362847aab230ade9a69935ba68af88518fed7fce"
}