{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC NET PC, SITOP Manager, TeleControl Server Basic\nVulnerability: Null Pointer Dereference\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-132-08 Siemens Industrial Products with OPC UA that was published May 12, 2022, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the device by sending uncertain status code in a response message.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens industrial products are affected:\n\nSIMATIC NET PC Software v14: All versions prior to 14 SP1 Update 14\nSIMATIC NET PC Software v15: All versions\nSIMATIC NET PC Software v16: All versions prior to 16 Update 6 \nSIMATIC NET PC Software v17: All versions prior to 17 SP1\nSITOP Manager: All versions\n\n--------- Begin Update C Part 1 of 3 ---------\n\nSIMATIC HMI Comfort Outdoor Panels 7” and 15” (including SIPLUS variants): All versions prior to 17 Update 5\nSIMATIC HMI Comfort Panels 4” to 22” (including SIPLUS variants): All versions prior to 17 Update 5\nSIMATIC HMI KTP Mobile Panels KTP400F, KTP700, KTP700F, KTP900 and KTP900F: All versions prior to 17 Update 5\n\n--------- End Update C Part 1 of 3 ---------\n\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    NULL POINTER DEREFERENCE CWE-476\nThe OPC UA ANSIC stack (also called Legacy C-stack) was reported to crash when an unexpected OPC UA response message status code was accessed via the synchronous Client API. The vulnerability was found in generated code of the OPC Foundation C-stack. An unexpected status code in response messages will result in null pointer dereference, leading to a ping-of-death crash. This affects a client, but it might also affect a server when it uses OpcUa_ClientApi_RegisterServer (e.g., register at Local Discovery Server). A specially crafted UA server or machine-in-the-middle attacker can cause the OPC UA application to crash by sending uncertain status code in response messages.\nCVE-2021-45117 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has recommended the following:\n\nSIMATIC NET PC Software v14, update to v14 SP1 Update 14 or later\nSIMATIC NET PC Software v15, no fix is currently planned \nSIMATIC NET PC Software v16, update to v16 Update 6 or later\nSIMATIC NET PC Software v17, update to v17 SP1 or later\nSITOP Manager, no fix is currently planned\n\n--------- Begin Update C Part 2 of 3 ---------\n\nSIMATIC HMI Comfort Outdoor Panels 7” and 15” (including SIPLUS variants), update to v17 Update 5 or later\nSIMATIC HMI Comfort Panels 4” to 22” (including SIPLUS variants), update to v17 Update 5 or later\nSIMATIC HMI KTP Mobile Panels KTP400F, KTP700, KTP700F, KTP900 and KTP900F, update to v17 Update 5 or late\n\n \n--------- End Update C Part 2 of 3 ---------\nSiemens has identified the following specific workarounds and mitigations to reduce risk:\n\nDo not use OPC client feature to connect via untrusted networks or to untrusted OPC-UA communication partners.\nUse VPN for protecting network communication between cells.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\n--------- Begin Update C Part 3 of 3 ---------\nFor additional information, please refer to Siemens Security Advisory SSA-285795 in HTML or CSAF.\n--------- End Update C Part 3 of 3 ---------\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-45117"
  ],
  "techniques": [],
  "advisory": "icsa-22-132-08",
  "title": "Siemens Industrial Products with OPC UA (Update C) | CISA",
  "source": "ics-advisories",
  "id": "50a1460feb220c0a6e68984ae3a7348082bafa639f144fb6e915f7a2a6b84dbf"
}