{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Airspan Networks\nEquipment: Mimosa by Airspan product line\nVulnerabilities: Improper Authorization, Incorrect Authorization, Server-side Request Forgery, SQL Injection, Deserialization of Untrusted Data, OS Command Injection, Use of a Broken or Risky Cryptographic Algorithm\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain user data (including organization details) and other sensitive data, compromise Mimosa’s AWS (Amazon Web Services) cloud EC2 instance and S3 Buckets, and execute unauthorized remote code on all cloud-connected Mimosa devices.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products of the Mimosa by Airspan product line, a network management software platform, are affected:\n\nMMP: All versions prior to v1.0.3\nPTP C-series: Device versions prior to v2.8.6.1\nPTMP C-series and A5x: Device versions prior to v2.5.4.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHORIZATION CWE-285\nThe affected product does not perform proper authorization and authentication checks on multiple API routes. An attacker may gain access to these API routes and achieve remote code execution, create a denial-of-service condition, and obtain sensitive information.\nCVE-2022-21196 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    INCORRECT AUTHORIZATION CWE-863\nThe affected product does not perform proper authorization checks on multiple API functions. An attacker may gain access to these functions and achieve remote code execution, create a denial-of-service condition, and obtain sensitive information.\nCVE-2022-21141 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    SERVER-SIDE REQUEST FORGERY (SSRF) CWE-918\nThis vulnerability could allow an attacker to force the server to create and execute a web request granting access to backend APIs that are only accessible to the Mimosa MMP server, or request pages that could perform some actions themselves. The attacker could force the server into accessing routes on those cloud-hosting platforms, accessing secret keys, changing configurations, etc.\nCVE-2022-21215 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.4    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe affected product does not properly sanitize user input, which may allow an attacker to perform a SQL injection and obtain sensitive information.\nCVE-2022-21176 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n3.2.5    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nThe affected product has a deserialization function that does not validate or check the data, allowing arbitrary classes to be created.\nCVE-2022-0138 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.2.6    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nThe affected product does not properly sanitize user input on several locations, which may allow an attacker to inject arbitrary commands.\nCVE-2022-21143 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.7    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThe affected product uses the MD5 algorithm to hash the passwords before storing them but does not salt the hash. As a result, attackers may be able to crack the hashed passwords.\nCVE-2022-21800 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nNoam Moshe of Claroty reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAirspan Networks recommends users update to following products (Login Required):\n\nMMP: Version 1.0.4 or later\nPTP:\n\nC5x: Version 2.90 or later\nC5c: Version 2.90 or later\n\n\nPTMP: \n\nC-series: Version 2.9.0 or later\nA5x: Version 2.9.0 or later\n\n\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-21143",
    "CVE-2022-21141",
    "CVE-2022-0138",
    "CVE-2022-21196",
    "CVE-2022-21215",
    "CVE-2022-21800",
    "CVE-2022-21176"
  ],
  "techniques": [],
  "advisory": "icsa-22-034-02",
  "title": "Airspan Networks Mimosa | CISA",
  "source": "ics-advisories",
  "id": "222d8be71de879dc0107fda38e63f2e1ecec9555bc0e14b0d058721fa303c442"
}