{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: low attack complexity\nVendor: Schneider Electric\nEquipment: IGSS (Interactive Graphical SCADA System)\nVulnerability: Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow arbitrary code execution or loss of control of the SCADA system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports these vulnerabilities affect the following IGSS (Interactive Graphical SCADA System) products:\n\nIGSS Update Service (IGSSupdateservice.exe): v16.0.0.23211 and prior.\n\n3.2 Vulnerability Overview\n3.2.1 Missing Authentication for Critical Function CWE-306\nA missing authentication for critical function vulnerability that could allow a local attacker to change the update source exists in the IGSS Update Service, which could lead to remote code execution the attacker force an update containing malicious content.\nCVE-2023-4516 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nSina Kheirkhah (@SinSinology) of Summoning Team (@SummoningTeam) working with Trend Micro Zero Day Initiative reported these vulnerabilities to Schneider Electric and CISA.\n4. MITIGATIONS\nSchneider Electric provided version 16.0.0.23212 of Update Service to address these vulnerabilities.\nThe update is available for download through IGSS Master > Update IGSS Software or from the Schneider Electric support page.\nIf users choose not to apply the remediation provided above, they should immediately apply the following mitigations to reduce the risk of exploit:\n\nDisable the IGSS Update Service as an Administrator, and only enable it while installing new updates.\nReview and implement the security guideline for IGSS on securing an IGSS SCADAinstallation.\nFollow the general security recommendation below and verify that devices are isolated on a private network and firewalls are configured with strict boundaries for devices that require remote access.\n\nFor more information, see Schneider Electric security notification SEVD-2023-255-01.\nSchneider Electric recommends the following industry cybersecurity best practices:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls so no unauthorized personnel can access your industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in the \"Program\" mode.\nNever connect programming software to any network other than the network intended for that device.\nScan all methods of mobile data exchange with the isolated network such as CDs, USB drives, etc. before use in the terminals or any node connected to these networks.\nNever allow mobile devices that have connected to any network besides the intended network to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and systems and ensure that they are not accessible from the internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs). Recognize that VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand that VPNs are only as secure as the connected devices.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nOctober 12, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-4516"
  ],
  "techniques": [],
  "advisory": "icsa-23-285-16",
  "title": "Schneider Electric IGSS | CISA",
  "source": "ics-advisories",
  "id": "232532be0403d03efd64e896c922c26b577a98035159495e61ca3b1dd0539668"
}