{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: PLUSCONTROL\nVulnerability: Predictable Exact Value from Previous Values\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could affect integrity of TCP connections.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following products:\n\nPLUSCONTROL 1st Gen: all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PREDICTABLE EXACT VALUE FROM PREVIOUS VALUES CWE-342\nInitial sequence numbers (ISNs) for TCP connections are derived from an insufficiently random source. As a result, the ISN of current and future TCP connections could be predictable. An attacker could hijack existing sessions or spoof future ones.\nCVE-2020-28388 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nPLUSCONTROL devices are typically located in a separate LAN segment of energy transmission solutions, where an attacker could use this vulnerability to disrupt SER messages or trace functionalities. Therefore, review the status of the defense-in-depth recommendations that apply to your specific deployment and align as needed; especially the measures on the network layer to prevent accessibility from other network segments.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-344238\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-28388"
  ],
  "techniques": [],
  "advisory": "icsa-21-068-08",
  "title": "Siemens Energy PLUSCONTROL 1st Gen | CISA",
  "source": "ics-advisories",
  "id": "6257f85a504cc21ffb861f2066acffa7c793668952201ac101904a490448ac3d"
}