{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Teamcenter\nVulnerabilities: Command Injection, Infinite Loop\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to command injection and denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Teamcenter, a product lifecycle management software, are affected:\n\nTeamcenter v12.4: All versions prior to v12.4.0.15\nTeamcenter v13.0: All versions prior to v13.0.0.10\nTeamcenter v13.1: All versions prior to v13.1.0.10\nTeamcenter v13.2: All versions prior to v13.2.0.9\nTeamcenter v13.3: All versions prior to v13.3.0.5\nTeamcenter v14.0: All versions prior to v14.0.0.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND (’COMMAND INJECTION’) CWE-77\nThe affected product is vulnerable to command injection, which may allow an attacker to remotely execute arbitrary code.\nCVE-2022-34660 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:H/UI:R/S:C/C:H/I:H/A:H).\n3.2.2    LOOP WITH UNREACHABLE EXIT CONDITION ('INFINITE LOOP') CWE-835\nThe affected product is vulnerable to an attack that causes the product to enter an infinite loop and use CPU cycles. This could allow an attacker to cause a denial-of-service condition.\nCVE-2022-34661 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nHan Lee from Apple Information Security reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens has identified the following workarounds and mitigations users can apply to reduce risk:\n\nHarden the application’s host to prevent local access by untrusted or unauthorized personnel.\nLimit access to port 4544/tcp to known, trusted IP addresses with a firewall.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-759952\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-34661",
    "CVE-2022-34660"
  ],
  "techniques": [],
  "advisory": "icsa-22-223-02",
  "title": "Siemens Teamcenter | CISA",
  "source": "ics-advisories",
  "id": "ad79afe9b24d87a26af130b0c5123a7dfa7f816d559a8cf4a2fd2dc0bd56a307"
}