{
  "markdown": " Arbiter Systems Power Sentinel Denial\\-of\\-Service Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryArbiter Systems Power Sentinel Denial\\-of\\-Service Vulnerability================================================================ Last Revised April 30, 2013 Alert Code ICSA\\-12\\-249\\-01Overview-------- Arbiter Systems reported to ICS\\-CERT that a vulnerability that causes a denial of service (DoS) has been identified in Arbiter Systems Power Sentinel Phasor Measurement Unit. The vulnerability can be exploited remotely. Arbiter Systems has produced a patch that mitigates this vulnerability. OSIsoft tested the patch to validate that it resolves the vulnerability.Affected Products----------------- The following Arbiter Systems Power Sentinel products are affected:* Model 1133A Power Sentinel, firmware versions 09Jun2012 and earlier.Impact------ Successful exploitation of this vulnerability could lead to a DoS. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of the vulnerability based on their operational environment, architecture, and product implementation.Background---------- Arbiter Systems manufactures time clocks, power measurement, and power calibration products for use in electricity generation and transmission. These products are used primarily in the United States. Some are deployed to South America and Europe as well.Vulnerability Characterization------------------------------### Vulnerability Overview#### Denial of ServiceCWE\\-410: Insufficient Resource Pool, http://cwe.mitre.org/data/definitions/410\\.html, Web site last accessed September 05, 2012\\. The Ethernet port on this device stops responding to queries when its buffer is full. Certain types of queries to the Ethernet port, such as port scanning, cause the device to stop responding. CVE\\-2012\\-3012NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2012\\-XXXX, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to these vulnerabilities. A CVSS v2 base score of 7\\.8 has been assigned; the CVSS vector string is [(AV:N/AC:L/Au:N/C:N/I:N/A:C)](http://nvd.nist.gov/cvss.cfm?version=2&vector=(AV:N/AC:M/Au:N/C:N/I:N/A:C))  .### Vulnerability Details#### Exploitability This vulnerability can be exploited remotely.#### Existence of Exploit No known public exploits specifically target this vulnerability.#### Difficulty An attacker with a low skill would be able to exploit this vulnerability.Mitigation---------- Arbiter Systems recommends that users update firmware to 11June2012 Rev 421 or later. This version is available on the product page for Model 1133A at the company Web site (http://www.arbiter.com/news/index.php?id\\=261\\). Users will need to download both the firmware as well as the uploader software to send the firmware to the device. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP Web page. Several recommended practices are available for reading and download, including *Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*  .CSSP Recommended Practices, http://www.us\\-cert.gov/control\\_systems/practices/Recommended\\_Practices.html, Web site last accessed September 05, 2012\\. Additional mitigation guidance and recommended practices are publicly available in the ICS\\-CERT Technical Information Paper ICS\\-TIP\\-12\\-146\\-01A—Cyber Intrusion Mitigation Strategies.Cyber Intrusion Mitigation Strategies, http://www.us\\-cert.gov/control\\_systems/pdf/ICS\\-TIP\\-12\\-146\\-01A.pdf, Web site last accessed September 05, 2012\\. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Arbiter Systems-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-249-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2012-3012"
  ],
  "techniques": [],
  "advisory": "icsa-12-249-01",
  "title": "Arbiter Systems Power Sentinel Denial-of-Service Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "60c5513719adf9c44095812170c7800d9c0818b77a231f86810aa24926020ec2"
}