{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Siemens  \nEquipment: RUGGEDCOM CROSSBOW \nVulnerabilities: Missing Authorization, SQL Injection \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow authenticated remote attackers to access restricted data or execute arbitrary database queries via an SQL injection attack.  \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following software from Siemens is affected: \n\nSiemens RUGGEDCOM CROSSBOW: All versions prior to V5.3 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 MISSING AUTHORIZATION CWE-862 \nIn the affected application, the client query handler fails to check for proper permissions for specific read queries. This could allow authenticated remote attackers to access restricted data. \nCVE-2023-27462 has been assigned to this vulnerability. A CVSS v3 base score of 3.1 has been assigned. The CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:L/I:N/A:N). \n3.2.2 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89 \nIn affected applications, the audit log form is vulnerable to SQL injection. This could allow authenticated remote attackers to execute arbitrary SQL queries on the server database. \nCVE-2023-27463 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned. The CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA. Cameron Whitehead from RISES Center at UCF reported the vulnerability CVE-2023-27463 to Siemens. \n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: \n\nRUGGEDCOM CROSSBOW: Update to V5.3 or later version \n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for Industrial Security. Additional information on Industrial Security by Siemens can be found at the Siemens website.\nFor more information, see the associated Siemens security advisory SSA-320629 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.  \n",
  "cves": [
    "CVE-2023-27463",
    "CVE-2023-27462"
  ],
  "techniques": [],
  "advisory": "icsa-23-075-02",
  "title": "Siemens RUGGEDCOM CROSSBOW V5.3 | CISA",
  "source": "ics-advisories",
  "id": "052dbebc7bed12e71afc6ec8343054013ce378939355f7678f916e9734382327"
}