{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: Siemens\nEquipment: Building Technologies Products\nVulnerabilities: Stack-based Buffer Overflows, Security Features, Improper Restriction of Operations within the Bounds of a Memory Buffer, NULL Pointer Dereference, XML Entity Expansion, Heap-based Buffer Overflow, Improper Access Control\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-093-01 Siemens Building Technologies Products that was published April 3, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow arbitrary code execution, NTLM-relay attacks, remote code execution, denial of service, or increased attack surface.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens License Management System (LMS), which includes a vulnerable version of Gemalto Sentinel LDK RTE, is used by the following Siemens products and solutions:\n\nLicense Management System (LMS) All versions prior to V2.1 SP3(2.1.670)\nAnnual Shading V1.0.4 and 1.1\nDesigo ABT Versions\n\nMP1.1 Build 845\nMP1.15 Build 360\nMP1.16 Build 055\nMP1.2 Build 850\nMP1.2.1 Build 318\nMP2.1 Build 965\n\n\nDesigo CC Versions\n\nMP1.1\nMP2.0\nMP2.1\nMP3.0\n\n\nDesigo Configuration Manager (DCM) V6.10.140\nDesigo XWP\n\nV5.00.204\nV5.00.260\nV5.10.142\nV5.10.212\nV6.00.184\nV6.00.342\nV6.10.172\n\n\nSiteIQ Analytics\n\nV1.1\nV1.2\nV1.3\n\n\nSiveillance Identity V1.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1     STACK-BASED BUFFER OVERFLOW CWE-121\nMalformed ASN1 streams in V2C and similar input files can be used to generate stack-based buffer overflows. The vulnerability could allow arbitrary code execution.\nCVE-2017-11496 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2     STACK-BASED BUFFER OVERFLOW CWE-121\nLanguage packs containing malformed filenames could lead to a stack-based buffer overflow. The vulnerability could allow arbitrary code execution.\nCVE-2017-11497 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3     SECURITY FEATURES CWE-254\nRemote manipulation of the language pack updater could allow NTLM-relay attacks.\nCVE-2017-12819 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.4     IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nA memory corruption flaw could allow remote code execution.\nCVE-2017-12821 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.5     NULL POINTER DEREFERENCE CWE-476\nZipped language packs with invalid HTML files could lead to NULL pointer access. The vulnerability could cause denial of service of the remote process.\nCVE-2017-11498 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.6     IMPROPER RESTRICTION OF RECURSIVE ENTITY REFERENCES IN DTDS ('XML ENTITY EXPANSION') CWE-776\nA stack overflow flaw in the custom XML-parser could allow remote denial of service.\nCVE-2017-12818 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.7     HEAP-BASED BUFFER OVERFLOW CWE-122\nArbitrary memory read from controlled memory pointer could allow remote denial of service.\nCVE-2017-12820 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.8     IMPROPER ACCESS CONTROL CWE-284\nThe administrative interface can be remotely enabled and disabled without authentication. This could increase the attack surface.\nCVE-2017-12822 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n\n4.4 RESEARCHER\nSergey Temnikov and Vladimir Dashchenko from Kaspersky Labs reported these vulnerabilities to Siemens.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 --------\nSiemens recommends that users upgrade License Management System (LMS) to version 2.1 SP4 (2.1.681) or newer. To do so, users should follow the instructions at https://support.industry.siemens.com/cs/document/109479834 or contact the local Siemens representative or Siemens customer support.\n--------- End Update A Part 1 of 1 --------\nNOTE: Users using Desigo CC MP2.1 or older need to upgrade ALM Manager before applying the update to LMS.\nSiemens has released the following advisory:\nhttps://cert-portal.siemens.com/productcert/pdf/ssa-727467.pdf\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2017-11498",
    "CVE-2017-11496",
    "CVE-2017-12818",
    "CVE-2017-12821",
    "CVE-2017-11497",
    "CVE-2017-12819",
    "CVE-2017-12822",
    "CVE-2017-12820"
  ],
  "techniques": [],
  "advisory": "icsa-18-093-01",
  "title": "Siemens Building Technologies Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "24a989847a7d885825db3f9088f86e309a33b8474be21f2997b8fd52aed0a435"
}