{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: LCDS—Leão Consultoria e Desenvolvimento de Sistemas LTDA ME\nEquipment: LAquis SCADA\nVulnerabilities: Out-of-bounds Read, Type Confusion\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to obtain confidential information or execute remote code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version of LAquis SCADA, an industrial automation software, is affected:\n\nSCADA 4.3.1.71\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nProcessing a specially crafted project file may trigger an out-of-bounds read, which may allow an attacker to obtain sensitive information.\nCVE-2019-10994 has been assigned to this vulnerability. A CVSS v3 base score of 2.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.2    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nA type confusion vulnerability may be exploited when LAquis SCADA processes a specially crafted project file.  This may allow an attacker to execute remote code.\nCVE-2019-10980 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: South America\nCOMPANY HEADQUARTERS LOCATION: Brazil\n\n3.4 RESEARCHER\nFrancis Provencher (PRL), working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nLCDS recommends users update to Version 4.3.1.323, which can be found at the following location:\nhttps://laquisscada.com\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2019-10980",
    "CVE-2019-10994"
  ],
  "techniques": [],
  "advisory": "icsa-19-213-06",
  "title": "LCDS LAquis SCADA LQS File Parsing | CISA",
  "source": "ics-advisories",
  "id": "8d05320fc46f5b5add56cab9e0ee9b1c6d6499988e304547546b7b14dab47159"
}