{
  "markdown": "\nOVERVIEW\nJohannes Klick, Christian Pfahl, Martin Gebert, and Lucas Jacob from Freie Universität Berlin’s work team SCADACS have identified a Denial-of-Service (DoS) vulnerability in Siemens SIMATIC S7-300 CPUs. Siemens has developed mitigations for this vulnerability.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following SIMATIC S7-300 CPUs are affected:\n\nSIMATIC S7-300 CPU family: all versions.\n\nIMPACT\nThis vulnerability could allow attackers to perform a DoS attack over the network without prior authentication against S7-300 CPUs under certain conditions. A cold restart is required to recover the system.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSiemens is a multinational company headquartered in Munich, Germany.\nThe affected product, SIMATIC S7-300 CPU, have been designed for process control in industrial environments. This product is deployed across several sectors including Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems. Siemens estimates that these products are used primarily in the United States and Europe with a small percentage in Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nDENIAL-OF-SERVICE ATTACKCWE-404: Improper Resource Shutdown or Release, http://cwe.mitre.org/data/definitions/404, web site last accessed March 05, 2015.\n\nSpecially crafted packets sent to Port 102/TCP (ISO-TSAP) or via Profibus could cause the affected device to go into defect mode. A cold restart is required to recover the system.\nCVE-2015-2177NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-2177, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7.8 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:N/I:N/A:C, web site last accessed March 05, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult.\nMITIGATION\nSiemens recommends the following mitigations:\n\nApply protection-level 3 (Read/Write protection),\nApply cell protection concept,Operational Guidelines for Industrial Security, https://www.siemens.com/cert/operational-guidelines-industrial-security, web site last accessed March 05, 2015.\nUse VPN for protecting network communication between cells, and\nApply Defense-in-Depth.Further information about Defense-in-Depth, http://www.industry.siemens.com/topics/global/en/industrial-security/concept/Pages/defense-in-depth.aspx, web site last accessed March 05, 2015.\n\nFor more information on these vulnerabilities and detailed instructions, please see Siemens Security Advisory SSA-987029 at the following location:\nhttp://www.siemens.com/cert/advisories\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed March 05, 2015. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed March 05, 2015. for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2015-2177"
  ],
  "techniques": [],
  "advisory": "icsa-15-064-04",
  "title": "Siemens SIMATIC S7-300 CPU Denial-of-Service Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "a621427afb9202c512ee0821722bfcda378e30f1c939e84fdd572eb9118ca7fe"
}