{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). \nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Low Attack Complexity\nVendor: Siemens\nEquipment: SIMATIC Field PG and SIMATIC IPC\nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated local user to potentially read other users' data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products of Siemens, are affected:\n\nSIMATIC Field PG M6: All Versions\nSIMATIC IPC BX-39A: All Versions\nSIMATIC IPC PX-39A: All Versions\nSIMATIC IPC PX-39A PRO: All Versions\nSIMATIC IPC RW-543A: All Versions\nSIMATIC IPC627E: All Versions\nSIMATIC IPC647E: All Versions\nSIMATIC IPC677E: All Versions\nSIMATIC IPC847E: All Versions\n\n3.2 Vulnerability Overview\n3.2.1 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nInformation exposure through microarchitectural state after transient execution in certain vector execution units for some Intel(R) Processors may allow an authenticated user to potentially enable information disclosure via local access.\nCVE-2022-40982 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nEnsure that only trusted persons have access to the system and avoid the configuration of additional accounts.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see the associated Siemens security advisory SSA-981975 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nSeptember 14, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2022-40982"
  ],
  "techniques": [],
  "advisory": "icsa-23-257-05",
  "title": "Siemens SIMATIC IPCs | CISA",
  "source": "ics-advisories",
  "id": "0c020ce3280e87e8b6840e11703b4c2ed28e4ab128938711f47cf04aabc8a5f4"
}