{
  "markdown": "\nOVERVIEW\nOn March 15, 2011, GLEG Ltd. announced the Agora SCADA+ Exploit Pack for Immunity’s CANVAS system. CANVAS is a penetration testing framework that is extensible using CANVAS Exploit Packs. On March 25, 2011, GLEG announced it would be adding exploits for the 35 vulnerabilities released by Luigi Auriemma on March 21, 2011. The ICS-CERT has not received any reports of this tool being used for an unauthorized compromise of an actual control system installation.\nICS-CERT has prepared this advisory to provide an initial summary of the possible vulnerabilities contained in this exploit pack. Please note that at this time, the information contained in this report is not conclusive, nor is it comprehensive. This report represents a cursory and credible snapshot of the vulnerabilities that are likely contained in the pack, based on the analysis conducted by ICS-CERT.\nAFFECTED PRODUCTS\nImmunity’s CANVAS is a penetration framework similar to the popular Metasploit tool. GLEG is a small company based in Moscow, Russia, that produces add-on exploit packages for Canvas. On March 22, 2011, GLEG’s CEO, Yuriy Gurkin, announced that its website was under a distributed denial-of-service (DDoS) attack with traffic exceeding 100 Gb per day. The source and intent of this traffic is unknown at this time.\nIMPACT\nICS-CERT contacted Immunity and obtained a general list of the targeted products and exploits (with very limited vulnerability details) contained in the Agora SCADA+ Exploit Pack. ICS-CERT has analyzed the data and surmises that of the 24 vulnerabilities, 18 are previously known and patched. One product could not be identified from the information provided. After consultation with the affected vendors, it appears that the remaining five may be true zero-day vulnerabilities. However, because the technical details of the vulnerabilities are not known, ICS-CERT’s analysis is not conclusive and vendors may have a difficult time addressing and patching these suspected vulnerabilities.\nICS-CERT contacted each of the identified vendors to inform them of the GLEG product. Some vendors have reached out to GLEG directly for additional information. ICS-CERT is also attempting to work with GLEG to obtain additional information and will update this reporting it as it becomes available.\nREFERENCES\nICS−ALERT-11-080-01 Multiple Vulnerabilities in Siemens Tecnomatix FactorylinkICS−ALERT-11-080-02 Multiple Vulnerabilities in Iconics Genesis (32 & 64)ICS−ALERT-11-080-03 Multiple Vulnerabilities ion 7-Technologies IGSSICS−ALERT-11-080-04 Multiple Vulnerabilities in Realflex RealWin\nTable 1. Known vulnerabilities likely included in the Agora SCADA+ Pack\n\n\n\nProduct\n\nExploit\n\n\nCVE\n\n\nICS-CERT Advisory\n\n\n\n\nIndusoft SCADA web studio 7.0 heap corruption\n\n\nHeap corruption\n\n\nCVE-2011-0488\n\n\n**\n\n\n\n\nSCADA Trace Mode Data Center\n\n\nFiledisclosure\n\n\nNone\n\n\n**\n\n\n\n\nIGSS SCADA odbc server\n\n\nDoS\n\n\nNone\n\n\nICSA-11-018-02 − IGSS ODBC Server Remote Heap Corruption\n\n\n\n\nOPC Modbus EthernetOPC Server\n\n\nDoS\n\n\nCVE-2010-4709\n\n\nICSA-10-322-02A - Automated Solutions OPC Server Vulnerability\n\n\n\n\nITS scada\n\n\nSQLInjection\n\n\nNone\n\n\nDemo website according to vendor, no ICS Product produced\n\n\n\n\nAutomated SolutionsModbus/TCP OPC Server\n\n\nRemote Heap Corruption\n\n\nCVE-2010-4709\n\n\nICSA-10-322-02A - Automated Solutions OPC Server Vulnerability\n\n\n\n\nBACnet OPC client before 1.0.25\n\n\nArbitrary code execution\n\n\nCVE-2010-4740\n\n\nICSA-10-264-01 - SCADA Engine BACnet OPC Client Buffer Overflow\n\n\n\n\nAdvantech Studio 6.1 Web server\n\n\nDoS\n\n\nCVE-2011-0488\n\n\nICSA-10-337-01 − Advantech_Studio_Buffer_Overflow\n\n\n\n\nICONICS Dialog Wrapper Module ActiveX control\n\n\nExploit\n\n\nCVE-2006-6488\n\n\n*\n\n\n\n\nBECK GMBH, INDUSTRIAL PC -\n\n\nIPC@CHIP DoS\n\n\nCVE-2001-1340\n\n\n*\n\n\n\n\nBECK GMBH, INDUSTRIAL PC -\n\n\nIPC@CHIP credentials stealing\n\n\nCVE-2001-1341\n\n\n*\n\n\n\n\nSafeNet Sentinel Protection Server <= 7.4.1.0 +Sentinel Keys Server <= 1.0.4.0DATARATE SCADA <= 2.5\n\n\nDirectory Traversal\n\n\nCVE-2008-0760\n\n\n*\n\n\n\n\nSCADA MOXA Device Manager Tool 2.1\n\n\nBuffer Overflow\n\n\nCVE-2010-4741\n\n\nICSA-10-301-01 - Moxa Device Manager Buffer Overflow\n\n\n\n\nEcava IntegraXor\n\n\nWeb directory traversal\n\n\nCVE-2010-4598\n\n\n \n\n\n\n\nGE Fanuc Real Time Information Portal 2.6.\n\n\n \n\n\nCVE-2008-0175\n\n\n*\n\n\n\n\nCitect SCADA ODBC\n\n\nBufferOverflow\n\n\nCVE-2008-2639\n\n\n*\n\n\n\n\nInvensys Wonderware InFusion SCADA (and other products) ActiveX.\n\n\n \n\n\nCVE-2010-2974\n\n\nICSA-10-208-01-Wonderware ArchestrA ActiveX ControlThere is no URL for this document because it was released exclusively on the US-CERT portal.\n\n\n\n\nDATAC RealWin SCADA 1.06\n\n\nBuffer Overflow Exploit\n\n\nCVE-2010-4142\n\n\nICSA-10-313-01 - RealWin Buffer Overflows\n\n\n\n\n* Vulnerability predates ICS-CERT, therefore no Advisory was published\n** Vulnerability is known, but technical details are currently unknown\nZERO-DAY VULNERABILITIES\nFive vulnerabilities appear to be true zero-day vulnerabilities. Because the technical details of the vulnerabilities are unknown, ICS-CERT’s analysis is not conclusive and vendors may have a difficult time addressing and patching these suspected vulnerabilities. ICS-CERT has contacted the affected vendors and provided them with the available information. Some vendors have reached out to GLEG directly for additional information. ICS-CERT will continue to work with the affected vendors and will provide analysis support as needed. Also, ICS-CERT will update this report as needed.\nMITIGATION\nICS-CERT recommends that asset owners and operators routinely audit their systems and apply updates as they become available or when possible. As with all system changes, administrators should consult their control systems vendor prior to making any control system changes.\nOrganizations observing suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations that proper impact analysis and risk assessment should be performed prior to taking defensive measures.\nThe Control System Security Program provides numerous recommended practices ICS-CERT CONTACT for control systems on the US-CERT website. Several relevant recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [
    "CVE-2008-0760",
    "CVE-2008-2639",
    "CVE-2010-4740",
    "CVE-2001-1341",
    "CVE-2011-0488",
    "CVE-2010-4142",
    "CVE-2010-4709",
    "CVE-2010-4598",
    "CVE-2010-4741",
    "CVE-2001-1340",
    "CVE-2006-6488",
    "CVE-2010-2974",
    "CVE-2008-0175"
  ],
  "techniques": [],
  "advisory": "icsa-11-096-01",
  "title": "GLEG Agora SCADA+ Exploit Pack | CISA",
  "source": "ics-advisories",
  "id": "8c31357d87013eddeda5eac47c3e5f2e67cf67172da47ae64a488e41c1b26c8c"
}