{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 7.6\nATTENTION: Exploitable remotely\nVendor: Johnson Controls Inc.\nEquipment: exacqVision Web Service\nVulnerability: Permissive Cross-domain Policy with Untrusted Domains\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to send an unauthorized request or access data from an untrusted domain.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports that the following versions of exacqVision Web Service are affected:\n\nexacqVision Web Service: 22.12.1.0\n\n3.2 Vulnerability Overview\n3.2.1 Permissive Cross-domain Policy with Untrusted Domains CWE-942\nUnder certain circumstances the exacqVision web service does not provide sufficient protection from untrusted domains.\nCVE-2024-32862 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-32862 . A base score of 7.6 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:H/AT:N/PR:N/UI:P/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Commercial Facilities, Government Facilities, Transportation Systems, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nDiego Zaffaroni from Nozomi Networks reported this vulnerability to Johnson Controls, Inc.\n4. MITIGATIONS\nJohnson Controls recommends users update exacqVision Web Service to version 24.06.\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2024-15\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nAugust 1, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-32862"
  ],
  "techniques": [],
  "advisory": "icsa-24-214-02",
  "title": "Johnson Controls exacqVision Web Service | CISA",
  "source": "ics-advisories",
  "id": "261948980ad471cc5fe6ad6e48864397a7241224ff43b1726e077802299b66f6"
}