{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Siveillance Video DLNA Server\nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow access to sensitive information on the DLNA server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siveillance Video DLNA Server, a video DLNA server, are affected:\n\nSiveillance Video DLNA Server 2019 R1: All versions\nSiveillance Video DLNA Server 2019 R2: All versions\nSiveillance Video DLNA Server 2019 R3: All versions\nSiveillance Video DLNA Server 2020 R1: All versions\nSiveillance Video DLNA Server 2020 R2: All versions\nSiveillance Video DLNA Server 2020 R3: All versions\nSiveillance Video DLNA Server 2021 R1: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PATH TRAVERSAL CWE-26\nThe affected application contains a path traversal vulnerability that could allow the reading of arbitrary files on the server located outside the application’s web document directory. An unauthenticated remote attacker could exploit this vulnerability to access sensitive information for subsequent attacks.\nCVE-2021-42021 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMilestone PSIRT reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has released updates for the DLNA server and recommends users apply the update on all installations where the DLNA server is used.\n\nSiveillance Video DLNA Server 2019 R1: Apply the hotfix using the latest available installer for the DLNA Server.\nSiveillance Video DLNA Server 2019 R2: Apply the hotfix using the latest available installer for the DLNA Server.\nSiveillance Video DLNA Server 2019 R3: Apply the hotfix using the latest available installer for the DLNA Server.\nSiveillance Video DLNA Server 2020 R1: Apply the hotfix using the latest available installer for the DLNA Server.\nSiveillance Video DLNA Server 2020 R2: Apply the hotfix using the latest available installer for the DLNA Server.\nSiveillance Video DLNA Server 2020 R3: Apply the hotfix using the latest available installer for the DLNA Server.\nSiveillance Video DLNA Server 2021 R1: Apply the hotfix using the latest available installer for the DLNA Server.\n\nAs a general security measure, Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices in order to run the devices in a protected IT environment.\nFor further inquiries on security vulnerabilities in Siemens’ products and solutions, please contact the Siemens ProductCERT.\nPlease see Siemens Security Advisory SSA-755517 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-42021"
  ],
  "techniques": [],
  "advisory": "icsa-21-315-13",
  "title": "Siemens Siveillance Video DLNA Server | CISA",
  "source": "ics-advisories",
  "id": "fb6e3be71e4cf90855703ee1e8eb613f4d8602c726883352e24ec6424f552e5d"
}