{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: CPC80 Firmware of SICAM A8000\nVulnerability: Missing Release of Resource after Effective Lifetime\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the device being accessed; a buffer overflow condition may allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nCP-8000 MASTER MODULE WITH I/O -25/+70°C (6MF2101-0AB10-0AA0): All versions prior to CPC80 v16.30\nCP-8000 MASTER MODULE WITH I/O -40/+70°C\" (6MF2101-1AB10-0AA0): All version prior to CPC80 v16.30\nCP-8021 MASTER MODULE (6MF2802-1AA00): All versions prior to CPC80 v16.30\nCP-8022 MASTER MODULE WITH GPRS (6MF2802-2AA00): All versions prior to CPC80 v16.30\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING RELEASE OF RESOURCE AFTER EFFECTIVE LIFETIME CWE-772\nThe affected product is vulnerable when using the HTTPS server under specific conditions, affected devices do not properly free resources. This could allow an unauthenticated remote attacker to put the device into a denial-of-service condition.\nCVE-2022-29884 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMichael Messner from Siemens Energy reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends updating to the latest version:\n\nCP-8000 MASTER MODULE WITH I/O -25/+70°C (6MF2101-0AB10-0AA0): Update to versions CPC80 v16.30 or later\nCP-8000 MASTER MODULE WITH I/O -40/+70°C\" (6MF2101-1AB10-0AA0): Update to versions CPC80 v16.30 or later\nCP-8021 MASTER MODULE (6MF2802-1AA00): Update to versions CPC80 v16.30 or later\nCP-8022 MASTER MODULE WITH GPRS (6MF2802-2AA00): Update to versions CPC80 v16.30 or later\n\nSiemens has identified the following specific workarounds and mitigations that customers can apply to\nreduce the risk:\n\nLimit access to port 443/tcp to trusted IP addresses and avoid opening untrusted files from unknown sources in affected products.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ Operational Guidelines for Industrial Security and following recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-491621\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-29884"
  ],
  "techniques": [],
  "advisory": "icsa-22-195-14",
  "title": "Siemens CPC80 Firmware of SICAM A8000 | CISA",
  "source": "ics-advisories",
  "id": "53839373cb01a55d510a358263bd8cf8e69293c4b4e7160840b8ba3988dfc571"
}