{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric Corporation\nEquipment: MELSEC iQ-R Series CPU Module\nVulnerability: Cleartext Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to be able to log in to the CPU module by obtaining credentials.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the vulnerability affects the following MELSEC CPU Modules:\n\nMELSEC iQ-R series Safety CPU R08SFCPU: Firmware versions \"26\" and prior\nMELSEC iQ-R series Safety CPU R16SFCPU: Firmware versions \"26\" and prior\nMELSEC iQ-R series Safety CPU R32SFCPU: Firmware versions \"26\" and prior\nMELSEC iQ-R series Safety CPU R120SFCPU: Firmware versions \"26\" and prior\nMELSEC iQ-R series SIL2 Process CPU R08PSFCPU: Firmware versions \"11\" and prior\nMELSEC iQ-R series SIL2 Process CPU R16PSFCPU: Firmware versions \"11\" and prior\nMELSEC iQ-R series SIL2 Process CPU R32PSFCPU: Firmware versions \"11\" and prior\nMELSEC iQ-R series SIL2 Process CPU R120PSFCPU: Firmware versions \"11\" and prior\n\n3.2 Vulnerability Overview\n3.2.1 Cleartext Transmission of Sensitive Information CWE-319\nAn unauthorized remote attacker may be able to log in to the CPU module by obtaining credentials other than password.\nCVE-2021-20599 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2021-20599. A base score of 7.8 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:L/SC:H/SI:H/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nIvan Speziale of Nozomi Networks reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric has prepared the following countermeasures:\n\nMELSEC iQ-R series Safety CPU R08/16/32/120SFCPU: Firmware versions \"27\" or later\nMELSEC iQ-R series SIL2 Process CPU R08/16/32/120PSFCPU: Firmware versions \"12\" or later\n\nCustomers using the affected products and versions may take measures through mitigations and workarounds. Mitsubishi Electric has released the fixed version as shown above, but updating the product to the fixed version is not available. Mitsubishi Electric recommends users take the following mitigation measures to minimize risk associated with this vulnerability:\n\nUse a firewall or virtual private network (VPN) to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\nUse the IP filter function to restrict the accessible IP addresses.\n\nPlease refer to the Mitsubishi Electric advisory for further details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nAugust 6, 2021: Initial Publication\nOctober 14, 2021: Update A - Changed affected products and mitigation sections.\nApril 18, 2024: Update B - Added mitigations for MELSEC iQ-R series SIL2 Process CPU\n\n",
  "cves": [
    "CVE-2021-20599"
  ],
  "techniques": [],
  "advisory": "icsa-21-287-03",
  "title": "Mitsubishi Electric MELSEC iQ-R Series (Update B) | CISA",
  "source": "ics-advisories",
  "id": "e1d799b529738d1eec71386c98b4fc3500a0768d93348ef6f4c494cb507522d7"
}