{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC Products, TIM 1531 IRC\nVulnerabilities: Improper Input Validation, Improper Validation of Specified Quantity in Input, Improper Validation of Specified Type of Input, Improper Validation of Syntactic Correctness of Input\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in a remote attacker causing a denial-of-service condition on the affected devices.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following software from Siemens is affected:\n\nSIMATIC Drive Controller family: All versions prior to V3.0.1\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): All versions prior to V4.6.0\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to V3.0.1\nSIMATIC S7-1500 Software Controller: All versions\nSIMATIC S7-PLCSIM Advanced: All versions prior V5.0\nSIPLUS TIM 1531 IRC (6AG1543-1MX00-7XE0): All versions\nTIM 1531 IRC (6GK7543-1MX00-0XE0): All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nAffected devices do not correctly process certain specially crafted packets sent to port 102/TCP, which could allow an attacker to cause a denial-of-service condition on the device.\nCVE-2021-40365 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H)\n3.2.2    IMPROPER VALIDATION OF SPECIFIED QUANTITY IN INPUT CWE-1284\nAffected devices do not correctly process certain specially crafted packets sent to port 102/TCP, which could allow an attacker to cause a denial-of-service condition on the device.\nCVE-2021-44693 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H)\n3.2.3    IMPROPER VALIDATION OF SPECIFIED TYPE OF INPUT CWE-1287\nAffected devices do not correctly process certain specially crafted packets sent to port 102/TCP, which could allow an attacker to cause a denial-of-service condition on the device.\nCVE-2021-44694 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:L/A:H)\n3.2.4    IMPROPER VALIDATION OF SYNTACTIC CORRECTNESS OF INPUT CWE-1286\nAffected devices do not correctly process certain specially crafted packets sent to port 102/TCP, which could allow an attacker to cause a denial-of-service condition on the device.\nCVE-2021-44695 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H)\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nGao Jian reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens released updates for several affected products and recommends updating to the latest versions. Siemens is preparing further updates and recommends countermeasures for products where updates are not, or not yet, available.\n\nSIMATIC Drive Controller family: Update to V3.0.1 or later version\nSIMATIC S7-PLCSIM Advanced: Update to V5.0 or later version\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): Update to V3.0.1 or later version\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): Update to V4.6.0 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nRestrict access to port 102/TCP to trusted systems with an external firewall\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security, and to follow the recommendations in the product manuals. Additional information on Industrial Security by Siemens can be found here.  \nFor further inquiries on security vulnerabilities in Siemens products, users should contact Siemens ProductCERT.\nFor more information, see the associated Siemens security advisory SSA-382653 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-40365",
    "CVE-2021-44694",
    "CVE-2021-44695",
    "CVE-2021-44693"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-03",
  "title": "Siemens Multiple Denial of Service Vulnerabilities in Industrial Products | CISA",
  "source": "ics-advisories",
  "id": "e2cf8d4c8165bdff50982021f80ae718762a656292154c674537945974e5faae"
}