{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 5.9\nATTENTION: Exploitable from adjacent network.\nVendor: PTC\nEquipment: Kepware ThingWorx Kepware Server\nVulnerability: Allocation of Resources Without Limits or Throttling\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the target device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPTC reports that the following products and versions are affected:\n\nPTC Kepware ThingWorx Kepware Server: V6\nPTC Kepware KEPServerEX: V6\nSoftware Toolbox TOP Server: V6\nGE IGS: V7.6x\n\n3.2 Vulnerability Overview\n3.2.1 Allocation of Resources Without Limits or Throttling CWE-770\nWhen performing an online tag generation to devices which communicate using the ControlLogix protocol, a machine-in-the-middle, or a device that is not configured correctly, could deliver a response leading to unrestricted or unregulated resource allocation. This could cause a denial-of-service condition and crash the Kepware application. By default, these functions are turned off, yet they remain accessible for users who recognize and require their advantages.\nCVE-2024-6098 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-6098. A base score of 5.9 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:H/AT:P/PR:N/UI:P/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov and Vera Mens of Claroty Research - Team82 reported this vulnerability to PTC.\n4. MITIGATIONS\nPTC recommends users take a defense-in-depth stance with regards to their manufacturing networks ensuring proper access control is maintained. Additionally, proper adherence to the Kepware Secure Deployment Guide will minimize this threat through accurate configuration and use of the product.\nPlease refer to this article (login required) for specific information on how this risk may be mitigated in your environment.\nIf additional questions remain, contact PTC Technical Support.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nAugust 15, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-6098"
  ],
  "techniques": [],
  "advisory": "icsa-24-228-11",
  "title": "PTC Kepware ThingWorx Kepware Server | CISA",
  "source": "ics-advisories",
  "id": "1a6baba9c25013c53d38edd2e3ce8a8a23bc770205c8a0b738105db675080d7c"
}