{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.6\nATTENTION: Low attack complexity\nVendor: GE Digital\nEquipment: CIMPLICITY\nVulnerability: Heap-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause memory corruption issues resulting in unwanted behavior such as code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following GE Digital products are affected: \n\n\nCIMPLICITY: All versions\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 HEAP-BASED BUFFER OVERFLOW CWE-122\nAll versions of GE Digital CIMPLICITY that are not adhering to SDG guidance and accepting documents from untrusted sources are vulnerable to memory corruption issues due to insufficient input validation, including issues such as out-of-bounds reads and writes, use-after-free, stack-based buffer overflows, uninitialized pointers, and a heap-based buffer overflow. Successful exploitation could allow an attacker to execute arbitrary code.\nCVE-2023-3463 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMichael Heinzl reported this vulnerability to CISA.\n4. MITIGATIONS\nTo obtain the latest versions of GE CIMPLICITY, contact your local GE Digital representative at https://digitalsupport.ge.com/s/contactsupport.\nExploit is only possible if an authenticated user with local access to the system obtains and opens a document from a malicious source so secure deployment and strong access management by users is essential. GE Digital and customers have a shared responsibility for security and users are required to adhere to the most recent Secure Deployment Guide (SDG) instructions.\nPlease refer to GE Digital’s security bulletin for more information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2023-3463"
  ],
  "techniques": [],
  "advisory": "icsa-23-199-06",
  "title": "GE Digital CIMPLICITY | CISA",
  "source": "ics-advisories",
  "id": "aece9704e1563eadd1b1687fcb5ff2d3d7b2b28082f651a7a129903bca0479b6"
}