{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC Process Historian\nVulnerability: Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could enable the execution of admin operations on the database.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC Process Historian, a long-term archive system, are affected:\n\nSIMATIC Process Historian 2013 and earlier: All versions\nSIMATIC Process Historian 2014: All versions prior to SP3 Update 6\nSIMATIC Process Historian 2019: All versions\nSIMATIC Process Historian 2020: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nAn interface in the software used for critical functionalities lacks authentication, which could allow a malicious attacker to insert, modify, or delete data.\nCVE-2021-27395 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released an update for the following affected products:\n\nSIMATIC Process Historian 2013 and earlier, all versions: See general Siemens recommendations below or upgrade to a newer SIMATIC Process Historian version.\nSIMATIC Process Historian 2014, all versions prior to SP3 Update 6: Update to SP3 Update 6 or later version.\n\nSiemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk:\n\nDeactivate following incoming rules in the local Windows firewall:\n\nPH Redundancy Services\nPH Wcf MessageQueue Service (RedundancyMaintenanceService)\nPH Wcf MessageQueue Service (SqlMirroringSetup)\nPH Wcf MessageQueue Service (MaintenanceService)\nPH SQL-Server Mirroring Port (UDP)\nPH SQL-Server Mirroring Port (TCP)\n\n\nIn case SIMATIC Process Historian is used as a redundant system, restrict remote IP addresses in the firewall rules to allow only access for the Master, the Standby, and the Mirror server.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and follow the recommendations in the product manuals. \nFor further inquiries on security vulnerabilities in Siemens products and solutions, please contact Siemens.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, see Siemens Security Advisory SSA-766247\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27395"
  ],
  "techniques": [],
  "advisory": "icsa-21-287-09",
  "title": "Siemens SIMATIC Process Historian | CISA",
  "source": "ics-advisories",
  "id": "c12a6cbecbbb05c755c6a5fd0e9b87122b9c9069d4b2ca690c8de88dfdffbdb7"
}