{
  "markdown": "\nCVSS v3 5.9\nATTENTION: Remotely exploitable.\nVendor: Siemens\nEquipment: LOGO! Soft Comfort\nVulnerability: Download of Code without Integrity Check\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following LOGO! Soft Comfort engineering software products:\n\nLOGO! Soft Comfort: All versions prior to V8.2\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a remote attacker in a privileged network position to manipulate a software package during download.\nMITIGATION\nSiemens removed the Update Center from LOGO! Soft Comfort V8.2 and provides SHA-256 checksums for all LOGO! Soft Comfort software packages via a secured HTTPS channel. Siemens recommends verifying legitimacy by comparing the SHA-256 checksum of the downloaded software package with the SHA-256 checksum provided for the software package.  Software version 8.2 for LOGO! Soft Comfort and SHA-256 checksums for LOGO! Soft Comfort downloads can be obtained via:\nhttps://www.siemens.com/logo-update\nAs a general security measure, Siemens strongly recommends protecting network access to the devices with appropriate mechanisms. Siemens advises configuring the environment according to Siemens operational guidelines in order to run the devices in a protected IT environment.\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-888929 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nDOWNLOAD OF CODE WITHOUT INTEGRITY CHECK CWE-494\n\nThe update center of LOGO! Soft Comfort lacks integrity verification on software packages downloaded via an unprotected communication channel. This could allow a remote attacker to manipulate the software package while performing a man-in-the-middle (MitM) attack.\nCVE-2017-12740 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N).\nRESEARCHER\nTobias Gebhardt reported this vulnerability to Siemens.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-12740"
  ],
  "techniques": [],
  "advisory": "icsa-17-353-04",
  "title": "Siemens LOGO! Soft Comfort | CISA",
  "source": "ics-advisories",
  "id": "74c4c98b4b2bed0d62865e7f668f4e0f97c7e9234e9b062a97261530e9f9333d"
}