{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Keysight Technologies\nEquipment: N6854A Geolocation Sever\nVulnerability: Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to escalate privileges in the affected device’s default configuration, resulting in remote code execution or deleting system files and folders.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Keysight monitoring products are affected:\n\nN6854A Geolocation Server versions 2.4.2 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nN6854A Geolocation Server versions 2.4.2 are vulnerable to untrusted data deserialization, which may allow a malicious actor to escalate privileges in the affected device’s default configuration and achieve remote code execution.\nCVE-2023-1399 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Government\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAn anonymous individual working with Trend Micro’s Zero Day Initiative reported this vulnerability to CISA.\n4. MITIGATIONS\nKeysight recommends upgrading the N6854A Geolocation server to version 2.4.3.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2023-1399"
  ],
  "techniques": [],
  "advisory": "icsa-23-080-01",
  "title": "Keysight N6845A Geolocation Server | CISA",
  "source": "ics-advisories",
  "id": "41249a17b88caea2424b8872b9ff7624108bf3187bdc1fb2e63e4a6f01b077e1"
}