{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.0\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available/known public exploitation\nVendor: FXC\nEquipment: AE1021, AE1021PE\nVulnerability: OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to achieve remote code execution on the device via NTP server settings.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of FXC AE1021, a wireless LAN router, are affected:\n\nAE1021PE firmware: version 2.0.9 and earlier\nAE1021 firmware: version 2.0.9 and earlier\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nFXC AE1021/AE1021PE versions 2.0.9 and prior are vulnerable to a code injection that could allow an authenticated user to achieve remote code execution via NTP server settings.\nCVE-2023-49897 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Information Technology, Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Japan\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nRyu Kuki, Takayuki Sasaki, and Katsunari Yoshioka of Yokohama National University reported this vulnerability to JPCERT/CC.\nChad Seaman and Larry Cashdollar of Akamai Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nFXC released the following versions to address this vulnerability:\n\nAE1021PE firmware: version 2.0.10.\nAE1021 firmware: version 2.0.10.\n\nFXC recommends users apply the following settings:\n\nReset \"Factory setting\" and change the default management screen login password.\n\nFor more information, see FXC's publication.\nFor more information, see JPCERT/CC's security advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA has received reports of this vulnerability being actively exploited.\nThis advisory contains a vulnerability that has an associated \"Known Exploited Vulnerabilities\" (KEV) entry. Refer to the following link to view the KEV entry: Known Exploited Vulnerabilities Catalog | CISA\n5. UPDATE HISTORY\n\nDecember 21, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-49897"
  ],
  "techniques": [],
  "advisory": "icsa-23-355-01",
  "title": "FXC AE1021/AE1021PE | CISA",
  "source": "ics-advisories",
  "id": "99e5b45560a9a976b0ce9d4e90463bdefd65cbf3006525bdc9807d31a4d82d00"
}