{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Moxa\nEquipment: NPort IAW5000A-I/O Series Wireless Device Server\nVulnerabilities: Classic Buffer Overflow, Stack-based Buffer Overflow, Improper Input Validation, OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device being accessed, cause a buffer overflow condition, or allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMoxa reports these vulnerabilities affect the following wireless device server:\n\nNPort IAW5000A-I/O Series firmware Version 2.2 or earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLASSIC BUFFER OVERFLOW CWE-120\nTwo buffer overflows in the built-in web server may allow a remote attacker to cause a denial-of-service condition.\nCVE-2021-32968 has been assigned to these vulnerabilities. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nFive buffer overflows in the built-in web server allow a remote attacker to initiate a denial-of-service attack and execute arbitrary code.\nCVE-2021-32976 has been assigned to these vulnerabilities. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER INPUT VALIDATION CWE-20\nData can be copied without validation in the built-in web server, which may allow a remote attacker to cause denial-of-service conditions.\nCVE-2021-32970 has been assigned to these vulnerabilities. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    OS COMMAND INJECTION CWE-78\nImproper input validation in the built-in web server may allow a remote attacker to execute commands.\nCVE-2021-32974 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy Sector\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nKonstantin Kondratev, Evgeniy Druzhinin and Ilya Karpov of Rostelecom-Solar reported these vulnerabilities to Moxa.\n4. MITIGATIONS\nMoxa has developed solutions to address these vulnerabilities. Please contact Moxa Technical Support for a security patch.\nMoxa has also published a security advisory to provide more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-32968",
    "CVE-2021-32970",
    "CVE-2021-32974",
    "CVE-2021-32976"
  ],
  "techniques": [],
  "advisory": "icsa-21-187-01",
  "title": "Moxa NPort IAW5000A-I/O Series Serial Device Server | CISA",
  "source": "ics-advisories",
  "id": "91bde16a21e1eab402f7b5743070ad6c5340624d5f0e9850f3df786a310a7b5e"
}