{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Low skill level to exploit\nVendor: LCDS - Leão Consultoria e Desenvolvimento de Sistemas Ltda ME\nEquipment: LAquis SCADA\nVulnerabilities: Exposure of Sensitive Information to an Unauthorized Actor, Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow unauthorized attackers to view sensitive information and create files in arbitrary locations.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LAquis SCADA are affected:\n\nLAquis SCADA Versions 4.3.1 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe affected product is vulnerable to sensitive information exposure by unauthorized users.\nCVE-2020-10618 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.2.2    IMPROPER INPUT VALIDATION CWE-20\nThe affected product is vulnerable to arbitrary file creation by unauthorized users.\nCVE-2020-10622 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: South America\nCOMPANY HEADQUARTERS LOCATION: Brazil\n\n3.4 RESEARCHER\nNatnael Samson (@NattiSamson) working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nLCDS recommends users update to the latest version of LAquis SCADA.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nEnsure that principles of least privilege are followed.\nRestrict physical access to critical systems.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-10622",
    "CVE-2020-10618"
  ],
  "techniques": [],
  "advisory": "icsa-20-119-01",
  "title": "LCDS LAquis SCADA | CISA",
  "source": "ics-advisories",
  "id": "f22d6e94a3eb4baeab679731c6d5febcc83cc60345d7fe014d73df62b760ddd6"
}