{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: Logix Controllers\nVulnerability: Inclusion of Functionality from Untrusted Control Sphere\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to modify user programs. A user could then unknowingly download those modified elements containing malicious code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports the vulnerability affects the following products:\n\n1768 CompactLogix controllers\n1769 CompactLogix controllers\nCompactLogix 5370 controllers\nCompactLogix 5380 controllers\nCompactLogix 5480 controllers\nCompact GuardLogix 5370 controllers\nCompact GuardLogix 5380 controllers\nControlLogix 5550 controllers\nControlLogix 5560 controllers\nControlLogix 5570 controllers\nControlLogix 5580 controllers\nGuardLogix 5560 controllers\nGuardLogix 5570 controllers\nGuardLogix 5580 controllers\nFlexLogix 1794-L34 controllers\nDriveLogix 5730 controllers\nSoftLogix 5800 controllers\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCLUSION OF FUNCTIONALITY FROM UNTRUSTED CONTROL SPHERE CWE-829\nAn attacker with the ability to modify a user program may change user program code on some ControlLogix, CompactLogix, and GuardLogix Control systems. Studio 5000 Logix Designer writes user-readable program code to a separate location than the executed compiled code, allowing an attacker to change one and not the other.\nCVE-2022-1161 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov and Tal Keren of Claroty reported this vulnerability to CISA.\n4. MITIGATIONS\nUsers using the affected software or controllers are directed towards the risk mitigation steps listed below and are encouraged, when possible, to combine this guidance with the general security guidelines for a comprehensive defense-in-depth strategy.\nThe following mitigations should be applied for ControlLogix 5560, ControlLogix 5570, ControlLogix 5580 series, GuardLogix 5570, GuardLogix 5580, GuardLogix 5380, CompactLogix, CompactLogix 5380 devices:\nRisk Mitigation A:\n\nRecompile and download user program code (i.e., acd).\nPut controller mode switch into Run position.\n\nIf keeping controller mode switch in Run is impractical, use the following mitigation:\n\nRecompile and download user program code (i.e., acd).\nMonitor controller change log for any unexpected modifications or anomalous activity.\nUtilize the Controller Log feature.\nUtilize Change Detection in the Logix Designer Application.\nIf available, use the functionality in FactoryTalk AssetCenter software to detect changes.\n\nRisk Mitigation B:\nImplement CIP Security to help prevent unauthorized connections when properly deployed. Supported controllers and communications modules include:\n\nControlLogix 5580 processors using on-board EtherNet/IP port.\nGuardLogix 5580 processors using on-board EtherNet/IP port.\nControlLogix 5580 processors operating in High Availability (HA) configurations using 1756-EN4TR\nControlLogix 5560, ControlLogix 5570, ControlLogix 5580, GuardLogix 5570 and GuardLogix 5580 can use a 1756-EN4TR ControlLogix EtherNet/IP module.\n\nIf using a 1756-EN2T, then replace with a 1756-EN4TR\n\n\nCompactLogix 5380 using on-board EtherNet/IP port.\nCompactLogix GuardLogix 5380 using on-board EtherNet/IP port.\n\nThe following mitigations should be applied for 1768 CompactLogix, 1769 CompactLogix, CompactLogix 5370, and CompactLogix 5480 devices:\n\nRecompile and download user program code (i.e., acd).\nPut controller mode switch into Run position.\n\nIf keeping controller mode switch in Run is impractical, then use the following mitigation:\n\nRecompile and download user program code (i.e., acd).\nMonitor controller change log for any unexpected modifications or anomalous activity.\nUse the Controller Log feature.\nUse Change Detection in the Logix Designer application.\nIf available, use the functionality in FactoryTalk AssetCenter to detect changes.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2022-1161"
  ],
  "techniques": [],
  "advisory": "icsa-22-090-05",
  "title": "Rockwell Automation Logix Controllers | CISA",
  "source": "ics-advisories",
  "id": "0ecf580d065d77ab862318313a9a2dcc5949fc38dd214c048b955b6363e9cafc"
}