{
  "markdown": "\nCVSS v3 5.9\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: Schneider Electric\nEquipment: Modicon Premium, Modicon Quantum, Modicon M340, and Modicon BMXNOR0200\nVulnerabilities: Stack-based Buffer Overflow, Use of Hard-coded Credentials, Use of a Broken or Risky Cryptographic Algorithm.\nAFFECTED PRODUCTS\nThe following versions of Modicon PLCs are affected:\n\nModicon Premium all versions,\nModicon Quantum all versions,\nModicon M340 all versions, and\nModicon X80 RTU (BMXNOR0200H) all versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow a remote unauthorized attacker access to the file transfer service on the device, which could result in arbitrary code execution or malicious firmware installation.\nMITIGATION\nSchneider Electric recommends that users follow the instructions outlined in the Modicon Controllers Platform - Cyber Security, Reference Manual to install Modicon PLCs securely.\nSchneider Electric also recommends that affected users disable FTP services on the device during times when maintenance or configuration activities are not needed.\nFor more information please see Schneider Electric’s security notification SEVD-2018-081-01 at:\nhttps://www.schneider-electric.com/en/download/document/SEVD-2018-081-01/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nThe FTP server does not limit the length of a command parameter which may cause a buffer overflow condition.\nCVE-2018-7240 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:R/S:U/C:N/I:N/A:H).\n\nUSE OF HARD-CODED CREDENTIALS CWE-798\n\nThe FTP servers contain a hard-coded account, which could allow unauthorized access.\nCVE-2018-7241 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:L/A:H).\n\nUSE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\n\nThe FTP server does not limit the length of a command parameter, which may cause a buffer overflow condition.\nCVE-2018-7242 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:L/A:H).\nRESEARCHER\nNikita Maximov, Alexey Stennikov, and Kirill Chernyshov of Positive Technologies reported the vulnerabilities to Schneider Electric. Meng Leizi and Zhang Daoquan reported the vulnerabilities to NCCIC.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2018-7241",
    "CVE-2018-7242",
    "CVE-2018-7240"
  ],
  "techniques": [],
  "advisory": "icsa-18-086-01",
  "title": "Schneider Electric Modicon Premium, Modicon Quantum, Modicon M340, and Modicon BMXNOR0200 | CISA",
  "source": "ics-advisories",
  "id": "ad4cd764be10b5961f1fd471532773cb7bd8b1b58d07691ed1ba0dda3457cff1"
}