{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: Delta Electronics\nEquipment: Delta Robot Automation Studio (DRAS)\nVulnerability: Improper Restriction of XML External Entity Reference.\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to read and exfiltrate sensitive information from the affected host machine.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DRAS, a controller software suite, are affected:\n\nDRAS: All versions prior to 1.13.20\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nThe software processes an XML document that could contain XML entities with URIs that resolve to documents outside of the intended sphere of control, causing the product to embed incorrect documents into its output. This may allow an attacker to view sensitive documents and information on the affected host.\nCVE-2022-2759 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nKimiya, working with Trend Micro Zero’s Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nDelta Electronics recommends users update DRAS to version 1.13.20 or later to address this vulnerability.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-2759"
  ],
  "techniques": [],
  "advisory": "icsa-22-228-03",
  "title": "Delta Industrial Automation DRAS | CISA",
  "source": "ics-advisories",
  "id": "881bb5c131929115ab616f30c60afb2cb48363ce609a943b2f881a1d073c1564"
}