{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE and RUGGEDCOM Devices\nVulnerability: Improper Restriction of Excessive Authentication Attempts\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-068-02 Siemens SCALANCE and RUGGEDCOM Devices SSH that was published March 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition under certain conditions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nRUGGEDCOM RM1224: v6.3\nSCALANCE M-800: v6.3\nSCALANCE: S615: v6.3\nSCALANCE SC-600: All versions from v2.1 and prior to v2.1.3 \n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition under certain conditions.\nCVE-2021-25676 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends applying updates where applicable:\n\nSCALANCE SC-600: Update to v2.1.3 or later\n\n--------- Begin Update A Part 1 of 1 ---------\n\nRUGGEDCOM RM1224: Update to v6.4 or later\n\t \nSCALANCE M-800/S615: Update to v6.4 or later\n\n--------- End Update A Part 1 of 1 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nConfigure the built-in firewall to only allow SSH incoming connections from trusted IP addresses.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-296266\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-25676"
  ],
  "techniques": [],
  "advisory": "icsa-21-068-02",
  "title": "Siemens SCALANCE and RUGGEDCOM Devices SSH (Update A) | CISA",
  "source": "ics-advisories",
  "id": "b30b2e36d37889758cbad0cf0ba2247323a2905ce6d6f7a504f2e735afefd3c9"
}