{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Phoenix Contact\nEquipment: FL NAT SMx\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthorized users full access to the device configuration.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPhoenix Contact reports the vulnerability affects the following FL NAT SMx industrial Ethernet switches:\n\nFL NAT SMN 8TX-M (2702443)\nFL NAT SMN 8TX-M-DMG (2989352)\nFL NAT SMN 8TX (2989365)\nFL NAT SMCS 8TX (2989378)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nAn unauthorized user can access the web interface using an authorized IP address, which may allow full access to the device configuration. This attack is only possible if an authorized session is still active on the system.\nCVE-2019-9744 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Critical Manufacturing, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nCERT@VDE, working with Maxim Rupp and Phoenix Contact, reported this vulnerability to NCCIC.\n4. MITIGATIONS\nPhoenix Contact recommends affected users operate the devices in closed networks or protected with a suitable firewall.\nPhoenix Contact recommends that users consider the following steps to protect the device from an attacker who has gained access to the closed network, or if there is a possibility that multiple users might share a VPN connection with a single endpoint IP:\n\nLog off from the WEB-UI immediately after administration.\nDisable the WEB-UI and use configuration access via SNMP instead.\n\nEnsure the system password is strong as this is also the SNMP write community.\n\n\n\nAdditional recommendations can be found within the following application note:\nhttps://www.phoenixcontact.com/assets/downloads_ed/local_pc/web_dwl_technical_info/ah_en_industrial_security_107913_en_01.pdf\nPlease see VDE-2019-006 at the following location for more details:\nhttps://cert.vde.com/en-us/advisories/vde-2019-006\nNCCIC notes that the SNMP mitigation strategy introduces new risk into the system because of known vulnerabilities within SNMP v2c. NCCIC recommends those using the SNMP mitigation strategy implement the following best practices:\n\nApply extended access control lists (ACLs) to block unauthorized computers from accessing the device. Access to devices with read and/or write SNMP permission should be strictly controlled. If monitoring and change management are done through separate software, then they should be on separate devices.\nSegregate SNMP traffic onto a separate management network. Management network traffic should be out-of-band; however, if device management must coincide with standard network activity, all communication occurring over that network should use some encryption capability. If the network device has a dedicated management port, it should be the sole link for services like SNMP, Secure Shell (SSH), etc.\nFor additional SNMP security recommendations see the following US-CERT Alert:\n\nhttps://www.us-cert.gov/ncas/alerts/TA17-156A\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-9744"
  ],
  "techniques": [],
  "advisory": "icsa-19-155-02",
  "title": "PHOENIX CONTACT FL NAT SMx | CISA",
  "source": "ics-advisories",
  "id": "ac1a581d079ae9dc92e1348164e330f4e11122163fff4e0012f7bd35ff461038"
}