{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.7\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Unitronics\nEquipment: Vision Legacy series\nVulnerability: Storing Passwords in a Recoverable Format\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to log in to the Remote HMI feature, where the PLC may be factory reset, stopped, and restarted.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Unitronics Vision Legacy series PLCs are affected:\n\nVision 230: All versions\nVision 280: All versions\nVision 290: All versions\nVision 530: All versions\nVision 120: All versions\n\n3.2 Vulnerability Overview\n3.2.1 Storing Passwords in a Recoverable Format CWE-257\nUnitronics Vision Legacy series PLCs allow a remote, unauthenticated individual to retrieve the 'Information Mode' password in plaintext.\nCVE-2024-1480 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-1480. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Israel\n\n3.4 RESEARCHER\nReid Wightman of Dragos reported this vulnerability to CISA.\n4. MITIGATIONS\nUnitronics recommends users to:\n\nChange the default 1111 \"Info Mode\" password via SI 253.\nRestrict Ethernet access to the PLC having an Ethernet card using: 1. Implementing PLC multi-factor access using SB 314. 2. Apply a multi-factor VPN to protect the service from remote access.\n\nPlease follow Unitronics published recommendations or contact Unitronics technical support for more information.\nDragos recommends users to restrict access to the PLC on TCP/20256 by either changing the default programmer port, or apply a multi-factor VPN to protect the service from remote access.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nApril 18, 2024: Initial Publication\nApril 30, 2024: (Update A ) Added Unitronics Mitigations\n\n",
  "cves": [
    "CVE-2024-1480"
  ],
  "techniques": [],
  "advisory": "icsa-24-109-01",
  "title": "Unitronics Vision Legacy Series (Update A) | CISA",
  "source": "ics-advisories",
  "id": "ec9bbe109e314cedef85fe45d949fb985957aa6a39f51eea50ca14fd2c01c291"
}