{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.6\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ControlByWeb\nEquipment: X-320M\nVulnerabilities: Improper Authentication, Cross-site Scripting\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow arbitrary code execution and could cause the device being accessed to require a physical factory reset to restore the device to an operational state.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ControlByWeb X-320M, a web-enabled weather station, are affected:\n\nX-320M-I firmware revision v1.05 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe software does not properly prove or insufficiently prove a claim to be correct, which may allow an attacker to cause a denial of service condition.\nCVE-2018-18881 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe software does not properly validate input, which may allow arbitrary code to be executed.\nCVE-2018-18882 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJohn Elder and Tom Westenberg of Applied Risk reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nControlByWeb has released a firmware update to address the vulnerabilities found on the X-320M that can be downloaded at:\nhttps://www.controlbyweb.com/firmware/X320M_V1.06_firmware.zip\nAdditional ControlByWeb support information can be found at:\nhttps://www.controlbyweb.com/support/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-18882",
    "CVE-2018-18881"
  ],
  "techniques": [],
  "advisory": "icsa-19-017-03",
  "title": "ControlByWeb X-320M | CISA",
  "source": "ics-advisories",
  "id": "1f094dc198ba438467c12028417d177d9201e8e75502da205cfdef5b6d291de6"
}