{
  "markdown": "\nCVSS V3 10\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Carlo Gavazzi\nEquipment: VMU-C EM, VMU-C PV\nVulnerabilities: Access Control Flaws, CSRF, Sensitive Information Stored In Clear Text\nAFFECTED PRODUCTS\nCarlo Gavazzi reports that the vulnerabilities affect the following versions:\n\nVMU-C EM prior to firmware Version A11_U05, and\nVMU-C PV prior to firmware Version A17\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow the attacker to execute configuration parameter changes and saving modified configuration.\nMITIGATION\nCarlo Gavazzi has created firmware updates that mitigate these vulnerabilities. Carlo Gavazzi recommends upgrading to the following firmware versions:\n\nVMU-C EM A11_U05 for VMUC EM, and\nVMU-C PV A17 for VMUC PV.\n\nThe relevant firmware versions are available either by means of the firmware update function embedded in the VMU-C or by downloading them from Carlo Gavazzi’s web site. Please open the link:\nhttp://www.gavazzi-automation.com/nsc/HQ/EN/energy_efficiency_monitoring,\nThen:\n\nClick on “Select the Product.”\nChoose “Web-Server” from the “FUNCTION” column.\nA list including both VMU-C EM and VMU-C PV will appear; select the target VMU-C model from the list.\nFrom the “downloads” section on the right, click on the “Software” icon to start downloading the updated firmware package.\n\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. Remotely exploitable. Low skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nACCESS CONTROL CWE 284\n\nThe access control flaw allows access to most application functions without authentication.\nCVE-2017-5144 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nCROSS-SITE REQUEST FORGERY (CSRF) CWE 352\n\nSuccessful exploitation of this vulnerability can allow execution of unauthorized actions on the device such as configuration parameter changes, and saving modified configuration.\nCVE-2017-5145 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n\nINFORMATION EXPOSURE CWE 200\n\nSensitive information stored in clear-text.\nCVE-2017-5146 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nKarn Ganeshen has reported these vulnerabilities.\n",
  "cves": [
    "CVE-2017-5146",
    "CVE-2017-5144",
    "CVE-2017-5145"
  ],
  "techniques": [],
  "advisory": "icsa-17-012-03",
  "title": "Carlo Gavazzi VMU-C EM and VMU-C PV | CISA",
  "source": "ics-advisories",
  "id": "f44d5ae66e96a7830e4eec4f512070bd90a1957e21f058fd1597806768dce2cb"
}