{
  "markdown": "\nOverview\nThis ICS-CERT Advisory is a follow-up to the ICS-CERT Alert titled, “ICS-ALERT-11-080-04—Multiple Vulnerabilities in RealFlex RealWin.”\nAn independent researcher has published exploit code for seven vulnerabilities identified in RealFlex Technologies’ RealWin 2.1.10 Demo Supervisory Control and Data Acquisition (SCADA) product. Multiple functions listening on Port 910/TCP are susceptible to heap and stacked-based buffer overflow vulnerabilities. The heap and stack buffer overflows may allow an attacker to remotely execute arbitrary code.\nRealFlex has released a new version (Version 2.1.12) of their free demo software that mitigates these vulnerabilities.\nICS-CERT has verified that these vulnerabilities do not affect the RealFlex RealWin commercial version and that Version 2.1.12 resolves the vulnerabilities in the demo version.\nAffected Products\nRealFlex reports that these zero-day vulnerabilities affect Versions 1.06A and earlier of its demo software only. The commercial version of RealWin is not affected.\nImpact\nSuccessful exploitation of these vulnerabilities can cause the RealWin demo application to crash.\nBackground\nRealFlex Technologies Ltd is a company based in Houston, Texas, that focuses on industrial automation software for many markets including power, oil and gas, water and wastewater, chemical, transportation, and manufacturing. RealWin is a SCADA server product including a human-machine interface that runs on a Windows (XP or newer) platform. For more information on RealFlex and RealWin, visit their website.\nVulnerability Characterization\nVulnerability Overview\nThe researcher provided reports of seven separate vulnerabilities. Six are stack overflows that can be exploited remotely. The remaining vulnerability is an integer overflow that also can be exploited remotely.\nMultiple functions listening on Port 910/TCP are susceptible to these buffer overflow vulnerabilities.\nVulnerability Details\nExploitability\nThis vulnerability is exploitable from a remote machine.\nExistence of Exploit\nThe researcher has publicly released exploits that specifically target these vulnerabilities.\nDifficulty\nAn attacker would need only basic skills to use the publicly available code to exploit these vulnerabilities.\nMitigation\nUsers of the demo version of RealFlex RealWin should upgrade to the newest version (2.1.12), which is available at http://realflex.com/download/.\nICS-CERT encourages asset owners to minimize network exposure for all control system devices. Critical devices should not directly face the Internet. Control system networks and remote devices should be located behind firewalls and isolated from the business network. If remote access is required, use secure methods such as Virtual Private Networks (VPNs).\nOrganizations that observe any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nThe Control System Security Program also provides a recommended practices section for control systems on the US-CERT website. Several recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-110-01",
  "title": "RealFlex RealWin Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "ed8dd871f3f67f16b8ecbe0d706667c23a476582c3809f0b3c3e3574dcdcf29c"
}