{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Delta Electronics\nEquipment: CNCSoft ScreenEditor\nVulnerability: Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the device, and an out-of-bounds write may allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CNCSoft ScreenEditor, a software management platform, are affected:\n\nCNCSoft ScreenEditor versions prior to v1.01.30\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds write vulnerability exists and could cause the corruption of data, a denial-of-service condition, or allow code execution. The vulnerability may allow an attacker to remotely execute arbitrary code.\nCVE-2021-22672 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nKimiya, working with Trend Micro Zero’s Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nDelta Electronics has released an updated version of CNCSoft ScreenEditor and recommends users install update v1.01.30 on all affected systems. \nDelta Electronics also recommends users restrict the interaction of the application to trusted files.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-22672"
  ],
  "techniques": [],
  "advisory": "icsa-21-124-02",
  "title": "Delta Electronics CNCSoft ScreenEditor | CISA",
  "source": "ics-advisories",
  "id": "262836e9d8d19b7760c94db30e58306a913c652e40f587ed7eb844f8919fb56f"
}