{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8 \nATTENTION: Exploitable remotely/low attack complexity \nVendor: PiiGAB, Processinformation i Göteborg Aktiebolag \nEquipment: M-Bus SoftwarePack 900S \nVulnerabilities: Code Injection, Improper Restriction of Excessive Authentication Attempts, Unprotected Transport of Credentials, Use of Hard-coded Credentials, Plaintext Storage of a Password, Cross-site Scripting, Weak Password Requirements, Use of Password Hash with Insufficient Computational Effort, Cross-Site Request Forgery \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash allow an attacker to inject arbitrary commands, steal passwords, or trick valid users into executing malicious commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPiiGAB reports these vulnerabilities affect the following wireless meter reading software:  \n\nM-Bus SoftwarePack 900S\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 CODE INJECTION CWE-94\nPiiGAB M-Bus does not correctly sanitize user input, which could allow an attacker to inject arbitrary commands.\nCVE-2023-36859 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.2 IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\nThe number of login attempts is not limited. This could allow an attacker to perform a brute force on HTTP basic authentication.\nCVE-2023-33868 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3 UNPROTECTED TRANSPORT OF CREDENTIALS CWE-523\nPiiGAB M-Bus transmits credentials in plaintext format.\nCVE-2023-31277 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.4 USE OF HARD-CODED CREDENTIALS CWE-798\nPiiGAB M-Bus contains hard-coded credentials, which it uses for authentication.\nCVE-2023-35987 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.5 PLAINTEXT STORAGE OF A PASSWORD CWE-256\nPiiGAB M-Bus stores credentials in a plaintext file, which could allow a low-level user to gain admin credentials.\nCVE-2023-35765 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.2.6 CROSS-SITE SCRIPTING CWE-79\nThe affected product does not validate identification strings before processing, which could make it vulnerable to cross-site scripting attacks.\nCVE-2023-32652 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.7 WEAK PASSWORD REQUIREMENTS CWE-521\nThere are no requirements for setting a complex password, which could contribute to a successful brute force attack if the password is inline with recommended password guidelines.\nCVE-2023-34995 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.8 USE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORT CWE-916\nPiiGAB M-Bus stores passwords using a weak hash algorithm.\nCVE-2023-34433 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.9 CROSS-SITE REQUEST FORGERY CWE-352\nPiiGAB M-Bus is vulnerable to cross-site request forgery. An attacker who wants to execute a certain command could send a phishing mail to the owner of the device and hope that the owner clicks on the link. If the owner of the device has a cookie stored that allows the owner to be logged in, then the device could execute the GET or POST link request.\nCVE-2023-35120 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Sweden\n\n3.4 RESEARCHER\nFloris Hendriks and Jeroen Wijenbergh of Radboud University reported these vulnerabilities to CISA.\n4. MITIGATIONS\nPiiGAB created updated software to address these issues and encourages users to install the new update on their own gateway. The new software packages can be downloaded directly from the web UI in the gateway and older gateways can download it from Piigab.se or Piigab.com.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nSet unique and secure passwords for all products requiring authentication.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have low attack complexity.\n",
  "cves": [
    "CVE-2023-32652",
    "CVE-2023-34433",
    "CVE-2023-35765",
    "CVE-2023-31277",
    "CVE-2023-35987",
    "CVE-2023-36859",
    "CVE-2023-33868",
    "CVE-2023-35120",
    "CVE-2023-34995"
  ],
  "techniques": [],
  "advisory": "icsa-23-187-01",
  "title": "PiiGAB M-Bus | CISA",
  "source": "ics-advisories",
  "id": "cfe967ab89e649524bc2e6142020b4d65958e87ed6e25090b66c146f951d1c81"
}