{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Low attack complexity\nVendor: Hitachi Energy\nEquipment: PCM600\nVulnerability: Cleartext Storage of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain sensitive credentials and gain access to the affected products, perform unauthorized modifications, or provoke a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hitachi Energy's IED Connectivity Packages and PCM600 products are affected:\n\nPCM600: v2.11 and previous versions, including hotfixes\n670 Connectivity Package: versions from 3.0 to 3.4.1\n650 Connectivity Package: versions from 1.3 to 2.4.1\nSAM600-IO Connectivity Package: versions from 1.0 to 1.2\nGMS600 Connectivity Package: versions from 1.3 to 1.3.1\nPWC600 Connectivity Package: versions from 1.1 to 1.3\n\n3.2 Vulnerability Overview\n3.2.1 CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nA vulnerability exists in the Intelligent Electronic Device (IED) Connectivity Package (ConnPack) credential storage function in Hitachi Energy's PCM600 product included in the versions listed below, where IEDs credentials are stored in a cleartext format in the PCM600 database and logs files. An attacker having get access to the exported backup file can exploit the vulnerability and obtain user credentials of the IEDs. Additionally, an attacker with administrator access to the PCM600 host machine can obtain other user credentials by analyzing database log files. The credentials may be used to perform unauthorized modifications such as loading incorrect configurations, reboot the IEDs or cause a denial-of-service on the IEDs.\nCVE-2022-2513 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi Energy released the following recommended immediate actions:\n\nUpdate to PCM600 v2.11 Hotfix 20240426 or apply mitigation factors/workarounds as described below.\n\nAfter applying the hotfix, reimport and export the backup files to secure that they do not contain this vulnerability. More information to deploy PCM600 securely can be found in the following documents:\n\n1MRS758440, PCM600 Cyber Security Deployment Guideline\n\nHitachi Energy recommends the following steps to mitigate the risk of vulnerability exploitation:\n\nImplement the least privilege principle, continuously revising permissions and accesses to PCM600 related resources, including the backup file, PCMI, PCMP, PCMA and PCMT files.\nUse a firewall system with the minimal number of exposed ports to help protect a process control network from attacks originating from outside the network.\nProtect process control systems from direct, physical access by unauthorized personnel.\nEnsure process control systems are not directly connected to the internet.\nSeparate process control systems from other networks via network segmentation techniques.\nAvoid using process control systems for browsing the internet, instant messaging, or receiving emails.\nScan removable storage media for malware prior to connection to a process control system.\n\nFor more information, see Hitachi Energy's Cybersecurity Advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nNovember 29, 2022: Initial Publication\nJuly 23, 2024: Update A - Updated vulnerability description and mitigation section\n\n",
  "cves": [
    "CVE-2022-2513"
  ],
  "techniques": [],
  "advisory": "icsa-22-333-02",
  "title": "Hitachi Energy IED Connectivity Packages and PCM600 Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "fa12297498abd6b25030d43b731d2c41f7f33f1bc4179a7fc0ddb2ac2b29ce73"
}