{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 6.0\nATTENTION: Low attack complexity\nVendor: Rockwell Automation\nEquipment: FactoryTalk System Services and Policy Manager\nVulnerabilities: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to obtain private keys, which would result in impersonating resources on the secured network.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Rockwell Automation FactoryTalk products are affected:\n\nFactoryTalk System Services: v6.40\nFactoryTalk Policy Manager: v6.40\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThe v6.40 release of FactoryTalk Policy Manager allowed the private keys to be insecurely stored with read and execute privileges for the Windows group, ‘Everyone'. These keys are used to generate digital certificates and pre-shared keys. This vulnerability could allow a malicious user with access to the machine to obtain private keys. If obtained, a malicious user could impersonate resources on the secured network.\nCVE-2024-6325 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-6325. A base score of 6.0 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:N/SC:H/SI:N/SA:N).\n3.2.2 IMPROPER PRIVILEGE MANAGEMENT CWE-269\nAn exposure of sensitive information vulnerability exists in the FactoryTalk System Service. A malicious user could exploit this vulnerability by starting a back-up or restore process, which temporarily exposes private keys, passwords, pre-shared keys, and database folders when they are temporarily copied to an interim folder. This vulnerability is due to the lack of explicit permissions set on the backup folder. If private keys are obtained by a malicious user, they could impersonate resources on the secured network.\nCVE-2024-6236 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-6236. A base score of 1.8 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:P/PR:L/UI:A/VC:N/VI:N/VA:N/SC:H/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to CISA.\n4. MITIGATIONS\nUsers using the affected software are encouraged to implement the following steps to invalidate the existing vulnerable private keys/digital certificates and regenerate new secure ones.\n\nClear CIP Security configurations from devices and from FactoryTalk Policy Manager (FTPM)\nUpdate FactoryTalk System Services (FTSS) and FactoryTalk Policy Manager to v6.40.01\nRedeploy CIP Security Policy\n\nDetailed steps are below:\n\n1) Remove deployed security policy from all devices using FTPM:\n\nOpen FTPM.\nDocument all Zone's security settings and all Conduit's settings as you must re-create them after updating FTPM.\nChange all devices port's Policies > Zone values to the \"Unassigned\" Zone.\nDelete all zones and conduits.\nDeploy (CIP). Ensure that all endpoints were reset successfully.\n(migrating from v6.40 only) Deploy (OPC UA). Ensure all endpoints were reset successfully.\nFor any OPC UA clients, perform whatever steps are required by those clients to remove the previously applied certificates.\nClose FTPM\n\n\n2) Delete the \\FTSS_backup folder: c:\\ProgramData\\Rockwell\\RNAServer\\Global\\RnaStore\\FTSS_Backup\n3) Delete the \\keystore folder: c:\\ProgramData\\Rockwell Automation\\FactoryTalk System Services\\keystore\n4) Delete any backup copies of the \\keystore folder. They will be named the same as the \\keystore folder but with a suffix appended to it, like: c:\\ProgramData\\Rockwell Automation\\FactoryTalk System Services\\ keystore_source_2024_04_25_12_25_38_541566\n5) Delete the PSKs.json file: c:\\ProgramData\\Rockwell Automation\\FactoryTalk System Services\\PSKs.json\n6) Delete any backup copies of the PSKs.json file. They will be named the same as the PSKs.json file but with a suffix appended to it, like: c:\\ProgramData\\Rockwell Automation\\FactoryTalk System Services\\ PSKs.json_source_2024_05_17_07_38_25_200356\n7) Install FactoryTalk Policy Manager version 6.40.01.\n\nRestart the computer when prompted at the end of the install.\nOpen FTPM. FTPM will attempt to connect to the FactoryTalk System Services web server before proceeding.\nIf FTPM could not successfully connect to FactoryTalk System Services (FTSS), it is because the FTSS service hasn't started yet. It will eventually start or else you can start the FTSS service manually in Windows Services.\n\n\n10) Re-create the original Zones.\n11) Move the devices from the unassigned Zone back to their original zones.\n12) Re-create the original Conduits.\n13) Deploy (CIP endpoints).\n14) (migrating from v6.40 only) Deploy (OPC UA endpoints).\n\nFor any OPC UA client endpoints, manually apply the newly generated certificates from this deploy.\n\n\n\nAdditionally, users are encouraged to implement the suggested security best practices to minimize the risk of vulnerability.\n\nSecurity Best Practices\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nJuly 11, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-6325",
    "CVE-2024-6236"
  ],
  "techniques": [],
  "advisory": "icsa-24-193-19",
  "title": "Rockwell Automation FactoryTalk System Services and Policy Manager | CISA",
  "source": "ics-advisories",
  "id": "382392f846e25bd3789dfd251161dac8775886283a449999facc8acefc16a32e"
}