{
  "markdown": "\nOverview\nThis advisory is a follow-up to the alert titled ICS-ALERT-12-212-02 WellinTech KingView User Credentials Not Securely Hashed that was published July 30, 2012, on the ICS-CERT Web page.\nDr. Wesley McGrew of Mississippi State University has identified a default credential vulnerability in WellinTech KingView application. WellinTech has produced a patch that mitigates this vulnerability.\nExploits that target this vulnerability are known to be publicly available.\nAffected Products\nWellinTech reports that the vulnerability affects the following versions of KingView:\n\nKingView 6.5.3 and previous.\n\nImpact\nA successful exploit of this vulnerability will allow an attacker complete access of the targeted system.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nWellinTech is a software development company specializing in automation and control. WellinTech is based in Beijing, China, with branches in the United States, Japan, Singapore, Europe, and Taiwan.\nAccording to the WellinTech Web site, the KingView product is a Windows-based control, monitoring, and data collection application deployed across several industries, including power, water, building automation, mining, and other sectors.\nVulnerability Characterization\nVulnerability Overview\nUser Credentials Not Securely HashedCWE-311: Missing Encryption of Sensitive Data, http://cwe.mitre.org/data/definitions/311.html, Web site last accessed October 09, 2012.\nKingView does not securely store user credentials. An attacker can decrypt the file containing usernames and passwords with a simple mathematical algorithm.\nCVE-2012-4899 has been assigned to this vulnerability. A CVSS v2 base score of 6.8 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:S/C:C/I:C/A:C).\nVulnerability Details\nExploitability\nAn attacker needs to be able to access the system where the files are stored to exploit this vulnerability.\nExistence of Exploit\nExploits that target this vulnerability are publicly available.\nDifficulty\nAn attacker with a low skill would be able to exploit this vulnerability.\nMitigation\nWellinTech has created a patch that fixes this vulnerability by increasing the complexity of the algorithm used to encrypt the passwords and usernames. A copy of the patch may be downloaded from the following location: http://www.wellintech.com/index.php/news/33-patch-for-kingview653.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the US-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B—Cyber Intrusion Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click Web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2012-4899"
  ],
  "techniques": [],
  "advisory": "icsa-12-283-02",
  "title": "WellinTech KingView User Credentials Not Securely Hashed | CISA",
  "source": "ics-advisories",
  "id": "bde5d15070d354b0f5b40581de724d839a1bcf4119b48c12635ef506105cf596"
}