{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-R\nVulnerabilities: Improper Restriction of Operations within the Bounds of a Memory Buffer, Session Fixation, NULL Pointer Dereference, Improper Access Control, Argument Injection, Resource Management Errors\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities by malicious attackers may result in network functions entering a denial-of-service condition or allow malware execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following modules of MELSEC iQ-R Series are affected:\n\nEtherNet/IP Network Interface Module, RJ71EIP91: First 2 digits of serial number are 02 or before.\nPROFINET IO Controller Module, RJ71PN92: First 2 digits of serial number are 01 or before\nHigh Speed Data Logger Module, RD81DL96: First 2 digits of serial number are 08 or before\nMES Interface Module, RD81MES96N: First 2 digits of serial number are 04 or before\nOPC UA Server Module, RD81OPC96: First 2 digits of serial number are 04 or before\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nAn attacker could deliver a specially crafted packet that may allow an attacker to cause a denial-of-service condition or execute arbitrary code.\nCVE-2020-5653 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    SESSION FIXATION CWE-384\nAn attacker could deliver a specially crafted packet that may allow an attacker to cause a denial-of-service condition or execute arbitrary code.\nCVE-2020-5654 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    NULL POINTER DEREFERENCE CWE-476\nAn attacker could deliver a specially crafted packet that may allow an attacker to cause a denial-of-service condition or execute arbitrary code. \nCVE-2020-5655 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    IMPROPER ACCESS CONTROL CWE-284\nAn attacker could deliver a specially crafted packet that may allow an attacker to cause a denial-of-service condition or execute arbitrary code.\nCVE-2020-5656 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.5    IMPROPER NEUTRALIZATION OF ARGUMENT DELIMITERS IN A COMMAND ('ARGUMENT INJECTION') CWE-88\nAn attacker could deliver a specially crafted packet that may allow an attacker to cause a denial-of-service condition or execute arbitrary code.\nCVE-2020-5657 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n3.2.6    RESOURCE MANAGEMENT ERRORS CWE-399\nAn attacker could deliver a specially crafted packet that may allow an attacker to cause a denial-of-service condition or execute arbitrary code. \nCVE-2020-5658 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\n4. MITIGATIONS\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting these vulnerabilities:\n\nBlock access from untrusted networks and hosts through firewalls.\n\nPlease refer to Mitsubishi Electric’s website for details on available patches. Mitsubishi recommends users update their products by downloading and applying the latest versions. Please contact a Mitsubishi Electric representative for additional details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-5653",
    "CVE-2020-5657",
    "CVE-2020-5654",
    "CVE-2020-5656",
    "CVE-2020-5658",
    "CVE-2020-5655"
  ],
  "techniques": [],
  "advisory": "icsa-20-303-02",
  "title": "Mitsubishi Electric MELSEC iQ-R | CISA",
  "source": "ics-advisories",
  "id": "d9980bc32dd734cc666bb1eb4e24f1f47ffc08efad8fc4b24869391372712f50"
}