{
  "markdown": " GE Bently Nevada 3500/22M Improper Authorization Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryGE Bently Nevada 3500/22M Improper Authorization Vulnerability============================================================== Last Revised October 06, 2016 Alert Code ICSA\\-16\\-252\\-01OVERVIEW-------- This advisory was originally posted to the US\\-CERT secure Portal library on September 8, 2016, and is being released to the NCCIC/ICS\\-CERT web site. GE has identified an improper authorization vulnerability in the GE Bently Nevada 3500/22M monitoring system. GE has produced a new firmware version to mitigate this vulnerability in the USB version of the GE Bently Nevada 3500/22M monitoring system. This vulnerability could be exploited remotely.AFFECTED PRODUCT---------------- The following GE Bently Nevada 3500/22M firmware versions are affected:* GE Bently Nevada 3500/22M (USB version), all versions prior to firmware Version 5\\.0, and* GE Bently Nevada 3500/22M (serial version), all versions.IMPACT------ Successful exploitation of the identified vulnerability may allow a remote attacker to gain unauthorized access to the affected device with elevated privileges. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- GE Bently Nevada is a wholly owned subsidiary of GE, a US\\-based company that maintains offices in several countries around the world. The affected product, GE Bently Nevada 3500/22M, is a vibration monitoring system. According to GE, the GE Bently Nevada 3500/22M is deployed across several sectors including Chemical and Energy. GE estimates that these products are used worldwide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### I **MPROPER AUTHORIZATIONCWE\\-285: Improper Authorization, http://cwe.mitre.org/data/definitions/285\\.html, web site last accessed October 06, 2016\\.** Several open ports have been identified on the affected device, which allow unauthorized access to the device with elevated privileges. CVE\\-2016\\-5788NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2016\\-5788, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 10\\.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3\\.0\\#CVSS:3\\.0/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H, web site last accessed October 06, 2016\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY An attacker with a low skill would be able to exploit this vulnerability.MITIGATION---------- GE has released a new firmware version for the GE Bently Nevada 3500/22M TDI USB monitoring system, Version 5\\.0\\. GE’s new firmware can only be applied to the USB version of the GE Bently Nevada 3500/22M monitoring system. Users registered with a GE Bently Nevada Technical Support Agreement can download Version 5\\.0 and access GE’s Technical Information Letter (TIL\\-149700250\\) detailing further mitigation strategies at the following URL with a valid account:<http://www.bntechsupport.com> GE recommends that users using the serial version of the GE Bently Nevada 3500/22M upgrade the affected device. Users who are concerned about the security of their GE Bently Nevada 3500 System should:* Employ system hardening techniques for GE Bently Nevada’s 3500 System as outlined in document 106M9733 \\- 3500 Hardening Guideline. This document is available through [www.bntechsupport.com](https://urldefense.proofpoint.com/v2/url?u=http-3A__www.bntechsupport.com&d=CwMFAg&c=54IZrppPQZKX9mLzcGdPfFD1hxrcB__aEkJFOKJFd00&r=92AiXsTZLqsPVx52d1QaXn5-gqBoaqDid8qfiMWSS6Q&m=ZEnv6g7Je5OpzEWdn52jv7HfHOJLMFp8XiAOKCf8FZM&s=riMyL3-dXzuG72pkJqrjeeiW1Ek4XnB5ngVoO6gu55Y&e=)  .* Contact GE Bently Nevada for information regarding installations compliant to IEC 62443\\-2\\-4 Level 1\\.* Implement a bump\\-in\\-the\\-wire solution to provide secure communication between endpoints, which may enhance security.* Effectively segment networks and implement demilitarized zones (DMZs) with properly configured firewalls to selectively control and monitor traffic passed between zones. ICS\\-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at *:* [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies *.*](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf) Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* GE-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-16-252-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* * [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)* * [Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2016-5788"
  ],
  "techniques": [],
  "advisory": "icsa-16-252-01",
  "title": "GE Bently Nevada 3500/22M Improper Authorization Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "39c3271b8e460fb7bd76898acc44df21c785627f3cf5a8bf88ceb9329eb093ff"
}