{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls\nEquipment: C-CURE 9000\nVulnerability: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-182-02 Sensormatic Electronics C-CURE 9000 that was published July 1, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote execution of lower privileged Windows programs.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nJohnson Controls reports the vulnerability affects the following product:\n\nC-CURE 9000: All versions prior to 2.80\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nAn insecure client automatic update feature in C-CURE 9000 can allow remote execution of lower privileged Windows programs. \nCVE-2021-27660 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n4.4 RESEARCHER\nJohnson Controls, Inc., reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 ---------\nJohnson Controls recommends users upgrade to Version 2.80 or later. Johnson Controls recommends uninstalling the C-CURE 9000 Auto Update feature if is not in use.\nVersions prior to 2.60\n\nVersions prior to 2.60 should first be upgraded to 2.60 Service Pack 2 CU07 or later.\n\nVersions 2.60 & 2.70\n\nApply 2.60 Service Pack 2 CU07 or later or 2.70 Service Pack 2 CU01 or later, respectively.\nOn a machine with the C-CURE 9000 server installed, the service pack will automatically remove the auto update client. \nOn remote client machines, when running the service pack and if the Auto Update service is installed, a prompt will ask users if they want to remove the service. \nIf users run the service pack in silent mode, they should run it with the optional parameter “/REMOVEAUTOUPDATE” to remove the auto update client.\n\nVersion 2.80 & 2.90\n\nStarting in C-CURE 9000 Version 2.80, the client Auto Update feature is a separate install.\nFrom Windows Programs and Features on the application server, select C-CURE 9000 Automated Update, right-click, then select Uninstall.\nFrom Windows Programs and Features, wherever the C-CURE 9000 clients (Monitoring Station, Administration Workstation) are installed (and the Auto Update service), select CCURE9000ClientAutoupdate, right-click, then select Uninstall.\n\nFor access to more specific product update and vulnerability mitigation information, please see Johnson Controls Product Security Advisory JCI-PSA-2021-10 v2 or contact a Johnson Controls Technical Support Team representative.\n--------- End Update A Part 1 of 1 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27660"
  ],
  "techniques": [],
  "advisory": "icsa-21-182-02",
  "title": "Sensormatic Electronics C-CURE 9000 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "3d4d53030d502b72880e6aa541b15f8d3d5f29e505d2c793baeb09385e5ea892"
}