{
  "markdown": "\nCVSS v3 7.8\nATTENTION: Low skill level to exploit.\nVendor: Trihedral Engineering Limited\nEquipment: VTScada\nVulnerabilities: Improper Access Control, Uncontrolled Search Path Element\nAFFECTED PRODUCTS\nTrihedral Engineering Limited reports that the vulnerability affects the following versions of the VTScada HMI and SCADA software:\n\nVTScada 11.3.03 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow execution of arbitrary code.\nMITIGATION\nTrihedral Engineering Limited recommends that users of an affected version update to the latest version, 11.3.05. The update can be found at the following location:\nftp://ftp.trihedral.com/VTS/VTScada 11.3 Versions/\nHelp file notes for upgrading VTScada/VTS can be found at:\nhttps://www.trihedral.com/help/Content/Op_Welcome/Wel_UpgradeNotes.htm\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nIMPROPER ACCESS CONTROL CWE-284\n\nA local, non-administrator user has privileges to read and write to the file system of the target machine.\nCVE-2017-14031 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nThe program will execute specially crafted malicious dll files placed on the target machine.\nCVE-2017-14029 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nKarn Ganeshen and Mark Cross independently discovered these vulnerabilities and reported them to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Chemical, Communications, Critical Manufacturing, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCountries/Areas Deployed: North America, Europe\nCompany Headquarters Location: Canada\n",
  "cves": [
    "CVE-2017-14029",
    "CVE-2017-14031"
  ],
  "techniques": [],
  "advisory": "icsa-17-304-02",
  "title": "Trihedral Engineering Limited VTScada | CISA",
  "source": "ics-advisories",
  "id": "41afd168bf71683198d85007068eeb9316c407ac320bf099d90915b044df9148"
}