{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Moxa\nEquipment: OnCell\nVulnerabilities: Improper Restriction of Excessive Authentication Attempts, Plaintext Storage of a Password, and Cross-Site Request Forgery\nAFFECTED PRODUCTS\nThe following versions of OnCell, a high-speed industrial-grade IP gateway, are affected:\n\nOnCell G3110-HSPA Version 1.3 build 15082117 and previous versions,\nOnCell G3110-HSDPA Version 1.2 Build 09123015 and previous versions,\nOnCell G3150-HSDPA Version 1.4 Build 11051315 and previous versions,\nOnCell 5104-HSDPA,\nOnCell 5104-HSPA, and\nOnCell 5004-HSPA.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow an attacker to use brute force to determine parameters needed to access the application. An attacker may also obtain credentials by obtaining files that store passwords in clear text.\nMITIGATION\nMoxa recommends the following mitigations:\n\nFor OnCell G31x0-HSPA and OnCell 5x04-HSPA devices users should upgrade to the latest official firmware Version 1.4 or above.\nFor OnCell G31x0-HSDPA and OnCell 5x04-HSDPA devices users should disable HTTP and use other another console such as HTTPS to access web UI or SNMP/Telnet. Moxa reports that the HSDPA devices have been phased out. If further assistance is needed, please contact Moxa.\n\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\n\nAn attacker can freely use brute force to determine parameters needed to bypass authentication.\nCVE-2017-7915 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nPLAINTEXT STORAGE OF A PASSWORD CWE-256\n\nThe application’s configuration file contains parameters that represent passwords in plaintext.\nCVE-2017-7913 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n\nCROSS-SITE REQUEST FORGERY CWE-352\n\nThe application does not sufficiently verify if a request was intentionally provided by the user who submitted the request, which could allow an attacker to modify the configuration of the device.\nCVE-2017-7917 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nIndependent researcher Maxim Rupp identified the vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-7913",
    "CVE-2017-7917",
    "CVE-2017-7915"
  ],
  "techniques": [],
  "advisory": "icsa-17-143-01",
  "title": "Moxa OnCell | CISA",
  "source": "ics-advisories",
  "id": "af3c4d2229bd25ddf289ef00dceb67b60553ef41f7f99bc28bbd3076f9eb7694"
}