{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: Desigo PX Devices\nVulnerability: External Control of Assumed-Immutable Web Parameter\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition on the device’s web server, requiring a reboot to recover the web interface.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Desigo PX automation controllers are affected:\n\nPXC00-E.D, PXC50-E.D, PXC100-E.D, PXC200-E.D with Desigo PX Web modules\n\tPXA40-W0, PXA40-W1, PXA40-W2: All firmware versions prior to V6.00.320\n\t \nPXC00-U, PXC64-U, PXC128-U with Desigo PX Web modules\n\tPXA30-W0, PXA30-W1, PXA30-W2: All firmware versions prior to V6.00.320\n\t \nPXC22.1-E.D, PXC36-E.D, PXC36.1-E.D with activated web server: All firmware versions prior to V6.00.320\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXTERNAL CONTROL OF ASSUMED-IMMUTABLE WEB PARAMETER CWE-472\nAn attacker with network access to an affected device could send a specially crafted HTTP message to the web server port (TCP/80), which would cause the server to reply with status code 404 to any further requests. Exploitation requires no system privileges and no user interaction. A reboot is required to recover the web interface. This vulnerability may impact the availability of the affected system.\n\nCVE-2019-13927 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nGjoko “LiquidWorm” Krstic from Zero Science Lab (MK) reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has an update available for the following affected products:\n\nPXC00-E.D, PXC50-E.D, PXC100-E.D, PXC200-E.D with Desigo PX Web modules\n\tPXA40-W0, PXA40-W1, PXA40-W2: Install v6.00.320 or a later version.\n\t \nPXC00-U, PXC64-U, PXC128-U with Desigo PX Web modules\n\tPXA30-W0, PXA30-W1, PXA30-W2: Install v6.00.320 or a later version.\n\t \nPXC22.1-E.D, PXC36-E.D, PXC36.1-E.D with activated web server: Install v6.00.320 or a later version.\n\nSiemens has identified the following specific workarounds and mitigations that users can apply to reduce risk:\n\nEnsure the PX Web interface is accessible only from trusted networks.\n\nAs a general security measure, Siemens strongly recommends customers protect network access to affected products with appropriate mechanisms. Siemens advises all users to follow recommended security practices to run the devices in a protected environment.\n\nFor more information on security vulnerabilities in Siemens products and solutions, please contact the Siemens ProductCERT:\nhttp://www.siemens.com/cert/advisories\n\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-898181 at the following location: http://www.siemens.com/cert/advisories\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13927"
  ],
  "techniques": [],
  "advisory": "icsa-19-318-03",
  "title": "Siemens Desigo PX Devices | CISA",
  "source": "ics-advisories",
  "id": "4b12bca06a8f269c14921a449fb2683562e64871146178a4509596fec425dba2"
}