{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: WISE-PaaS/RMM\nVulnerabilities: Path Traversal, Missing Authorization, Improper Restriction of XML External Entity Reference, SQL Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow information disclosure, remote code execution, and compromise system availability.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WISE-PaaS/RMM, an IoT device remote monitoring and management platform, are affected:\n\nWISE-PaaS/RMM Versions 3.3.29 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nPath traversal vulnerabilities are caused by a lack of proper validation of a user-supplied path prior to use in file operations. An attacker can leverage these vulnerabilities to remotely execute code while posing as an administrator.\nCVE-2019-13551 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    MISSING AUTHORIZATION CWE-862\nThere is an unsecured function that allows anyone who can access the IP address to use the function without authentication.\nCVE-2019-13547 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)\n3.2.3    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nXXE vulnerabilities exist that may allow disclosure of sensitive data.\nCVE-2019-18227 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N)\n3.2.4    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nLack of sanitization of user-supplied input cause SQL injection vulnerabilities. An attacker can leverage these vulnerabilities to disclose information.\nCVE-2019-18229 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n•    CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water\n•    COUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States\n•    COMPANY HEADQUARTERS LOCATION: Taiwan\n3.4 RESEARCHER\nrgod of 9sg Security Team and trendytofu working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAdvantech phased out WISE-PaaS/RMM in July of 2019 and replaced this product with EdgeSense and DeviceOn. Advantech has provided notification to their PSM’s, sales managers, RSM’s and partners of the phase out to replace the old WISE-PaaS/RMM software bundle with EdgeSense and DeviceOn.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nMonitor or block Port 1880/TCP.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-18229",
    "CVE-2019-13551",
    "CVE-2019-18227",
    "CVE-2019-13547"
  ],
  "techniques": [],
  "advisory": "icsa-19-304-01",
  "title": "Advantech WISE-PaaS/RMM | CISA",
  "source": "ics-advisories",
  "id": "53b896395165d547230154805360134e0a3d817bdbd12e7648afa3a3ad4e934b"
}