{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.0\n\nATTENTION: Remotely exploitable/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC\nVulnerability: Improper Authentication\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-17-045-03C Siemens SIMATIC Authentication Bypass that was published November 30, 2017, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow attackers to circumvent user authentication under certain conditions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update D Part 1 of 1 --------\nSiemens reports this vulnerability affects the following software applications used for central user administration:\n\nSIMATIC Logon: All versions prior to v1.5 SP3 Update 2\n\nThe following products include affected versions of SIMATIC Logon:\n\nSIMATIC WinCC: All versions prior to v7.4 SP1,\nSIMATIC WinCC Runtime Professional: All versions prior to v14 SP1,\nSIMATIC PCS 7: All versions prior to v8.2 SP1,\nSIMATIC PDM: All versions prior to v9.1, and\nSIMATIC IT: All versions prior to v7.1\n\n--------- End Update D Part 1 of 1 ----------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHENTICATION CWE-287\nAn attacker with knowledge of a valid user name, and physical or network access to the affected system could bypass the application-level authentication.\nCVE-2017-2684 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to ICS-CERT.\n5. MITIGATIONS\nSiemens provides SIMATIC Logon v1.5 SP3 Update 2 and recommends that users update to the new version. Users using recent versions of SIMATIC WinCC, SIMATIC PCS 7, SIMATIC IT, SIMATIC IT Production Suite, or SIMATIC PDM can install the new version of SIMATIC Logon without an update of these products as described in the compatibility note that can be accessed via the download link below:\nhttps://support.industry.siemens.com/cs/ww/en/view/109744966\nFor more information on this vulnerability and more detailed mitigation instructions, see Siemens Security Advisory SSA-931064 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nAs a general security measure Siemens strongly recommends configuring the environment according to Siemens’ operational guidelines in order to run the devices in a protected IT environment.\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2017-2684"
  ],
  "techniques": [],
  "advisory": "icsa-17-045-03",
  "title": "Siemens SIMATIC Authentication Bypass (Update D) | CISA",
  "source": "ics-advisories",
  "id": "8cfa92a16c5b18ed8e9e8d38503421be46344cbf16bb80951093e758877a6eca"
}