{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: ICONICS and Mitsubishi Electric\nEquipment: ICONICS Product Suite, Mitsubishi Electric MC Works64\nVulnerabilities: Cross-site Scripting, Incomplete List of Disallowed Inputs, Plaintext Storage of a Password, Buffer Over-read \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in unauthorized access to information, unauthorized access to GENESIS64 and MC Works64 functionality, or the disabling of SQL Server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThese vulnerabilities can affect the following HMI SCADA products:\n\nICONICS Suite including GENESIS64, Hyper Historian, AnalytiX, and MobileHMI\n\nFor CVE-2022-23127 (Cross-site Scripting CWE-79)\n\nAll versions up to and including 10.96.2\n\n\nFor CVE-2022-23128 (Incomplete List of Disallowed Inputs CWE-184)\n\nAll versions from 10.95.3 to 10.97\n\n\nFor CVE-2022-23129 (Plaintext Storage of a Password CWE-256)\n\nAll versions from 10.90 to 10.97\n\n\nFor CVE-2022-23130 (Buffer Over-read CWE-126)\n\nAll versions up to and including 10.97\n\n\n\n\nMitsubishi Electric MC Works64\n\nFor CVE-2022-23127 (Cross-site Scripting CWE-79)\n\nAll versions prior to 4.04E (10.95.210.01)\n\n\nFor CVE-2022-23128 (Incomplete List of Disallowed Inputs CWE-184)\n\nMC Works64: Version 4.00A (v10.95.201.23) to 4.04E (v10.95.210.01)\n\n\nFor CVE-2022-23129 (Plaintext Storage of a Password CWE-256)\n\nAll versions prior to 4.04E (10.95.210.01)\n\n\nFor CVE-2022-23130 (Buffer Over-read CWE-126)\n\nMC Works64: Version 4.00A (v10.95.201.23) to 4.04E (v10.95.210.01)\n\n\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nICONICS MobileHMI and Mitsubishi Electric MC Mobile products lack proper validation checks on user input and external data when they are used to render a page to the client.\nCVE-2022-23127 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:N).\n3.2.2    INCOMPLETE LIST OF DISALLOWED INPUTS CWE-184\nThe FrameWorX Server in all ICONICS Suite and Mitsubishi Electric MC Works64 products can allow an attacker to bypass GENESIS64 /MC Works64 security when opening a communication channel to the WebSocket endpoint (Port 80 or 443) of the FrameWorX Server.\nCVE-2022-23128 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    PLAINTEXT STORAGE OF A PASSWORD CWE-256\nThe GENESIS64 and MC Works64 Workbench “export to CSV” function may expose a password in plain text when used to export the GridWorX Server configuration.\nCVE-2022-23129 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:C/C:H/I:H/A:H).\n3.2.4    BUFFER OVER-READ CWE-126\nA coding error in the SQL query engine memory allocation code makes it possible to execute a series of SQL commands in a GENESIS64 system or a MC Works64 system, which could cause a crash of the SQL Query Engine and result in the disabling of the SQL Server.\nCVE-2022-23130 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:H/UI:R/S:C/C:N/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: ICONICS is headquartered in the United States; Mitsubishi Electric is headquartered in Japan\n\n3.4 RESEARCHER\nICONICS and Mitsubishi Electric reported these vulnerabilities to CISA.\n4. MITIGATIONS\nICONICS and Mitsubishi Electric are releasing critical fixes rollups or patches for these products. GENESIS64 Version 10.97.1 and later will not be vulnerable to these exploits.\nICONICS and Mitsubishi Electric recommend users of these products take the following mitigation steps:\n\nUse a firewall. Place control system networks and devices behind firewalls and isolate them from the business network.\nMinimize network exposure for all control system devices. Control system devices should not directly face the Internet.\nDo not click web links or open unsolicited attachments in e-mail messages.\nInstall the applicable critical fixes/rollup releases when available.\n\nUsers can find additional information and useful links related to the GENESIS64 security updates on the ICONICS website.\nUsers can find additional information and useful links related to the MC Work64 security updates on the Mitsubishi Electric website. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-23130",
    "CVE-2022-23127",
    "CVE-2022-23128",
    "CVE-2022-23129"
  ],
  "techniques": [],
  "advisory": "icsa-22-020-01",
  "title": "ICONICS and Mitsubishi Electric HMI SCADA | CISA",
  "source": "ics-advisories",
  "id": "440e0ed550e73a54d9eeeb8207c2ac02d6bb3201f8660175c4fa2c0ec20a714e"
}