{
  "markdown": "\nCVSS V3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Advantech\nEquipment: WebAccess\nVulnerabilities: Authentication Bypass, SQL Injection\nAFFECTED PRODUCTS\nThe following WebAccess version is affected:\n\nWebAccess Version 8.1\n\nIMPACT\nSuccessful exploitation of this authentication bypass vulnerability could allow an attacker to access pages unrestricted; SQL injection condition may allow remote code execution.\nMITIGATION\nAdvantech has produced WebAccess Version 8.2 that mitigates these vulnerabilities. The new version can be downloaded at http://www.advantech.com/industrial-automation/webaccess.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nSQL INJECTION CWE-89\n\nTo be able to exploit the SQL injection vulnerability, an attacker must supply malformed input to the WebAccess software. Successful attack could result in administrative access to the application and its data files.\nCVE-2017-5154 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nAUTHENTICATION BYPASS ISSUES CWE-592\n\nBy accessing a specific uniform resource locator (URL) on the web server, a malicious user is able to access pages unrestricted.\nCVE-2017-5152 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\nRESEARCHER\nTenable Network Security working with Trend Micro's Zero Day Initiative\n",
  "cves": [
    "CVE-2017-5154",
    "CVE-2017-5152"
  ],
  "techniques": [],
  "advisory": "icsa-17-012-01",
  "title": "Advantech WebAccess | CISA",
  "source": "ics-advisories",
  "id": "e0dffbe2d6dac69e6fdbc7d6314cfca2e56b512f631ce8fafcafe5ded2da38bc"
}