{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE and SIMATIC\nVulnerability: Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-068-10 Siemens SCALANCE and SIMATIC libcurl (Update A) that was published March 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this third-party vulnerability could allow an attacker to cause a denial-of-service condition on the affected devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected by the third-party component libcurl:\n\nSCALANCE SC600 Family: all versions prior to v2.0\n\n--------- Begin Update B Part 1 of 2 ---------\n\nSIMATIC NET CM 1542-1: all versions prior to v3.0\n\n--------- End Update B Part 1 of 2 --------- \n\nSIMATIC NET CP 343-1 Advanced (incl. SIPLUS variants): v3.0.33, v3.0.44 and v3.0.53\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS READ CWE-125\nThe libcurl library Versions 7.34.0 through 7.63.0 are vulnerable to a heap out-of-bounds read condition in the code handling the end-of-response for SMTP. This vulnerability could allow an attacker to trigger a denial-of-service condition on the affected devices. \nCVE-2019-3823 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nSCALANCE SC600: Update to v2.0 or later\n\n--------- Begin Update B Part 2 of 2 --------- \n\nSIMATIC NET CM 1542-1: Update to v3.0 or later\n\n--------- End Update B Part 2 of 2 --------- \n\nDisable the SMTP Client function on affected devices or use VPN for protecting SMTP traffic to trusted email servers only.\n\nThe impact of additional libcurl vulnerabilities is described in Siemens Security Advisory SSA-436177\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2019-3823"
  ],
  "techniques": [],
  "advisory": "icsa-21-068-10",
  "title": "Siemens SCALANCE and SIMATIC libcurl (Update B) | CISA",
  "source": "ics-advisories",
  "id": "3f84ddfc142a0d5870025a6b3924ac74df2345dfabfe8667bb2396dd28dabe44"
}