{
  "markdown": "\nOverview\nICS-CERT received a report from ABB and the Zero Day Initiative (ZDI) concerning a buffer overflow vulnerability in the Robot Communication Runtime software used to communicate with IRC5, IRC5C, and IRCP robot controllers. This vulnerability was reported to ZDI by independent security researcher Luigi Auriemma.\nIf exploited, this vulnerability could allow an attacker to cause a denial of service to the robot scanning and discovery service on the computer and potentially execute remote code with administrator privileges.\nABB has developed a patch to address this issue.\nAffected Products\nThe following ABB products and versions are affected:\n\nABB Interlink Module: Versions 4.6 through 4.9\nIRC5 OPC Server: Versions up to and including 5.14.01\nPC SDK: Versions up to and including 5.14.01\nPickMaster 3: Versions up to and including 3.3\nPickMaster 5: Versions up to and including 5.13\nRobot Communications Runtime: Versions up to and including 5.14.01\nRobotStudio: Versions supporting IRC5 up to and including 5.14.01\nRobView 5: Works together with other products listed here.\nWebWare SDK: Versions 4.6 through 4.9\nWebWare Server: Versions 4.6 through 4.91\n\nImpact\nAn attacker may be able to use this vulnerability to cause a denial of service for the robot scanning and discovery service and potentially execute code remotely on the Windows PC. Depending on the installation, the remote code execution could run with administrator privilege.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nAccording to ABB, RobotStudio and PickMaster 5 are used in installation, programming, and commissioning of ABB industrial robots. PickMaster 3, IRC5 OPC Server, and WebWare SDK are used for continuous operations and custom human-machine interfaces for Windows PCs connected to the robot controller over a factory network.\nVulnerability Characterization\nVulnerability Overview\nAccording to ZDI, the vulnerability exists within RobNetScanHost.exe and its parsing of network packets accepted on Port 5512/TCP. By sending a specially crafted packet, an attacker can cause the RobNetScanHost service to terminate, resulting in a denial of service that prevents robot controllers from being discovered on the network. An attacker may be able to use the buffer overflow to download and execute code on the affected PC.\nBuffer Overflowhttp://cwe.mitre.org/data/definitions/119.html, CWE-119: Improper Restriction of Operations within the Bounds of a Memory Buffer.\nThe vulnerability originates from a buffer overflow in the RobNetScanHost service component when processing incoming announcements of robot controller availability on the network.\nCVE-2012-0245 has been assigned to this vulnerability. A CVSS V2 base score of 10 has also been assigned.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo known exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a low skill level would be able to exploit the buffer overflow while more advanced knowledge would be required to execute arbitrary code.\nMitigation\nABB has issued a customer notification as well as a patch to correct this vulnerability.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls with properly configured rules addressing Port 5512/TCP, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [
    "CVE-2012-0245"
  ],
  "techniques": [],
  "advisory": "icsa-12-059-01",
  "title": "ABB Robot Communications Runtime Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "a243823dbfd2b8ba02115aed937e2dc1c9755fa38159b008068f2e12b1e6ec28"
}