{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Advantech\nEquipment: WebAccess/SCADA\nVulnerabilities: Open Redirect, Relative Path Traversal\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-168-03 Advantech WebAccess/SCADA that was published June 17, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to read files outside the intended directory or redirect a user to a malicious webpage.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Advantech WebAccess/SCADA, a browser-based SCADA software package, are affected:\n\nWebAccess/SCADA Versions 9.0.1 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    URL REDIRECTION TO UNTRUSTED SITE ('OPEN REDIRECT') CWE-601\nThe affected product is vulnerable to redirection, which may allow an attacker to send a maliciously crafted URL that could result in redirecting a user to a malicious webpage.\nCVE-2021-32956 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.2    RELATIVE PATH TRAVERSAL CWE-23\nThe affected product is vulnerable to a directory traversal, which may allow an attacker to remotely read arbitrary files on the file system.\nCVE-2021-32954 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n4.4 RESEARCHER\nChizuru Toyama of TXOne IoT/ICS Security Research Labs, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 ---------\nAdvantech recommends users upgrade to any version after v9.0.1\n--------- End Update A Part 1 of 1 ---------\nFor more information, contact Advantech via website or phone (1-888-576-9668).\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-32956",
    "CVE-2021-32954"
  ],
  "techniques": [],
  "advisory": "icsa-21-168-03",
  "title": "Advantech WebAccess/SCADA (Update A) | CISA",
  "source": "ics-advisories",
  "id": "4feed4ad93b462bee70a9dedde0b086b46b5c1b1238851a7f4de4426274790fa"
}