{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.7\n\nATTENTION: Low skill level to exploit\nVendor: MatrikonOPC\nEquipment: MatrikonOPC Explorer\nVulnerability: Files or Directories Accessible to External Parties\n\n2. RISK EVALUATION\nIf the attacker has local access to the system, an attacker could exploit this vulnerability. This could allow an attacker to transfer unauthorized files from the host system, which could result in unauthorized information disclosure.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAccording to MatrikonOPC, the following product is affected:\n\nMatrikonOPC Explorer, Versions 5.0 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 FILES OR DIRECTORIES ACCESSIBLE TO EXTERNAL PARTIES CWE-552\nSuccessful exploitation of this vulnerability could allow an attacker to transfer unauthorized files from the host system. The attacker must have local access to be able to exploit this vulnerability.\nCVE-2018-8714 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:N/A:L).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Chemical and Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n\n3.4 RESEARCHER\nIlya Kapov of Positive Technologies reported this vulnerability to MatrikonOPC.\n4. MITIGATIONS\nMatrikonOPC has made fixes available to resolve this vulnerability through a patch:\n\nMatrikonOPC Explorer Versions 5.0 and prior: Update to V5.1.0.0\n\nMatrikonOPC recommends that the affected users follow the instructions below to download and install the patch:\n\nNavigate to the MatrikonOPC website: https://www.matrikonopc.com/downloads/176/software/index.aspx\nLogin with your credentials\nDownload the patch via this link\nRun the patch installer, which will make all necessary changes.\n\nMatrikonOPC has published a security notification, which can be located here:\nhttps://www.opcsupport.com/s/article/SECURITY-NOTIFICATION-OPC-Explorer-SN-2017-04-27-01\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-8714"
  ],
  "techniques": [],
  "advisory": "icsa-18-130-01",
  "title": "MatrikonOPC Explorer | CISA",
  "source": "ics-advisories",
  "id": "ae2370664725f832e21b4b1a7a0fa7afb198d34fba48a6ca74e1383ac332633c"
}