{
  "markdown": "\nCVSS v3 6.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: ABB\nEquipment: Ellipse\nVulnerability: Unprotected Transport of Credentials\nAFFECTED PRODUCTS\nABB reports that the vulnerability affects Ellipse 8.3 through Ellipse 8.9 released prior to December 2017 (including Ellipse Select).\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to discover authentication credentials by sniffing the network traffic.\nMITIGATION\nABB has released the following product updates to mitigate the vulnerability:\n\nEllipse 8.5.26 Release 7, Dec 2017\nEllipse 8.6.21 Release 5, Dec 2017\nEllipse 8.7.18 Release 7, Dec 2017\nEllipse 8.8.12 Release 7, Dec 2017\nEllipse 8.9.6 Release 7, Dec 2017\n\nPlease see ABB Cyber Security Advisory number Ellipse201703 for more information about this vulnerability, as well as additional mitigations and workarounds at the following location:\nhttp://search-ext.abb.com/library/Download.aspx?DocumentID=9AKK107045A7341&Action=Launch\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nUNPROTECTED TRANSPORT OF CREDENTIALS CWE-523\n\nA vulnerability exists in the authentication of Ellipse to LDAP/AD using the LDAP protocol. An attacker could exploit the vulnerability by sniffing local network traffic, allowing the discovery of authentication credentials.\nCVE-2017-16731 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nRESEARCHER\nABB self-reported the vulnerability to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Switzerland\n",
  "cves": [
    "CVE-2017-16731"
  ],
  "techniques": [],
  "advisory": "icsa-17-353-01",
  "title": "ABB Ellipse | CISA",
  "source": "ics-advisories",
  "id": "d5260bbafa8cd11c62973d4a4c9f6f05a2ff0b133c45c2eaeaf3aff04e9a3b3d"
}