{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: Omron\nEquipment: Sysmac Studio, NX-IO Configurator\nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to overwrite files on a system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Omron engineering software are affected:\n\nSysmac Studio: version 1.54 and prior\nNX-IO Configurator: version 1.22 and prior\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nDotNetZip.Semvered before 1.11.0 is vulnerable to directory traversal, which could allow attackers to write to arbitrary files via a ../ (dot dot slash) in a Zip archive entry mishandled during extraction. This vulnerability is also known as \"Zip-Slip.\"\nCVE-2018-1002205 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nReid Wightman of Dragos reported this vulnerability to CISA. Michael Heinzl reported the Zip-Slip vulnerability to JPCERT/CC.\n4. MITIGATIONS\nOMRON recommends the following general mitigation measures to minimize the risk of vulnerability exploitation:\n\nAnti-virus protection:\n\nProtect any PC with access to the control system against malware and ensure installation and maintenance of up-to-date commercial grade anti-virus software protections. \n\n\nSecurity measures to prevent unauthorized access:\n\nMinimize connection of control systems and equipment to open networks so untrusted devices will be\n\t\tunable to access them.\nImplement firewalls (by shutting down unused communications ports, limiting communications hosts,\n\t\tetc.) and isolate them from the IT network.\nUse a virtual private network (VPN) for remote access to control systems and equipment.\nUse strong passwords and change them frequently.\nInstall physical controls so only authorized personnel can access control systems and equipment.\nScan for viruses to ensure safety of any USB drives or similar devices before connecting them to\n\t\tsystems and devices.\nEnforce multifactor authentication whenever possible of all devices with remote access to control\n\t\tsystems and equipment.\n\n\n\nData input and output protection:\n\nPerform process validation, such as backup validation or range checks, to cope with unintentional\n\t\tmodification of input/output data to control systems and devices.\n\n\n\nData recovery:\n\nPeriodical data backup and maintenance to prevent data loss.\n\n\n\nPlease see Omron's Advisory for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nSeptember 19, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2018-1002205"
  ],
  "techniques": [],
  "advisory": "icsa-23-262-03",
  "title": "Omron Engineering Software Zip-Slip | CISA",
  "source": "ics-advisories",
  "id": "b1c33ff31e7599c3f3f1cf0a2d70a2e505423a200d1891d1de121314d5fc553a"
}