{
  "markdown": "\nCVSS v3 8.1\nATTENTION: Low skill level to exploit.\nVendor: LAVA Computer MFG Inc.\nEquipment: Ether-Serial Link\nVulnerability: Authentication Bypass by Spoofing\nAFFECTED PRODUCTS\nThe following versions of LAVA Computer MFG Inc.’s Ether-Serial Links (ESL) are affected:\n\nAll ESLs running firmware versions 6.01.00/29.03.2007 and prior versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to spoof the IP address of an authenticated user, assume the authenticated user’s identity, and gain privileges or access to the system.\nMITIGATION\nLAVA Computer MFG Inc. has not responded to requests to work with NCCIC/ICS-CERT to mitigate this vulnerability.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n1.Do not click web links or open unsolicited attachments in email messages.\n2.Refer to Recognizing and Avoiding Email Scamsfor more information on avoiding email scams.\n3.Refer to Avoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks.\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nAUTHENTICATION BYPASS BY SPOOFING CWE-290\n\nAn improper authentication vulnerability has been identified, which, if exploited, would allow an attacker with the same IP address to bypass authentication by accessing a specific uniform resource locator.\nCVE-2017-14003 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nMaxim Rupp reported this vulnerability to ICS-CERT. \nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Ontario, Canada\n",
  "cves": [
    "CVE-2017-14003"
  ],
  "techniques": [],
  "advisory": "icsa-17-283-01",
  "title": "LAVA Computer MFG Inc. Ether-Serial Link | CISA",
  "source": "ics-advisories",
  "id": "2332c967e9fb36206a42ecded39b72b48af3e34b96f24a13893399120dae8efd"
}