{
  "markdown": "\nOverview\nThis Advisory is a follow-up to the Alert titled “ICS-ALERT-11-256-04 Measuresoft ScadaPro” that was published September 13, 2011, on the ICS-CERT website.\nICS-CERT is aware of a public report of three vulnerabilities with proof-of-concept (PoC) exploit code affecting Measuresoft ScadaPro. According to the report, the vulnerabilities include a stack buffer overflow, an insecure method call, and a path traversal, which are all remotely exploitable through Port 11234/UDP. This report was released publicly without coordination with either the vendor or ICS-CERT.\nAttribution for the discovery of these vulnerabilities is not provided in this advisory because no prior coordination occurred with the vendor, ICS-CERT, or other coordinating body. ICS-CERT encourages researchers to coordinate vulnerability details before public release. The public release of vulnerability details prior to the development of proper mitigations may put industrial control systems (ICSs) and the public at avoidable risk.\nICS-CERT has coordinated with Measuresoft, which has produced a fix that resolves these vulnerabilities. The fix has been tested to validate that it resolves the vulnerabilities.\nAffected Products\nThe following Measuresoft ScadaPro versions are affected:\n\nScadaPro Version 4.0.0.0 and earlier.\n\nImpact\nThe stack overflow vulnerability could allow an attacker to cause a denial of service (DoS) or to remotely execute code on the affected machine. The insecure method call and the path traversal vulnerabilities could allow information leakage.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their environment, architecture, and product implementation.\nBackground\nScadaPro is a supervisory control and data acquisition (SCADA) system used in the power generation, oil and gas, pharmaceuticals, and manufacturing sectors. According to Measuresoft, ScadaPro is sold in multiple countries by various third-party distributors, making total deployment difficult to quantify.\nMeasuresoft Development Ltd. is headquartered in Louth, Ireland, with an office in Missouri City, Texas.\nVulnerability Characterization\nVulnerability Overview\n\n\n\nVulnerability Type\nExploitability\nImpact\n\n\n\n\n\nStack Overflow\n\n\nRemote\n\n\nDenial of Service / Possible Remote Code Execution\n\n\n\n\nInsecure Method Call\n\n\nRemote\n\n\nInformation Leak / Disclosure\n\n\n\n\nPath Traversal \n\n\nRemote\n\n\nInformation Leak / Disclosure\n\n\n\n\n \nMITRE has assigned numbers CVE-2011-3490, CVE-2011-3495, CVE-2011-3496, and CVE-2011-3497 to these vulnerabilities in the Common Vulnerabilities and Exposures\nVulnerability Details\nExploitability\nThese vulnerabilities are remotely exploitable.\nExistence of Exploit\nPublic exploits are known to exist that target these vulnerabilities.\nDifficulty\nAn attacker with a low skill level can create a DoS, traverse directories, or extract data; only a more skilled attacker would be able to execute arbitrary code on affected systems.\nMitigation\nMeasuresoft has provided a new version (4.0.1), which is available without cost to all licensed customers who are currently running Version 4.0.0. Measuresoft has resolved the reported issues by disabling Port 11234/UDP by default. According to Measuresoft, alternative network communication methods are already in place and will be used instead.\nAccording to Measuresoft, Version 4.0.1 of ScadaPro Server is now available for download from the Measuresoft website.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks. Asset owners should consider the following measures:\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n\n",
  "cves": [
    "CVE-2011-3490",
    "CVE-2011-3497",
    "CVE-2011-3495",
    "CVE-2011-3496"
  ],
  "techniques": [],
  "advisory": "icsa-11-263-01",
  "title": "Measuresoft ScadaPro Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "d1d120078f02473e642b934dc3d3da91d3e2ae78c31c6ab5cea3834e549954c9"
}