{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE X Products\nVulnerabilities: Missing Authentication for Critical Function, Heap-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-012-05 Siemens SCALANCE X Products (Update A) that was published February 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause denial-of-service conditions and further impact the system through heap and buffer overflows.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that these vulnerabilities affect the following SCALANCE X products: \n--------- Begin Update B Part 1 of 2 ---------\n\nSCALANCE X-200 switch family (incl. SIPLUS NET variants): All versions prior to v5.2.5\n\n--------- End Update B Part 1 of 2 ---------\n\nSCALANCE X-200IRT switch family (incl. SIPLUS NET variants): All versions prior to v5.5.0\nSCALANCE X-300 switch family (incl. X408 and SIPLUS NET variants): All versions prior to v4.1.0, only affected by CVE-2020-15800\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThis vulnerability could allow an unauthenticated attacker to reboot the device over the network using special URLs from integrated web server of the affected products. \nCVE-2020-15799 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe web server of the affected devices contains a vulnerability that may lead to a heap-overflow condition. An attacker could cause this condition on the web server by sending specially crafted requests. This could stop the web server temporarily. \nCVE-2020-15800 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe web server of the affected devices contains a vulnerability that may lead to a buffer-overflow condition. An attacker could cause this condition on the web server by sending a specially crafted request. The web server could stop and not recover. \nCVE-2020-25226 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\\\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens has released updates for several affected products and recommends updating to the latest version(s). Siemens recommends countermeasures where fixes are not currently available.\n--------- Begin Update B Part 2 of 2 ---------\n\nSCALANCE X-200 switch family (incl. SIPLUS NET variants): Update to v5.2.5 or later\n\n--------- End Update B Part 2 of 2 ---------\n\nSCALANCE X-300 switch family: Update to v4.1.0 or later\nSCALANCE X-200IRT switch family (incl. SIPLUS NET variants): Update to v5.5.0 or later\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nLimit network traffic of web servers of SCALANCE X switches to trusted connections by firewall rules (Port 443/TCP).\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-139628\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-15799",
    "CVE-2020-25226",
    "CVE-2020-15800"
  ],
  "techniques": [],
  "advisory": "icsa-21-012-05",
  "title": "Siemens SCALANCE X Products (Update B) | CISA",
  "source": "ics-advisories",
  "id": "169fdfef678b3b688a10ef91a491ef299e3f0add760c88b871f80cadc2c647c2"
}