{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 9.4\nATTENTION: Exploitable from adjacent network/Low attack complexity\nVendor: IOSiX\nEquipment: IO-1020 Micro ELD\nVulnerabilities: Use of Default Credentials, Download of Code Without Integrity Check\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an adjacent attacker to take control of vehicle systems by connecting to and modifying the affected device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following IOSiX products are affected:\n\nIO-1020 Micro ELD: Versions prior to 360\n\n3.2 Vulnerability Overview\n3.2.1 USE OF DEFAULT CREDENTIALS CWE-1392\nIO-1020 Micro ELD uses a default WIFI password that could allow an adjacent attacker to connect to the device.\nCVE-2024-30210 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-30210. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:H/SI:H/SA:H).\n3.2.2 USE OF DEFAULT CREDENTIALS CWE-1392\nWeb server uses a default password for authentication.\nCVE-2024-31069 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-31069. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:H/SI:H/SA:H).\n3.2.3 DOWNLOAD OF CODE WITHOUT INTEGRITY CHECK CWE-494\nIO-1020 Micro ELD downloads source code or an executable from an adjacent location and executes the code without sufficiently verifying the origin or integrity of the code.\nCVE-2024-28878 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-28878. A base score of 9.4 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Transportation\nCOUNTRIES/AREAS DEPLOYED: North America\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJake Jepson of Colorado State University reported these vulnerabilities to CISA.\n4. MITIGATIONS\nIOSIX recommends users update to 360.\nFor further support, contact IOSiX.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nApril 2, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-30210",
    "CVE-2024-28878",
    "CVE-2024-31069"
  ],
  "techniques": [],
  "advisory": "icsa-24-093-01",
  "title": "IOSIX IO-1020 Micro ELD | CISA",
  "source": "ics-advisories",
  "id": "31e05d51f0a5e175a44c1972749995539cdcb38ad04e2fd7f1bae2dd1e29c7be"
}