{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 6.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Dorsett Controls\nEquipment: InfoScan\nVulnerabilities: Exposure of Sensitive Information To An Unauthorized Actor, Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to expose sensitive information, resulting in data theft and misuse of credentials.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Dorsett Controls products are affected:\n\nInfoScan: v1.32, v1.33, and v1.35\n\n3.2 Vulnerability Overview\n3.2.1 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nDorsett Controls InfoScan is vulnerable due to a leak of possible sensitive information through the response headers and the rendered JavaScript prior to user login.\nCVE-2024-42493 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-42493. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N).\n3.2.2 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe InfoScan client download page can be intercepted with a proxy, to expose filenames located on the system, which could lead to additional information exposure.\nCVE-2024-42408 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-42408. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.2.3 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nDorsett Controls Central Server update server has potential information leaks with an unprotected file that contains passwords and API keys.\nCVE-2024-39287 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-39287. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N/SC:L/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAn anonymous researcher reported these vulnerabilities to CISA.\n4. MITIGATIONS\nDorsett Controls recommends users update their InfoScan system v1.38 or later.\nTo install the new release, user administrators will need to:\n\nlogin to InfoScan and select \"System Prefs\" from the menu.\nOnce the System Prefs application is open, select Maintenance.\nClick the Install Now button in the Ready To Install section.\nIf no internet access available, the update will need to be downloaded from the Dorsett Controls Customer Portal by selecting the InfoScan Update tile. Download the update and following the instructions listed on the portal.\n\nFor more information, please refer to the Dorsett Controls security bulletin for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nAugust 8, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-42493",
    "CVE-2024-39287",
    "CVE-2024-42408"
  ],
  "techniques": [],
  "advisory": "icsa-24-221-01",
  "title": "Dorsett Controls InfoScan | CISA",
  "source": "ics-advisories",
  "id": "c78b625c9d6d4985b3531132b10423280d0138cec8c3034de756940ec24dd1cb"
}