{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available\nVendor: Adminer\nEquipment: Adminer\nVulnerability: Files or Directories Accessible to External Parties\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow reading of database credentials and loss of sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Adminer, a database management tool, are affected:\n\nAdminer: Versions 1.112.0 to 4.6.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    FILES AND DIRECTORIES ACCESSIBLE TO EXTERNAL PARTIES CWE-552\nThe affected product is vulnerable to a MySQL database issue that allows an attacker to read database files. This may allow an attacker to read database credentials and steal data. \nCVE-2021-43008 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Czech Republic\n\n3.4 RESEARCHER\nMosin from ELEX FEIGONG RESEARCH INSTITUTE of Elex CyberSecurity, Inc., reported this vulnerability to CISA.\n4. MITIGATIONS\nAdminer has fixed this vulnerability and recommends users upgrade to Version 4.6.3 or later.\nSee the following links for more information and mitigations on ICS devices that use Adminer:\n\nAdvantech R-SeeNet (Windows Installation of R-SeeNet is only affected, upgrade to Version 2.4.19 or later)\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2021-43008"
  ],
  "techniques": [],
  "advisory": "icsa-22-130-01",
  "title": "Adminer in Industrial Products | CISA",
  "source": "ics-advisories",
  "id": "606baac1cf3ca55a3e4823b3aa5e8267885d583ae5ce1482e5c31bfa95dde3ca"
}