{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Schneider Electric\nEquipment: ClearSCADA\nVulnerability: Improper Input Validation\nAFFECTED PRODUCTS\nThe following versions of ClearSCADA, server and communications driver processes, are affected:\n\nAll supported versions including:\n\nClearSCADA 2014 R1 (build 75.5210) and prior,\nClearSCADA 2014 R1.1 (build 75.5387) and prior,\nClearSCADA 2015 R1 (build 76.5648) and prior,\nClearSCADA 2015 R2 (build 77.5882) and prior.\n\n\n\nIMPACT\nSuccessful exploitation of this vulnerability could cause the ClearSCADA server process and communications driver processes to terminate.\nMITIGATION\nSchneider Electric has released the following updates to mitigate the vulnerability:\n\nClearSCADA 2014 R1.1 hotfix build 75.6239\nClearSCADA 2015 R1.1 Service Pack (build 76.6191)\nClearSCADA 2015 R2 hotfix build 77.6181\n\nUsers of ClearSCADA 2013 R2 and prior versions should upgrade to the latest ClearSCADA 2015 R2 hotfix to mitigate the vulnerability.\nEach of the Service Pack and hotfixes above are available for direct download from Schneider Electric’s web site at:\nhttp://resourcecenter.controlmicrosystems.com/display/CS/SCADA+Expert+ClearSCADA+Downloads\nMore information can be found by visiting Schneider Electric’s Security Notification at:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-060-01/\nSchneider Electric recommends users include the following measures in their SCADA strategies:\n\nSecure physical and network interfaces to the ClearSCADA system.\nDeploy suitably configured firewalls between network segments to limit access to ports and protocols appropriately.\nDeploy VPN technology with secure authentication on any externally accessible networks.\nConfigure and audit user security to reduce the risk of a denial of service.\nFor critical accounts use ClearSCADA security policy configuration to disable invalid logon count and delayed lockout time and to use logon throttling.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION CWE-20\n\nAn attacker with network access to the ClearSCADA server can send specially crafted sequences of commands and data packets to the ClearSCADA server that can cause the ClearSCADA server process and ClearSCADA communications driver processes to terminate.\nCVE-2017-6021 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nSergey Temnikov and Vladimir Dashchenko of Kapersky Lab’s Critical Infrastructure Defense Team identified and reported the vulnerability to Schneider Electric.\nBACKGROUND\nCritical Infrastructure Sector(s): Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n \n",
  "cves": [
    "CVE-2017-6021"
  ],
  "techniques": [],
  "advisory": "icsa-17-068-01",
  "title": "Schneider Electric ClearSCADA | CISA",
  "source": "ics-advisories",
  "id": "6756cf7e445c4f7ffaa1ce520aa91972fe5f22432b1e7baa96a9c9cdcb701a3a"
}