{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Schneider Electric\nEquipment: U.motion Builder\n\n--------- Begin Update A Part 1 of 5 --------\n\nVulnerabilities: SQL Injection, Path Traversal, Improper Authentication, Use of Hard-Coded Password, Improper Access Control, Denial of Service, Information Disclosure, Improper Input Validation, Improper Control of Generation of Code\n\n--------- End Update A Part 1 of 5 ----------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-180-02 Schneider Electric U.motion Builder that was published June 29, 2017, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nA successful exploit of these vulnerabilities could allow an attacker to execute arbitrary commands or compromise the confidentiality, integrity, and availability of the system.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following U.motion Builder Software versions are affected:\n\nU.motion Builder Versions 1.2.1 and prior.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nUnauthenticated users can use calls to various paths in order to perform arbitrary SQL statements against the underlying database.\nCVE-2017-7973 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n--------- Begin Update A Part 2 of 5 --------\n4.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of track_import_export.php. The underlying SQLite database query is subject to SQL injection on the object_id input parameter.\nCVE-2018-7765 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.3    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of track_getdata.php. The underlying SQLite database query is subject to SQL injection on the id input parameter.\nCVE-2018-7766 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n4.2.4    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of editobject.php. The underlying SQLite database query is subject to SQL injection on the type input parameter.\nCVE-2018-7767 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n4.2.5    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of loadtemplate.php. The underlying SQLite database query is subject to SQL injection on the tpl input parameter.\nCVE-2018-7768 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n4.2.6    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of xmlserver.php. The underlying SQLite database query is subject to SQL injection on the id input parameter.\nCVE-2018-7769 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n4.2.7    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of applets that are exposed on the web service. The underlying SQLite database query to determine whether a user is logged in is subject to SQL injection on the loginSeed parameter, which can be embedded in the HTTP cookie of the request.\nCVE-2018-7772 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n4.2.8    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of nfcserver.php. The underlying SQLite database query is subject to SQL injection on the sessionid input parameter.\nCVE-2018-7773 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n4.2.9    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe vulnerability exists within processing of localize.php. The underlying SQLite database query is subject to SQL injection on the username input parameter.\nCVE-2018-7774 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n--------- End Update A Part 2 of 5 ----------\n4.2.10    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nUnauthenticated users can execute arbitrary code and exfiltrate files.\nCVE-2017-7974 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- Begin Update A Part 3 of 5 --------\n4.2.11    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe vulnerability exists within css.inc.php. The 'css' parameter contains a directory traversal vulnerability.\nCVE-2018-7763 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n4.2.12    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe vulnerability exists within runscript.php applet. There is a directory traversal vulnerability in the processing of the 's' parameter of the applet.\nCVE-2018-7764 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n4.2.13    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe vulnerability exists within processing of sendmail.php. The applet allows callers to select arbitrary files to send to an arbitrary email address.\nCVE-2018-7770 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n4.2.14    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe vulnerability exists within processing of editscript.php. A directory traversal vulnerability allows a caller with standard user privileges to write arbitrary php files anywhere in the web service directory tree.\nCVE-2018-7771 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:L).\n--------- End Update A Part 3 of 5 ----------\n4.2.15    IMPROPER AUTHENTICATION CWE-287\nThe system includes a hard-coded valid session. If an attacker uses that session ID as part of the HTTP cookie of a web request, then authentication is bypassed.\nCVE-2017-9956 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.16    USE OF HARD-CODED PASSWORD CWE-259\nThe system comes with a system web access account hard-coded.\nCVE-2017-9957 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.17    IMPROPER ACCESS CONTROL CWE-284\nImproper handling of the system configuration can allow an attacker to execute arbitrary code under the context of root.\nCVE-2017-9958 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n4.2.18    DENIAL OF SERVICE CWE-730\nThe system accepts reboot in session from unauthenticated user causing a denial of service.\nCVE-2017-9959 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.19    INFORMATION EXPOSURE THROUGH AN ERROR MESSAGE CWE-209\nThe system returns more information than should be passed to an unauthenticated caller who might be an attacker.\nCVE-2017-9960 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n--------- Begin Update A Part 4 of 5 --------\n4.2.20    INFORMATION EXPOSURE THROUGH AN ERROR MESSAGE CWE-209\nThe vulnerability exists within externalframe.php. Exception information is returned to the attacker that contains sensitive path information.\nCVE-2018-7776 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n4.2.21    IMPROPER INPUT VALIDATION CWE-20\nThe vulnerability is due to insufficient handling of update_file request parameter on update_module.php. A remote, authenticated attacker can exploit this vulnerability by sending a crafted request to the target server.\nCVE-2018-7777 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.22    IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94\nSamba since Version 3.5.0 and before 4.6.4, 4.5.10 and 4.4.14 is vulnerable to remote code execution vulnerability, allowing a malicious client to upload a shared library to a writable share, and then cause the server to load and execute it.\nCVE-2017-7494  has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n--------- End Update A Part 4 of 5 ----------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, and Energy\nCOUNTRIES/AREAS DEPLOYED: United States, Europe, and Asia\nCOMPANY HEADQUARTERS LOCATION: France\n\n4.4 RESEARCHER\nrgod working with Trend Micro’s Zero Day Initiative, Constantin-Cosmin CRACIUN, and Schneider Electric identified these vulnerabilities.\n5. MITIGATIONS\nSchneider Electric’s security notice SEVD-2017-178-01 is available at the following location:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-178-01/\n--------- Begin Update A Part 5 of 5 --------\nFirmware update Version 1.3.4, which includes fixes for most of these vulnerabilities, has been released. It is highly recommended that U.motion Builder users apply the patch in a timely manner.\nThe firmware is available for download at:\nhttps://www.schneider-electric.com/en/download/document/SE_UMOTION_BUILDER/\nU.motion server firmware update Version 1.3.4 is available for download at:\nhttps://www.schneider-electric.com/en/download/document/Umotion_Server_update/\n--------- End Update A Part 5 of 5 ----------\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2017-9958",
    "CVE-2018-7763",
    "CVE-2018-7769",
    "CVE-2018-7772",
    "CVE-2018-7768",
    "CVE-2017-9957",
    "CVE-2018-7774",
    "CVE-2017-9959",
    "CVE-2017-9960",
    "CVE-2018-7765",
    "CVE-2018-7766",
    "CVE-2017-7974",
    "CVE-2018-7770",
    "CVE-2018-7771",
    "CVE-2018-7764",
    "CVE-2018-7773",
    "CVE-2018-7776",
    "CVE-2017-7973",
    "CVE-2017-9956",
    "CVE-2018-7767",
    "CVE-2017-7494",
    "CVE-2018-7777"
  ],
  "techniques": [],
  "advisory": "icsa-17-180-02",
  "title": "Schneider Electric U.motion Builder (Update A) | CISA",
  "source": "ics-advisories",
  "id": "6739af95398eabb46351a3c938462a6f98539cd06fc7ac25058433c522b34530"
}