{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Mitsubishi Electric\nEquipment: MELSEC\nVulnerability: Cleartext Transmission of Sensitive Information\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-175-01 Mitsubishi Electric MELSEC iQ-R, iQ-F, Q, L and FX Series CPU Modules that was published June 23, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow information disclosure, information tampering, unauthorized operation, or a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the vulnerability affects the following MELSEC products: \n\nMELSEC iQ-R, iQ-F, Q, L and FX series CPU modules, all versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThere is a vulnerability due to cleartext communication between Mitsubishi Electric MELSEC iQ-R, iQ-F, Q, L, and FX series CPU modules, and GX Works3/GX Works2. There are risks of communication data eavesdropping/tampering, unauthorized operation, and denial-of-service (DoS) attacks from attackers.\n--------- Begin Update A Part 1 of 2 ---------\nCVE-2020-5594 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n--------- End Update A Part 1 of 2 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan \n\n4.4 RESEARCHER\nShunkai Zhu, Rongkuan Ma and Peng Cheng from NESC Lab of Zhejiang University reported this vulnerability to Mitsubishi Electric.\n5. MITIGATIONS\nMitsubishi Electric recommends encrypting the communication path by setting up a VPN to mitigate the impact of this vulnerability.\n--------- Begin Update A Part 2 of 2 ---------\nAdditional information about the vulnerability is available by contacting a Mitsubishi Electric representative.\nhttps://us.mitsubishielectric.com/fa/en/about-us/distributors\n--------- End Update A Part 2 of 2 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-5594"
  ],
  "techniques": [],
  "advisory": "icsa-20-175-01",
  "title": "Mitsubishi Electric MELSEC iQ-R, iQ-F, Q, L and FX Series CPU Modules (Update A) | CISA",
  "source": "ics-advisories",
  "id": "2f6d877922d064f2871291f866280fc7b00ffa6050194242b62108790608d8ad"
}