{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Opcenter Quality\nVulnerability: Incorrect Implementation of Authentication Algorithm.\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthenticated access to the application or cause denial of service condition for existing users.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following quality management systems: \n\nOpcenter Quality V13.1: All versions prior to v13.1.20220624 \nOpcenter Quality V13.2: All versions prior to v13.2.20220624 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT IMPLEMENTATION OF AUTHENTICATION ALGORITHM CWE-303\nThe affected applications do not properly validate login information during authentication. This could lead to denial-of-service condition for existing users or allow unauthenticated remote attackers to successfully login without credentials.\nCVE-2022-33736 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends updating to the latest versions:\n\nOpcenter Quality V13.1: Update to v13.1.20220624 or later version.\nOpcenter Quality V13.2: Update to v13.2.20220624 or later version.\n\nSiemens recommends implementing the following specific workarounds and mitigations that customers can apply to reduce the risk:\n\nSolutions with configuration as Encryted=2 in ibs.config are potentially impacted by this vulnerability.  If problems exist and an immediate replacement of IbsGailWrapper-DLLs is NOT possible, please contact your support-team to change the secure mode of your installation\nFor all other cases it is recommended to replace the IbsGailWrapper-DLLs for short-term \n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals to help foster a secure environment.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity \nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-944952\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-33736"
  ],
  "techniques": [],
  "advisory": "icsa-22-195-17",
  "title": "Siemens Opcenter Quality | CISA",
  "source": "ics-advisories",
  "id": "02279f6c50105d6954fae2a292fec0325d5fe3241111741face3ad532e791f1c"
}