{
  "markdown": "\nOVERVIEW\nSiemens has identified a password storage vulnerability in its Sm@rtClient Android application. This vulnerability was reported directly to Siemens by Karsten Sohr from Universität Bremen and Stephan Huber from Fraunhofer SIT. Siemens has produced a new version to mitigate this vulnerability.\nThis vulnerability can only be exploited locally.\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following versions of SIMATIC WinCC Sm@rtClient:\n\nSIMATIC WinCC Sm@rtClient for Android: All versions prior to V01.00.01.00,\nSIMATIC WinCC Sm@rtClient Lite for Android: All versions prior to V01.00.01.00.\n\nIMPACT\nA local attacker may be able to exploit this vulnerability to retrieve Sm@rtServer-specific passwords stored on the mobile device.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSiemens is a multinational company headquartered in Munich, Germany.\nThe affected products, SIMATIC WinCC Sm@rtClient applications, in combination with the SIMATIC WinCC Sm@rtServer, allow remote mobile operation and observation of SIMATIC HMI systems. According to Siemens, the SIMATIC WinCC Sm@rtClient applications are deployed across several sectors including Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems. Siemens estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nINSUFFICIENTLY PROTECTED CREDENTIALSCWE-522: Insufficiently Protected Credentials, http://cwe.mitre.org/data/definitions/522.html, web site last accessed July 21, 2015.\n\nThe existing storage technique for Sm@rtServer-specific passwords could allow attackers to extract the password if local access to the mobile device was available.\nCVE-2015-5084NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-5084, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 2.1 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:N/C:P/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:N/C:P/I:N/A:N , web site last accessed July 21, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability can only be exploited locally.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit this vulnerability.\nMITIGATION\nSiemens has released SIMATIC WinCC Sm@rtClient V01.00.01.00 for Android, which fixes these vulnerabilities and recommends updating as soon as possible.\n\nThe new version of Sm@rtClient can be obtained via Google’s Play Store:\n\nhttps://play.google.com/store/apps/details?id=com.siemens.smartclient\n\nThe new version of Sm@rtClient for US customers can be obtained via Google’s Play Store:\n\nhttps://play.google.com/store/apps/details?id=com.siemens.smartclient_us\n\nThe new version of Sm@rtClient Lite can be obtained via Google’s Play Store:\n\nhttps://play.google.com/store/apps/details?id=com.siemens.smartclient_lite\n\nThe new version of Sm@rtClient Lite for US customers can be obtained via Google’s Play Store:\n\nhttps://play.google.com/store/apps/details?id=com.siemens.smartclient_us_lite\nFor more information on these vulnerabilities and detailed instructions, please see Siemens Security Advisory SSA- 267489 at the following location:\nhttp://www.siemens.com/cert/advisories\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nEmploy strong passwords on portable devices.\nCarefully select and use security applications on portable devices.\nBe selective of other apps loaded on the same portable device.\nCreate multiple user accounts on shared devices.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n\n",
  "cves": [
    "CVE-2015-5084"
  ],
  "techniques": [],
  "advisory": "icsa-15-202-02",
  "title": "Siemens Sm@rtClient Password Storage Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "2be863b5cc2f1c0909f0d5046bac242208b516b9f4cc3e67cf680d1de29e5f8f"
}