{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE X switches\nVulnerability: Insufficient Resource Pool\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-19-225-03 Siemens SCALANCE X Switches (Update C) that was published September 14, 2021, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SCALANCE X switches are affected:\n--------- Begin Update D Part 1 of 1 ---------\n\nSCALANCE X204RNA (HSR) (6GK5204-0BA00-2MB2): All versions\nSCALANCE X204RNA (PRP) (6GK5204-0BA00-2KB2): All versions\nSCALANCE X204RNA EEC (HSR) (6GK5204-0BS00-2NA3): All versions\nSCALANCE X204RNA EEC (PRP) (6GK5204-0BS00-3LA3): All versions\nSCALANCE X204RNA EEC (PRP/HSR) (6GK5204-0BS00-3PA3): All versions\n\n--------- End Update D Part 1 of 1 ---------\n\n\n\nSCALANCE X-200IRT switch family (incl. SIPLUS NET variants): All versions prior to 5.5.0\nSCALANCE X-200RNA: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INSUFFICIENT RESOURCE POOL CWE-410\nAn attacker may send large message packages repeatedly to the telnet service, which may allow a denial-of-service condition.\nCVE-2019-10942 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\n\n\nYounes Dragoni and Alessandro Di Pinto from Nozomi Networks and Artem Zinenko from Kaspersky reported these vulnerability details to Siemens.\n5. MITIGATIONS\nSiemens has identified the following specific updates, workarounds and mitigations users can apply to reduce the risk:\n\nSCALANCE X-200 switch family (incl. SIPLUS NET variants): Update to v5.2.5 or later\nSCALANCE X-200IRT switch family (incl. SIPLUS NET variants): Update to v5.5.0 or later\nDisable telnet service on affected devices. Users should use SSH instead.\nRestrict network access to Port 23/TCP of the device.\n\nSiemens recommends users configure their environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens security advisory SSA-100232\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10942"
  ],
  "techniques": [],
  "advisory": "icsa-19-225-03",
  "title": "Siemens SCALANCE X Switches (Update D) | CISA",
  "source": "ics-advisories",
  "id": "15b626e8598ac995ce989bed094be6ffc2853ddf547da1be08b8785e1462587d"
}