{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Low attack complexity\nVendor: AVEVA\nEquipment: System Platform\nVulnerability: Cleartext Storage of Sensitive Information in Memory\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could expose cleartext credentials for the network user account or for logged-in users to an authorized, low privilege user. The cleartext credentials would also be exposed if the user creates a diagnostic memory dump of the relevant process and saves it to a non-protected location where an unauthorized, malicious user can access it.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AVEVA System Platform, a software management platform, are affected:\n\nAVEVA System Platform 2020 R2 P01\nAVEVA System Platform 2020 R2S\nAVEVA System Platform 2020\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT STORAGE OF SENSITIVE INFORMATION IN MEMORY CWE-316 \nThe affected product stores sensitive information in cleartext, which may allow access to an attacker or a low-privileged user.\nCVE-2022-0835 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nNoam Moshe of Claroty and Ilya Karpov, Evgeniy Druzhinin, and Konstantin Kondratev of Rostelecom-Solar reported this vulnerability to AVEVA.\n4. MITIGATIONS\nAVEVA recommends users of affected versions upgrade to one of the versions listed below and apply the corresponding security update:\n\nAVEVA System Platform 2020 R2 P01 and AVEVA System Platform 2020 R2: update to AVEVA System Platform 2020 R2 SP1\nAVEVA System Platform 2020: update to AVEVA System Platform 2020 P01\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-0835"
  ],
  "techniques": [],
  "advisory": "icsa-22-067-02",
  "title": "AVEVA System Platform | CISA",
  "source": "ics-advisories",
  "id": "c3c4a88e7be02611235684503d7f5432d60ee87b95ebcd1375fe5b20d6900880"
}