{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: MiCODUS\nEquipment: MV720 GPS tracker\nVulnerabilities: Use of Hard-coded Credentials, Improper Authentication, Cross-site Scripting, Authorization Bypass Through User-controlled Key\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-200-01 MiCODUS MV720 GPS tracker that was published July 19, 2022, on the ICS webpage on cisa.gov/ICS\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker control over any MV720 GPS tracker, granting access to location, routes, fuel cutoff commands, and the disarming of various features (e.g., alarms).\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of MV720 GPS tracker are affected:\n\n MV720 model\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe API server has an authentication mechanism that allows devices to use a hard-coded master password. This may allow an attacker to send SMS commands directly to the GPS tracker as if they were coming from the GPS owner’s mobile number.\nCVE-2022-2107  has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    IMPROPER AUTHENTICATION CWE-287\nSMS-based GPS commands can be executed without authentication.\nCVE-2022-2141 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe main web server has a reflected cross-site scripting vulnerability that could allow an attacker to gain control by tricking a user into making a request.\nCVE-2022-2199 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.4    AUTHORIZATION BYPASS THROUGH USER-CONTROLLED KEY CWE-639\nThe main web server has an authenticated insecure direct object reference vulnerability on endpoint and parameter device IDs, which accept arbitrary device IDs without further verification.\nCVE-2022-34150 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:N).\n4.2.5    AUTHORIZATION BYPASS THROUGH USER-CONTROLLED KEY CWE-639\nThe main web server has an authenticated insecure direct object references vulnerability on endpoint and POST parameter “Device ID,” which accepts arbitrary device IDs.\nCVE-2022-33944 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Transportation Systems, Government Facilities, Financial Services, Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: China\n\n4.4 RESEARCHER\nPedro Umbelino, Dan Dahlberg, and Jacob Olcott of BitSight reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A part 1 of 1 ---------\nMiCODUS has reportedly fixed these vulnerabilities and recommends the following three-part mitigation: \n\nFor the web tracking platform: MiCODUS issued an update eliminating loopholes.\nFor the Android app: Users should update to V2.0.32 or later on Google Play Store.\nFor the iOS app: Users should update to V2.1.1or later on Apple App store.\n\n--------- End Update A part 1 of 1 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-2141",
    "CVE-2022-2107",
    "CVE-2022-2199",
    "CVE-2022-34150",
    "CVE-2022-33944"
  ],
  "techniques": [],
  "advisory": "icsa-22-200-01",
  "title": "MiCODUS MV720 GPS tracker (Update A) | CISA",
  "source": "ics-advisories",
  "id": "28fc434e1a9062162730e8716295830fde012b9a4d934f9cde0bfe2b53bd5aa2"
}