{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.7\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Hitachi Energy \nEquipment: Lumada APM \nVulnerability: Improper Access Control \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain unauthorized access to any Power BI reports installed or manipulate asset issue comments on assets. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi Energy reports the following products are affected: \n\nLumada APM – SaaS: Versions 6.0.0.0 to 6.4.220601.0 \nLumada APM – On Premises: Versions 6.0.0.0.0 to 6.4.0 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER ACCESS CONTROL CWE-284\nHitachi Energy Lumada APM has a flaw in the access control mechanism implementation on the “Limited Engineer” role, granting access to the embedded Power BI reports feature. This could allow an unauthorized user to access information by gaining unauthorized access to any installed Power BI reports, then manipulating asset issue comments on assets that should not be available to that user. \nCVE-2022-2155 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi Energy advises users that the vulnerability is remediated in Lumada APM v6.4.0.1. Lumada APM v6.5.0.0 and later are not affected.  \nAccording to Hitachi Energy, the “On Premise” edition of Lumada APM does not support the Power BI integration feature. However, users can connect a subscription-based Power BI to Lumada APM.  \nIf the Power BI integration feature is enabled, Hitachi Energy recommends: \n\nDisabling the unsupported Power BI integration feature if there are users with “Limited Engineer” role. \nRemoving the any users with “Limited Engineer” role. \nAssigning users to another role prior to using the unsupported Power BI integration feature. \n\nNote: If Power BI integration is disabled, it is safe to continue to assign the “Limited Engineer” role to users. \nHitachi Energy also recommends the following security practices: \n\nPhysically protect process control systems from direct access by unauthorized personnel,  \nEnsure affected equipment has no direct connections to the internet,  \nSeparate process control systems from other networks using a firewall system with a minimal number exposed of ports.  \n\nHitachi Energy advises that process control systems should not be used for internet surfing, instant messaging, or receiving emails. Portable computers and removable storage media should be carefully scanned for viruses before connecting to a control system. \nFor more information, see the Hitachi Energy advisory. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-2155"
  ],
  "techniques": [],
  "advisory": "icsa-23-012-07",
  "title": "Hitachi Energy Lumada APM | CISA",
  "source": "ics-advisories",
  "id": "f2c81a2545d0a815704b36f716b70eba077904b22d1c13193fc247fb7c6870d7"
}