{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: ThinManager ThinServer\nVulnerabilities: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to remotely delete arbitrary files with system privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports this vulnerability affects the following versions of ThinManager ThinServer, a thin client and remote desktop protocol (RDP) server management software:\n\nThinManager ThinServer: Versions 11.0.0-11.0.6\nThinManager ThinServer: Versions 11.1.0-11.1.6\nThinManager ThinServer: Versions 11.2.0-11.2.6\nThinManager ThinServer: Versions 12.1.0-12.1.6\nThinManager ThinServer: Versions 12.0.0-12.0.5\nThinManager ThinServer: Versions 13.0.0-13.0.2\nThinManager ThinServer: Version 13.1.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER INPUT VALIDATION CWE-20\nDue to improper input validation, an integer overflow condition exists in the affected products. When the ThinManager processes incoming messages, a read access violation occurs and terminates the process. A malicious user could exploit this vulnerability by sending a crafted synchronization protocol message.\nCVE-2023-2914 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2 IMPROPER INPUT VALIDATION CWE-20\nDue to improper input validation, a path traversal vulnerability exists when the ThinManager processes a certain function. If exploited, an unauthenticated remote threat actor can delete arbitrary files with system privileges. A malicious user could exploit this vulnerability by sending a specifically crafted synchronization protocol message.\nCVE-2023-2915 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3 IMPROPER INPUT VALIDATION CWE-20\nDue to improper input validation, a path traversal vulnerability exists, via the file name field, when the ThinManager processes a certain function. If exploited, an unauthenticated remote attacker can upload arbitrary files to any directory on the disk drive where ThinServer.exe is installed. A malicious user could exploit this vulnerability by sending a crafted synchronization protocol message.\nCVE-2023-2917 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to CISA.\n4. MITIGATIONS\nRockwell Automation recommends customers apply the following mitigations:\n\nThinManager ThinServer: Versions 11.0.0-11.2.6: Update to 11.0.7\nThinManager ThinServer: Versions 11.1.0-11.1.6: Update to 11.1.7\nThinManager ThinServer: Versions 11.2.0-11.2.6: Update to 11.2.8\nThinManager ThinServer: Versions 12.1.0-12.1.6: Update to 12.1.7\nThinManager ThinServer: Versions 12.0.0-12.0.5: Update to 12.0.6\nThinManager ThinServer: Versions 13.0.0-13.0.2: Update to 13.0.3\nThinManager ThinServer: Version 13.1.0: Update to 13.1.1\n\n \nCustomers using the affected software are encouraged to apply mitigations, if possible. Additionally, Rockwell Automation encourages customers to implement suggested security best practices to minimize the risk of vulnerability.\n\nUpdate to the corrected software versions.\nLimit remote access for TCP Port 2031 to known thin clients and ThinManager servers.\nSecurity Best Practices\n\nFor more information, see Rockwell Automation’s Security Advisory.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n",
  "cves": [
    "CVE-2023-2917",
    "CVE-2023-2914",
    "CVE-2023-2915"
  ],
  "techniques": [],
  "advisory": "icsa-23-234-03",
  "title": "Rockwell Automation ThinManager ThinServer | CISA",
  "source": "ics-advisories",
  "id": "fccf6187ddbde854e1f8f7eca3694779d6548189537e90d22f9d6a2f3b69e5ee"
}