{
  "markdown": "\nCVSS v3 10.0\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: iniNet Solutions GmbH\nEquipment: SCADA Webserver\nVulnerability: Improper Authentication\nAFFECTED PRODUCTS\nThe following versions of iniNet Solutions GmbH’s SCADA Webserver, a third-party web-based server software, are affected:\n\niniNet Webserver, All versions prior to V2.02.0100\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow malicious users to access human-machine interface (HMI) pages or to modify programmable logic controller (PLC) variables without authentication.\nMITIGATION\nIniNet Solutions GmbH has released a new version of the SCADA Webserver, V2.02.0100, which allows users to implement basic authentication. It can be found at the following location (login required):\nhttp://spidercontrol.net/download/downloadarea/?lang=en\nInstructions for implementing basic authentication can be found in the user manual for V2.02.0100.\nIniNet Solutions GmbH reminds users that the webserver is designed to be used in a protected environment.\nAs a third-party software, the iniNet Webserver is used in many different vendors’ products. Asset owners should determine if they are using a vulnerable version of the iniNet Webserver and follow the recommended practices below.\nIniNet Solutions GmbH recommends that users never connect PLCs to the Internet. If a user must connect to the Internet, IniNet Solutions GmbH recommends using a managed infrastructure to do so.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nThe webserver does not properly authenticate users, which may allow a malicious attacker to access sensitive information such as HMI pages or modify PLC variables.\nCVE-2017-13995 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\nRESEARCHER\nMatthias Niedermaier and Florian Fischer, both of Augsburg University of Applied Sciences, reported this vulnerability.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Switzerland\n",
  "cves": [
    "CVE-2017-13995"
  ],
  "techniques": [],
  "advisory": "icsa-17-264-04",
  "title": "iniNet Solutions GmbH SCADA Webserver | CISA",
  "source": "ics-advisories",
  "id": "5c422a0cd906e4c0adfaaacf0f3ff902b4d0276ace1b887a588d2de8f233632f"
}