{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: OZW web server\nVulnerability: Information disclosure\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthenticated users to access project files.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of OZW web server are affected:\n\nOZW672 and OZW772: All versions prior to 10.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INFORMATION DISCLOSURE CWE-552\nVulnerable versions of OZW web server use predictable path names for project files that legitimately authenticated users have created by using the application’s export function. By accessing a specific uniform resource locator on the web server, a remote attacker could be able to download a project file without prior authentication.\nCVE-2019-13941 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Government Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMaxim Rupp reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends users to update OZW672 and OZW772 to version 10.0\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nConfigure the product according to the OZW hardening guidelines.\nRestrict access to the device to the internal or VPN network. Further, if possible, restrict access to the OZW Web Server to trusted IP addresses.\n\nAs a general security measure Siemens strongly recommends users protect network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices in order to run the devices in a protected IT environment.\nFor more information refer to SSA-986695.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability\n",
  "cves": [
    "CVE-2019-13941"
  ],
  "techniques": [],
  "advisory": "icsa-20-042-09",
  "title": "Siemens OZW Web Server | CISA",
  "source": "ics-advisories",
  "id": "946dba34fdf2fb6a5a650cc80ae89c742cfcf5de38d9023f87fb9b5b411730be"
}