{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Omron\nEquipment: Sysmac CJ/CS/CP Series\nVulnerability: Improper Control of Interaction Frequency\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain sensitive information in memory.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Omron CJ/CS/CP series, programmable logic controllers, are affected:\n\nSmart Security Manager: Versions 1.4 and prior to 1.31\nSmart Security Manager: Versions 1.5 and prior\nCJ2H-CPU ** (-EIP): version 1.4 and prior\nCJ2M-CPU ** : version 2.0 and prior\nCS1H/G-CPU ** H、CJ1G-CPU ** P: version 4.0 and prior\nCS1D-CPU ** H / -CPU ** P: version 1.3 and prior\nCS1D-CPU ** S: version 2.0 and prior\nCP1E-E / -N: version 1.2 and prior\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER CONTROL OF INTERACTION FREQUENCY CWE-799\nOmron CJ/CS/CP series programmable logic controllers use the FINS protocol, which is vulnerable to brute-force attacks. The controllers do not enforce any rate limit on password guesses to password-protected memory regions.\nCVE-2022-45790 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nReid Wightman of Dragos reported this vulnerability to CISA.\n4. MITIGATIONS\nOmron recommends users update their products as soon as possible. Updated versions can be obtained by contacting Omron's Customer Care Team.\n\nCJ2H-CPU**(-EIP): Update to version 1.5\nCJ2M-CPU**: Update to version 2.1\nCS1H/G-CPU** H、CJ1G-CPU** P: Update to version 4.1\nCS1D-CPU** H / -CPU** P: Update to version 1.4\nCS1D-CPU** S: Update to version 2.1\nCP1E-E / -N: Update to version 1.3\n\nPlease see Omron's Advisory for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nSeptember 19, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2022-45790"
  ],
  "techniques": [],
  "advisory": "icsa-23-262-05",
  "title": "Omron CJ/CS/CP Series | CISA",
  "source": "ics-advisories",
  "id": "c59844fc0f479c4868c36cf68259127070fc6ee05f589ca6a864d3d0f33e5ce7"
}