{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: CODESYS GmbH\nEquipment: CODESYS Gateway Server\nVulnerability: Heap Based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-15-258-02 3S CODESYS Gateway Server Buffer overflow Vulnerability that was published September 15, 2015, on the ICS webpage at cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a buffer overflow condition that may allow remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of CODESYS Gateway Server, a connection management server, are affected:\n--------- Begin Update A Part 1 of 2 ---------\n\nCODESYS Gateway Server: Version 2.3.9.33 and prior\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe affected product is vulnerable to multiple heap-based buffer overflow vulnerabilities that may allow remote code execution.\nCVE-2015-6460 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nJosep Pi Rodriguez, working with Trend Micro’s Zero Day Initiative, reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nCODESYS has released Version 2.3.9.34 of the CODESYS Gateway Server to address this vulnerability. This CODESYS Gateway Server version is also part of the CODESYS Development System setup Version 2.3.9.48 and is available for download (login required).\n--------- End Update A Part 2 of 2 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2015-6460"
  ],
  "techniques": [],
  "advisory": "icsa-15-258-02",
  "title": "CODESYS Gateway Server (Update A) | CISA",
  "source": "ics-advisories",
  "id": "56ec2cdbc0b934250beca816f5f08bdb55c0040586fda02fa4b80e3055fb0918"
}