{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity \nVendor: Moxa \nEquipment: ARM-Based Computers \nVulnerability: Privilege Escalation \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could provide an attacker with root privileges and total control of the system. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMoxa reports this vulnerability affects the following products and versions:  \n\nUC-8100A-ME-T System Image: Versions v1.0 to v1.6 \nUC-2100 System Image: Versions v1.0 to v1.12 \nUC-2100-W System Image: Versions v1.0 to v 1.12 \nUC-3100 System Image: Versions v1.0 to v1.6 \nUC-5100 System Image: Versions v1.0 to v1.4 \nUC-8100 System Image: Versions v3.0 to v3.5 \nUC-8100-ME-T System Image: Versions v3.0 and v3.1 \nUC-8200 System Image: v1.0 to v1.5 \nAIG-300 System Image: v1.0 to v1.4 \nUC-8410A with Debian 9 System Image: Versions v4.0.2 and v4.1.2 \nUC-8580 with Debian 9 System Image: Versions v2.0 and v2.1 \nUC-8540 with Debian 9 System Image: Versions v2.0 and v2.1 \nDA-662C-16-LX (GLB) System Image: Versions v1.0.2 to v1.1.2 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250\nThe affected devices and versions of Moxa's ARM-based computers have an execution with unnecessary privileges vulnerability, which could allow an attacker with user-level privileges to gain root privileges. \nCVE-2022-3088 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Transportation Systems \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Taiwan \n\n3.4 RESEARCHER\nEn Garde ICSRange research team reported this vulnerability to CISA. \n4. MITIGATIONS\nMoxa developed updates to address this vulnerability. Users should follow the instructions in Moxa's security advisory to update their system image.  \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-3088"
  ],
  "techniques": [],
  "advisory": "icsa-22-326-05",
  "title": "Moxa Multiple ARM-Based Computers | CISA",
  "source": "ics-advisories",
  "id": "93a5972f66232adb4c1f53620e5b1cfcefa08dbeaa513da4e281b5cd42f0be2a"
}