{
  "markdown": " ING. Punzenberger COPA\\-DATA GMBH DoS Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryING. Punzenberger COPA\\-DATA GMBH DoS Vulnerabilities===================================================== Last Revised June 02, 2014 Alert Code ICSA\\-12\\-013\\-01Overview-------- ICS\\-CERT originally released Advisory ICSA\\-12\\-013\\-01P on the US\\-CERT secure portal on January 13, 2012\\. This web page release was delayed to allow users time to download and install the update. Researcher Kuang\\-Chun Hung of the Security Research and Service Institute\\-\\-Information and Communication Security Technology Center (ICST) has identified multiple denial\\-of\\-service (DoS) vulnerabilities in the Ing. Punzenberger COPA\\-DATA GmbH zenon human\\-machine interface (HMI) system. ICS\\-CERT has coordinated with Ing. Punzenberger COPA\\-DATA GmbH, which has produced an updated software release that resolves these vulnerabilities. ICST has tested the new release and verified that it fully resolves these vulnerabilities.Affected Products----------------- The following product and version is affected:* Ing. Punzenberger COPA\\-DATA GmbH zenon 6\\.51 SP0\\.Impact------ Successful exploitation of these vulnerabilities may allow an attacker to execute a DoS attack and potentially execute arbitrary code. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.Background---------- According to Ing. Punzenberger COPA\\-DATA GmbH, zenon is an HMI that offers a graphical visualization system that runs entirely under Windows. The zenon product is used by companies worldwide for equipment automation in the automotive, energy and infrastructure, food and beverage, and pharmaceutical industries. The Ing. Punzenberger COPA\\-DATA GmbH distribution network includes offices in Austria (for Central and Eastern Europe), France, Germany, Italy, Korea, Portugal and Spain, Sweden, the UK, and the USA.Vulnerability Characterization------------------------------### Vulnerability Overview#### Denial of Service Vulnerability 1 A vulnerability exists that may allow an attacker to cause a DoS and possibly execute arbitrary code if the attacker sends a specially crafted packet to zenAdminSrv.exe on Port 50777/TCP. The vendor has assigned Reference Number 25240 to the available update.[CVE\\-2011\\-4533](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4533)  has been assigned to this vulnerability.#### Denial of Service Vulnerability 2 A second vulnerability exists that could allow an attacker to crash the ZenSysSrv.exe service resulting in a DoS and possibly allow arbitrary code execution. This vulnerability can be exploited by connecting and disconnecting multiple times to the ZenSysSrv.exe service on Port 1101/TCP. The vendor has assigned Reference Number 25212 to the available update.[CVE\\-2011\\-4534](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4534)  has been assigned to this vulnerability.### Vulnerability Details#### Exploitability These vulnerabilities are remotely exploitable.#### Existence of Exploit No known exploits specifically target these vulnerabilities.#### Difficulty An attacker with a low skill level can create the DoS; executing arbitrary code would require a more skilled attacker.Mitigation---------- Ing. Punzenberger COPA\\-DATA GmbH recommends that customers take the following actions in order to prevent successful exploitation of these vulnerabilities:* Properly configure network access to Ports 1101/TCP and 50777/TCP.* Disable the ZenSysSrv.exe service. This service should only be enabled when necessary and disabled immediately after being used.* Install the Ing. Punzenberger COPA\\-DATA GmbH update. Customers can obtain the update for their systems from their local support source by referring to either Reference Number 25212 or 25240\\. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* COPA\\-DATA-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-013-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-4534",
    "CVE-2011-4533"
  ],
  "techniques": [],
  "advisory": "icsa-12-013-01",
  "title": "ING. Punzenberger COPA-DATA GMBH DoS Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "0a4efd0906a7a440414a7d5da37026223eb0ec2256429981ee8eb7d37180563a"
}