{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: ENTRON 3VA COM100/800, SENTRON 3VA DSP800, SENTRON PAC2200, SENTRON PAC3200T, SENTRON PAC3200, SENTRON PAC4200, SIRIUS 3RW5\nVulnerability: Integer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-343-05 Siemens Embedded TCP/IP Stack Vulnerabilities–AMNESIA:33 (Update B) that was published March 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products are affected:\n\nSENTRON 3VA COM100/800: all versions prior to v4.2\nSENTRON 3VA DSP800: all versions prior to v2.0\nSENTRON PAC2200 (without MID Approval): all versions prior to v3.0.5\nSENTRON PAC3200: all versions prior to v2.4.5 \nSENTRON PAC3200T: all versions prior to v3.0.5\nSENTRON PAC4200: all versions prior to v2.0.1\nSIRIUS 3RW5 communication module Modbus TCP: all versions prior to v1.1.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INTEGER OVERFLOW CWE-190\nAn attacker located in the same network could trigger a denial-of-service condition on the device by sending a specially crafted IP packet.\nCVE-2020-13988 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nDaniel dos Santos, Stanislav Dashevskyi, Jos Wetzels, and Amine Amri of Forescout Research Labs reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends users upgrade affected products if upgrade are available for those products: \n\n\n\nSENTRON 3VA COM100/800: Update to v4.2 or later version\nSENTRON 3VA DSP800: Update to v2.0 or later version\nSENTRON PAC2200 (without MID Approval): Update to v3.0.5 or later version\n\n--------- Begin Update C Part 1 of 1 ---------\n\nSENTRON PAC3200T: Update to v3.0.5 or later version\n\n--------- End Update C Part 1 of 1 ---------\n\nSENTRON PAC3200: Update to v2.4.5 or later version\nSENTRON PAC4200: Update to v2.0.1 or later version\nSIRIUS 3RW5 communication module Modbus TCP: Update to v1.1.1 or later version\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-541017\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-13988"
  ],
  "techniques": [],
  "advisory": "icsa-20-343-05",
  "title": "Siemens Embedded TCP/IP Stack Vulnerabilities–AMNESIA:33 (Update C) | CISA",
  "source": "ics-advisories",
  "id": "7da415037d1ac60b1a20f3fa87caf70da52d516cb7dd7e4eeabea78dbb8abdca"
}