{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n​CVSS v3 7.8\n​ATTENTION: Exploitable remotely/low attack complexity\n​Vendor: Delta Electronics\n​Equipment: InfraSuite Device Master\n​Vulnerabilities: Improper Access Control, Deserialization of Untrusted Data\n\n2. RISK EVALUATION\n​Successful exploitation of these vulnerabilities could allow an attacker to escalate privileges or remotely execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n​The following Delta Electronics products are affected: \n\n​InfraSuite Device Master: Versions prior to 1.0.7\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 ​IMPROPER ACCESS CONTROL CWE-284\n​An attacker could bypass the latest Delta Electronics InfraSuite Device Master (versions prior to 1.0.7) patch, which could allow an attacker to retrieve file contents.\n​CVE-2023-34316 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.2.2 ​IMPROPER ACCESS CONTROL CWE-284\n​Delta Electronics InfraSuite Device Master versions prior to 1.0.7 contain improper access controls that could allow an attacker to alter privilege management configurations, resulting in privilege escalation.\n​CVE-2023-30765 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.3 DESERIALIZATION OF UNTRUSTED DATA CWE-502\n​Delta Electronics InfraSuite Device Master versions prior to 1.0.7 contains classes that cannot be deserialized, which could allow an attack to remotely execute arbitrary code. \n​CVE-2023-34347 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\n\n​CRITICAL INFRASTRUCTURE SECTORS: Energy\n\n\n​COUNTRIES/AREAS DEPLOYED: Worldwide\n\n\n​COMPANY HEADQUARTERS LOCATION: Taiwan\n\n\n3.4 RESEARCHER\n​Piotr Bazydlo (@chudypb) of Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\n​Delta Electronics has provided a fix to these vulnerabilities. Users are encouraged to update to the latest version.\n\n​Delta Electronics InfraSuite Device Master: Update to v1.0.7.\n\n​CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\n​Minimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\n​Locate control system networks and remote devices behind firewalls and isolate them from business networks.\n​When remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\n​CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n​CISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n​Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n​Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n​No known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2023-34347",
    "CVE-2023-34316",
    "CVE-2023-30765"
  ],
  "techniques": [],
  "advisory": "icsa-23-180-01",
  "title": "Delta Electronics InfraSuite Device Master | CISA",
  "source": "ics-advisories",
  "id": "425cf8b61ee6af9025f94accb9ee95da2f8fcade11ece14f1c656c03330fa543"
}