{
  "markdown": "\n \nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Integration Objects\nEquipment: OPC UA Server Toolkit\nVulnerability: Improper Output Neutralization for Logs\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to add content to the log file.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of OPC UA Server Toolkit, OPC library designed to allow creation of OPC DA, DX and HDA servers software, are affected:\n\nOPC UA Server Toolkit: versions 1.0.0 and prior\n\n3.2 Vulnerability Overview\n3.2.1 Improper Output Neutralization for Logs CWE-117\nOPCUAServerToolkit will write a log message once an OPC UA client has successfully connected containing the client's self-defined description field.\nCVE-2023-7234 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSam Hanson of Dragos reported this vulnerability to CISA.\n4. MITIGATIONS\nIntegration Objects has released a security fix (version 1.0.0 fix 20240123) of the OPC UA Server Toolkit aimed at mitigating potential risks of the vulnerability. The security fix is available to all users of the OPC UA Server Toolkit demo version. The full version of the security fix is available for users who acquired the full version of the toolkit and have valid support contracts. These customers are invited to contact the Integration Objects sales team to check their support contract status and access to the full version of the security fix.\nIntegration Objects published a news update on their website\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJanuary 16, 2024: Initial Publication\nMarch 5, 2024: Update with mitigation information\n\n",
  "cves": [
    "CVE-2023-7234"
  ],
  "techniques": [],
  "advisory": "icsa-24-016-02",
  "title": "Integration Objects OPC UA Server Toolkit (Update A) | CISA",
  "source": "ics-advisories",
  "id": "f63e16fdee131f14d01530333fa07c761600dac747a672c55378aeb7592cef31"
}