{
  "markdown": " GE Intelligent Platforms Proficy Real\\-Time Information Portal Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryGE Intelligent Platforms Proficy Real\\-Time Information Portal Vulnerabilities============================================================================== Last Revised August 23, 2018 Alert Code ICSA\\-12\\-234\\-01OVERVIEW-------- This advisory is a follow\\-up to the previously updated portal advisory titled ICSA\\-12\\-234\\-01AP—GE Intelligent Platforms Proficy Real\\-Time Information Portal Multiple Vulnerabilities, which was published September 17, 2012, in the US\\-CERT secure Portal library. This advisory provides mitigation details for multiple vulnerabilities that affect the GE Intelligent Platforms Proficy Real\\-Time Information Portal. Researcher Kuang\\-Chun Hung of Information and Communication Security Technology Center (ICST) identified multiple vulnerabilities in GE’s Intelligent Platforms Proficy Real\\-Time Information Portal. Three improper input validation vulnerabilities could lead to a possible denial of service (DoS). GE has released patches that fix the vulnerabilities in Versions 3\\.5 SP1, 3\\.5, and 3\\.0 SP1\\. Successful exploitation of these vulnerabilities could affect multiple sectors worldwide. These vulnerabilities can be exploited remotely.AFFECTED PRODUCTS----------------- The following GE product versions are affected:* Intelligent Platforms Proficy Real\\-Time Information Portal v2\\.6,* Intelligent Platforms Proficy Real\\-Time Information Portal v3\\.0,* Intelligent Platforms Proficy Real\\-Time Information Portal v3\\.0 SP1,* Intelligent Platforms Proficy Real\\-Time Information Portal v3\\.5, and* Intelligent Platforms Proficy Real\\-Time Information Portal v3\\.5 SP1\\. Note: These vulnerabilities do not affect versions of Proficy Real\\-Time Information Portal v2\\.5 and earlier.IMPACT------ By successfully exploiting these vulnerabilities, attackers could initiate a DoS or possible remote code execution in the Remote Interface Service. These could affect the availability of the system. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.BACKGROUND---------- According to GE, Proficy Real\\-Time Information Portal is a Web\\-based data visualization and reporting tool that is deployed across multiple industries worldwide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW Three improper input validation vulnerabilities have been identified in the Remote Interface Service that operates on Port 5159/TCP.### VULNERABILITY DETAILS### Improper Input ValidationCWE, http://cwe.mitre.org/data/definitions/20\\.html, CWE\\-20: Improper Input Validation, Web site last accessed October 15, 2012\\. These vulnerabilities can be exploited by sending additional data into the buffer, which is not properly checked as input data by the service. As a result, an attacker can cause a crash of the system leading to a DoS condition. CVE\\-2012\\-3010,NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2012\\-3010 , NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. CVE\\-2012\\-3021,NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2012\\-3021, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. and CVE\\-2012\\-3026NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2012\\-3026 , NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. have been assigned to these vulnerabilities. A CVSS v2 base score of 7\\.1 has also been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:N/I:N/A:C).CVSS, http://nvd.nist.gov/cvss.cfm?name\\=\\&vector\\=AV:N/AC:M/Au:N/C:N/I:N/A:C\\&version\\=2#### EXPLOITABILITY These vulnerabilities can be exploited remotely.#### EXISTENCE OF EXPLOIT No known exploits specifically target these vulnerabilities.#### DIFFICULTY An attacker with a high skill level could exploit these vulnerabilities.MITIGATION---------- GE has released a security advisory and [patches](http://support.ge-ip.com/support/index?page=kbchannel&id=S:KB15050)  that fix the vulnerabilities in Versions 3\\.5 SP1, 3\\.5, and 3\\.0 SP1\\. The currently available patches can be found at GE’s Intelligent Platforms Software Download Web Sites listed below:* [Proficy Real\\-Time Information Portal 3\\.5 SP1 SIM 1](http://support.ge-ip.com/support/index?page=dwchannel&id=S:DN3884)* [Proficy Real\\-Time Information Portal 3\\.5 SIM 17](http://support.ge-ip.com/support/index?page=dwchannel&id=S:DN3873)* [Proficy Real\\-Time Information Portal 3\\.0 SP1 SIM 44](http://support.ge-ip.com/support/index?page=dwchannel&id=S:DN3875) Note: Proficy SIMs are cumulative. All future SIMs will include these updates. Proficy Real\\-Time Information Portal customers using Versions 3\\.0 and 2\\.6 are encouraged to upgrade to one of the versions described above and apply the appropriate product update. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Install control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the US\\-CERT Web page. Several recommended practices are available for reading and download, including Improving [Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS\\-CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01A—Cyber Intrusion Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01A)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks.1. Do not click Web links or open unsolicited attachments in email messages.2. Refer to *[Recognizing and Avoiding Email Scams](/reading_room/emailscams_0905.pdf)* for more information on avoiding email scams.3. Refer to [*Avoiding Social Engineering and Phishing Attacks*](/cas/tips/ST04-014.html) for more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* GE-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-234-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2012-3010",
    "CVE-2012-3026",
    "CVE-2012-3021"
  ],
  "techniques": [],
  "advisory": "icsa-12-234-01",
  "title": "GE Intelligent Platforms Proficy Real-Time Information Portal Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "6a6e8368a62137315b634a0c36252a9573ca6fdc06994a121ecf49ce92a5feeb"
}