{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.3\nATTENTION: Low attack complexity\nVendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls Inc.\nEquipment: C-CURE 9000\nVulnerability: Observable Response Discrepancy\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized user to enumerate user accounts.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls Inc. reports this vulnerability affects the following Sensormatic Electronics C-CURE 9000 security management systems: \n\nC-CURE 9000 version 2.90 and prior  \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OBSERVABLE RESPONSE DISCREPANCY CWE-204\nSensormatic Electronics C•CURE 9000, version 2.90 and prior, provides responses to incoming requests that could reveal internal state information to an unauthorized user.\nCVE-2021-36201 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nKim Syversen and Mathias Kjølleberg Førland reported this vulnerability to Johnson Controls, Inc.\n4. MITIGATIONS\nJohnson Controls recommends that users update or upgrade to one of the two versions below:\n\nUpdate C-CURE 9000 2.90 with patch 2.90 SP5\nUpgrade C-CURE 9000 to version 3.0\n\nFor more detailed mitigation instructions, see Johnson Controls Product Security Advisory JCI-PSA-2022-12 v1\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nExercise principles of least privilege.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. This vulnerability has a low attack complexity.\n",
  "cves": [
    "CVE-2021-36201"
  ],
  "techniques": [],
  "advisory": "icsa-22-284-03",
  "title": "Sensormatic Electronics C-CURE 9000 | CISA",
  "source": "ics-advisories",
  "id": "8aaae6d05918f86783578fbedb8fbd88ba7ad2f9cb44014342f01e63dd4bef87"
}