{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Apache HTTP Server\nVulnerabilities: NULL Pointer Dereference, Out-of-bounds Write, Server-side Request Forgery (SSRF)\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-22-167-06 Siemens Apache HTTP Server that was published June 16, 2022, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to access or modify resources, crash the device, or achieve code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nRUGGEDCOM NMS: All versions when using the device firmware upgrade mechanism\n\n--------- Begin Update A part 1 of 3 ---------\n\nSINEC NMS: All versions prior to v1.0.3\n\n--------- End Update A part 1 of 3 ---------\n\nSINEMA Remote Connect Server: All versions prior to v3.1\nSINEMA Server v14: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    NULL POINTER DEREFERENCE CWE-476\nMalformed requests may cause the server to dereference a NULL pointer. This issue affects Apache HTTP Server v2.4.48 and earlier.\nCVE-2021-34798 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    OUT-OF-BOUNDS WRITE CWE-787\nap_escape_quotes() may write beyond the end of a buffer when given malicious input. No included modules pass untrusted data to these functions, but third-party and external modules may. This issue affects Apache HTTP Server v2.4.48 and earlier.\nCVE-2021-39275 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    SERVER-SIDE REQUEST FORGERY (SSRF) CWE-918\nA crafted request uri-path can cause mod_proxy to forward the request to an origin server chosen by the remote user. This issue affects Apache HTTP Server v2.4.48 and earlier.\nCVE-2021-40438 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: German\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends updating the following to the latest version:\n\nSINEMA Remote Connect Server: Update to v3.1 or later\n\n--------- Begin Update A part 2 of 3 ---------\n\nSINEC NMS: Update to v1.0.3 or later\n\n--------- End Update A part 2 of 3 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict access to the affected systems, especially to Port 443/TCP, to trusted IP addresses only\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\n--------- Begin Update A part 3 of 3 ---------\nFor more information see Siemens Security Advisory SSA-685781 in HTML or CSA\n--------- End Update A part 3 of 3 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-34798",
    "CVE-2021-40438",
    "CVE-2021-39275"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-06",
  "title": "Siemens Apache HTTP Server (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c50b4c4a950fa3b5c8285e07027b6bb91762feca67446ac9c78fb3f6c7695270"
}