{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 4.0\n\nVendor: Siemens\nEquipment: SIMATIC WinCC OA iOS App\nVulnerability: File and Directory Information Exposure.\n\n2  UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-109-01 Siemens SIMATIC WinCC OA Operator iOS App that was published April 19, 2018, on the NCCIC/ICS-CERT.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker with physical access to read sensitive data located in the app’s directory.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 2 --------\nSiemens reports this vulnerability affects the following product:\n\nSIMATIC WinCC OA Operator iOS App: All versions prior to v1.4.\n\n--------- End Update A Part 1 of 2 ----------\n4.2.1  FILE AND DIRECTORY INFORMATION EXPOSURE CWE-538\nAn attacker with physical access to the mobile device could read unencrypted sensitive data from the app’s directory.\nCVE-2018-4847 has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n\n4.4 RESEARCHER\nAlexander Bolshev of IOActive and Ivan Yushkevich of Embedi reported this vulnerability to Siemens.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 --------\nSiemens has recommended that users update to v1.4, which can be located here:\nhttps://itunes.apple.com/app/simatic-wincc-oa-operator/id681238489\n--------- End Update A Part 2 of 2 ----------\nSiemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk:\n\nToggle off the button to save password while logging in, and logout after every work session.\nFollow the SIMATIC WinCC OA Security Guideline (available at https://portal.etm.at/index.php? option=com_phocadownload&view=category&id=52:security&Itemid=81) for maintaining a secured SIMATIC WinCC OA environment.\nSiemens does not recommend to use the app in high security areas.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security (Download: https://www.siemens.com/cert/operational-guidelines-industrial-security), and following the recommendations in the product manuals. Additional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and associated mitigation practices, please see Siemens security advisory SSA-597741 on their website:\nhttps://www.siemens.com/cert/advisories  \nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-4847"
  ],
  "techniques": [],
  "advisory": "icsa-18-109-01",
  "title": "Siemens SIMATIC WinCC OA Operator IOS App (Update A) | CISA",
  "source": "ics-advisories",
  "id": "30a4d429864e79d9204cc7a8ca0da2fb24b4489d42869a855292c636e727884f"
}