{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Exploitable remotely/high skill level is needed to exploit.\nVendor: Hirschmann Automation and Control GmbH, a division of Belden Inc.\nEquipment: Classic Platform Switches\nVulnerabilities: Session Fixation, Information Exposure Through Query Strings in GET Request, Cleartext Transmission of Sensitive Information, Inadequate Encryption Strength, Improper Restriction of Excessive Authentication Attempts\nAFFECTED PRODUCTS\nHirschmann reports that the vulnerabilities affect the following Classic Platform Switches products:\n\nRS all versions,\nRSR all versions,\nRSB all versions,\nMACH100 all versions,\nMACH1000 all versions,\nMACH4000 all versions,\nMS all versions, and\nOCTOPUS all versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow the attacker to hijack web sessions, impersonate a legitimate user, receive sensitive information, and gain access to the device.\nMITIGATION\nHirschmann strongly recommends users restrict access to remote management access and the following mitigation strategies should be applied:\n\nDisable HTTP for remote management access.\nUse the secure HTTPS or SSH protocols for remote management access.\nUse of complex user passwords.\nUse the “Restricted Management Access” feature to restrict access to known IP addresses.\nDisable remote management access when not in use.\n\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nIn addition, NCCIC recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nSESSION FIXATION CWE-384\n\nA session fixation vulnerability in the web interface has been identified, which may allow an attacker to hijack web sessions.\nCVE-2018-5465 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nINFORMATION EXPOSURE THROUGH QUERY STRINGS IN GET REQUEST CWE-598\n\nAn information exposure through query strings vulnerability in the web interface has been identified, which may allow an attacker to impersonate a legitimate user.\nCVE-2018-5467 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:N).\n\nCLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\n\nA cleartext transmission of sensitive information vulnerability in the web interface has been identified, which may allow an attacker to obtain sensitive information through a successful man-in-the-middle attack.\nCVE-2018-5471 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N).\n\nINADEQUATE ENCRYPTION STRENGTH CWE-326\n\nAn inadequate encryption strength vulnerability in the web interface has been identified, which may allow an attacker to obtain sensitive information through a successful man-in-the-middle attack.\nCVE-2018-5461 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:L/A:N).\n\nIMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\n\nAn improper restriction of excessive authentication vulnerability in the web interface has been identified, which may allow an attacker to brute force authentication.\nCVE-2018-5469 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nIlya Karpov, Evgeniy Druzhinin, Mikhail Tsvetkov, and Damir Zainullin of Positive Technologies reported these vulnerabilities to Belden.\nBACKGROUND\nCritical Infrastructure Sectors: Multiple sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: St. Louis, Missouri\n",
  "cves": [
    "CVE-2018-5469",
    "CVE-2018-5467",
    "CVE-2018-5471",
    "CVE-2018-5461",
    "CVE-2018-5465"
  ],
  "techniques": [],
  "advisory": "icsa-18-065-01",
  "title": "Hirschmann Automation and Control GmbH Classic Platform Switches | CISA",
  "source": "ics-advisories",
  "id": "1f826bd1afe866ed1bc8bad72885be87642e3377f1be01c8ceeefd9df4d99dc6"
}