{
  "markdown": "\nCVSS v3 7.1\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: OSIsoft\nEquipment: PI Web API 2017\nVulnerability: Cross-Site Request Forgery\nAFFECTED PRODUCTS\nOSIsoft reports that the vulnerability affects the following PI Web API products:\n\nPI Web API versions prior to 2017 (1.9.0).\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to access the PI System with the privileges of a legitimate client user. PI System data alteration is possible if the client user has sufficient access to write data.\nMITIGATION\nOSIsoft recommends that users upgrade to the PI Web API version 2017 (1.9.0) and enable CSRF defense. To enable this option, set the configuration attribute ‘EnableCSRFDefense’ to ‘True’ in the PI Web API System Configuration element. This element is located at the path \"..\\OSIsoft\\PI Web API\\PIWebAPIMachineName\\System Configuration\" in PI AF Server Configuration database.\nA new installation of PI Web API 2017 (1.9.0) enables CSRF protection by default.\nPlease see alert AL00316 on the OSIsoft web page for more information about this issue:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00316\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nCROSS-SITE REQUEST FORGERY CWE-352\n\nThe vulnerability allows cross-site request forgery (CSRF) attacks to occur when an otherwise-unauthorized cross-site request is sent from a browser the server has previously authenticated.\nCVE-2017-7926 has been assigned to this vulnerability. OSIsoft calculated a CVSS v3 base score of 7.1; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:L).\nRESEARCHER\nThese issues were found by OSIsoft and reported once they had prepared an upgrade to fix them.\nBACKGROUND\nCritical Infrastructure Sectors: Multiple Sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2017-7926"
  ],
  "techniques": [],
  "advisory": "icsa-17-164-03",
  "title": "OSIsoft PI Web API 2017 | CISA",
  "source": "ics-advisories",
  "id": "3c7dffdde964a25578cf8ea99fa72f510b7d070cb7c5bdc96dfb36b9f7a56a82"
}