{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: WAGO\nEquipment: Series 750-88x and 750-87x\nVulnerability: Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nThis vulnerability allows a remote attacker to change the settings or alter the programming of the device. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Series 750-88x and 750-87x, programmable logic controllers, are affected:\n\nSeries 750-88x\n\n750-330 firmware versions prior to FW14\n750-352 firmware versions prior to FW14 \n750-829 firmware versions prior to FW14\n750-831 firmware versions prior to FW14\n750-852 firmware versions prior to FW14 \n750-880 firmware versions prior to FW14 \n750-881 firmware versions prior to FW14 \n750-882 firmware versions prior to FW14 \n750-884 firmware versions prior to FW14 \n750-885 firmware versions prior to FW14 \n750-889 firmware versions prior to FW14 \n\n\nSeries 750-87x\n\n750-830 firmware versions prior to FW06 \n750-849 firmware versions prior to FW08 \n750-871 firmware versions prior to FW11 \n750-872 firmware versions prior to FW07 \n750-873 firmware versions prior to FW07\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nBy exploiting the undocumented service access, it is possible to change the settings of a device and access web-based management with administrator privileges. An attacker can exploit this vulnerability to lock other users out from the device or open closed network ports. It is also possible to use this service access as an FTP user and exchange or delete the application.\nCVE-2019-10712 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States, Germany, Switzerland, Poland, China, India\n\n3.4 RESEARCHER\nReported by Jörn Schneeweisz/Recurity Labs to CERT-Bund coordinated by CERT@VDE with NCCIC.\n4. MITIGATIONS\nWAGO released a security advisory available at:https://www.wago.com/de/download/public/Sicherheitshinweis-SA-SYS-2019-001/SA-SYS-2019-001.pdf\nWAGO recommends updating to the newest firmware as listed above and taking the following defensive measures:\n\nRestrict network access to the web server.\nRestrict network access to the device.\nDo not directly connect the device to the Internet.\n\nCERT@VDE has published an advisory regarding this vulnerability at the following location:\nhttps://cert.vde.com/en-us/advisories/vde-2019-008\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10712"
  ],
  "techniques": [],
  "advisory": "icsa-19-106-02",
  "title": "WAGO Series 750-88x and 750-87x | CISA",
  "source": "ics-advisories",
  "id": "fbce1e66b4862d445f6ff2223d453a07d55b3c663ad1b7858f7cce2941a5d952"
}