{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Moxa\nEquipment: MGate MB3180/MB3280/MB3480 Series Protocol Gateways\nVulnerability: Cleartext Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote attackers to obtain sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following firmware versions of MGate MB3000 Series, a serial-to-Ethernet Modbus gateway, are affected:\n\nMGate MB3180 Series: Firmware Version 2.2 or lower\nMGate MB3280 Series: Firmware Version 4.1 or lower\nMGate MB3480 Series: Firmware Version 3.2 or lower\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe affected products contain vulnerable firmware, which could allow an attacker to sniff the traffic and decrypt login credential details. This could give an attacker admin rights through the HTTP web server.\nCVE-2021-4161 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nParul Sindhwad, Anurag M. Chevendra, and Dr. Faruk Kazi of CoE-CNDS Lab; VJTI; and Mumbai-INDIA reported this vulnerability to Moxa.\n4. MITIGATIONS\nMoxa has developed the following mitigations to address this vulnerability.\n\nEnable ‘HTTPS’ and disable the HTTP console function under ‘Console Settings’\n\nMoxa also recommends users refer to Tech Note: Moxa Security Hardening Guide for MGate MB3000 Series\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-4161"
  ],
  "techniques": [],
  "advisory": "icsa-21-357-01",
  "title": "Moxa MGate Protocol Gateways | CISA",
  "source": "ics-advisories",
  "id": "21e6877170f3174aad85e9016349d4a1cd1a0420fd90d3aa1c728336fa8e9fb8"
}