{
  "markdown": "\nCVSS v3 7.3\nATTENTION: Low skill level to exploit.\nVendor: Schneider Electric\nEquipment: Wonderware InduSoft Web Studio\nVulnerability: Incorrect Default Permissions\nAFFECTED PRODUCTS\nThe following versions of Schneider Electric’s Wondeware InduSoft Web Studio are affected:\n\nWonderware InduSoft Web Studio v8.0 Patch 3 and prior versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an authenticated user to escalate his or her privileges.\nMITIGATION\nSchneider Electric released Wonderware InduSoft Web Studio v8.0 + Service Pack 1 to address this vulnerability. It can be found at the following location:\nhttp://www.indusoft.com/Products-Downloads\nFor more information, users of affected products can read Schneider Electric’s Security Notification at the following location:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-090-02/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable.\nVULNERABILITY OVERVIEW\n\niNCORRECT DEFAULT PERMISSIONS CWE-276\n\nUpon installation, Wonderware InduSoft Web Studio creates a new directory and two files, which are placed in the system’s path and can be manipulated by non-administrators. This could allow an authenticated user to escalate his or her privileges.\nCVE-2017-7968 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nKarn Ganeshen identified this vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Healthcare and Public Health, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n",
  "cves": [
    "CVE-2017-7968"
  ],
  "techniques": [],
  "advisory": "icsa-17-138-02",
  "title": "Schneider Electric Wonderware InduSoft Web Studio | CISA",
  "source": "ics-advisories",
  "id": "dbb0eaee444c09fa1d6f562cb55dcc1c65491edfcd00ec2868dc52eaeaa165e6"
}