{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Circontrol\nEquipment: CirCarLife\nVulnerabilities: Authentication Bypass Using an Alternate Path or Channel, Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to retrieve credentials stored in clear text to bypass authentication, and see and access critical information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CirCarLife, an electric vehicle charging station, are affected:\n\nCirCarLife all versions prior to 4.3.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nAuthentication to the device can be bypassed by entering the URL of a specific page.\nCVE-2018-17918 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nThe PAP credentials of the device are stored in clear text in a log file that is accessible without authentication.\nCVE-2018-17922 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Europe and Asia\nCOMPANY HEADQUARTERS LOCATION: Spain\n\n3.4 RESEARCHER\nAnkit Anubhav of NewSky Security, M. Can Kurnaz Senior Consultant at KPMG Netherlands, Alim Solmaz Security Consultant at Atos, Michael John Chief Information Security Officer at WePower Network, and Gyorgy Miru Security Researcher at Verint reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nCircontrol has released a new version of the software that is available at (login required):\nhttp://expertarea.circontrol.com/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-17922",
    "CVE-2018-17918"
  ],
  "techniques": [],
  "advisory": "icsa-18-305-03",
  "title": "Circontrol CirCarLife | CISA",
  "source": "ics-advisories",
  "id": "e66372fc1466ae9280854a3bda3c460457f8e3374269318c95c172f8207b38ba"
}