{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.2\n\nATTENTION: Exploitable remotely/Low skill level to exploit/Public exploits are available for these vulnerabilities\nVendor: Schweitzer Engineering Laboratories, Inc. (SEL)\nEquipment: Compass and AcSELerator Architect\nVulnerabilities: Incorrect Default Permissions, XXE, Resource Exhaustion\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow modification/replacement of files within the Compass installation directory, disclosure of information, or denial of service.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products from SEL are affected. Not all products are affected by all vulnerabilities.\n\nCompass Version 3.0.5.1 and prior, and\nAcSELerator Architect Version 2.2.24.0 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT DEFAULT PERMISSIONS CWE-276\nIncorrect default permissions allows all users full access to the SEL Compass directory, which may allow modification or overwriting of files within the Compass installation folder, resulting in escalation of privilege and/or malicious code execution. \nCVE-2018-10604 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H).\n3.2.2    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE ('XXE') CWE-611\nAn XXE vulnerability allows unsanitized input to be passed to the AcSELerator Architect XML parser, which may allow disclosure and retrieval of arbitrary data, arbitrary code execution (in certain situations on specific platforms), and denial of service attacks. \nCVE-2018-10600 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:N/A:L).\n3.2.3    UNCONTROLLED RESOURCE CONSUMPTION ('RESOURCE EXHAUSTION') CWE-400\nA resource exhaustion vulnerability can be exploited when the AcSELerator Architect FTP client connects to a malicious FTP server, which may cause denial of service via 100% CPU utilization. Restart of the application is required. \nCVE-2018-10608 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: USA\n\n3.4 RESEARCHER\nGjoko Krstic of Applied Risk reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSEL recommends affected users upgrade to latest release:\nSEL Compass v3.0.6.1 or later\nhttps://selinc.com/products/compass/#tab-downloads\nSEL AcSELerator v2.2.29.0 or later\nhttps://selinc.com/products/5032/#tab-downloads\nContact SEL Support for specific instructions and downloads:\nhttps://selinc.com/support/?categories.Customer%20Service\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-10604",
    "CVE-2018-10600",
    "CVE-2018-10608"
  ],
  "techniques": [],
  "advisory": "icsa-18-191-02",
  "title": "Schweitzer Engineering Laboratories, Inc. Compass and AcSELerator Architect | CISA",
  "source": "ics-advisories",
  "id": "01759c5b79662fb4b318ba498d12e6e1c94a17b311f9ed60f514ad9651bc9cd2"
}