{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Exacq Technologies, a subsidiary of Johnson Controls, Inc.\nEquipment: exacqVision Server 32-bit\nVulnerability: Integer Overflow or Wraparound\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated remote user to exploit an integer overflow in the exacqVision Server with a specially crafted script and cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Exacq Technologies’ exacqVision surveillance video software products are affected:\n\nexacqVision Server 32-bit: Versions 21.06.11.0 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INTEGER OVERFLOW OR WRAPAROUND CWE-190\nThe affected product is vulnerable to an integer overflow vulnerability, which may allow an attacker to cause a denial-of-service condition.\nCVE-2021-27665 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nTenable Research reported this vulnerability to Johnson Controls.\n4. MITIGATIONS\nJohnson Controls recommends the following:\n\nUpgrade exacqVision Server 32-bit to Version 21.09 or upgrade to exacqVision Server 64-bit.\nCurrent users can obtain the critical software update from the software download location.\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-18v1\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\n\nFurther ICS security notices and product security guidance are located at the Johnson Controls product security website.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27665"
  ],
  "techniques": [],
  "advisory": "icsa-21-280-03",
  "title": "Johnson Controls exacqVision | CISA",
  "source": "ics-advisories",
  "id": "527f751513a1346f2a7da262b92e815633a8bb077c0cbad81a4881c4913104cb"
}