{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/Low attack complexity \nVendor: Siemens\nEquipment: SINEC INS\nVulnerabilities: Improper Input Validation, Integer Overflow or Wraparound, Uncontrolled Resource Consumption, Command Injection, Inadequate Encryption Strength, Missing Encryption of Sensitive Data, Improper Restriction of Operations Within the Bounds of a Memory Buffer, Exposure of Private Personal Information to an Unauthorized Actor, Open Redirect, Improper Resource Shutdown or Release, Server-Side Request Forgery (SSRF)\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to cause a denial-of-service condition, disclose sensitive data, or violate the system integrity. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SINEC INS, a software tool for central network services, are affected:\n\nSiemens SINEC INS: All versions prior to V1.0 SP2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe UAParser.js package, versions prior to 0.7.23, are vulnerable to regular expression denial-of-service in multiple RegExes.\nCVE-2020-7793 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    INTEGER OVERFLOW OR WRAPAROUND CWE-190\nThe JSON-C application programming interface (API) documentation through version 0.14 has an integer overflow and out-of-bounds write via a large JSON file.\nCVE-2020-12762 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    SERVER-SIDE REQUEST FORGERY (SSRF) CWE-918\nThe Axios NPM package, version 0.21.0, contains an SSRF vulnerability that could allow an attacker to bypass a proxy by providing a URL that responds with a redirect to a restricted host or IP address.\nCVE-2020-28168 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.4    IMPROPER INPUT VALIDATION CWE-20\nLodash versions prior to 4.17.21 are vulnerable to regular expression denial-of-service via the toNumber, trim, and trimEnd functions.\nCVE-2020-28500 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.2.5    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAxios is vulnerable to inefficient regular expression complexity.\nCVE-2021-3749 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.6    IMPROPER INPUT VALIDATION CWE-20\nTLS 1.3 default curves are impacted by EC algorithms affected by a carry propagation bug in the MIPS32 and MIPS64 squaring procedure.\nCVE-2021-4160 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.7    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND (’COMMAND INJECTION’) CWE-77\nLodash versions prior to 4.17.21 are vulnerable to command injection via the template function.\nCVE-2021-23337 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.2.8    INADEQUATE ENCRYPTION STRENGTH CWE-326\nOpenSSL 1.0.2 servers from version 1.0.2s to 1.0.2x are affected by inverted logic regarding padding checks. Implementation of this padding check inverted the logic so that the connection attempt is accepted if the padding is present and rejected if it is absent. Resultantly, a server will accept a connection if a version rollback attack has occurred, and the server will erroneously reject a connection if a normal SSLv2 connection attempt is made\nCVE-2021-23839 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:N).\n3.2.9    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nUpon attempting to create a unique hash value based on the issuer and serial number data contained within an X509 certificate, the OpenSSL public API function “X509_issuer_and_serial_hash()”fails to correctly handle any errors that may occur while parsing the issuer field. This may result in a NULL pointer deref and a crash leading to a denial-of-service condition.\nCVE-2021-23841 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.10    IMPROPER INPUT VALIDATION CWE-20\nThe following versions of BIND, 9.11.0 -> 9.11.36 9.12.0 -> 9.16.26 9.17.0 -> 9.18.0, the following versions of  BIND Supported Preview Editions, 9.11.4-S1 -> 9.11.36-S1 9.16.8-S1 -> 9.16.26-S1, and versions of BIND 9 –prior to 9.1.0, including Supported Preview Editions, are potentially vulnerable. However, these versions have not been tested as they are EOL. An attacker could contaminate the cache with incorrect records, resulting in queries being made to the wrong servers and false information being.\nCVE-2021-25220 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:H/A:N).\n3.2.11    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe affected products contain the third-party component, ISC DHCP. This component introduces a vulnerability when used as a DHCP client or server when storing and reading DHCP lease information. An attacker could exploit this vulnerability to affect the availability of the DHCP client, availability of the server, or the confidentiality of the data. Other potential exploits include impacts to the integrity of the device through a buffer overflow or a remote-code execution.\nCVE-2021-25217 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:H).\n3.2.12    EXPOSURE OF PRIVATE PERSONAL INFORMATION TO AN UNAUTHORIZED ACTOR CWE-359\nThe follow-redirect could potentially expose private personal information to an attacker.\nCVE-2022-0155 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.2.13    URL REDIRECTION TO UNTRUSTED SITE (’OPEN REDIRECT’) CWE-601\nThe node-fetch could potentially expose sensitive information to an attacker.\nCVE-2022-0235 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n3.2.14    IMPROPER RESOURCE SHUTDOWN OR RELEASE CWE-404\nThe following versions of BIND, 9.16.11 -> 9.16.26, 9.17.0 -> 9.18.0, and the following versions of BIND Supported Preview Edition, 9.16.11-S1 -> 9.16.26-S1, are affected. Specifically crafted TCP streams can suspend BIND connections in a CLOSE_WAIT status for an indefinite time, even after the client has terminated the connection.\nCVE-2022-0396 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends updating to V1.0 SP2 or later.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found here.\nFor more information about these issues, see Siemens’ security advisory SSA-637483 HTML CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-3749",
    "CVE-2022-0155",
    "CVE-2022-0235",
    "CVE-2020-28500",
    "CVE-2021-23841",
    "CVE-2022-0396",
    "CVE-2021-23337",
    "CVE-2021-25217",
    "CVE-2020-12762",
    "CVE-2021-25220",
    "CVE-2020-28168",
    "CVE-2021-23839",
    "CVE-2021-4160",
    "CVE-2020-7793"
  ],
  "techniques": [],
  "advisory": "icsa-22-258-05",
  "title": "Siemens SINEC INS | CISA",
  "source": "ics-advisories",
  "id": "1c12851f2e82f7086fe2025b800d803adf04750b07c5827120ef8f24794c0ef0"
}