{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Phoenix Contact\nEquipment: ILC, AXC, RFC, PC WORX, FC\nVulnerability: Insufficient Verification of Data Authenticity\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to upload logic with arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the classic line industrial controllers, are affected:\n\nILC 1x0 All variants\nILC 1x1 All variants\nILC 1x1 GSM/GPRS: Article number 2700977\nILC 3xx All variants\nAXC 1050: Article number 2700988\nAXC 1050 XC: Article number 2701295\nAXC 3050: Article number 2700989\nRFC 480S PN 4TX: Article number 2404577\nRFC 470 PN 3TX: Article number 2916600\nRFC 470S PN 3TX: Article number 2916794\nRFC 460R PN 3TX: Article number 2700784\nRFC 460R PN 3TX-S: Article number 1096407\nRFC 430 ETH-IB: Article number 2730190\nRFC 450 ETH-IB: Article number 2730200\nPC WORX SRT: Article number 2701680\nPC WORX RT BASIC: Article number 2700291\nFC 350 PCI ETH: Article number 2730844\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nThe affected product lacks a function to check integrity and authenticity of uploaded logic, which could allow an attacker to execute malicious code on the device.\nCVE-2022-31800 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels of Forescout Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nPhoenix Contact has provided the following mitigations and workarounds:\n\nPhoenix Contact classic line industrial controllers are developed and designed for the use in closed industrial networks using a defense-in-depth approach focusing on network segmentation and communication robustness. In such an approach, users are protected against attacks, (especially from the outside) by a multi-level perimeter, including firewalls as well as dividing the plant into OT zones by using firewalls. This concept is supported by organizational measures in the production plant as part of a security management system. To accomplish security here measures are required at all levels. Ensure that the logic is always transferred or stored in protected environments. This is valid for data in transmission as well as data in rest. \nConnections between the engineering tools and the controller must always be in a locally protected environment or protected by VPN for remote access. \nProject data should not send as a file via email or other transfer mechanisms without additional integrity and authenticity checks. \nProject data should be saved in protected environments only. \nCustomers using Phoenix Contact classic line controllers are recommended to operate the devices in closed networks or protected with a suitable firewall as intended. \n\nMeasures to protect devices based on classic control technology\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-31800"
  ],
  "techniques": [],
  "advisory": "icsa-22-172-03",
  "title": "Phoenix Contact Classic Line Controllers | CISA",
  "source": "ics-advisories",
  "id": "6207596db68f85b019d9bfb21b5e4a3f79cc670275cc6b155b449357708de3c5"
}