{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity/public exploits are available\nVendor: Modbus Tools\nEquipment: Modbus Slave\nVulnerability: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the application when inputting a registration key.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Modbus Slave, a PLC programming simulation tool, are affected:\n\nModbus Slave Versions 7.4.2 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow in the registration field. This may cause the program to crash when a long character string is used.\nCVE-2022-1068 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Denmark\n\n3.4 RESEARCHER\nYehia Elghaly reported this vulnerability to CISA.\n4. MITIGATIONS\nModbus Tools has fixed the vulnerability and recommends users update to Version 7.4.3 or later.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThis vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-1068"
  ],
  "techniques": [],
  "advisory": "icsa-22-088-04",
  "title": "Modbus Tools Modbus Slave | CISA",
  "source": "ics-advisories",
  "id": "bc08fd03217ee54fcc52df4d8fef92e8c88dcf2edeb9c47cfc00241c143df387"
}