{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-R, Q, and L Series CPU Module; MELIPC Series CPU\nVulnerability: Improper Resource Locking\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition for Ethernet communication. A system restart would be required to restore functionality.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Mitsubishi Electric products are affected:\n\nMELSEC iQ-R Series R12CCPU-V CPU Firmware: Version 16 and prior\nMELSEC Q Series Q03UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q04UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q06UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q10UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q13UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q20UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q26UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q50UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q100UDECPU: Versions with the first 5 digits of serial number 24061 and prior\nMELSEC Q Series Q03UDVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q04UDVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q06UDVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q13UDVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q26UDVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q04UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q06UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q13UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q26UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior\nMELSEC Q Series Q12DCCPU-V: Versions with the first 5 digits of serial number 25061 and prior\nMELSEC Q Series Q24DHCCPU-V(G): Versions with the first 5 digits of serial number 25061 and prior\nMELSEC Q Series Q24DHCCPU-LS: Versions with the first 5 digits of serial number 25061 and prior\nMELSEC Q Series Q26DHCCPU-LS: Versions with the first 5 digits of serial number 25061 and prior\nMELSEC L Series L02CPU(-P): Versions with the first 5 digits of serial number 24051 and prior\nMELSEC L Series L06CPU(-P): Versions with the first 5 digits of serial number 24051 and prior\nMELSEC L Series L26CPU(-P): Versions with the first 5 digits of serial number 24051 and prior\nMELSEC L Series L26CPU-(P)BT: Versions with the first 5 digits of serial number 24051 and prior\nMELIPC Series MI5122-VW CPU Firmware: Version 05 and prior\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER RESOURCE LOCKING CWE-413\nThe affected product is vulnerable to a stack-based buffer overflow, which may allow an attacker to remotely execute arbitrary code.\nCVE-2022-24946 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi has fixed the vulnerability in the following products:\n\nMELSEC iQ-R Series R12CCPU-V CPU: Firmware Version 17 and later\nMELSEC Q Series Q03UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q04UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q06UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q10UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q13UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q20UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q26UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q50UDECPU: Versions with the first 5 digits of serial No. 24062 and later\nMELSEC Q Series Q100UDECPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q03UDVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q04UDVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q06UDVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q13UDVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q26UDVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q04UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q06UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q13UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q26UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later\nMELSEC Q Series Q12DCCPU-V: Versions with the first 5 digits of serial No. 25062 and later\nMELSEC Q Series Q24DHCCPU-V(G): Versions with the first 5 digits of serial No. 25062 and later\nMELSEC Q Series Q24DHCCPU-LS: Versions with the first 5 digits of serial No. 25062 and later\nMELSEC Q Series Q26DHCCPU-LS: Versions with the first 5 digits of serial No. 25062 and later\nMELSEC L Series L02CPU(-P): Versions with the first 5 digits of serial No. 24052 and later\nMELSEC L Series L06CPU(-P): Versions with the first 5 digits of serial No. 24052 and later\nMELSEC L Series L26CPU(-P): Versions with the first 5 digits of serial No. 24052 and later\nMELSEC L Series L26CPU-(P)BT: Versions with the first 5 digits of serial No. 24052 and later\nMELIPC Series MI5122-VW CPU: Firmware Version 06 and later\n\nMitsubishi Electric recommends customers apply the following countermeasures:\nMELSEC iQ-R Series:\n\nCustomers using the MELSEC iQ-R Series firmware versions 08 and prior will be unable to update to the fixed version. Take the mitigation measures that are common to all affected products found later in the advisory.\nCustomers using the MELSEC iQ-R Series firmware versions 09 and later are recommended to download and install the updated firmware. Please refer to the MELSEC iQ-R Module Configuration Manual \"Appendix 2 Firmware Update Function\" for instructions on how to update the firmware.\n\nMELSEC Q Series:\n\nCustomers using the MELSEC Q Series will be unable to update to the respective fixed versions. Mitsubishi Electric recommends customers consider migrating to the MELSEC iQ-R Series. Take the mitigation measures that are common to all affected products found later in the advisory.\n\nMELSEC L Series:\n\nCustomers using the MELSEC L Series will be unable to update to the respective fixed versions. Mitsubishi Electric recommends customers consider migrating to the MELSEC iQ-R Series. Take the mitigation measures that are common to all affected products found later in the advisory.\n\nMELIPC Series:\n\nCustomers using the MELIPC Series will be unable to update to the fixed version. Take the mitigation measures that are common to all affected products found later in the advisory.\n\nMitsubishi Electric recommends the following mitigation measures as being common to all affected products:\n\nUse a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\n\nFor additional information, such as how to check device or firmware versions, see the Mitsubishi Electric security advisory.\nPlease contact Mitsubishi Electric customer support for more information on how to update specific hardware.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n5. UPDATE HISTORY\n\nJune 14, 2022: Initial Publication\nAugust 16, 2022: Update A - Additional affected products added (R12CCPU-V, Q12DCCPU-V, Q24DHCCPU-V (G), Q24/26DHCCPU-LS, MI5122-VW); additional mitigations added (R12CCPU-V, Q03UDECPU, Q04/06/10/13/20/26/50/100UDEHCPU, MI5122-VW)\nJuly 27, 2023: Update B - Additional mitigations added (Q12DCCPU-V, Q24DHCCPU-V (G), Q24/26DHCCPU-LS).\nMay 30, 2024: Update C - Product specific update information added to Mitigations section.\n\n",
  "cves": [
    "CVE-2022-24946"
  ],
  "techniques": [],
  "advisory": "icsa-22-172-01",
  "title": "Mitsubishi Electric MELSEC iQ-R, Q, L Series and MELIPC Series (Update C) | CISA",
  "source": "ics-advisories",
  "id": "4278a1240e6b7f764b07dbba68f1fcda1893c31554a7b3c89979a46cc9328f44"
}