{
  "markdown": "\nOVERVIEW\nThis updated advisory is a follow-up to the advisory titled ICSA-15-181-02 SMA Solar Technology AG Sunny WebBox Hard-Coded Account Vulnerability that was published September 3, 2015, on the NCCIC/ICS-CERT web site.\nAleksandr Timorin of PT Security has identified a hard-coded account vulnerability in SMA Solar Technology AG’s Sunny WebBox product. SMA is planning to discontinue the sale of this product, and there is no plan to fix old versions. They have reached out to WebBox users with compensating security recommendations.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Sunny WebBox versions are affected:\n\nSunny WebBox – All versions.\n\nIMPACT\nA remote attacker could exploit this vulnerability to gain full access to the system.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSMA Solar Technology AG is a German solar energy equipment supplier.\nThe affected product, Sunny WebBox, is used for remote monitoring and maintenance of medium-sized photovoltaic plants. According to SMA, Sunny WebBox devices are deployed in the Energy sector. SMA estimates that this product is used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nUSE OF HARD-CODED CREDENTIALSCWE-798: Use of Hard-coded Credentials, http://cwe.mitre.org/data/definitions/798.html, web site last accessed June 30, 2015.\n\nSunny WebBox can be accessed using hard-coded passwords that cannot be changed or disabled by a user.\nCVE-2015-3964NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3964, web site last accessed September 17, 2015. has been assigned to this vulnerability. A CVSS v2 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:C/I:C/A:C, web site last accessed June 30, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit this vulnerability.\nMITIGATION\n--------- Begin Update A Part 1 of 1 --------\nSMA Solar Technology AG has sent out security recommendations via its Sunny Portal Online Platform to WebBox users. SMA expressly recommends deactivation of port-forwarding or use of a VPN to access these devices remotely. Please refer to the Sunny Portal Online Platform or contact SMA customer service for more information:\nPhone: 1-888-4SMAUSAEmail: Info@SMA-America.comWeb: www.SMA-America.com\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\nUpgrade to a newer system that is supported by the vendor.\n\n--------- End Update A Part 1 of 1 ----------\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (www.ics-cert.org).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2015-3964"
  ],
  "techniques": [],
  "advisory": "icsa-15-181-02a",
  "title": "SMA Solar Technology AG Sunny WebBox Hard-Coded Account Vulnerability (Update A) | CISA",
  "source": "ics-advisories",
  "id": "4a17d600481b7dc4765af7c50946016ac5315af20ae1f29dd4860d61ba47cf95"
}