{
  "markdown": "\nOVERVIEW\nSecurity researcher George Lashenko of CyberX has identified a buffer overflow vulnerability in Schneider Electric’s ConneXium firewall product. Schneider Electric is developing a firmware update to mitigate this vulnerability.\nThis vulnerability is remotely exploitable.\nAFFECTED PRODUCTS\nThe following ConneXium firewalls are affected:\n\nTCSEFEC23F3F20 all versions,\nTCSEFEC23F3F21 all versions,\nTCSEFEC23FCF20 all versions,\nTCSEFEC23FCF21 all versions, and\nTCSEFEC2CF3F20 all versions.\n\nIMPACT\nAn exploit of this vulnerability could result in a buffer overflow that could allow an attacker to execute code during the SNMP (Simple Network Management Protocol) login authentication process.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSchneider Electric’s corporate headquarters is located in Paris, France, and maintains offices in more than 100 countries worldwide.\nThe affected products, ConneXium firewalls, are network firewalls. According to Schneider Electric, ConneXium firewalls are deployed across several sectors including Commercial Facilities Sector and others. Schneider Electric estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOWCWE-121: Stack-based Buffer Overflow, https://cwe.mitre.org/data/definitions/121.html, web site last accessed November 01, 2016.\n\nA buffer overflow can be triggered during the SNMP login authentication process that may allow an attacker to remotely execute code.\nCVE-2016-8352NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8352, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H, web site last accessed November 01, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit this vulnerability.\nMITIGATION\nSchneider Electric is in the process of updating ConneXium firewall products to resolve this vulnerability through a firmware update. The updated firmware will be available on the Schneider Electric web site for download.\nSchneider Electric recommends users contact their local Schneider representative for additional information.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-8352"
  ],
  "techniques": [],
  "advisory": "icsa-16-306-01",
  "title": "Schneider Electric ConneXium Buffer Overflow Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "5a1bd8376ac2f790305547f0b7a18447e59523af3a73fbe53f03166cc5c60f19"
}