{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: PanelView 800\nVulnerabilities: Out-of-bounds Write, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of PanelView 800, a graphics terminal, are affected: \n\nPanelView 800-2711R-T4T: Version 5.011 to 8.011\nPanelView 800-2711R-T7T: Version 5.011 to 8.011\nPanelView 800-2711R-T10T: Version 5.011 to 8.011\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to an out-of-bounds write, which could allow an attacker to accomplish a heap buffer overflow if the user has the email feature enabled in the project file  WolfSSL uses. This feature is disabled by default.\nCVE-2020-36177 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2 OUT-OF BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read, which could allow an attacker to accomplish a heap buffer overflow if the user has the email feature enabled in the project file WolfSSL uses. This feature is disabled by default.\nCVE-2019-16748 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater, Telecommunications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to CISA.\n4. MITIGATIONS\nUsers of the affected software are encouraged to apply the following risk mitigations, if possible:\n\nUpgrade to V8.011, which has been patched to mitigate these issues.\nEnsure the email feature is disabled (it is disabled by default).\nFor information on mitigating security risks on industrial automation control systems (IACS) networks, see the following:\n\nSystem Security Design Guidelines Reference Manual publication, SECURE-RM001\nConfigure System Security Features User Manual, SECURE-UM001\n\n\nRockwell Automation encourages users to implement their suggested security best practices to minimize risk of vulnerability.\nFor additional information, refer to Rockwell Automation’s Security Bulletin.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-16748",
    "CVE-2020-36177"
  ],
  "techniques": [],
  "advisory": "icsa-23-131-14",
  "title": "Rockwell Automation PanelView 800 | CISA",
  "source": "ics-advisories",
  "id": "d0224f2b96f0306a00b7c919e43a69dde59e021dbd196867ebe9c87e94e90f74"
}