{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: JTTK and JT Utilities\nVulnerabilities: Out-of-bounds Write, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause the application to crash or allow arbitrary code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of JT Open Toolkit (JTTK), an application programming interface, and JT Utilities, a series of command line utilities, are affected:\n\nJT Utilities: All versions prior to v12.8.1.1\nJTTK: All versions prior to v10.8.1.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nJTTK library in affected products contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted JT files. This could allow an attacker to execute code in the context of the current process.\nCVE-2021-44449 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS READ CWE-125\nJTTK library in affected products is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing JT files. An attacker could leverage this vulnerability to leak information in the context of the current process.\nCVE-2021-44450 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nBentley Systems Incorporated coordinated these vulnerabilities with Siemens.\n4. MITIGATIONS\nSiemens recommends updating to the latest versions, specifically:\n\nJT Utilities: Update to v12.8.1.1 or later version\nJTTK: Update to v10.8.1.1 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDo not open untrusted files from unknown sources using JTTK\nDo not open untrusted files from unknown sources using JT Utilities\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals.\nFor more information about this issue, please see Siemens security advisory SSA-396621\nFor further inquiries on security vulnerabilities in Siemens products and solutions, please contact Siemens ProductCERT.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-44449",
    "CVE-2021-44450"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-20",
  "title": "Siemens JTTK and JT Utilities | CISA",
  "source": "ics-advisories",
  "id": "a31ece387ea3a8558bbd0da4ba092904f2a5a081c4529f469e70e35b4a3d199f"
}