{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.4\nATTENTION: Exploitable remotely\nVendor: Johnson Controls, Inc.\nEquipment: exacqVision Server\nVulnerability: Improper Certificate Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to perform a man-in-the-middle attack and intercept communications.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Johnson Controls exacqVision Server are affected:\n\nexacqVision Server: Versions 24.03 and prior\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER CERTIFICATE VALIDATION CWE-295\nUnder certain circumstances the exacqVision Server will not properly validate TLS certificates provided by connected devices.\nCVE-2024-32865 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.4 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Commercial Facilities, Government Facilities, Transportation Systems, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nDiego Zaffaroni from Nozomi Networks reported this vulnerability to Johnson Controls, Inc.\n4. MITIGATIONS\nJohnson Controls recommends users update exacqVision Client and exacqVision Server to version 24.06\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2024-18.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nAugust 01, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-32865"
  ],
  "techniques": [],
  "advisory": "icsa-24-214-05",
  "title": "Johnson Controls exacqVision Server | CISA",
  "source": "ics-advisories",
  "id": "d7011edf1f15b5e63ff40a56f64ddef4949cd536073ab9b2c264e751bb14f81a"
}