{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Remotely exploitable/low skill level to exploit\nVendor: Honeywell\nEquipment: ControlEdge PLC and RTU\nVulnerabilities: Cleartext Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to obtain passwords and session tokens.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ControlEdge PLC and RTU, are affected:\n\nControlEdge PLC R130.2, R140, R150, and R151\nControlEdge RTU R101, R110, R140, R150, and R151\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe affected device exposes unencrypted passwords on the network.\nCVE-2020-10628 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe affected product exposes a session token on the network.\nCVE-2020-10624 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nNikolay Sklyarenko of Kaspersky reported these vulnerabilities to Honeywell.\n4. MITIGATIONS\nHoneywell provided detailed information for mitigation on the insecure communication in Control Edge PLC\\RTU. Please access the support document SN2020-04-17-01-ConotrolEdge-PLC-and- and-RTU-Secure-Communication (login required). Download this document and follow the step by step instructions. The user must be logged in to access the security notification.\nUsers who have difficulty accessing the document can contact Honeywell support.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-10624",
    "CVE-2020-10628"
  ],
  "techniques": [],
  "advisory": "icsa-20-175-02",
  "title": "Honeywell ControlEdge PLC and RTU | CISA",
  "source": "ics-advisories",
  "id": "61dec7f5495bffc952050decb1d2e4a40e8dba67802bdd55e64d4f95316f5f4a"
}