{
  "markdown": "\nCVSS v3 8.1\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: GE\nEquipment: Multilin SR, UR, and URplus Protective Relays\nVulnerabilities: Weak Cryptography for Passwords\nUPDATED INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-17-117-01A GE Multilin SR Protective Relays that was published May 18, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following versions of Multilin SR protective relays are affected:\n\n750 Feeder Protection Relay, firmware versions prior to Version 7.47,\n760 Feeder Protection Relay, firmware versions prior to Version 7.47,\n469 Motor Protection Relay, firmware versions prior to Version 5.23,\n489 Generator Protection Relay, firmware versions prior to Version 4.06,\n745 Transformer Protection Relay, firmware versions prior to Version 5.23, and\n\n--------- Begin Update B Part 1 of 2 --------\n\n369 Motor Protection Relay, firmware versions prior to Version 3.63.\n\nThe following versions of the Multilin Universal Relay (UR) and URplus relay families are affected:\n\nUniversal Relay, firmware Version 6.02 (excluding Version 5.83, Version 5.92, and all subsequent minor releases), and\nURplus (D90, C90, B95), all versions.\n\nGE has identified additional legacy products that are affected:\n\nMM300 Motor Management Relay, firmware versions prior to Version 1.71,\nMM200 Motor Management System, firmware versions prior to Version 1.25,\nMX350 Relay, firmware versions prior to Version 1.27,\nRPTCS, firmware versions prior to Version 1.29,\n350 Feeder Protection Relay, firmware versions prior to Version 2.30,\n345 Transformer Protection Relay, firmware versions prior to Version 2.30,\n339 Motor Protection Relay, firmware versions prior to Version 2.30, and\nT1000 Switch, firmware versions prior to Version 03A02.\n\n--------- End Update B Part 1 of 2 ----------\nIMPACT\nSuccessful exploitation of this vulnerability may allow a remote attacker to obtain weakly encrypted user passwords, which could be used to gain unauthorized access to affected products.\nMITIGATION\nGE has released the following firmware versions, which remove access to the cipher text from the front LCD panel and through Modbus in the affected products:\n--------- Begin Update B Part 2 of 2 --------\n\n760 Feeder Protection Relay, Version 7.47,\n\nGE’s download link for 760 Feeder Protection Relay, Version 7.47 is as follows:\nhttp://www.gegridsolutions.com/app/downloadfile.aspx?prod=750&type=7&file=2\n\n750 Feeder Protection Relay, Version 7.47,\n\nGE’s download link for 750 Feeder Protection Relay, Version 7.47 is as follows (login required):\nhttp://www.gegridsolutions.com/app/downloadfile.aspx?prod=750&type=7&file=2\n\n745 Transformer Protection Relay, Version 5.23,\n\nGE’s download link for 745 Transformer Protection Relay, Version 5.23 is as follows (login required):\nhttp://www.gegridsolutions.com/app/downloadfile.aspx?prod=745&type=7&file=2\n\n489 Generator Protection Relay, Version 4.06,\n\nGE’s download link for 489 Generator Protection Relay, Version 4.06 is as follows (login required):\nhttp://www.gegridsolutions.com/app/downloadfile.aspx?prod=489&type=7&file=2\n\n469 Motor Protection Relay, Version 5.23, and\n\nGE’s download link for 469 Motor Protection Relay, Version 5.23 is as follows (login required):\nhttp://www.gegridsolutions.com/app/downloadfile.aspx?prod=469&type=7&file=2\n\n369 Motor Protection Relay, Version 3.63.\n\nGE’s download link for 369 Motor Protection Relay, Version 3.63 is as follows (login required):\nhttp://www.gegridsolutions.com/app/downloadfile.aspx?prod=369&type=7&file=2\nGE security advisory, UR-2017-00001 Multilin UR/URPlus Family of Protective Relays, is available at the following location, with a valid account:\nhttp://www.gegridsolutions.com/app/ViewFiles.aspx?prod=t60&type=21\nGE had identified additional legacy products that have the same vulnerability as the SR protective relays and in response, has released the following updated firmware versions:\n\nMM300 Motor Management Relay, firmware versions prior to Version 1.71,\n\nGE’s download link for the MM300 Motor Management Relay, firmware Version 1.71 is as follows (login required):\nhttp://www.gegridsolutions.com/Passport/Login.aspx?ReturnUrl=%2fapp%2fDownloadFile.aspx%3fprod%3dMM300%26type%3d7%26file%3d2\nGE’s release notification is as follows:\nhttp://www.gegridsolutions.com/products/support/mm300/GER-4807.pdf\n\nMM200 Motor Management System, firmware versions prior to Version 1.25,\n\nGE’s download link for the MM200 Motor Management System, firmware Version 1.25 is as follows (login required):\nhttp://www.gegridsolutions.com/Passport/Login.aspx?ReturnUrl=%2fapp%2fDownloadFile.aspx%3fprod%3dMm200%26type%3d7%26file%3d3\nGE’s release notification is as follows:\nhttp://www.gegridsolutions.com/products/support/mm200/GER-4801.pdf\n\nMX350 Relay, firmware versions prior to Version 1.27,\n\nFor more information about the availability of this firmware version, contact GE’s support:\nhttp://www.gegridsolutions.com/multilin/support.aspx.\n\nRPTCS, firmware versions prior to Version 1.29,\n\nFor more information about the availability of this firmware version, contact GE’s support:\nhttp://www.gegridsolutions.com/multilin/support.aspx.\n\n350 Feeder Protection Relay, firmware versions prior to Version 2.30,\n\nGE’s download link for the 350 Feeder Protection Relay, firmware Version 2.30 is as follows (login required):\nhttp://www.gegridsolutions.com/Passport/Login.aspx?ReturnUrl=%2fapp%2fDownloadFile.aspx%3fprod%3d350%26type%3d7%26file%3d3\nGE’s release notification is as follows:\nhttp://www.gegridsolutions.com/products/support/3Series/GER-4791.pdf\n\n345 Transformer Protection Relay, firmware versions prior to Version 2.30,\n\nGE’s download link for the 345 Transformer Protection Relay, firmware Version 2.30, is as follows (login required):\nhttp://www.gegridsolutions.com/Passport/Login.aspx?ReturnUrl=%2fapp%2fDownloadFile.aspx%3fprod%3d345%26type%3d7%26file%3d2\nGE’s release notification is as follows:\nhttp://www.gegridsolutions.com/products/support/3Series/GER-4791.pdf\n\n339 Motor Protection Relay, firmware versions prior to Version 2.30, and\n\nGE’s download link for the 339 Motor Protection Relay, firmware Version 2.30, is as follows (login required):\nhttp://www.gegridsolutions.com/Passport/Login.aspx?ReturnUrl=%2fapp%2fDownloadFile.aspx%3fprod%3d339%26type%3d7%26file%3d2\nGE’s release notification is as follows:\nhttp://www.gegridsolutions.com/products/support/3Series/GER-4791.pdf\n\nT1000 Switch, firmware versions prior to Version 03A02.\n\nGE’s download link for the T1000 Switch, firmware Version 03A02 is as follows (login required):\nhttp://www.gegridsolutions.com/Passport/Login.aspx?ReturnUrl=%2fapp%2fDownloadFile.aspx%3fprod%3dS20-T1000%26type%3d7%26file%3d3\n--------- End Update B Part 2 of 2 ----------\nGE UR firmware versions 7.xx are not affected. GE has released updates that remove the ability to obtain the password cipher text in the following firmware versions:\n\nUniversal Relay, firmware Version 5.83,\nUniversal Relay, firmware Version 5.92, and\nUniversal Relay, firmware Version 6.02 to 6.05.\n\nThe Universal Relay firmware is available at the following location:\nhttps://www.gegridsolutions.com/app/ViewFiles.aspx?prod=urfamily&type=7\nGE reports that the URplus platform will have firmware updates released in July 2017 for the following product versions:\n\nURplus, firmware Version 1.86,\nURplus, firmware Version 1.92, and\nB95Plus, firmware Version 1.03.\n\nGE recommends that users apply updated firmware versions to affected products, as well as implement the following physical security and network security defensive measures:\n\nControl access to affected products by keeping devices in a locked and secure environment,\nRemove passwords when decommissioning devices,\nMonitor and block malicious network activity, and\nImplement appropriate network segmentation and place affected devices within the control system network, behind properly configured firewalls. Protection and Control system devices should not be directly connected to the Internet or business networks.\n\nGE security advisory, SR-2017-00001 Multilin SR Family of Protective Relays, is available at the following location, with a valid account:\nhttps://www.gegridsolutions.com/app/ViewFiles.aspx?prod=750&type=21\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nWEAK CRYPTOGRAPHY FOR PASSWORDS CWE-261\n\nCipher text versions of user passwords were created with a non-random initialization vector leaving them susceptible to dictionary attacks. Cipher text of user passwords can be obtained from the front LCD panel of affected products and through issued Modbus commands.\nCVE-2017-7905 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nGE reported the vulnerability to ICS-CERT. It was initially identified by New York University security researchers Anastasis Keliris, Charalambos Konstantinou, Marios Sazos, and Dr. Michail (Mihalis) Maniatakos.\nBACKGROUND\nCritical Infrastructure Sectors: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Government Facilities, Transportation Systems, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Boston, Massachusetts\n",
  "cves": [
    "CVE-2017-7905"
  ],
  "techniques": [],
  "advisory": "icsa-17-117-01b",
  "title": "GE Multilin SR, UR, and URplus Protective Relays (Update B) | CISA",
  "source": "ics-advisories",
  "id": "4e992d1c6de5977a45e4075fd9d630350fdbc2f4c5b8c6c6d664324bec8bf2d8"
}