{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: KTK, SIDOOR, SIMATIC, and SINAMICS\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-105-08 Siemens KTK, SIDOOR, SIMATIC, and SINAMICS (Update C) that was published June 16, 2021, to the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could create a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200: All Versions\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200P: All Versions\nKTK ATE530S: All versions\nSIDOOR ATD430W: All versions\nSIDOOR ATE530S COATED: All versions\nSIDOOR ATE531S: All versions\nSIMATIC ET200AL IM157-1 PN: All versions\nSIMATIC ET200ecoPN, CM 8x IO-Link, M12-L (6ES7148-6JG00-0BB0): Versions 5.1.1 and later\nSIMATIC ET200ecoPN, DI 8x24VDC, M12-L (6ES7141-6BG00-0BB0): Versions 5.1.1 and later\nSIMATIC ET200ecoPN, DI 16x24VDC, M12-L (6ES7141-6BH00-0BB0): Versions 5.1.1 and later\nSIMATIC ET200ecoPN, DIQ 16x24VDC/2A, M12-L (6ES7143-6BH00-0BB0): Versions 5.1.1 and later\nSIMATIC ET200ecoPN, DQ 8x24VDC/0,5A, M12-L (6ES7142-6BG00-0BB0): Versions 5.1.1 and later\nSIMATIC ET200ecoPN, DQ 8x24VDC/2A, M12-L (6ES7142-6BR00-0BB0): Versions 5.1.1 and later\nSIMATIC ET200SP IM155-6 MF HF: All versions\nSIMATIC ET 200SP Open Controller CPU 1515SP PC (incl. SIPLUS variants): All versions prior to 2.0\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions prior to 2.0\nSIMATIC ET200MP IM155-5 PN HF (incl. SIPLUS variants): Versions 4.2 and later\nSIMATIC ET200SP IM155-6 PN HA (incl. SIPLUS variants): All versions\nSIMATIC ET200SP IM155-6 PN HF (incl. SIPLUS variants): Versions 4.2 and later\nSIMATIC ET200SP IM155-6 PN/2 HF (incl. SIPLUS variants): Versions 4.2 and later\nSIMATIC ET200SP IM155-6 PN/3 HF (incl. SIPLUS variants): Versions 4.2 and later\nSIMATIC MICRO-DRIVE PDC: All versions\nSIMATIC PN/PN Coupler (incl. SIPLUS NET variants): Versions 4.2 and later\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): All versions prior to 4.4.0 \nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to 2.0\nSIMATIC S7-1500 Software Controller: All versions prior to 2.0\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions\nSIMATIC S7-400 H V6 CPU family and below (incl. SIPLUS variants): All Versions\nSIMATIC S7-400 PN/DP V7 and below CPU family (incl. SIPLUS variants): All versions\n\n--------- Begin Update D Part 1 of 3 ---------\n\nSIMATIC S7-410 CPU family (incl. SIPLUS variants): All versions prior to 10.1.1\n\n--------- End Update D Part 1 of 3 ---------\n\nSIMATIC TDC CP51M1: All versions\nSIMATIC TDC CPU555: All versions\nSIMATIC WinAC RTX (F) 2010: All versions\nSINAMICS S/G Control Unit w. PROFINET: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION (‘RESOURCE EXHAUSTION’) CWE-400\nThe InterNiche-based TCP stack can be forced to make resource intense calls for every incoming packet, which can lead to a denial-of-service condition.\nCVE-2019-19300 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends applying updates if available:\n\nSIMATIC ET 200SP Open Controller CPU 1515SP PC (incl. SIPLUS variants): Update to v2.1.7\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): Update to v20.8\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): Update to v2.8 \nSIMATIC S7-1500 Software Controller: Update to v20.8\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): Update to v4.5.2 or later\n\n--------- Begin Update D Part 2 of 3 ---------\n\nSIMATIC S7-410 CPU family (incl. SIPLUS variants): Update to v10.1.1 or later. \n\nUsers should disable the ethernet ports on the CPU and use a communication module (like CP) for communication instead\n\n\n\n--------- End Update D Part 2 of 3 ---------\nSiemens has not identified any specific mitigations or workarounds and recommends following their general security recommendations. As a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\n--------- Begin Update D Part 3 of 3 ---------\nFor additional information, users can refer to Siemens Security Advisory SSA-593272 in HTML or CSAF formats.\n--------- End Update D Part 3 of 3 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-19300"
  ],
  "techniques": [],
  "advisory": "icsa-20-105-08",
  "title": "Siemens KTK, SIDOOR, SIMATIC, and SINAMICS (Update D) | CISA",
  "source": "ics-advisories",
  "id": "bd3e6dd76e8568b18befa19af87bc64f7edf9e43f56f31fcaa50add626f3b200"
}