{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: WebAccess Node\nVulnerabilities: Improper Validation of Array Index, Relative Path Traversal, SQL Injection, Stack-based Buffer Overflow, Heap-based Buffer Overflow, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow information disclosure, remote code execution, and compromise system availability.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WebAccess Node, an HMI platform, are affected:\n\nWebAccess Node Version 8.4.4 and prior\nWebAccess Node Version 9.0.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER VALIDATION OF ARRAY INDEX CWE-129\nAn improper validation vulnerability exists that could allow an attacker to inject specially crafted input into memory where it can be executed.\nCVE-2020-12022 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    RELATIVE PATH TRAVERSAL CWE-23\nMultiple relative path traversal vulnerabilities exist that may allow an authenticated user to use a specially crafted file to delete files outside the application’s control.\nCVE-2020-12010 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:N/I:L/A:H).\n3.2.3    RELATIVE PATH TRAVERSAL CWE-23\nMultiple relative path traversal vulnerabilities exist that may allow an attacker to overwrite files outside the application’s control.\nCVE-2020-12006 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    RELATIVE PATH TRAVERSAL CWE-23\nMultiple relative path traversal vulnerabilities exist that may allow a low privilege user to overwrite files outside the application’s control.\nCVE-2020-12026 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.5    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nInput is not properly sanitized and may allow an attacker to inject SQL commands.\nCVE-2020-12014 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.6    STACK-BASED BUFFER OVERFLOW CWE-121\nMultiple stack-based buffer overflow vulnerabilities exist caused by a lack of proper validation of the length of user-supplied data, which may allow remote code execution.\nCVE-2020-12002 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.7    HEAP-BASED BUFFER OVERFLOW CWE-122\nMultiple heap-based buffer overflow vulnerabilities exist caused by a lack of proper validation of the length of user-supplied data, which may allow remote code execution.\nCVE-2020-10638  has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.8    OUT-OF-BOUNDS READ CWE-125\nAn out-of-bounds vulnerability exists that may allow access to unauthorized data.\nCVE-2020-12018 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, United States, Europe\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nNatnael Samson and Z0mb1E, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAdvantech has released WebAccessNode Version 8.4.4.P0320844 to address the reported vulnerabilities for users currently using WebAccessNode Version 8.4.4\nAdvantech has released WebAccessNode Version 9.0.0.P0320900 to address the reported vulnerabilities for users currently using WebAccessNode Version 9.0.0\nNote: Upon installation, there is a step to let the user decide whether to define a password code for RPC calls. If the user leaves this blank, the installation will pop up a warning to the user for potential risks that they are willing to take.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-12026",
    "CVE-2020-12014",
    "CVE-2020-12018",
    "CVE-2020-12022",
    "CVE-2020-12010",
    "CVE-2020-12006",
    "CVE-2020-10638",
    "CVE-2020-12002"
  ],
  "techniques": [],
  "advisory": "icsa-20-128-01",
  "title": "Advantech WebAccess Node | CISA",
  "source": "ics-advisories",
  "id": "c783b5b5fa0dd67b39b9196ba846ee47861ea747639e91601e6ef4d2e593b5c7"
}