{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.6\n\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: Siemens\nEquipment: SCALANCE X Switches\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker with network access to the device to cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SCALANCE X Switches, which are used to connect industrial components like programmable logic controllers (PLCs) or human machine interfaces (HMIs), are affected:\n\nSCALANCE X300: All versions prior to 4.0.0,\nSCALANCE X408: All versions prior to 4.0.0 and\nSCALANCE X414: All versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE- 20\nThe web interface on Port 443/TCP could allow an attacker to cause a denial-of-service condition by sending specially crafted packets to the web server. The device will automatically reboot, impacting network availability for other devices.\nAn attacker must have network access to Port 443/TCP to exploit the vulnerability. Neither valid credentials nor interaction by a legitimate user are required to exploit the vulnerability. There is no confidentiality or integrity impact, availability is only temporarily impacted.\nThis vulnerability could be exploited by publicly available tools.\nCVE-2018-13807 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSiemens provides updates for SCALANCE X300, and SCALANCE X408, and provides mitigations for the SCALANCE X414.\n\nSCALANCE X300: Update to Version 4.1.2\n\nhttps://support.industry.siemens.com/cs/us/en/view/109753720\n\nSCALANCE X408: Update to Version 4.1.2\n\nhttps://support.industry.siemens.com/cs/us/en/view/109753720\n\nSCALANCE X424: Siemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk:\n\nProtect network access to the integrated web server on Port 443/TCP with appropriate mechanisms.\nRestrict network access to Port 443/TCP to trusted IP addresses, and avoid running vulnerability scanning tools from trusted IP addresses on affected devices.\n\n\n\nAs a general security measure, Siemens strongly recommends to protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends to configure the environment according to Siemens’ operational guidelines for Industrial Security (download: https://www.siemens.com/cert/operational-guidelines-industrial-security), and to follow the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity.\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-447396 on their web site:\nhttps://www.siemens.com/cert/advisories.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-13807"
  ],
  "techniques": [],
  "advisory": "icsa-18-254-05",
  "title": "Siemens SCALANCE X Switches | CISA",
  "source": "ics-advisories",
  "id": "584e7070f0819bda0dff67826ffe5dad2a1d61bdbea7606870a48e74f68cc4cd"
}