{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Auto-Maskin\nEquipment: RP 210E Remote Panels, DCU 210E Control Units, and Marine Observer Pro (Android App)\nVulnerabilities: Cleartext Transmission of Sensitive Information, Origin Validation Error, Use of Hard-coded Credentials, Weak Password Recovery Mechanism for Forgotten Password, Weak Password Requirements\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to gain root access to the underlying operating system of the device and may allow read/write access.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of RP210E and DCU 210, a remote panel and digital control unit, are affected:\n\nRP210E Versions 3.7 and prior\nDCU210E Versions 3.7 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe embedded web server software transmits sensitive or security-critical data in cleartext in a communication channel that can be sniffed by unauthorized actors.\nCVE-2018-5402 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe device software transmits sensitive or security-critical data in cleartext in a communication channel that can be sniffed by unauthorized actors.\nCVE-2018-5401 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3    ORIGIN VALIDATION ERROR CWE-346\nThe software does not properly verify that the source of data or communication is valid.\nCVE-2018-5400 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H).\n3.2.4    USE OF HARD-CODED CREDENTIALS CWE-798\nThe software contains hard-coded credentials, such as a password or cryptographic key, which it uses for its own inbound authentication, outbound communication to external components, or encryption of internal data.\nCVE-2018-5399 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.5    WEAK PASSWORD RECOVERY MECHANISM FOR FORGOTTEN PASSWORD CWE-640\nThe software contains a mechanism for users to recover or change their passwords without knowing the original password, but the mechanism is weak.\nCVE-2019-6560 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:L).\n3.2.6    WEAK PASSWORD REQUIREMENTS CWE-521\nThe product contains multiple weak password requirements, which makes it easier for attackers to compromise user accounts.\nCVE-2019-6558  has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Norway\n\n3.4 RESEARCHER\n4. MITIGATIONS\nAuto-Maskin reports new firmware is available to download from its website that mitigates the reported vulnerabilities.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6558",
    "CVE-2018-5399",
    "CVE-2019-6560",
    "CVE-2019-6568",
    "CVE-2018-5402",
    "CVE-2018-5401",
    "CVE-2018-5400"
  ],
  "techniques": [],
  "advisory": "icsa-20-051-04",
  "title": "Auto-Maskin RP210E, DCU210E, and Marine Observer Pro (Android App) | CISA",
  "source": "ics-advisories",
  "id": "2261e5c056a89a7f4139ed0ba5dc01080dcdf2652c21c7af07bf48a272a2d3b5"
}