{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Schneider Electric\nEquipment: IGSS (Interactive Graphical SCADA System)\nVulnerabilities: Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products and versions are affected:\n\nIGSS Definition (Def.exe) Version 15.0.0.21041 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThis vulnerability could result in loss of data or remote code execution when a malicious CGF (configuration group file) file is imported into an IGSS Definition.\nCVE-2021-22709 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThis vulnerability could result in loss of data or remote code execution when a malicious CGF file is imported into an IGSS Definition.\nCVE-2021-22710 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThis vulnerability could result in arbitrary read or write conditions due to missing validation of input data when a malicious CGF file is imported into an IGSS Definition.\nCVE-2021-22711 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThis vulnerability could result in arbitrary read or write conditions due to an unchecked pointer address when a malicious CGF file is imported into an IGSS Definition.\nCVE-2021-22712 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nKimiya, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSchneider Electric has provided Version 15.0.0.21042 of the IGSS Definition module: Def.exe to address these vulnerabilities. The update is available for download through IGSS Master > Update IGSS Software or from the Schneider Electric support page.\nIf users choose not to apply the remediation provided above, they should immediately apply the following mitigations to reduce the risk of exploit:\n\nAvoid importing CGF files from untrusted sources.\n\nFor more information, see the Schneider Electric security notification.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n\\No known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-22710",
    "CVE-2021-22709",
    "CVE-2021-22712",
    "CVE-2021-22711"
  ],
  "techniques": [],
  "advisory": "icsa-21-070-01",
  "title": "Schneider Electric IGSS SCADA Software | CISA",
  "source": "ics-advisories",
  "id": "0a74dc080f3ecbb62d71312b874e0b179841e4e633a8211436adcb3459db831e"
}