{
  "markdown": "\nCVSS v3 7.1\nATTENTION: Local access and user-level privileges are required to exploit these vulnerabilities\nVendor: AzeoTech\nEquipment: DAQFactory\nVulnerabilities: Incorrect Default Permissions, Uncontrolled Search Path Element\nAFFECTED PRODUCTS\nAzeoTech reports that the vulnerabilities affect the following versions of DAQFactory HMI:\n\nDAQFactory versions prior to 17.1\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow authenticated system users to escalate their privileges and modify or replace application files.\nMITIGATION\nAccording to AzeoTech, the newest version (Version 17.1) gives write privileges only to administrators and no longer searches for dlls outside of the application directory.\nAzeoTech provides the following instructions to upgrade to Version 17.1. Existing users can download and install the DAQFactory trial from the following web site over their existing installation at no charge:\nhttp://www.AzeoTech.com/downloads.php\nThe user’s license is maintained. Because this is the standard update path for DAQFactory, most users will be familiar with the process.\nNCCIC/ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks. Specifically, users should:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nINCORRECT DEFAULT PERMISSIONS CWE-276\n\nLocal, non-administrative users may be able to replace or modify original application files with malicious ones.\nCVE-2017-12699 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nAn uncontrolled search path element vulnerability has been identified, which may execute malicious DLL files that have been placed within the search path.\nCVE-2017-5147 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:R/S:U/C:L/I:L/A:L).\nRESEARCHER\nKarn Ganeshen reported these vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical manufacturing, Energy, and Water\nCountries/Areas Deployed: United States and Europe\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2017-12699",
    "CVE-2017-5147"
  ],
  "techniques": [],
  "advisory": "icsa-17-241-01",
  "title": "AzeoTech DAQFactory | CISA",
  "source": "ics-advisories",
  "id": "15c37ba6098e91a028bf3e1f9a7a9bf8856393be7e72416afb455f06f9f62fa4"
}