{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Johnson Controls, Inc.\nEquipment: Illustra Essentials Gen 4\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to inject commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports that the following versions of Illustra Essentials Gen 4 IP camera are affected:\n\nIllustra Essentials Gen 4: all versions up to Illustra.Ess4.01.02.10.5982\n\n3.2 Vulnerability Overview\n3.2.1 Improper Input Validation CWE-20\nUnder certain circumstances the web interface will accept characters unrelated to the expected input.\nCVE-2024-32755 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Commercial Facilities, Government Facilities, Transportation Systems, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nSam Hanson of Dragos reported this vulnerability to Johnson Controls, Inc.\n4. MITIGATIONS\nJohnson Controls recommends that users upgrade cameras to Illustra.Ess4.01.02.13.6953. For more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2024-09 v1\nJohnson Controls recommends taking steps to minimize risks to all building automation systems. Further ICS security notices and product security guidance are located at the Johnson Controls product security website\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJune 27, 2024: Initial Publication\nJuly 2, 2024: Update A - Change in mitigation schedule\n\n",
  "cves": [
    "CVE-2024-32755"
  ],
  "techniques": [],
  "advisory": "icsa-24-179-04",
  "title": "Johnson Controls Illustra Essentials Gen 4 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "7325900b6d7e45768405dcb1fc1fc3c9a195a50cd39dc7f71374c04517cb1d27"
}