{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/Low attack complexity\nVendor: Delta Electronics\nEquipment: DIAEnergie\nVulnerabilities: Use of Hard-coded Credentials\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled “ICSA-22-256-03 Delta Industrial Automation DIAEnergie” that was published September 19, 2022, on the ICS webpage on cisa.gov/ICS\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 2 ---------\nDelta Electronics reports this vulnerability affects the following versions of DIAEnergie, an industrial energy management system:\n\nDIAEnergie: versions prior to 1.9.03.009\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1 USE OF HARD-CODED CREDENTIALS CWE-798\nExecutable files could be uploaded to certain directories using hard-coded bearer authorization, allowing remote code execution.\nCVE-2022-3214 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n4.4 RESEARCHER\nY4er working with Trend Micro Zero Day Initiative reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nDelta Electronics fixed the reported vulnerability in version 1.9.03.009 and recommends all users update affected systems. Users can contact the front end sales or FAEs to get this version.\n--------- End Update A Part 2 of 2 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-3214"
  ],
  "techniques": [],
  "advisory": "icsa-22-256-03",
  "title": "Delta Electronics DIAEnergie (Update A) | CISA",
  "source": "ics-advisories",
  "id": "b25d7f8cee4acf4c19218cb187251e5a2c70b135e7ee5a33c3c43b9546b7590b"
}