{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC S7\nVulnerability: Uncontrolled Resource Consumption (Resource Exhaustion)\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-042-05 Siemens SIMATIC S7 (Update A) that was published March 10, 2020, to the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote attackers to perform a denial-of-service attack by sending a specially crafted HTTP request to the web server of an affected device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC S7 devices are affected:\n\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants) all versions prior to v4.1\nSIMATIC S7-300 PN/DP CPU family (incl. related ET200 CPUs and SIPLUS variants) all versions prior to V3.x.17\nSIMATIC S7-400 PN/DP v6 and below CPU family (incl. SIPLUS variants) all versions\nSIMATIC S7-400 PN/DP v7 CPU family (incl. SIPLUS variants) all versions\n\n--------- Begin Update B Part 1 of 1 ---------\n\nSIMATIC WinAC (F) 2010 all versions\n\n--------- End Update B Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION (‘RESOURCE EXHAUSTION’) CWE-400\nAffected devices contain a vulnerability that could cause a denial-of-service condition of the web server by sending specially crafted HTTP requests to Ports 80/TCP and 443/TCP. \nCVE-2019-13940 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nChina Industrial Control Systems Cyber Emergency Response Team (CIC) reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict access to the device to the internal or VPN network. Further, if possible, restrict access to the web server (80/TCP, 443/TCP) to trusted IP addresses.\nIf possible, disable the integrated web server. The web server is disabled in the default settings and its use is optional.\nFor SIMATIC S7-1200 CPU family (including SIPLUS variants) Siemens recommends affected users update to v4.1 or any later version. \nFor SIMATIC S7-300 PN/DP CPU family (including related ET200 CPUs and SIPLUS variants), Siemens recommends affected users update to v3.X.17 or later version.\n\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-431678\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2019-13940"
  ],
  "techniques": [],
  "advisory": "icsa-20-042-05",
  "title": "Siemens SIMATIC S7 (Update B) | CISA",
  "source": "ics-advisories",
  "id": "c85256f99bd1d69400c0d81aee3ad6926353801f28b1815349653687e7d7ee59"
}