{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC Communication Processor\nVulnerability: Authentication Bypass Issues\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-15-335-03 Siemens SIMATIC Communication Processor (Update B) that was published May 3, 2016, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow unauthenticated users to perform administrative operations on the SIMATIC Communication Processor under certain conditions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following Communication Processor modules, which are designed to be used with Siemens’ SIMATIC S7-300/S7-400 CPUs: \n--------- Begin Update C Part 1 of 2 ---------\n\nSIMATIC NET CP 342-5 (incl. SIPLUS variants): All versions\nSIMATIC CP 343-1 Advanced (incl. SIPLUS variants): All firmware versions prior to v3.0.44,\nSIMATIC CP 343-1 Lean (incl. SIPLUS variants): All firmware versions prior to v3.1.1,\nSIMATIC NET CP 343-1 Standard (incl. SIPLUS variants): All versions prior to v3.1.1\nSIMATIC NET CP 443-1 Advanced (incl. SIPLUS variants): All versions prior to v3.2.9\nSIMATIC NET CP 443-1 Standard (incl. SIPLUS variants): All versions prior to v3.2.9\nSIMATIC NET CP 443-5 Basic (incl. SIPLUS variants): All versions\nSIMATIC NET CP 443-5 Extended: All versions\nTIM 3V-IE / TIM 3V-IE Advanced (incl. SIPLUS NET variants): All versions prior to v2.6.0\nTIM 3V-IE DNP3 (incl. SIPLUS NET variants): All versions prior to v3.1.0\nTIM 4R-IE (incl. SIPLUS NET variants): All versions prior to v2.6.0\nTIM 4R-IE DNP3 (incl. SIPLUS NET variants): All versions prior to v3.1.0\n\n--------- End Update C Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nCommunication Processor module families may allow unauthenticated users to perform administrative operations on the Communication Processor if network access to Port 102/TCP is available and the Communication Processor’s configuration is stored on its corresponding CPUs. \nCVE-2015-8214 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nLei ChengLin (Z-0ne) from Fengtai Technologies’ Security Research Team and Artem Zinenko from Kaspersky reported this vulnerability to Siemens.\n5. MITIGATIONS\n--------- Begin Update C Part 2 of 2 ---------\nSiemens has released the following updates for Communication Processor (CP) module families CP 343-1/TIM 3VIE/ TIM 4R-IE/CP 443-1 to resolve this issue:\n\nSIMATIC NET CP 343-1 Advanced: Update to v3.0.44\nSIMATIC NET CP 343-1 Lean / Standard: Update to v3.1.1\nSIMATIC NET CP 443-1 Advanced / Standard: Update to v3.2.9\nTIM 3V-IE / TIM 3V-IE Advanced / TIM 4R-IE: Update to v2.6.0\nTIM 3V-IE DNP3: Update to v3.1.0\nTIM 4R-IE DNP3: Update to v3.1.0\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens operational guidelines for industrial security, and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\n--------- End Update C Part 2 of 2 ---------\nFor more information on this vulnerability and detailed instructions, please see Siemens Security Advisory SSA-763427\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2015-8214"
  ],
  "techniques": [],
  "advisory": "icsa-15-335-03",
  "title": "Siemens SIMATIC Communication Processor Vulnerability (Update C) | CISA",
  "source": "ics-advisories",
  "id": "9ae276476a6eecb8991cf77dd5816fb15ed820af0d265f2e10eca2794f6dff3d"
}