{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: AutomationDirect\nEquipment: C-More Touch Panels EA9 Series\nVulnerability: Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to get account information such as usernames and passwords, obscure or manipulate process data, and lock out access to the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of C-More Touch Panels, a software management platform, are affected:\n\nC-More Touch Panels EA9 series: firmware versions prior to 6.53\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS (CWE-522)\nIt is possible to unmask credentials and other sensitive information on “unprotected” project files, which may allow an attacker to remotely access the system and manipulate system configurations.\nCVE-2020-6969 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJoel Langill of Amentum Mission Engineering & Resilience reported this vulnerability to CISA.\n4. MITIGATIONS\nAutomation Direct recommends users to upgrade to Version 6.53\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-6969"
  ],
  "techniques": [],
  "advisory": "icsa-20-035-01",
  "title": "AutomationDirect C-More Touch Panels | CISA",
  "source": "ics-advisories",
  "id": "2910e77240020c95be88e82e21f9568c1c2a2eb714fe0ac84a5ef375e7a30b0c"
}