{
  "markdown": "\nCVSS v3 8.8\nATTENTION: Remotely Exploitable/low skill level to exploit\nVendor: Schneider Electric\nEquipment: Wonderware InTouch Access Anywhere\nVulnerabilities: Cross-Site Request Forgery, Information Exposure, Inadequate Encryption Strength\nAFFECTED PRODUCTS\nThe following Wonderware InTouch Access Anywhere versions are affected:\n\nWonderware InTouch Access Anywhere, version 11.5.2 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to perform actions on behalf of a legitimate user, perform network reconnaissance, and gain access to resources beyond those intended with normal operation of the product.\nMITIGATION\nSchneider Electric has released a new software version to address the identified vulnerabilities and recommends that users of affected versions upgrade to Wonderware InTouch Access Anywhere 2017 (17.0.0).\nUsers of Wonderware InTouch Access Anywhere can login at the following support site to download the upgrade:\nhttps://gcsresource.invensys.com/tracking/ConfirmDownload.aspx?id=22401\nSchneider Electric has issued Security Bulletin LFSEC00000114, which contains additional information:\nhttp://software.schneider-electric.com/support/cyber-security-updates/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nCROSS-SITE REQUEST FORGERY CWE-352\n\nThe client request may be forged from a different site. This will allow an external site to access internal RDP systems on behalf of the currently logged in user.\nCVE-2017-5156 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nINFORMATION EXPOSURE CWE-200\n\nCredentials may be exposed to external systems via specific URL parameters, as arbitrary destination addresses may be specified.\nCVE-2017-5158 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated by Schneider Electric; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n\nINADEQUATE ENCRYPTION STRENGTH CWE-326\n\nThe software will connect via Transport Layer Security without verifying the peer’s SSL certificate properly.\nCVE-2017-5160 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N).\nRESEARCHER\nRuslan Habalov and Jan Bee of the Google ISA Assessments Team identified these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Healthcare and Public Health, and Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n",
  "cves": [
    "CVE-2017-5160",
    "CVE-2017-5158",
    "CVE-2017-5156"
  ],
  "techniques": [],
  "advisory": "icsa-17-089-01",
  "title": "Schneider Electric Wonderware InTouch Access Anywhere | CISA",
  "source": "ics-advisories",
  "id": "e6692d0806efe2e0d2652d33d5b88ebfc62f04be133c159b9b79651437b4245e"
}