{
  "markdown": "\nCVSS v3 8.8\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Continental AG\nEquipment: Infineon S-Gold 2 (PMB 8876)\nVulnerabilities: Stack-Based Buffer Overflow, Improper Restriction of Operations within the Bounds of a Memory Buffer\nAFFECTED PRODUCTS\nAll telematics control modules (TCUs) built by Continental AG that contain the S-Gold 2 (PMB 8876) cellular baseband chipset are affected. The S-Gold 2 (PMB 8876) is found in the following vehicles:\n\nBMW several models produced between 2009-2010\nFord - program to update 2G modems has been active since 2016 and impact is restricted to the limited number of P-HEV vehicles equipped with this older technology that remain in service.\nInfiniti 2013 JX35\nInfiniti 2014-2016 QX60\nInfiniti 2014-2016 QX60 Hybrid\nInfiniti 2014-2015 QX50\nInfiniti 2014-2015 QX50 Hybrid\nInfiniti 2013 M37/M56\nInfiniti 2014-2016 Q70\nInfiniti 2014-2016 Q70L\nInfiniti 2015-2016 Q70 Hybrid\nInfiniti 2013 QX56\nInfiniti 2014-2016 QX 80\nNissan 2011-2015 Leaf\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to execute arbitrary code. This may allow an attacker to disable the infotainment system of the vehicle and affect functional features of the vehicle. According to affected auto manufacturers, these vulnerabilities do not directly affect the critical safety features of the vehicle.\nMITIGATION\nContinental has validated the reported vulnerabilities but has not yet identified a mitigation plan.\nNissan and Infiniti have issued Technical Service Bulletins (TSB) asking dealers to advise customers of the issue and offer a free 2G TCU deactivation. Nissan/Infiniti’s 2G cellular service provider no longer provides 2G services in the U.S. The subject 2G TCUs are no longer connected to telematics services and no longer perform any function in the affected vehicles. Nissan/Infiniti have stated that this campaign is being performed out of abundance of caution to help safeguard against potential cybersecurity issues.\nNissan/Infiniti proposes that users contact their local Infiniti or Nissan dealers to have the subject 2G TCUs deactivated free of charge.\nBMW has validated the vulnerabilities and will be offering a service measure to affected customers.\nFord, since 2016, has had a customer satisfaction program to update or disable legacy 2G modems and there are a limited number of vehicles left on the market. Ford is reviewing the researcher’s findings through internal processes and evaluating the need for any additional steps.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nStack-based buffer overflow CWE-121\n\nAn attacker with a physical connection to the TCU may exploit a buffer overflow condition that exists in the processing of AT commands. This may allow arbitrary code execution on the baseband radio processor of the TCU.\nCVE-2017-9647 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\n\nA vulnerability in the temporary mobile subscriber identity (TMSI) may allow an attacker to access and control memory. This may allow remote code execution on the baseband radio processor of the TCU.\nCVE-2017-9633 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nMickey Shkatov, Jesse Michael, and Oleksandr Bazhaniuk of the Advanced Threat Research Team at McAfee have reported the vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-9633",
    "CVE-2017-9647"
  ],
  "techniques": [],
  "advisory": "icsa-17-208-01",
  "title": "Continental AG Infineon S-Gold 2 (PMB 8876) | CISA",
  "source": "ics-advisories",
  "id": "daccc4932dcdb43ae6f5c2ae0708eb76065f07a7a85e3522fd8e351c72aaa58f"
}