{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.6\nATTENTION: Exploitable remotely  \nVendor: Siemens \nEquipment: SINEC NMS \nVulnerability: Deserialization of Untrusted Data \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow attackers with write access to the logback configuration file to execute arbitrary code on the system. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SINEC NMS, a network management system, are affected: \n\nAll versions prior to v1.0.3 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 DESERIALIZATION OF UNTRUSTED DATA CWE-502 \nIn Siemens SINEC NMS logback version 1.2.7 and prior, an attacker with the required privileges to edit configuration files could craft malicious packages allowing the execution arbitrary code loaded from LDAP servers.\nCVE-2021-42550 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy  \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA. \n4. MITIGATIONS\nSiemens recommends updating to version 1.0.3 or later. \nSiemens identified the following workaround and mitigation customers can apply to reduce risk: \n\nRestrict the write access to the logback configuration file (logback.xml) to trusted personnel. \n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends  configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals. \nFor more information, see Siemens Security Advisory SSA-371761 in HTML or CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity. \n",
  "cves": [
    "CVE-2021-42550"
  ],
  "techniques": [],
  "advisory": "icsa-22-314-03",
  "title": "Siemens SINEC Network Management System Logback Component | CISA",
  "source": "ics-advisories",
  "id": "78210e8f6ba916aa5b7a878f42855385b194b42e5d7e1d9635e6e2d6300f90f0"
}