{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.0\nATTENTION: Low attack complexity/public exploits are available\nVendor: Rockwell Automation\nEquipment: FactoryTalk Software, Enhanced HIM for PowerFlex, Connected Components Workbench\nVulnerability: Type Confusion\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Rockwell products are affected:\n\nFactoryTalk Linx Enterprise software: Versions 6.20, 6.21, and 6.30\nEnhanced HIM (eHIM) for PowerFlex 6000T: Version 1.001\nConnected Components Workbench software: Versions 11, 12, 13, and 20\nFactoryTalk View Site Edition: Version 13\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nRockwell Automation has been made aware of a third-party vulnerability present in multiple vendor components currently in use. Due to how Rockwell Automation uses the Chromium web browser, exploitation of this vulnerability may cause the affected products to become temporarily unavailable. As a result, the CVSS Score was adjusted to reflect how this vulnerability affects these Rockwell products.\nCVE-2022-1096 has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation is in the process of testing and validating the patch and will update this advisory for each product as updated firmware becomes available.\nUsers currently utilizing the FactoryTalk View Site Edition should avoid using the web browser control if it is not required for the intended use of the product.\nUsers currently utilizing the FactoryTalk View Site Edition web browser can manually download and apply the updated version of WebView2 by performing these recommended actions: \n\nReplace the Microsoft WebView2 file in the C:\\Program Files (x86)\\Rockwell Software\\RS View Enterprise\\Microsoft.WebView2.FixedVersionRuntime directory by copying and pasting the new version of the software into the folder. \nUsers should be sure to not remove the contents of the folder before pasting the new file.\n\nUsers currently utilizing Enhanced HIM (eHIM) for Power Flex 6000T drives should perform the following recommended actions to address the vulnerability: \n\nUpdate the Microsoft Edge browser to Version 99.0.1150 or later.\nApply the update for eHIM when made available.\n\nIf applying the mitigations noted above is not feasible, then see Rockwell Automation’s Knowledgebase article, Security Best Practices (login required), for additional recommendations for maintaining adequate environment security posture.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nThis vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-1096"
  ],
  "techniques": [],
  "advisory": "icsa-22-209-01",
  "title": "Rockwell Products Impacted by Chromium Type Confusion | CISA",
  "source": "ics-advisories",
  "id": "110eb998f347581634df7208a6dfcc6874fed28e44d81fc50d2cf1b9b5ee2426"
}