{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Low skill level to exploit\nVendor: Mitsubishi Electric\nEquipment: Mitsubishi Electric FR Configurator2\nVulnerabilities: Improper Restriction of XML External Entity Reference, Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may enable arbitrary files to be read or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Mitsubishi FR Configurator2, used for configuring Mitsubishi variable frequency drives, are affected:\n\nFR Configurator2 Version 1.16S and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nThis vulnerability is triggered when input passed to the XML parser is not sanitized while parsing the XML project and/or template file (.frc2). Once a user opens the file, the attacker could read arbitrary files.\nCVE-2019-10976 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:H). \n3.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThis vulnerability can be triggered when an attacker provides the target with a rogue project file (.frc2). Once a user opens the rogue project, CPU exhaustion occurs, which causes the software to quit responding until the application is restarted.\nCVE-2019-10972 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nApplied Risk reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi Electric has released Version 1.17T for the reported vulnerabilities. Additional information about the vulnerabilities and how to obtain the update can be found at the following location:\nhttps://www.mitsubishielectric.com/fa/download/software/drv/inv/vulnerability-protection/2019-001.pdf\nAdditional information about the vulnerabilities or Mitsubishi Electric's compensating control is available by contacting a local Mitsubishi Electric representative, which can be found at the following location:\nhttps://us.mitsubishielectric.com/fa/en/about-us/distributors\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nBe careful with files from untrusted sources.\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2019-10976",
    "CVE-2019-10972"
  ],
  "techniques": [],
  "advisory": "icsa-19-204-01",
  "title": "Mitsubishi Electric FR Configurator2 | CISA",
  "source": "ics-advisories",
  "id": "ab3018c1d9c23daeb545c5053862857ea4bf1c9fae1ee47825eeb4e157687c20"
}