{
  "markdown": "\nOVERVIEW\nEvgeny Druzhinin, Alexey Osipov, Ilya Karpov, and Gleb Gritsai of Positive Technologies have identified several vulnerabilities in Inductive Automation’s Ignition Software. Inductive Automation has produced a patch that mitigates these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Inductive Automation product is affected:\n\nInductive Automation Ignition 7.7.2\n\nIMPACT\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nInductive Automation is a Folsom, California-based supplier of web-based industrial automation software.\nThe affected product, Ignition, is an updated version of FactoryPMI, offered by Inductive Automation. Ignition is a human-machine interface/SCADA product used in a variety of industrial applications. According to Inductive Automation, Ignition is deployed across several sectors including Communications, Energy, Food and Agriculture, and Water and Wastewater Systems. Inductive Automation estimates that this product is used primarily in North and South America, Europe, Australia, and across Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nCROSS-SITE SCRIPTING (XSS)CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting'), http://cwe.mitre.org/data/definitions/79.html, web site last accessed March 31, 2015.\n\nAn attacker may cause dangerous content to be executed through a vulnerable web application. The server reads data directly from the HTTP request and reflects it back in the HTTP response.\nCVE-2015-0976NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0976, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.9 has been assigned; the CVSS vector string is (AV:L/AC:H/Au:N/C:C/I:C/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:H/Au:N/C:C/I:C/A:P, web site last accessed March 31, 2015.\n\nINFORMATION EXPOSURE THROUGH ERROR MESSAGECWE-209: Information Exposure Through an Error Message http://cwe.mitre.org/data/definitions/209.html, web site last accessed March 31, 2015.\n\nThis page contains an error/warning message that may disclose sensitive information. The message can also contain the location of the file that produced the unhandled exception.\nCVE-2015-0991NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0991, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:P/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:P/I:N/A:N, web site last accessed March 31, 2015.\n\nINSECURE STORAGE OF SENSITIVE INFORMATIONCWE-922: Insecure Storage of Sensitive Information http://cwe.mitre.org/data/definitions/922.html, web site last accessed March 31, 2015.\n\nOPC Server username and password stored in setting file is in clear text.\nCVE-2015-0992NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0992, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.2 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:S/C:C/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:S/C:C/I:P/A:N, web site last accessed March 31, 2015.\n\nINSUFFICIENT SESSION EXPIRATIONCWE-613: Insufficient Session Expiration , https://cwe.mitre.org/data/definitions/613.html, web site last accessed March 31, 2015.\n\nAfter user logs out, the session is not removed. This could lead to session reuse by attacker with privileges of the same user.\nCVE-2015-0993NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0993, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.5 has been assigned; the CVSS vector string is (AV:A/AC:H/Au:S/C:P/I:C/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:A/AC:H/Au:S/C:P/I:C/A:P, web site last accessed March 31, 2015.\n\nCREDENTIALS MANAGEMENTCWE-255: Credentials Management https://cwe.mitre.org/data/definitions/255.html, web site last accessed March 31, 2015.\n\nThe mechanism of blocking brute force attacks could be bypassed with resetting session id parameter in HTTP request.\nCVE-2015-0994NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0994, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 4.6 has been assigned; the CVSS vector string is (AV:N/AC:H/Au:S/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:H/Au:S/C:P/I:P/A:P, web site last accessed March 31, 2015.\n\nUSE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORTCWE-916: Use of Password Hash With Insufficient Computational Effort http://cwe.mitre.org/data/definitions/916.html, web site last accessed March 31, 2015.\n\nDatabase storage of accounts by default in Windows and Database storage of accounts by default in Linux. Used hash algorithm - MD5, is known to be vulnerable to brute force attacks and not considered secure.\nCVE-2015-0995NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0995, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 9.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:S/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:S/C:C/I:C/A:C, web site last accessed March 31, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities are not exploitable remotely and cannot be exploited without user interaction. The exploit is only triggered when a local user runs the vulnerable application and loads the malformed URL to the JNLP.\nEXISTENCE OF EXPLOIT\nExploits that target these vulnerabilities are not publicly available.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nInductive Automation has developed a patch for these vulnerabilities and recommends updating as soon as possible. The patch is available at:\nhttps://www.inductiveautomation.com/downloads/ignition\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2015-0991",
    "CVE-2015-0994",
    "CVE-2015-0992",
    "CVE-2015-0993",
    "CVE-2015-0995",
    "CVE-2015-0976"
  ],
  "techniques": [],
  "advisory": "icsa-15-090-01",
  "title": "Inductive Automation Ignition Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "a809a90b291417f8bf56df0c7f33610938de92685a4fee5e2c2ae11f8bcf8aea"
}