{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low attack complexity\nVendor: AVEVA\nEquipment: AVEVA Edge products (formerly known as InduSoft Web Studio)\nVulnerability: Uncontrolled Search Path Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in an attacker achieving arbitrary code execution and privilege escalation by tricking AVEVA Edge to load an unsafe DLL.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following AVEVA Edge products (formerly known as InduSoft Web Studio) are affected:\n\nAVEVA Edge: 2020 R2 SP2 and prior\n\n3.2 Vulnerability Overview\n3.2.1 UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nThe vulnerability, if exploited, could allow a malicious entity with access to the file system to achieve arbitrary code execution and privilege escalation by tricking AVEVA Edge to load an unsafe DLL.\nCVE-2023-6132 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nTing Chen of UESTC discovered and disclosed this vulnerability to AVEVA. ADLab of Venustech discovered and disclosed this vulnerability to AVEVA.\n4. MITIGATIONS\nAVEVA recommends users upgrade to AVEVA Edge 2023, or AVEVA Edge 2020 R2 SP2 P01 as soon as possible. Upgrades can be downloaded from the AVEVA official website: AVEVA Edge 2023, AVEVA Edge 2020 R2 SP2 P01.\n\nNote: Log-in is required.\n\nFor additional information, please refer to AVEVA's security advisory AVEVA-2024-002.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nFebruary 1, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-6132"
  ],
  "techniques": [],
  "advisory": "icsa-24-032-03",
  "title": "AVEVA Edge products (formerly known as InduSoft Web Studio) | CISA",
  "source": "ics-advisories",
  "id": "56256374db81bef488d26a001e3293579f5bc723f5167726cf2d5aa47b432185"
}