{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Web Server of SCALANCE X200\nVulnerabilities: Heap-based Buffer Overflow, Stack-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-103-07 Siemens Web Server of SCALANCE X200 that was published April 13, 2021, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause a buffer overflow condition resulting in remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSCALANCE X200-4P IRT: All versions prior to 5.5.1\nSCALANCE X201-3P IRT: All versions prior to 5.5.1\nSCALANCE X201-3P IRT PRO: All versions prior to 5.5.1\nSCALANCE X202-2 IRT: All versions prior to 5.5.1\nSCALANCE X202-2P IRT (incl. SIPLUS NET variant): All versions prior to 5.5.1\nSCALANCE X202-2P IRT PRO: All versions prior to 5.5.1\nSCALANCE X204 IRT: All versions prior to 5.5.1\nSCALANCE X204 IRT PRO: All versions prior to 5.5.1\nSCALANCE XF201-3P IRT: All versions prior to 5.5.1\nSCALANCE XF202-2P IRT: All versions prior to 5.5.1\nSCALANCE XF204 IRT: All versions prior to 5.5.1\nSCALANCE XF204-2BA IRT: All versions prior to 5.5.1\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSCALANCE X204-2 (incl. SIPLUS NET variant): All versions prior to 5.2.5\nSCALANCE X204-2FM: All versions prior to 5.2.5\nSCALANCE X204-2LD (incl. SIPLUS NET variant): All versions prior to 5.2.5\nSCALANCE X204-2LD TS: All versions prior to 5.2.5\nSCALANCE X204-2TS: All versions prior to 5.2.5\nSCALANCE X206-1: All versions prior to 5.2.5\nSCALANCE X206-1LD: All versions prior to 5.2.5\nSCALANCE X208 (incl. SIPLUS NET variant): All versions prior to 5.2.5\nSCALANCE X208PRO: All versions prior to 5.2.5\nSCALANCE X212-2 (incl. SIPLUS NET variant): All versions prior to 5.2.5\nSCALANCE X212-2LD: All versions prior to 5.2.5\nSCALANCE X216: All versions prior to 5.2.5\nSCALANCE X224: All versions prior to 5.2.5\nSCALANCE XF204: All versions prior to 5.2.5\nSCALANCE XF204-2 (incl. SIPLUS NET variant): All versions prior to 5.2.5\nSCALANCE XF206-1: All versions prior to 5.2.5\nSCALANCE XF208: All versions prior to 5.2.5\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nIncorrect processing of POST requests in the web server may result in an out-of-bounds write in the heap. An attacker could leverage this to cause a denial-of-service condition and remotely execute code.\nCVE-2021-25668 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nIncorrect processing of POST requests in the web server may write out-of-bounds in the stack. An attacker could leverage this to cause a denial-of-service condition or remotely execute code.\nCVE-2021-25669 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends upgrading the following products to v5.5.1:\n\nSCALANCE X200-4P IRT\nSCALANCE X201-3P IRT\nSCALANCE X201-3P IRT PRO\nSCALANCE X202-2 IRT\nSCALANCE X202-2P IRT (incl. SIPLUS NET variant)\nSCALANCE X202-2P IRT PRO\nSCALANCE X204 IRT\nSCALANCE X204 IRT PRO\nSCALANCE XF201-3P IRT\nSCALANCE XF202-2P IRT\nSCALANCE XF204 IRT\nSCALANCE XF204-2BA IRT\n\n--------- Begin Update A Part 2 of 2 ---------\nSiemens recommends upgrading the following products to v5.2.5 or later:\n\nSCALANCE X204-2 (incl. SIPLUS NET variant)\nSCALANCE X204-2FM\nSCALANCE X204-2LD (incl. SIPLUS NET variant) SCALANCE X204-2LD TS\nSCALANCE X204-2TS\nSCALANCE X206-1\nSCALANCE X206-1LD\nSCALANCE X208 (incl. SIPLUS NET variant)\nSCALANCE X208PRO\nSCALANCE X212-2 (incl. SIPLUS NET variant)\nSCALANCE X212-2LD\nSCALANCE X216\nSCALANCE X224\nSCALANCE XF204\nSCALANCE XF204-2 (incl. SIPLUS NET variant)\nSCALANCE XF206-1\nSCALANCE XF208\n\n--------- End Update A Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nLimit network traffic of web servers of Scalance X switches to trusted connections by firewall rules (Ports 443/TCP and 80/TCP).\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-187092\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-25668",
    "CVE-2021-25669"
  ],
  "techniques": [],
  "advisory": "icsa-21-103-07",
  "title": "Siemens Web Server of SCALANCE X200 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "17c9c711883e64adf1c4e25793f2da554b9763e3934e1d854afd232838d3f3bd"
}