{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Low skill level to exploit\nVendor: National Renewable Energy Laboratory (NREL)\nEquipment: EnergyPlus\nVulnerability: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of EnergyPlus, an Energy simulation program, are affected:\n\nEnergyPlus Versions 8.6.0 and potentially prior releases\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThe application fails to prevent an exception handler from being overwritten with arbitrary code.\nCVE-2019-10974 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:L).\n3.3 BACKGROUND\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: United States\n3.4 RESEARCHER\nKarn Ganeshen reported this vulnerability to CISA.\n4. MITIGATIONS\nIt is recommended that users update the application to the latest available release, v9.0.1 or later, available at the following location:\nhttps://energyplus.net/\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-10974"
  ],
  "techniques": [],
  "advisory": "icsa-19-204-02",
  "title": "NREL EnergyPlus | CISA",
  "source": "ics-advisories",
  "id": "cbd6110a93583591c41d554f7b24d472f11d4e3ef549422a7eb4ae145aada575"
}