{
  "markdown": "\nCVSS v3 10\nATTENTION: Remotely exploitable. Low skill level is needed to exploit.\nVendor: Red Lion Controls, AutomationDirect\nEquipment: Sixnet-Managed Industrial Switches and STRIDE-Managed Ethernet Switches\nVulnerability: Use of Hard-coded Cryptographic Keys\nAFFECTED PRODUCTS\nThe following Red Lion Controls Sixnet-Managed Industrial Switches are affected:\n\nSixnet-Managed Industrial Switches running firmware Version 5.0.196 and prior.\n\nThe following AutomationDirect STRIDE-Managed Ethernet Switch models, which are manufactured by Red Lion Controls, are affected:\n\nStride-Managed Ethernet Switches running firmware Version 5.0.190 and prior.\n\nIMPACT\nSuccessful exploitation of the hard-coded cryptographic key vulnerabilities could result in loss of data confidentiality, integrity, and availability.\nMITIGATION\nRed Lion Controls has released SLX firmware Version 5.3.174 to address the hard-coded cryptographic keys issue.\nRed Lion Controls recommends updating to SLX firmware Version 5.3.174, found here:\nhttp://www.redlion.net/ethernet-switches-software-firmware\nAutomation Direct recommends updating to Stride Managed Ethernet firmware Version 5.3.174, found here:\nhttp://support.automationdirect.com/firmware/binaries.html\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nUSE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\n\nA hard-coded cryptographic key vulnerability was identified. Vulnerable versions of Stride-Managed Ethernet switches and Sixnet-Managed Industrial switches use hard-coded HTTP SSL/SSH keys for secure communication. Because these keys cannot be regenerated by users, all products use the same key. The attacker could disrupt communication or compromise the system.\nCVE-2016-9335 has been assigned to this vulnerability. A CVSS v3 base score of 10 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\nRESEARCHER\nMark Cross of RIoT Solutions identified these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Deployed worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2016-9335"
  ],
  "techniques": [],
  "advisory": "icsa-17-054-02",
  "title": "Red Lion Controls Sixnet-Managed Industrial Switches, AutomationDirect STRIDE-Managed Ethernet Switches Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "2812812998c5043aabe6daf984566b4b0df63cbff902ac13ef2f8acc1fd4695f"
}