{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.9\nATTENTION: Low attack complexity \nVendor: Landis+Gyr \nEquipment: E850 (ZMQ200) \nVulnerability: Reliance on Cookies without Validation and Integrity \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition for the end user that the cookie was modified for. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of E850 (ZMQ200) are affected: \n\nE850 (ZMQ200): All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 RELIANCE ON COOKIES WITHOUT VALIDATION AND INTEGRITY CWE-784\nLandis+Gyr E850 (ZMQ200) web application navigation depends on the value of the session cookie. The web application could become inaccessible for the user if an attacker changes the cookie values. \nCVE-2022-3083 has been assigned to this vulnerability. A CVSS v3 base score of 3.9 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:N/I:L/A:L). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n3.4 RESEARCHER\nAarón Flecha Menéndez and Gabriel Vía Echezarreta of S21Sec reported this vulnerability to CISA.\n4. MITIGATIONS\nLandis+Gyr has fixed this vulnerability and recommends users update to the latest version. For information on how to obtain this update, users should reach out to Landis+Gyr support. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-3083"
  ],
  "techniques": [],
  "advisory": "icsa-23-026-07",
  "title": "Landis+Gyr E850 | CISA",
  "source": "ics-advisories",
  "id": "8f266ca99bd31b370474ef25a14425ab816fa0d4e7b2e3f72c501cdb9d7e580a"
}