{
  "markdown": "\nOVERVIEW\nThis updated advisory is a follow-up to the original advisory titled ICSA-16-287-05 Moxa ioLogik E1200 Series Vulnerabilities that was published October 13, 2016, on the NCCIC/ICS-CERT web site.\n--------- Begin Update A Part 1 of 4 --------\nAlexandru Ariciu of Applied Risk has identified vulnerabilities in Moxa’s ioLogik E1200 series and ioLogik E2200 series devices. Moxa has produced a new edition of the firmware to mitigate these vulnerabilities. Alexandru Ariciu has tested the firmware to validate that it resolves the vulnerabilities.\n--------- End Update A Part 1 of 4 ----------\nThese vulnerabilities could be exploited remotely. Exploits that target these vulnerabilities are known to be publicly available.\nAFFECTED PRODUCTS\nMoxa reports that the vulnerabilities affect the following products:\n\nioLogik E1210, firmware Version V2.4 and prior,\nioLogik E1211, firmware Version V2.3 and prior,\nioLogik E1212, firmware Version V2.4 and prior,\nioLogik E1213, firmware Version V2.5 and prior,\nioLogik E1214, firmware Version V2.4 and prior,\nioLogik E1240, firmware Version V2.3 and prior,\nioLogik E1241, firmware Version V2.4 and prior,\nioLogik E1242, firmware Version V2.4 and prior,\nioLogik E1260, firmware Version V2.4 and prior,\nioLogik E1262, firmware Version V2.4 and prior,\n\n--------- Begin Update A Part 2 of 4 --------\n\nioLogik E2210, firmware versions prior to V3.13,\nioLogik E2212, firmware versions prior to V3.14,\nioLogik E2214, firmware versions prior to V3.12,\nioLogik E2240, firmware versions prior to V3.12,\nioLogik E2242, firmware versions prior to V3.12,\nioLogik E2260, firmware versions prior to V3.13, and\nioLogik E2262, firmware versions prior to V3.12\n\n--------- End Update A Part 2 of 4 ----------\nIMPACT\nAn attacker who exploits these vulnerabilities may be able to remotely execute arbitrary code, modify parameters and settings, or reset the device.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nMoxa is a Taiwan-based company that maintains offices in several countries around the world, including the US, UK, India, Germany, France, China, Russia, and Brazil.\n--------- Begin Update A Part 3 of 4 --------\nThe affected products, ioLogik E1200 series and E2200 series, are remote I/O for use in monitoring. According to Moxa, ioLogik is deployed across several sectors, including Commercial Facilities and Energy. Moxa estimates that these products are used primarily in the United States, Europe, and Asia.\n--------- End Update A Part 3 of 4 ----------\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nCROSS-SITE SCRIPTINGCWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting'), https://cwe.mitre.org/data/definitions/79.html, web site last accessed October 13, 2016.\n\nThe web application fails to sanitize user input, which may allow an attacker to inject script or execute arbitrary code.\nCVE-2016-8359NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8359, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H, web site last accessed October 13, 2016.\n\nINSUFFICIENTLY PROTECTED CREDENTIALSCWE-522: Insufficiently Protected Credentials, https://cwe.mitre.org/data/definitions/522.html, web site last accessed October 13, 2016.\n\nA password is transmitted in a format that is not sufficiently secure.\nCVE-2016-8372NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8372, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed October 13, 2016.\n\nWEAK PASSWORD REQUIREMENTSCWE-521: Weak Password Requirements, https://cwe.mitre.org/data/definitions/521.html, web site last accessed October 13, 2016.\n\nUsers are restricted to using short passwords.\nCVE-2016-8379NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8379, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed October 13, 2016.\n\nCROSS-SITE REQUEST FORGERYCWE-352: Cross-Site Request Forgery (CSRF), https://cwe.mitre.org/data/definitions/352.html, web site last accessed October 13, 2016.\n\nThe web application may not sufficiently verify whether a request was provided by a valid user.\nCVE-2016-8350NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8350, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed October 13, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nDetailed vulnerability information is publicly available that could be used to develop an exploit that targets these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nMoxa has created new firmware to mitigate these vulnerabilities. It recommends that all users upgrade to the latest version. Moxa recommends installing the latest edition of the firmware, which can be downloaded at the following location:\n\nioLogik E1210 V2.5:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12462\n\nioLogik E1211 V2.4:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12469\n\nioLogik E1212 V2.5:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12467\n\nioLogik E1213 V2.6:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12466\n\nioLogik E1214 V2.5:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12464\n\nioLogik E1240 V2.4:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12460\n\nioLogik E1241 V2.5:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12461\n\nioLogik E1242 V2.5:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12458\n\nioLogik E1260 V2.5:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12463\n\nioLogik E1262 V2.5:\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=12465\n--------- Begin Update A Part 4 of 4 --------\n\nioLogik E2210 V3.13\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=13567\n\nioLogik E2212 V3.14\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=13568\n\nioLogik E2214 V3.12\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=13569\n\nioLogik E2240 V3.12\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=13570\n\nioLogik E2242 V3.12\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=13571\n\nioLogik E2260 V3.13\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=13572\n\nioLogik E2262 V3.12\n\nhttp://www.moxa.com/support/DownloadFile.aspx?type=support&id=13573\n--------- End Update A Part 4 of 4 ----------\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-8379",
    "CVE-2016-8359",
    "CVE-2016-8372",
    "CVE-2016-8350"
  ],
  "techniques": [],
  "advisory": "icsa-16-287-05a",
  "title": "Moxa ioLogik E1200 Series Vulnerabilities (Update A) | CISA",
  "source": "ics-advisories",
  "id": "1a7e84fe2f7194db84d52d642016cd0b71e710d34326a7238e96ad542abebbcd"
}