{
  "markdown": "\nCVSS v3 7.4\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: SIMATIC Sm@rtClient Android App\nVulnerabilities: Man-in-the-Middle, Authentication Bypass Using an Alternate Path or Channel\nAFFECTED PRODUCTS\nSiemens reports that the vulnerabilities affect the following SIMATIC Sm@rtClient Android apps for remote operation and monitoring of SIMATIC HMI systems:\n\nSIMATIC WinCC Sm@rtClient for Android: All versions prior to V1.0.2.2\nSIMATIC WinCC Sm@rtClient Lite for Android: All versions prior to V1.0.2.2\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker in a privileged network position to read and modify data within a Transport Layer Security TLS session.\nMITIGATION\nSiemens has released SIMATIC WinCC Sm@rtClient V1.0.2.2 for Android to address these vulnerabilities and recommends updating as soon as possible. Updates will be installed automatically if the mobile device is configured accordingly. If the update does not install automatically, users can find the latest version at the Google Play Store:\nhttps://play.google.com/store/search?q=Sm@rtClient\nIt is advised to configure the environment according to operational guidelines.\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-589378 at the following location:\nhttp://www.siemens.com/cert/advisories\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nCHANNEL ACCESSIBLE BY NON-ENDPOINT ('MAN-IN-THE-MIDDLE') CWE-300\n\nThe existing TLS protocol implementation could allow an attacker to read and modify data within a TLS session while performing a man-in-the-middle attack. This vulnerability affects only SIMATIC WinCC Sm@rtClient for Android.\nCVE-2017-6870 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n\nAUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\n\nAn attacker with physical access to an unlocked mobile device that has the affected app running could bypass the app’s authentication mechanism under certain conditions.  SIMATIC WinCC Sm@rtClient Lite for Android is only affected by this vulnerability.\nCVE-2017-6871 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:L/UI:N/S:U/C:H/I:L/A:N).\nRESEARCHER\nKarsten Sohr and Timo Glander from the TZI at the University of Bremen reported these vulnerabilities to Siemens.\nBACKGROUND\nCritical Infrastructure Sector: Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-6870",
    "CVE-2017-6871"
  ],
  "techniques": [],
  "advisory": "icsa-17-194-03",
  "title": "Siemens SIMATIC Sm@rtClient Android App | CISA",
  "source": "ics-advisories",
  "id": "51d6c85b5a178c379e343121416ba67da5d6dd0468050606136063880d24ad66"
}