{
  "markdown": "\nCVSS v3 6.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: OSIsoft\nEquipment: PI Vision\nVulnerabilities: Protection Mechanism Failure, Information Exposure\nAFFECTED PRODUCTS\nThe following versions of PI Vision, a data visualization framework, are affected:\n\nPI Vision versions 2017 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow remote code execution and expose information.\nMITIGATION\nOSIsoft recommends that users upgrade to PI Vision 2017 R2 Update 1. Obtain the update from OSIsoft.\nOSIsoft has released the following alert:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00338\nNOTE: PI Vision 2017 R2 Update 1 also addresses PI Web API vulnerabilities. Please see the following OSIsoft alerts:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00337\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00336\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nPROTECTION MECHANISM FAILURE CWE-693\n\nX-XSS-Protection response header is not set to block, allowing attempts at reflected cross-site scripting.\nCVE-2018-7504 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n\nINFORMATION EXPOSURE CWE-200\n\nServer response header and referrer-policy response header each provide unintended information disclosure.\nCVE-2018-7496 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\nRESEARCHER\nOSIsoft self-reported the vulnerabilities to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Multiple Sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2018-7496",
    "CVE-2018-7504"
  ],
  "techniques": [],
  "advisory": "icsa-18-072-03",
  "title": "OSIsoft PI Vision | CISA",
  "source": "ics-advisories",
  "id": "9284d541588cb08c7aaf7e30a29bf98c6f81fea26cc9bb04fb9957cc718eb729"
}