{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Triangle MicroWorks\nEquipment: DNP3 Outstation Libraries\nVulnerability: Stacked-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could possibly allow remote attackers to stop the execution of code on affected equipment.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DNP3 Outstation .NET Protocol components and DNP3 Outstation ANSI C source code libraries are affected:\n\n3.16.00 through 3.25.01\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nA specially crafted message may cause a stack-based buffer overflow. Authentication is not required to exploit this vulnerability.\nCVE-2020-6996 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nIncite Team of Steven Seeley and Chris Anastasio working with Trend Micro’s Zero Day Initiative reported this vulnerability to Triangle MicroWorks.\n4. MITIGATIONS\nTriangle Microworks recommends users update to Version 3.26.\nPlease contact Triangle MicroWorks support for additional details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-6996"
  ],
  "techniques": [],
  "advisory": "icsa-20-105-02",
  "title": "Triangle MicroWorks DNP3 Outstation Libraries | CISA",
  "source": "ics-advisories",
  "id": "9a5b981a5623fdb1fd9de759bc8afce085b648b7f76e7e42a4f654fb054298ce"
}