{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely\nVendor: Schneider Electric\nEquipment: Easergy T300\nVulnerability: Missing Authentication for Critical Function, Missing Authorization, Missing Encryption of Sensitive Data, Improper Restriction of Rendered UI Layers or Frames\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain unauthorized access to the internal product LAN, which could result in exposure of sensitive information, denial of service, and remote code execution when access to a resource from an attacker is not restricted or incorrectly restricted.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports this vulnerability affects the following firmware versions of the Easergy T300 products:\n\nEasergy T300 with firmware Versions 2.7 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product is vulnerable to a missing authentication for critical function vulnerability, which may allow an attacker to expose information, cause a denial-of-service condition, and remotely execute arbitrary code.\nCVE-2020-7561 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:H/A:H).\n3.2.2    MISSING AUTHORIZATION CWE-862\nThe affected product is vulnerable to a missing authorization vulnerability, which may allow an attacker to gain access to sensitive information, cause a denial-of-service condition, and remotely execute arbitrary code when access control checks are not applied consistently.\nCVE-2020-28215 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.2.3    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nThe affected product is vulnerable to a missing encryption of sensitive data vulnerability, which may allow an attacker to read network traffic over HTTP protocol.\nCVE-2020-28216 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.4    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nThe affected product is vulnerable to a missing encryption of sensitive data vulnerability, which may allow an attacker to read network traffic over IEC60870-5-104 protocol.\nCVE-2020-28217 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:C/C:L/I:H/A:L).\n3.2.5    IMPROPER RESTRICTION OF RENDERED UI LAYERS OR FRAMES CWE-1021\nThe affected product is vulnerable due to an improper restriction of rendered UI layers or frames vulnerability, which may allow an attacker to trick a user into initiating an unintended action.\nCVE-2020-28218 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:C/C:N/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Energy, Food and Agriculture, Government Facilities, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nEvgeniy Druzhinin and IIya Karpov of Rostelecom-Solar and an anonymous researcher reported these vulnerabilities to Schneider Electric.\n4. MITIGATIONS\nSchneider Electric recommends users upgrade to v2.7.1, which is available from the Schneider Electric Customer Care Center. Alternatively, users may disable port forwarding in the product firewall.\nSchneider Electric strongly recommends the following industry cybersecurity best practices:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls so no unauthorized personnel can access industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in “Program” mode.\nNever connect programming software to any network other than the network for which the devices are intended.\nScan all methods of mobile data exchange with the isolated network (e.g., CDs, USB drives, etc.) before use in the terminals or any node connected to these networks.\nNever allow mobile devices that have connected to any other network, besides the intended network, to connect to the safety or control networks without proper sanitation. \nMinimize network exposure for all control system devices and systems and ensure that they are not accessible from the Internet. \nWhen remote access is required, use secure methods, such as virtual private networks (VPNs). Recognize that VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand that VPNs are only as secure as the connected devices. \n\nFor more information refer to the Schneider Electric Recommended Cybersecurity Best Practices document.\nRefer to Schneider Electric’s security bulletin SEVD-2020-315-06 for specific mitigation details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-28217",
    "CVE-2020-7561",
    "CVE-2020-28215",
    "CVE-2020-28218",
    "CVE-2020-28216"
  ],
  "techniques": [],
  "advisory": "icsa-20-343-03",
  "title": "Schneider Electric Easergy T300 | CISA",
  "source": "ics-advisories",
  "id": "63403c650866dcfcae57579fc9e3857983fb36f20af9d92e89c23279575f6026"
}