{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.6\n\nATTENTION: Low skill level to exploit\nVendor: Hetronic\nEquipment: Nova-M\nVulnerability: Authentication Bypass by Capture-Replay\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthorized users to view commands, replay commands, control the device, or stop the device from running.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hetronic remote control transmitters and receivers are affected:Transmitters:\n\nNova-M: all versions prior to r161,\n\nReceivers:\n\nES-CAN-HL: all versions prior to Main r1864, Estop_v24,\nBMS-HL: all versions prior to Main r1175, Estop_v24,\nMLC: all versions prior to Main r1600, Estop_v24, and\nDC Mobile: all versions prior to Main r515, Estop_v24.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nThese devices use fixed codes that are reproducible by sniffing and re-transmission. This can lead to unauthorized replay of a command, spoofing of an arbitrary message, or keeping the controlled load in a permanent “stop” state.\nCVE-2018-19023 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJonathan Andersson, Philippe Z Lin, Akira Urano, Marco Balduzzi, Federico Maggi, Stephen Hilt, and Rainer Vosseler working with Trend Micro’s Zero Day Initiative reported this vulnerability to NCCIC.\n4. MITIGATIONS\nHetronic recommends that all Nova-M users update their radio transmitters to firmware version r161 and their receivers to the following versions:\n\nES-CAN-HL: Main r1864, Estop_v24\nBMS-HL: Main r1175, Estop_v24\nMLC: Main r1600, Estop_v24\nDC Mobile: Main r515, Estop_v24\n\nThe new firmware patches can be obtained free of charge by signing in to the Hetronic website portal or by bringing the transmitter and receiver to any Hetronic service center. A list of service centers can be found at the following link:\nhttp://www.hetronic.com/contact-us/find-a-partner\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-19023"
  ],
  "techniques": [],
  "advisory": "icsa-19-003-03",
  "title": "Hetronic Nova-M | CISA",
  "source": "ics-advisories",
  "id": "66dfd663fd98d3e35d03639b844eeb47d09f87f30ab6bb2f72f697540f150c4a"
}