{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 5.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: CC-Link IE TSN Industrial Managed Switch\nVulnerability: Allocation of Resources Without Limits or Throttling\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a temporary denial-of service (DoS) condition in the web service on the product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CC-Link IE TSN Industrial Managed Switch are affected:\n\nNZ2MHG-TSNT8F2: Versions 05 and prior\nNZ2MHG-TSNT4: Versions 05 and prior\n\n3.2 Vulnerability Overview\n3.2.1 Allocation of Resources Without Limits or Throttling CWE-770\nMitsubishi Electric CC-Link IE TSN Industrial Managed Switch has an OpenSSL vulnerability that allows an attacker to cause a temporary denial-of service (DoS) condition on the web service of the product by getting a legitimate administrator user to import specially crafted certificate that makes the product experience notable to very long delays.\nCVE-2023-2650 has been assigned to this vulnerability. A CVSS v3.1 base score of 2.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:L).\nA CVSS v4 score has also been calculated forCVE-2023-2650. A base score of 5.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:H/UI:N/VC:N/VI:N/VA:L/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends users to update to the fixed versions by following the steps below.\n[Fixed versions]\n\nCC-Link IE TSN Industrial Managed Switch NZ2MHG-TSNT8F2: Version \"06\" or later\nCC-Link IE TSN Industrial Managed Switch NZ2MHG-TSNT4: Version \"06\" or later\n\n[Update steps]\n\nContact your local Mitsubishi Electric representative to obtain the fixed firmware version file for CC-Link IE TSN Industrial Managed Switch.\nAfter logging into NZ2MHG-TSNT8F2 or NZ2MHG-TSNT4 through the web interface, update the firmware to the fixed firmware version file mentioned in the above 1. by the function of [System] -> [System Management] -> [Firmware Upgrade] from Function menu. For the detailed procedures, please refer to \"CC-Link IE TSN Industrial Managed Switch User's Manual (SH-082449ENG)\".\n\nMitsubishi Electric recommends that customers take the following mitigations to minimize the risk of exploiting this vulnerability:\n\nWhen internet access is required, use a virtual private network (VPN) or other means to prevent unauthorized access.\nUse the products within a LAN and block access from untrusted networks and hosts.\nRestrict physical access to the product and your computer and network equipment on the same network.\nAfter you log into NZ2MHG-TSNT8F2 or NZ2MHG-TSNT4 through the web interface, change user name and password from default setting at [Account Management] displayed on the function menu. Also, set the proper access permissions for the users.\n\nFor additional information see Mitsubishi Electric advisory 2024-002\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJune 6, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-2650"
  ],
  "techniques": [],
  "advisory": "icsa-24-158-03",
  "title": "Mitsubishi Electric CC-Link IE TSN Industrial Managed Switch | CISA",
  "source": "ics-advisories",
  "id": "212bc4df8c71c4e606a2263726fc942b024d482a7c5505f0a1c069af078a168b"
}