{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 9.3\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available/known public exploitation\nVendor: AVTECH SECURITY Corporation\nEquipment: IP camera\nVulnerability: Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to inject and execute commands as the owner of the running process.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following AVTECH IP camera was identified as being affected; it is suspected that prior versions of other IP cameras and NVR (network video recorder) products are also affected:\n\nAVM1203: firmware version FullImg-1023-1007-1011-1009 and prior\n\n3.2 Vulnerability Overview\n3.2.1 COMMAND INJECTION CWE-77\nCommands can be injected over the network and executed without authentication.\nCVE-2024-7029 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-7029. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Financial Services, Healthcare and Public Health, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nLarry Cashdollar of Akamai Technologies reported this vulnerability to CISA.An anonymous third-party organization confirmed Akamai's report and identified specific affected products and firmware versions.\n4. MITIGATIONS\nAVTECH SECURITY Corporation has not responded to requests to work with CISA to mitigate these vulnerabilities. Users of the affected products are encouraged to contact AVTECH for additional information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n5. UPDATE HISTORY\n\nAugust 1, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-7029"
  ],
  "techniques": [],
  "advisory": "icsa-24-214-07",
  "title": "AVTECH IP Camera | CISA",
  "source": "ics-advisories",
  "id": "62b65afc2b5ade22f18dbefef923b30a1a39511395adfbc9824ae0699e971098"
}