{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: GE\nEquipment: MU320E\nVulnerabilities: Use of Hard-coded Password, Execution with Unnecessary Privileges, Inadequate Encryption Strength\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to escalate unnecessary privileges and use hard-coded credentials to take control of the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following firmware versions of MU320E are affected:\n\nAll firmware versions prior to v04A00.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED PASSWORD CWE-259\nThe software contains a hard-coded password that could allow an attacker to take control of the merging unit using these hard-coded credentials.\nCVE-2021-27452 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250\nA miscommunication in the file system allows adversaries with access to the MU320E to escalate privileges.\nCVE-2021-27448 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    INADEQUATE ENCRYPTION STRENGTH CWE-326\nSSH server configuration file does not implement some best practices. This could lead to a weakening of the SSH protocol strength, which could lead to additional misconfiguration or be leveraged as part of a larger attack.\nCVE-2021-27450 has been assigned to this vulnerability. A CVSS v3 base score of 3.8 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:H/UI:R/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nTom Westenberg of Thales UK reported these vulnerabilities to GE.\n4. MITIGATIONS\nGE recommends MU320E users upgrade to firmware v04A00.1 or higher to mitigate these vulnerabilities.\nInstructions on how to upgrade the MU320E firmware and verify its installation are available in the product user’s manual.\nSee GE publication number: GES-2021-003 for more information.\nGE recommends MU320E devices be protected using network defense-in-depth practices. This includes, but is not limited to, placing MU320E devices inside the control system network security perimeter, and having access controls, monitoring (such as an Intrusion Detection System), and other mitigating technologies in place. Many electric utilities have deployed cyber security solutions in accordance with the NERC-CIP implementation requirements. Please refer to the product secure deployment guide.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-27448",
    "CVE-2021-27450",
    "CVE-2021-27452"
  ],
  "techniques": [],
  "advisory": "icsa-21-082-02",
  "title": "GE MU320E | CISA",
  "source": "ics-advisories",
  "id": "779b2f65ef4928f6c28bf0be3fb07581d8f5c6a55853b19c669b308458203c80"
}