{
  "markdown": " Canary Labs Inc Trend Link Insecure ActiveX Control Method \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryCanary Labs Inc Trend Link Insecure ActiveX Control Method========================================================== Last Revised April 30, 2013 Alert Code ICSA\\-13\\-098\\-01Overview-------- This advisory provides mitigation details for a vulnerability in the Canary Labs, Inc. Trend Link software. Researcher Kuang\\-Chun Hung of Security Research and Service Institute−Information and Communication Security Technology Center (ICST) has identified an insecure ActiveX control method vulnerability in Canary Labs, Inc. Trend Link ActiveX control. Canary Labs, Inc. has updated Trend Link, and Kuang\\-Chun Hung has tested the patch and verified that it mitigates the vulnerability. If exploited, an attacker could influence the paths or file names that are used in the software application. This could affect systems using Trend Link in the critical manufacturing and energy sectors in the United States, South America, and Europe. This vulnerability could be exploited remotely.Affected Products----------------- Canary Lab, Inc. reports that the vulnerabilities affect the following products:* Trend Link Versions 9\\.0\\.2\\.27051 and prior.Impact------ Successful exploit of this vulnerability could result in a denial of service (DoS) or remote code execution. Impact to individual organizations depends on many factors that are unique to each organization. ICS‑CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- Canary Labs, Inc. is a US\\-based company that has products deployed in 24 countries, including the United States, South America, and Europe. The affected product, Trend Link,Canary Labs, Inc. Trend Link, http://www.canarylabs.com/software/canary\\-trend\\-link, Web site last accessed April 08, 2013\\. is a trending application that can be used in SCADA systems. According to Canary Labs, Inc., these products are deployed across several sectors including the critical manufacturing and energy sectors.Vulnerability Characterization------------------------------### Vulnerability Overview#### Insecure ActiveX Control MethodCWE\\-73: External Control of File Name or Path, http://cwe.mitre.org/data/definitions/73\\.html, Web site last accessed April 08, 2013\\. Trend Link uses an ActiveX control that contains an insecure ActiveX control method. This control is loaded from “TrendDisplay.dll,” and contains a method called “SaveToFile” that allows users to save arbitrary files to any location on the server hosting the control. This vulnerability could result in a DoS or allow remote code execution. CVE\\-2012\\-3022NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2012\\-3022, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7\\.9 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:S/C:N/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=(AV:N/AC:M/Au:S/C:N/I:C/A:C), Web site last accessed April 08, 2013\\.### Vulnerability Details#### Exploitability This vulnerability can be exploited remotely.#### Existence of Exploit No known public exploits specifically target this vulnerability.#### Difficulty An attacker with medium skill could exploit this vulnerability.Mitigation---------- Canary Labs, Inc. has published a customer notification concerning this vulnerability.  Trend Link customers who wish to obtain the update and instructions on how to apply it should contact Canary Labs product support: Canary Labs Product SupportCanary Labs Product Support, http://www.canarylabs.com/services\\-and\\-support/product\\-support, Web site last accessed April 08, 2013\\. 814\\-793\\-3770[support@canarylabs.com](mailto:support@canarylabs.com)  ICS‑CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies *.CSSP Recommended Practices, http://www.us\\-cert.gov/control\\_systems/practices/Recommended\\_Practices.html, Web site last accessed April 08, 2013\\.*  ICS‑CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS\\-TIP\\-12\\-146\\-01B—Targeted Cyber Intrusion Detection and Mitigation Strategies.Targeted Cyber Intrusion Detection and Mitigation Strategies, http://www.us\\-cert.gov/control\\_systems/pdf/ICS\\-TIP\\-12\\-146\\-01B.pdf, Web site last accessed April 08, 2013\\. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS‑CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Canary Labs, Inc.-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-13-098-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2012-3022"
  ],
  "techniques": [],
  "advisory": "icsa-13-098-01",
  "title": "Canary Labs Inc Trend Link Insecure ActiveX Control Method | CISA",
  "source": "ics-advisories",
  "id": "4086d90a8765386bad5222aa02ed3145fe49e24c6f1ff3a50207d08b3f881d23"
}