{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: HIWIN\nEquipment: HIWIN Robot System Software (HRSS)\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to cause a denial-of-service condition to the affected product. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version of HIWIN Robot System Software, a human-machine interface (HMI), is affected:\n\nHIWIN HRSS: version 3.3.21.9869\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected product does not properly address the terminated command source. As a result, an attacker could craft code to disconnect HRSS and the controller, causing a denial-of-service condition.\nCVE-2022-3382 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nYenting Lee of TXOne Networks reported this vulnerability to CISA.\n4. MITIGATIONS\nHIWIN has not responded to requests to work with CISA to mitigate these vulnerabilities. Users of these affected products are invited to contact HIWIN Technical Support or HIWIN Customer Service for additional information.\nThe researcher recommends the following mitigations to reduce the risk of exploitation:\n\nWhen internet access is required, use firewalls, virtual private networks (VPNs), or other access control measures to prevent unauthorized access to the affected product.\nUse network monitoring and other defense measures to ensure the affected product is not accessible from untrusted packets and hosts.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-3382"
  ],
  "techniques": [],
  "advisory": "icsa-22-279-02",
  "title": "HIWIN Robot System Software (HRSS) | CISA",
  "source": "ics-advisories",
  "id": "ffd05f1486a543da85fe9262568feb3e029fc902d4adce6e1f68a16a8bf7ed7c"
}