{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: TIA Portal and PCS neo\nVulnerability: Improper Access Control\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-040-05 Siemens TIA Administrator that was published February 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow local users to escalate privileges and execute code as a local SYSTEM user.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products, are affected:\n--------- Begin Update A Part 1 of 2 ---------\n\nPCS neo (Administration Console): v3.1\n\n--------- End Update A Part 1 of 2 ---------\n\nTIA Portal: v15, v15.1, and v16\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected product has improper access controls, which may allow an attacker to execute code with SYSTEM privileges. \nCVE-2020-25238 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nWill Dormann from CERT Coordination Center (CERT/CC) reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has released the following update and recommends it be applied:\nTia Portal: Update TIA Administrator to v1.0 SP2 Upd2 or later version\n--------- Begin Update A Part 2 of 2 ---------\n\nSIMATIC PCS neo: Update to v3.1 or later version\n\n--------- End Update A Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict local access to authorized users.\nFor PCS neo apply measures described in Industrial Security in SIMATIC PCS neo\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens security advisory SSA-428051\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-25238"
  ],
  "techniques": [],
  "advisory": "icsa-21-040-05",
  "title": "Siemens TIA Administrator (Update A) | CISA",
  "source": "ics-advisories",
  "id": "3d7d37c6c6674a46e633e25955f9388d623da667384574166a5bbeaf7b824230"
}