{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9 \nATTENTION: Exploitable remotely/low attack complexity \nVendor: Hitachi Energy \nEquipment: MicroSCADA System Data Manager SDM600 \nVulnerabilities: Unrestricted Upload of File with Dangerous Type, Improper Authorization, Improper Resource Shutdown or Release, Improper Privilege Management \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to take remote control of the product. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hitachi Energy’s MicroSCADA SDM600, a data management tool, are affected: \n\nSDM600: Versions prior to v1.2 FP3 HF4 (Build Nr. 1.2.23000.291) \nSDM600: Versions prior to v1.3.0 (Build Nr. 1.3.0.1339) \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434 \nA vulnerability exists in the affected SDM600 versions file permission validation. An attacker could exploit the vulnerability by gaining access to the system and uploading a specially crafted message to the system node, which could result in arbitrary code execution. \nCVE-2022-3682 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). \n3.2.2 IMPROPER AUTHORIZATION CWE-285 \nA vulnerability exists in the affected SDM600 versions application programmable interface (API) web services authorization validation implementation. An attacker successfully exploiting the vulnerability could read sensitive data directly from an insufficiently protected or restricted data store.\nCVE-2022-3683 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:N/I:H/A:N). \n3.2.3 IMPROPER RESOURCE SHUTDOWN OR RELEASE CWE-404 \nA vulnerability exists in an SDM600 endpoint. An attacker could exploit this vulnerability by running multiple parallel requests, causing the SDM600 web services to become busy, rendering the application unresponsive. \nCVE-2022-3684 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.4 IMPROPER PRIVILEGE MANAGEMENT CWE-269 \nA vulnerability exists in the affected SDM600 versions software. The software operates at a privilege level higher than the minimum level required. An attacker successfully exploiting this vulnerability could escalate privileges. \nCVE-2022-3685 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:H). \n3.2.5 IMPROPER AUTHORIZATION CWE-285 \nA vulnerability exists in the affected SDM600 versions API permission check mechanism. Successful exploitation could cause an unauthenticated user to gain access to device data, causing confidentiality and integrity issues. \nCVE-2022-3686 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:L). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA. \n4. MITIGATIONS\nHitachi Energy recommends applying the following mitigations: \n\nAll SDM600 versions prior to v1.2 FP3 HF4 (Build Nr. 1.2.23000.291): Update to v1.3.0.1339 \nSDM600 versions prior to v1.3.0 (Build Nr. 1.3.0.1339): Apply workaround detailed below. \n\nHitachi Energy recommends the following security practices and firewall configurations to help protect a process control network from attacks originating from outside the network:  \n\nPractice principles of least privileges to minimize permissions and accesses to SDM600 related resources. \nFollow security practices defined in SDM600 security deployment guidelines. \nPhysically protect process control systems from unauthorized direct access.  \nDo not directly connect control systems networks to the internet.  \nSeparate process control systems from other networks using a firewall system with a minimal number of open ports.  \nProcess control systems should not be used for internet surfing, instant messaging, or receiving emails.  \nPortable computers and removable storage media should be carefully scanned for viruses prior connection to a control system.  \n\nFor more information, see Hitachi security advisory 8DBD000138. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-3683",
    "CVE-2022-3685",
    "CVE-2022-3686",
    "CVE-2022-3682",
    "CVE-2022-3684"
  ],
  "techniques": [],
  "advisory": "icsa-23-096-05",
  "title": "Hitachi Energy MicroSCADA System Data Manager SDM600 | CISA",
  "source": "ics-advisories",
  "id": "855ed12f77598f4d91efbd6082474e896d58c6abc22ab145b16cf6a1d2f5f918"
}