{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ABB\nEquipment: Power Generation Information Manager (PGIM) and Plant Connect\nVulnerability: Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to bypass authentication and extract credentials from the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Power Generation Information Manager (PGIM) and Plant Connect monitoring platforms are affected:\n\nPower Generation Information Manager (PGIM): All versions\nPlant Connect: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nThe affected product is vulnerable to authentication bypass, which may allow an attacker to remotely bypass authentication and extract credentials from the affected device.\nCVE-2019-18250 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nRikard Bodforss of Bodforss Consulting reported this vulnerability to ABB.\n4. MITIGATIONS\nABB reports PGIM will transition to a limited support phase in January, 2020, and Plant Connect is already obsolete.\nUsers are advised to upgrade to Symphony Plus Historian, which is not affected by this vulnerability. Symphony Plus Historian is the successor to the PGIM and Plant Connect products and features improved cybersecurity.\nABB further recommends users of PGIM not use the same credentials for Windows login as used to log into the PGIM and Plant Connect applications. Additionally, end users who cannot immediately upgrade should consider protecting network communication by use of IPSec or other means. Users should contact ABB for additional support details.\nFor additional instructions and support, please contact ABB service at: https://new.abb.com/contact-centers\nInformation about ABB’s cybersecurity program and capabilities can be found at: http://www.abb.com/cybersecurity\nFor more information, see ABB’s security advisory 8VZZ002158.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-18250"
  ],
  "techniques": [],
  "advisory": "icsa-19-318-05",
  "title": "ABB Power Generation Information Manager (PGIM) and Plant Connect | CISA",
  "source": "ics-advisories",
  "id": "4b45cae09a80edfbec499fc6670e0d4e0d0b2028b67e806f86811e1b3fd211e7"
}