{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely\nVendor: ICONICS\nEquipment: GENESIS64, GENESIS32\nVulnerabilities: Out-of-Bounds Write, Deserialization of Untrusted Data, Code Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow remote code execution or denial of service.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products using GenBroker64, Platform Services, Workbench, FrameWorX Server; v10.96 and prior are affected:\n\nGENESIS64\nHyper Historian\nAnalytiX\nMobileHMI\n\nThe following products using GenBroker32 v9.5 and prior are affected:\n\nGENESIS32\nBizViz\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nA specially crafted communication packet sent to the affected GENESIS64 GenBroker64 or GENESIS32 GenBroker32 systems could cause a denial-of-service condition or allow remote code execution.\nCVE-2020-12011 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA specially crafted communication packet sent to the affected GENESIS64 Platform Services could cause a denial-of-service condition due to a deserialization issue.\nCVE-2020-12015 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA specially crafted communication packet sent to the affected GENESIS64 Workbench Pack-and-Go function could cause a denial-of-service condition due to a deserialization vulnerability.\nCVE-2020-12009 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94\nA specially crafted WCF client that interfaces to the GENESIS64 FrameWorX Server may allow the execution of certain arbitrary SQL commands remotely.\nCVE-2020-12013 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L).\n3.2.5    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA specially crafted communication packet sent to the affected GENESIS64 FrameWorX Server could allow remote code execution and a denial-of-service condition due to a deserialization vulnerability.\nCVE-2020-12007 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nTobias Scharnowski, Niklas Breitfeld, Ali Abbasi, Yehuda Anikster of Claroty; Pedro Ribeiro and Radek Domanski of Flashback; Ben McBride of Oak Ridge National Laboratory; and Steven Seeley and Chris Anastasio of Incite reported these vulnerabilities to ICONICS.\n4. MITIGATIONS\nICONICS is releasing a patch for v10.96, v10.95.5, and v10.95.2 of GENESIS64.\nICONICS is releasing a patch for v9.4 and v9.5 of GENESIS32. \nICONICS recommends users update to the latest software versions. \nMore information on these vulnerabilities and associated mitigations can be found in ICONICS Whitepapers on Security Vulnerabilities.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-12015",
    "CVE-2020-12009",
    "CVE-2020-12013",
    "CVE-2020-12011",
    "CVE-2020-12007"
  ],
  "techniques": [],
  "advisory": "icsa-20-170-03",
  "title": "ICONICS GENESIS64, GENESIS32 | CISA",
  "source": "ics-advisories",
  "id": "31bfe9ba8d89cfd1cadd1326ad6941153515edef61db548555e3438eb856a4a8"
}