{
  "markdown": "\nOVERVIEW\nThis updated advisory is a follow-up to the updated advisory titled ICSA-15-012-01A CodeWrights GmbH HART DTM Vulnerability that was published January 13, 2015, on the NCCIC/ICS-CERT web site.\nAlexander Bolshev of Digital Security has identified an improper input validation vulnerability in CodeWrights GmbH HART Device Type Manager (DTM) libraries. CodeWrights GmbH produces DTM libraries for vendors of HART DTM products. CodeWrights GmbH has updated the libraries that mitigate this vulnerability. Using CodeWrights GmbH’s updated library for HART DTM, Emerson has tested the new library to validate that it resolves the vulnerability.\nAFFECTED PRODUCTS\nAny DTM written by CodeWrights GmbH DTMStudio prior to 1.5.151 is impacted. These libraries can be identified by a filename DDCH*Lib, where “*” is a wildcard string. Libraries prior to Version 1.4.181 are impacted.\nCodeWrights GmbH’s customers include the following vendor companies:\n\nABB, (Please refer to the ABB web page, http://www.abb.com/cawp/abbzh254/2c9d1261d9fa1dcfc1257950002e4fbf.aspx, where ABB will publish notifications if any products are found to be affected by this vulnerability.)\nBerthold Technologies,\nEmerson,\nEndress+Hauser,\nMagnetrol, and\nPepperl+Fuchs.\n\nOther companies may be impacted and ICS-CERT will issue advisories for each vendor identified as remediation efforts are addressed. This advisory will be updated as necessary.\nIMPACT\nThe vulnerability causes a buffer overflow in the HART component crashing the DTM component and the Field Device Tool (FDT) Frame application.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nCodeWrights GmbH is a German-based company that provides device integration and management solutions. The affected library is a component within the FDT/DTM application used to integrate HART devices.\nCodeWrights GmbH supplies components that are used in DTMs of other vendors. HART DTM is deployed across several sectors including Chemical, Commercial Facilities, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems, and other sectors. CodeWrights GmbH estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATIONCWE-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20.html, web site last accessed January 12, 2015.\n\nBy sending specially crafted response packets to the 4 mA to 20 mA current loop, the DTM component stops functioning and the FDT Frame Application becomes unresponsive.\nCVE-2014-9191NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-9191, web site last accessed January 12, 2015. has been assigned to this vulnerability. A CVSS v2 base score of 1.8 has been assigned; the CVSS vector string is (AV:A/AC:H/Au:N/C:N/I:N/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:A/AC:H/Au:N/C:N/I:N/A:P, web site last accessed January 12, 2015.\nVULNERABILITY DETAILS\n--------- Begin Update B Part 1 of 1 --------\nEXPLOITABILITY\nThis exploit is possible from any adjacent network between the FDT/DTM frame application and the HART transmitter on the 4 mA to 20 mA current loop.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult. Compromised access at any point between the HART transmitter and Frame Application with DTM will allow a malicious user to unencapsulate, modify, re-encapsulate, and send malicious packets. This exploit requires timing the spoofed response to crash the FDT/DTM components. This increases the difficulty of a successful exploit.\n--------- End Update B Part 1 of 1 ----------\nMITIGATION\nCodeWrights GmbH has developed an updated library to address this vulnerability. These libraries are being provided to its customers (vendors) with current support agreements.\nICS-CERT recommends contacting the vendor if using HART DTM technology to determine if the products are vulnerable and what remediation steps should be taken.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (www.ics-cert.org).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2014-9191"
  ],
  "techniques": [],
  "advisory": "icsa-15-012-01b",
  "title": "CodeWrights GmbH HART DTM Vulnerability (Update B) | CISA",
  "source": "ics-advisories",
  "id": "3ba9a69e9f2ff9f7fcea4026011c12b56d71096e5d24cf8d4a76ebedd2ca4f9b"
}