{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: Studio 5000 Logix Designer, RSLogix 5000, Logix Controllers\nVulnerability: Insufficiently Protected Credentials\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-056-03 Rockwell Automation Logix Controllers that was published February 25, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote unauthenticated attacker to bypass the verification mechanism and connect with Logix controllers. Additionally, this vulnerability could enable an unauthorized third-party tool to alter the controller’s configuration and/or application code.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 2 --------\nThe following versions of Rockwell software are affected:\n\nRSLogix 5000: Versions 16 through 20\nStudio 5000 Logix Designer: Versions 21 and later\nFactoryTalk Security, part of the FactoryTalk Services Platform, if configured and deployed v2.10 and later\n\n--------- End Update A Part 1 of 2 ---------\nThe following Rockwell Logix Controllers are affected:\n\nCompactLogix 1768\nCompactLogix 1769\nCompactLogix 5370\nCompactLogix 5380\nCompactLogix 5480\nControlLogix 5550\nControlLogix 5560\nControlLogix 5570\nControlLogix 5580\nDriveLogix 5560\nDriveLogix 5730\nDriveLogix 1794-L34\nCompact GuardLogix 5370\nCompact GuardLogix 5380\nGuardLogix 5570\nGuardLogix 5580\nSoftLogix 5800\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nStudio 5000 Logix Designer uses a key to verify Logix controllers are communicating with the affected Rockwell Automation products. The product is vulnerable because an unauthenticated attacker could bypass this verification mechanism and authenticate with Logix controllers.\nCVE-2021-22681 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nThe vulnerability was independently co-discovered by Lab. of Information Systems Security Assurance (Eunseon Jeong, Youngho An, Junyoung Park, Insu Oh, Kangbin Yim) of Soonchunhyang University, Kaspersky, and Sharon Brizinov and Tal Keren of Claroty.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 --------\nRockwell Automation has determined this vulnerability cannot be mitigated with a patch. Rockwell encourages users to combine its specific risk mitigation recommendations with general security guidelines for a comprehensive defense-in-depth strategy.\nA comprehensive defense-in-depth strategy can reduce the risk of this vulnerability. To reduce risk, Rockwell recommends users ensure they are employing proper network segmentation and security controls; including, but not limited to:\n\nMinimizing network exposure for all control system devices and/or systems and confirm these devices are not accessible from the Internet.\nLocating control system networks and devices behind firewalls and isolating them from the enterprise/business network.\nRestricting or blocking traffic on TCP 44818 from outside of the industrial control system network zone. For more information on the TCP/UDP ports used by Rockwell Automation products, see BF7490 (login required). \nWhen remote access is required, use secure methods such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. VPN is only as secure as the connected devices.\n\nUsers should refer to the Converged Plantwide Ethernet (CPwE) Design and Implementation Guide for best practices for deploying network segmentation, as well as broader defense-in-depth strategies. Users can also refer to Rockwell Automation’s System Security Design Guidelines on how to use Rockwell Automation products to improve the security of industrial automation systems. \nCommon Industrial Protocol (CIP) Security mitigates this vulnerability as it provides the ability to deploy TLS- and DTLS-based secure communications to supported products. CIP Security is an enhancement to the ODVA (Open DeviceNet Vendors Association) EtherNet/IP industrial communication standard and directly addresses this vulnerability. CIP Security allows users to leverage and manage certificates and/or pre-shared keys, and does not make use of any hardcoded keys.\nUsers requiring setup or deployment guidance for CIP Security protocol should refer to the CIP Security deployment reference guide.\n--------- End Update A Part 2 of 2 --------\nAdditionally, Rockwell recommends users follow the following risk mitigation and recommended user actions for the following product family and versions:\n\nControlLogix 5580 v32 or later:\n\nPut controller’s mode switch to “Run” mode.\nIf the above cannot be deployed, the followings mitigations are recommended:\n\nDeploy CIP Security for Logix Designer connections through the front port. CIP Security prevents unauthorized connection when deployed properly.\nIf not using the front port, use a 1756-EN4TR ControlLogix Ethernet/IP Module and deploy CIP Security. The 1756-EN4TR supports CIP Security which prevents unauthorized connections when properly deployed.\n\n\n\n\nControlLogix 5580 v31:\n\nPut controller’s mode switch to “Run” mode.\nIf the above cannot be deployed, the following mitigations are recommended:\n\nApply v32 or later and follow mitigations actions outlined above.\nIf unable to apply a newer version, use a 1756-EN4TR ControlLogix EtherNet/IP Module and deploy CIP Security. The 1756-EN4TR supports CIP Security, which prevents unauthorized connections when properly deployed.\n\n\n\n\nControlLogix 5570 v31 or later:\n\nPut controller’s mode switch to “Run” mode.\nIf the above cannot be deployed, the following mitigations are recommended:\n\nUse a 1756-EN4TR ControlLogix EtherNet/IP Module and deploy CIP Security. The 1756-EN4TR supports CIP Security, which prevents unauthorized connections when properly deployed.\n\n\n\n\nControlLogix 5580 v28-v30, ControlLogix 5570 v18 or later, ControlLogix 5560 v16 or later, ControlLogix 5550 v16, GuardLogix 5580 v31 or later, GuardLogix 5570 v20 or later, GuardLogix 5560 v16 or later, 1768 CompactLogix v16 or later, 1769 CompactLogix v16 or later, CompactLogix 5370 v20 or later, CompactLogix 5380 v28 or later, CompactLogix 5480 v32 or later, Compact GuardLogix 5370 v28 or later, Compact GuardLogix 5380 v31 or later, FlexLogix 1794-L34 v16, DriveLogix 5370 v16 or later.\n\nPut controller’s mode switch to “Run” mode.\n\n\nSoftLogix 5800: No additional mitigation available. Follow the Converged Plantwide Ethernet (CPwE) Design and Implementation Guide.\n\nIn addition, Rockwell recommends users employ the following methods to detect changes to configuration or application files:\n\nMonitor controller change log for any unexpected modifications or anomalous activity.\nIf using v17 or later, utilize the Controller Log feature.\nIf using v20 or later, utilize Change Detection in the Logix Designer Application.\nIf available, use the functionality in Factory Talk AssetCentre to detect changes.\n\nRockwell Automation has published a security advisory that further describes how this vulnerability affects the Studio 5000 Logix Designer software and associated controllers.\nRequests for additional information can be sent to the Rockwell RASecure Inbox (rasecure@ra.rockwell.com).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-22681"
  ],
  "techniques": [],
  "advisory": "icsa-21-056-03",
  "title": "Rockwell Automation Logix Controllers (Update A) | CISA",
  "source": "ics-advisories",
  "id": "9a5e600d7d1914f91ef49d83f3c977a5dc1c32767b33ef8192890a2baf5f4ca4"
}