{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls, Inc.\nEquipment: Illustra\nVulnerability: Off-by-one Error\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a local attacker to obtain super user access to the underlying Linux operating system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports this vulnerability affects the following Sensormatic Electronics Illustra camera systems:\n\nPro Gen 3, All versions prior to 2.8.0\nFlex Gen 2, All versions prior to 1.9.4\nPro 2, All versions\nInsight, All versions prior to 1.4.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OFF-BY-ONE ERROR CWE-193\nUnder specific circumstances, a local attacker could exploit this vulnerability to obtain super user access to the underlying Linux operating system.\nCVE-2021-3156 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls reported this vulnerability to CISA.\n4. MITIGATIONS\nUsers are recommended update to one of the following firmware versions:\n\nPro Gen 3, upgrade to Version 2.8.0\nFlex Gen 2, upgrade to Version 1.9.4\nPro 2 is EOL\nInsight, upgrade to Version 1.4.0\n\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-13\nJohnson Controls recommends taking steps to minimize risks to all building automation systems.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nRestrict physical access to the device to authorized personnel only.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-3156"
  ],
  "techniques": [],
  "advisory": "icsa-21-245-01",
  "title": "Johnson Controls Sensormatic Electronics Illustra | CISA",
  "source": "ics-advisories",
  "id": "961eb1de64ca7f579d725912e02c5c20fee1358fae9d417de0216133ef380ecb"
}