{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: GOT and Tension Controller\nVulnerability: Buffer Access with Incorrect Length Value\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-131-02 Mitsubishi Electric GOT and Tension Controller that was published May 11, 2021, to the ICS webpage on www.cisa.gov/uscert/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may be able to stop the communication function of the products, requiring a reset to regain functionality.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the vulnerability affects the MODBUS/TCP slave communication function of the following devices:\n\nGOT2000 series\n\nGT27 model: Versions 01.19.000 - 01.38.000\nGT25 model: Versions 01.19.000 - 01.38.000\nGT23 model: Versions 01.19.000 - 01.38.000\nGT21 model: Versions 01.21.000 - 01.39.000\n\n\nGOT SIMPLE series\n\nGS21 model: Versions 01.21.000 - 01.39.000\n\n\nGT SoftGOT2000: Versions 1.170C - 1.250L\nLE7-40GU-L Screen package data for MODBUS/TCP: v1.00\n\nPlease see Mitsubishi Electric report number 2021-002 to learn how to check which version is in use.\n4.2 VULNERABILITY OVERVIEW\n4.2.1    BUFFER ACCESS WITH INCORRECT LENGTH VALUE CWE-805\nAn attacker could exploit this vulnerability to cause a denial-of-service condition in the MODBUS/TCP server communication function of GOT2000 series, GOT SIMPLE series, SoftGOT2000 and Tension Controller.\nCVE-2021-20589 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nParul Sindhwad and Dr. Faruk Kazi of COE-CNDS Lab, VJTI, Mumbai, India reported this vulnerability to Mitsubishi Electric.\n5. MITIGATIONS\nMitsubishi Electric has created the following versions to address this vulnerability:\n\nGOT2000 series: GT27 model, GT25 model, and GT23 model: update to 01.39.000 or later.\nGOT2000 series: GT21 model: update to 01.40.000 or later.\nGOT SIMPLE series GS21 model: update to 01.40.000 or later.\nGT SoftGOT2000: update to 1.255R or later.\n\n--------- Begin Update A Part 1 of 1 ---------\n\nLE7-40GU-L Screen package data for MODBUS/TCP: update to v1.01 or later.\n\n--------- End Update A Part 1 of 1 ---------\nPlease refer to the Mitsubishi Electric website for detailed update procedures.\nMitsubishi Electric recommends the following mitigations until users can update to safer versions:\n\nWhen connecting the product to the Internet, use a firewall or virtual private network (VPN) to prevent unauthorized access.\nUse it within the LAN and make it inaccessible from untrusted networks and hosts.\nInstall antivirus software on a computer that can access the product.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High attack complexity.\n",
  "cves": [
    "CVE-2021-20589"
  ],
  "techniques": [],
  "advisory": "icsa-21-131-02",
  "title": "Mitsubishi Electric GOT and Tension Controller (Update A) | CISA",
  "source": "ics-advisories",
  "id": "dbc430df8e7679bec826be41b0508f41ba4fa1b42bb5b89856a9a4c059b44eb3"
}