{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available/known public exploitation\nVendor: Hitron Systems\nEquipment: DVR\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to affect the availability of the product through exploitation of an improper input validation vulnerability and default credentials.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hitron Systems DVR, a digital video recorder, are affected:\n\nDVR HVR-4781: Versions 1.03 through 4.02\nDVR HVR-8781: Versions 1.03 through 4.02\nDVR HVR-16781: Versions 1.03 through 4.02\nDVR LGUVR-4H: Versions 1.02 through 4.02\nDVR LGUVR-8H: Versions 1.02 through 4.02\nDVR LGUVR-16H: Versions 1.02 through 4.02\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER INPUT VALIDATION CWE-20\nAn improper input validation vulnerability exists in Hitron Systems DVR HVR-4781 versions 1.03 through 4.02 that could allow an attacker to cause a denial-of-service condition when using default admin name and password.\nCVE-2024-22768 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.2 IMPROPER INPUT VALIDATION CWE-20\nAn improper input validation vulnerability exists in Hitron Systems DVR HVR-8781 versions 1.03 through 4.02 that could allow an attacker to cause a denial-of-service condition when using default admin name and password.\nCVE-2024-22769 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.3 IMPROPER INPUT VALIDATION CWE-20\nAn improper input validation vulnerability exists in Hitron Systems DVR HVR-16781 versions 1.03 through 4.02 that could allow an attacker to cause a denial-of-service condition when using default admin name and password.\nCVE-2024-22770 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.4 IMPROPER INPUT VALIDATION CWE-20\nAn improper input validation vulnerability exists in Hitron Systems DVR LGUVR-4H versions 1.02 through 4.02 that could allow an attacker to cause a denial-of-service condition when using default admin name and password.\nCVE-2024-22771 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.5 IMPROPER INPUT VALIDATION CWE-20\nAn improper input validation vulnerability exists in Hitron Systems DVR LGUVR-8H versions 1.02 through 4.02 that could allow an attacker to cause a denial-of-service condition when using default admin name and password.\nCVE-2024-22772 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.6 IMPROPER INPUT VALIDATION CWE-20\nAn improper input validation vulnerability exists in Hitron Systems DVR LGUVR-16H versions 1.02 through 4.02 that could allow an attacker to cause a denial-of-service condition when using default admin name and password.\nCVE-2024-23842 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: South Korea\n\n3.4 RESEARCHER\nAline Eliovich, Chad Seaman, and Larry Cashdollar of Akamai Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nHitron Systems has released the following updates for their DVR:\n\nDVR HVR-4781: Version 4.03\nDVR HVR-8781: Version 4.03\nDVR HVR-16781: Version 4.03\nDVR LGUVR-4H: Version 4.03\nDVR LGUVR-8H: Version 4.03\nDVR LGUVR-16H: Version 4.03\nFor more information, see KISA's Security Notice.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA has received reports of this vulnerability being actively exploited.\n5. UPDATE HISTORY\n\nJanuary 30, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-23842",
    "CVE-2024-22769",
    "CVE-2024-22770",
    "CVE-2024-22772",
    "CVE-2024-22771",
    "CVE-2024-22768"
  ],
  "techniques": [],
  "advisory": "icsa-24-030-04",
  "title": "Hitron Systems Security Camera DVR | CISA",
  "source": "ics-advisories",
  "id": "946c805a186a3c130ec808c1dc245b55d40c1944d45aefe2d515667472044e6a"
}