{
  "markdown": " MICROSYS PROMOTIC Stack Buffer Overflow \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryMICROSYS PROMOTIC Stack Buffer Overflow======================================= Last Revised August 27, 2018 Alert Code ICSA\\-15\\-062\\-01OVERVIEW-------- An anonymous researcher working with HP’s Zero Day Initiative has identified a stack\\-based buffer overflow vulnerability in the MICROSYS, spol. s r.o. PROMOTIC application. MICROSYS, spol. s r.o. has produced a new version that mitigates this vulnerability. This vulnerability could be exploited remotely.AFFECTED PRODUCTS----------------- The following PROMOTIC versions are affected:* PROMOTIC versions prior to stable 8\\.2\\.19* PROMOTIC versions prior to development 8\\.3\\.2IMPACT------ Successful exploitation of this vulnerability may result in denial of service or data leakage. Impact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- MICROSYS, spol. s r.o. is a Czech company with headquarters in Ostrava. The affected product, PROMOTIC, is a Microsoft Windows\\-based supervisory control and data acquisition human\\-machine interface (SCADA HMI) software programming suite for creating applications that monitor, control, and display technological processes. This suite also includes support for a web interface. According to MICROSYS, spol. s r.o., PROMOTIC is deployed across several sectors including Critical Manufacturing, Energy, Water and Wastewater Systems, and others. The PROMOTIC system is primarily used in Czech and Slovak Republics. It is also used in Poland, Hungary, Slovenia, Serbia, Bulgaria, and Romania.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### STACK\\-BASED BUFFER OVERFLOWCWE\\-121: Stack\\-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121\\.html, web site last accessed March 03, 2015\\. A demonstration application contains a stack\\-based overflow. This is only vulnerable when this application is running, which limits this vulnerability’s exposure. CVE\\-2014\\-9205NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-9205, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. ZDI has assigned a CVSS v2 base score of 7\\.5; the CVSS vector string is (AV:N/AC:L/Au:N/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:P/I:P/A:P, web site last accessed March 03, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY An attacker with a low skill level would be able to exploit this vulnerability, if the vulnerable demonstration application is running.MITIGATION---------- MICROSYS, spol. s r.o. recommends that customers with affected versions of PROMOTIC update their installations by downloading the latest version and installation instructions from the following MICROSYS, spol. s r.o. web site:<http://www.promotic.eu/en/promotic/download/download.htm> . MICROSYS, spol. s r.o. has produced a news release that contains additional information about new features and bug fixes for available stable and developmental PROMOTIC software versions:[http://www.promotic.eu/en/pmdoc/News.htm\\#ver80105](http://www.promotic.eu/en/pmdoc/News.htm#ver80105)  ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* MICROSYS-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-062-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2014-9205"
  ],
  "techniques": [],
  "advisory": "icsa-15-062-01",
  "title": "MICROSYS PROMOTIC Stack Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "db925c3e00db8f1e447df91a90f3a0396b5c587c38e9d3756f3019567ee778b1"
}