{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: WebAccess/SCADA\nVulnerabilities: Command Injection, Stack-based Buffer Overflow, Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may cause a denial of service and allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WebAccess/SCADA, a SCADA software platform, are affected:\n\nWebAccess/SCADA Versions 8.3.5 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nMultiple command injection vulnerabilities, caused by a lack of proper validation of user-supplied data, may allow remote code execution.\nCVE-2019-6552 has been assigned to these vulnerabilities. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)\n3.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nMultiple stack-based buffer overflow vulnerabilities, caused by a lack of proper validation of the length of user-supplied data, may allow remote code execution.\nCVE-2019-6550 has been assigned to these vulnerabilities. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3   IMPROPER ACCESS CONTROL CWE-284\nAn improper access control vulnerability may allow an attacker to cause a denial-of-service condition.\nCVE-2019-6554 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H)\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, United States, and Europe\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nMat Powell and Natnael Samson (@NattiSamson) working with Trend Micro’s Zero Day Initiative (ZDI) reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nAdvantech has released Version 8.4.0 of WebAccess/SCADA to address the reported vulnerabilities. Users can download the latest version of WebAccess/SCADA at the following location (registration required):\nhttps://support.advantech.com/support/DownloadSRDetail_New.aspx?SR_ID=1-MS9MJV&Doc_Source=Download\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6550",
    "CVE-2019-6552",
    "CVE-2019-6554"
  ],
  "techniques": [],
  "advisory": "icsa-19-092-01",
  "title": "Advantech WebAccess/SCADA | CISA",
  "source": "ics-advisories",
  "id": "193941ecc66d07825445738976e4849a91d21c0ff8a5260659afd9b3ce024f9c"
}