{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: Industrial Real-Time (IRT) Devices\nVulnerability: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-19-283-01 Siemens Industrial Real-Time (IRT) Devices (Update E) published on February 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following products and versions:\n\nCP1604/CP1616: All versions prior to 2.8\nDevelopment/Evaluation Kits for PROFINET IO:\n\nDK Standard Ethernet Controller: All versions prior to 4.1.1 Patch 05\nEK-ERTEC 200: All versions prior to 4.5.0 Patch 01\nEK-ERTEC 200P: All versions prior to 4.5.0\n\n\nSIMATIC ET 200ecoPN (except 6ES7148-6JD00-0AB0 and 6ES7146-6FF00-0AB0): All versions\nSIMATIC PN/PN Coupler 6ES7158-3AD01-0XA0: All versions\nSIMATIC WinAC RTX (F) 2010: All versions prior to SP3\nSINAMICS DCM: All versions prior to 1.5 HF1\nSINAMICS DCP: All versions prior to 1.3\nSINAMICS G110M v4.7 (Control Unit): All versions prior to 4.7 SP10 HF5\nSINAMICS G130 v4.7 (Control Unit): All versions prior to 4.7 HF29\nSINAMICS G150 (Control Unit): All versions prior to 4.8\nSINAMICS GH150 v4.7 (Control Unit): All versions\nSINAMICS GL150 v4.7 (Control Unit): All versions\nSINAMICS GM150 v4.7 (Control Unit): All versions\nSINAMICS S110 (Control Unit): All versions\nSINAMICS S150 (Control Unit): All versions prior to 4.8\nSCALANCE X-200IRT switch family (incl. SIPLUS NET variants): All versions prior to 5.2.1\nSIMATIC ET 200M (incl. SIPLUS variants): All versions\nSIMATIC ET 200S (incl. SIPLUS variants): All versions\nSIMATIC ET 200pro (incl. SIPLUS variants): All versions\n\n---------Begin Update F Part 1 of 1---------\n\nSIMATIC ET200ecoPN, 4AO U/I 4xM12 (6ES7145-6HD00-0AB0): All versions\nSIMATIC ET200ecoPN, 8 DIO, DC24V/1,3A, 8xM12 (6ES7147-6BG00-0AB0): All versions\nSIMATIC ET200ecoPN, 8 DO, DC24V/2A, 8xM12 (6ES7142-6BR00-0AB0): All versions\nSIMATIC ET200ecoPN, 8AI RTD/TC 8xM12 (6ES7144-6KD50-0AB0): All versions\nSIMATIC ET200ecoPN, 8AI; 4 U/I; 4 RTD/TC 8xM12 (6ES7144-6KD00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DI, DC24V, 4xM12 (6ES7141-6BF00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DI, DC24V, 8xM12 (6ES7141-6BG00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DO, DC24V/0,5A, 4xM12 (6ES7142-6BF50-0AB0): All versions\nSIMATIC ET200ecoPN, 8DO, DC24V/1,3A, 4xM12 (6ES7142-6BF00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DO, DC24V/1,3A, 8xM12 (6ES7142-6BG00-0AB0): All versions\nSIMATIC ET200ecoPN, 16DI, DC24V, 8xM12 (6ES7141-6BH00-0AB0): All versions\nSIMATIC ET200ecoPN, 16DO DC24V/1,3A, 8xM12 (6ES7142-6BH00-0AB0): All versions\nSIMATIC ET200ecoPN: IO-Link Master (6ES7148-6JA00-0AB0): All versions\n\n---------End Update F Part 1 of 1---------\n\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to 3.X.17\nSIMATIC S7-400 (incl. F) v6 and below CPU family (incl. SIPLUS variants): All versions\nSIMATIC S7-400 PN/DP v7 CPU family (incl. SIPLUS variants): All versions\nSIMOTION (incl. SIPLUS variants): All versions\nSINAMICS G120 v4.7 Control Unit (incl. SIPLUS variants): All versions prior to 4.7 SP10 HF5\nSINAMICS S120 v4.7 Control Unit and CBE20 (incl. SIPLUS variants): All versions prior to 4.7 HF34\nSINAMICS SL150 v4.7 (Control Unit): All versions prior to 4.7 HF33\nSINAMICS SM120 v4.7 (Control Unit): All versions\nSINUMERIK 828D: All versions prior to 4.8 SP5\nSINUMERIK 840D sl: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nAn attacker sending a specially crafted packet could break the real-time synchronization of the affected installation, which may cause a denial-of-service condition.\nCVE-2019-10923 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Critical Manufacturing, Energy, Food and Agriculture, Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA. Artem Zinenko of Kaspersky reported to Siemens that SIPLUS is also affected.\n5. MITIGATIONS\nSiemens has provided firmware updates for the following products to fix the vulnerability:\n\nCP1604/CP1616: Update to v2.8\nDevelopment/Evaluation Kits for PROFINET IO:\n\nDK Standard Ethernet Controller: Update to v4.1.1 Patch 05\nEK-ERTEC 200: Update to v4.5.0 Patch 01\nEK-ERTEC 200P: Update to v4.5.0\n\n\nSCALANCE X-200IRT: Update to v5.4.2\nSIMATIC WinAC RTX (F) 2010: Update to SP3, apply BIOS and Microsoft Windows updates\nSINAMICS DCM: Update to v1.5 HF1\nSINAMICS G110M v4.7 (Control Unit): Update to v4.7 SP10 HF5\nSINAMICS G120 v4.7 (Control Unit): Update to v4.7 SP10 HF5\nSINAMICS G130 v4.7 (Control Unit): Update to v4.7 HF29 or upgrade to v5.2 HF2\nSINAMICS S120 v4.7 (Control Unit and CBE20): Update to v4.7 HF34 or upgrade to v5.2 HF2\nSINAMICS DCP: Upgrade to v1.3\nSIMATIC S7-300 CPU family: Update to v3.X.17\n\nThe following updates can be obtained from a Siemens representative or via Siemens’ customer service.\n\nSINAMICS GH150 v4.7 (Control Unit): Upgrade to v4.8 SP2 HF9\nSINAMICS GL150 v4.7 (Control Unit): Upgrade to v4.8 SP2 HF9\nSINAMICS GM150 v4.7 (Control Unit): Upgrade to v4.8 SP2 HF9\nSINUMERIK 828D: Update to v4.8 SP5\nSINAMICS SL150 v4.7 (Control Unit): Update to v4.7 HF33\n\nSiemens is preparing further updates and recommends the following mitigations until patches are available:\n\nRestrict network access to Port 161/UDP of the affected product.\nDisable SNMP in Versions 1 and 2c, if supported by the product.\nEnable SNMP v3 if required and supported by the product to prevent unauthorized access of the affected product.\nEnable access protection and change default credentials for SNMP service, if possible.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security, and following the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-349422\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10923"
  ],
  "techniques": [],
  "advisory": "icsa-19-283-01",
  "title": "Siemens Industrial Real-Time (IRT) Devices (Update F) | CISA",
  "source": "ics-advisories",
  "id": "f858dca253b798000b53f2aabf21bd02973cf86f47ec2d2aa99067e9da11a3ec"
}