{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC WinCC\nVulnerabilities: Path Traversal, Insertion of Sensitive Information into Log File\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-315-03 Siemens SIMATIC WinCC (Update D) that was published April 14, 2022, to the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow local attackers to escalate privileges, and read, write, or delete critical files.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affects the following SIMATIC SCADA HMI system products:\n\nOpenPCSPCS 7 v8.2: All versions\nOpenPCS PCS 7 v9.0: All versions prior to v9.0 Upd4\nOpenPCS PCS 7 v9.1: All versions \nSIMATIC BATCH v8.2: All versions\nSIMATIC BATCH v9.0: All versions\nSIMATIC BATCH v9.1: All versions\nSIMATIC NET PC Software v14: All versions\nSIMATIC NET PC Software v15: All versions\n\n--------- Begin Update E Part 1 of 2 ---------\n\nSIMATIC NET PC Software v16: All versions prior to v16 Update 6\n\n--------- End Update E Part 1 of 2 ---------\n\nSIMATIC NET PC Software v17: All versions prior to v17 SP1\nSIMATIC PCS 7 v8.2: All versions\nSIMATIC PCS 7 v9.0: All versions\nSIMATIC PCS 7 V9.1: All versions prior to v9.1 SP1\nSIMATIC Route Control v8.2: All versions\nSIMATIC Route Control v9.0: All versions\nSIMATIC Route Control v9.1: All versions\nSIMATIC WinCC v7.4 and earlier: All versions prior to v7.4 SP1 Update 19\nSIMATIC WinCC v7.5: All versions prior to v7.5 SP2 Update 5\nSIMATIC WinCC v15 and earlier: All versions prior to v15 SP1 Update 7\nSIMATIC WinCC v16: All versions prior to v16 Update 5\nSIMATIC WinCC v17: All versions prior to v17 Update 2\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nLegitimate file operations of the affected systems do not properly neutralize special elements within the pathname. An attacker could cause the pathname to resolve to a location outside of the restricted directory on the server and read, write, or delete critical files.\nCVE-2021-40358 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n4.2.2    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nWhen downloading files, the affected systems do not properly neutralize special elements within the pathname. An attacker could cause the pathname to resolve to a location outside of the restricted directory on the server and read critical files.\nCVE-2021-40359 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.2.3    INSERTION OF SENSITIVE INFORMATION INTO LOG FILE CWE-532\nThe affected systems store sensitive information in log files. An attacker with access to the log files could publicly expose the information or reuse it to develop further attacks.\nCVE-2021-40364 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nThomas Riedmaier from Siemens Energy reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens has released updates for several affected products and recommends updating to the latest versions. Siemens is preparing further updates and recommends specific countermeasures for products where updates are not, or not yet, available.\n\nOpenPCS 7 v8.2: Install SIMATIC WinCC v7.4 SP1 Update 19 or later version\nOpenPCS 7 v9.0: Update to v9.0 Upd4 or later version; v9.0 Upd4 is bundled in PCS 7 v9.0 SP3 UC04\nOpenPCS 7 v9.1: Update to v9.1 SP1 or later version\nSIMATIC BATCH v8.2: Install SIMATIC WinCC v7.4 SP1 Update 19 or later version\nSIMATIC BATCH v9.1: Update to v9.1 SP1 or later version\n\n--------- Begin Update E Part 2 of 2 ---------\n\nSIMATIC NET PC Software v16: Update to v16 Update 6 or later version\n\n--------- End Update E Part 2 of 2 ---------\n\nSIMATIC NET PC Software v17: Update to v17 SP1 or later version\nSIMATIC PCS 7 v8.2: Install SIMATIC WinCC v7.4 SP1 Update 19 or later version\nSIMATIC PCS 7 v9.0: Update to v9.0 SP3 UC04 or later version\nSIMATIC Route Control v8.2: Install SIMATIC WinCC v7.4 SP1 Update 19 or later version\nSIMATIC Route Control v9.1: Update to v9.1 SP1 or later version\nSIMATIC PCS 7 v9.1: Update to v9.1 SP1 or later version\nSIMATIC WinCC v7.5: Update to v7.5 SP2 Update 5 or later version\nSIMATIC WinCC v15 and earlier: Update to v15 SP1 Update 7 or later version\nSIMATIC WinCC v16: Update to v16 Update 5 or later version\nSIMATIC WinCC v17: Update to v17 Update 2 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nHarden the application’s host to prevent local access by untrusted personnel\nDisable the webserver or only enable it temporarily, when needed\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manuals.\nFor more information about this issue, please see Siemens security advisory SSA-840188\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-40358",
    "CVE-2021-40359",
    "CVE-2021-40364"
  ],
  "techniques": [],
  "advisory": "icsa-21-315-03",
  "title": "Siemens SIMATIC WinCC (Update E) | CISA",
  "source": "ics-advisories",
  "id": "87e4344e2f8996e9b9fee686f6018614212f2db7745e97e26f162b2680ddb6cb"
}