{
  "markdown": "\nCVSS v3 6.3\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: CyberVision\nEquipment: Kaa IoT Platform\nVulnerability: Code Injection\nAFFECTED PRODUCTS\nThe following version of Kaa IoT Platform, a middleware platform, is affected:\n\nKaa IoT Platform, Version 0.7.4, and possibly other versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow for the creation of files with custom content, movement of files, and execution of arbitrary OS commands.\nMITIGATION\nCyberVision’s Kaa Project has been unresponsive to multiple contact requests and has produced no mitigations for this vulnerability.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nINSUFFICIENT ENCAPSULATION CWE-485\n\nA code injection vulnerability has been identified, which may allow remote code execution.\nCVE-2017-7911 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\nRESEARCHER\nJacob Baines from Tenable Network Security is credited with the discovery of this vulnerability.\nBACKGROUND\nCritical Infrastructure Sector(s): Commercial Facilities, Critical Manufacturing, Food and Agriculture, Healthcare and Public Health, Information Technology\nCountries Deployed: Worldwide\nCompany Headquarters Location: Florida, United States\n",
  "cves": [
    "CVE-2017-7911"
  ],
  "techniques": [],
  "advisory": "icsa-17-122-02",
  "title": "CyberVision Kaa IoT Platform | CISA",
  "source": "ics-advisories",
  "id": "8451d3c6cdea16ad9a7f399c1b1ba0b8312b63edda89456397d618ae46dada1a"
}