{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SCALANCE LPE 4903 and SINUMERIK Edge\nVulnerability: Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unprivileged local user to escalate privileges and gain administrative rights.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products and versions are affected:\n\nSCALANCE LPE9403: All versions prior to v2.0\nSINUMERIK Edge: All versions prior to v3.3.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nA local privilege escalation vulnerability could allow an attacker to craft environment variables and execute arbitrary code. When successfully executed, the attack can cause a local privilege escalation, giving unprivileged users administrative rights on the target machine.\nCVE-2021-4034 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends users update products to the following versions: \n\nSCALANCE LPE9403: Update to v2.0 or later.\nSINUMERIK Edge: Update to v3.3.0 or later using the product’s internal update mechanism.\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict system access to authorized personnel and follow a least privilege approach\nTemporary mitigation exists at the expense of pkexec’s capabilities. By removing SUID permissions, the program cannot run processes as root. However, any processes that rely on it for normal operation will be affected\n\nSUID permission can be removed with chmod, as follows: chmod 0755 /usr/bin/pkexec\n\n\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-330556\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-4034"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-16",
  "title": "Siemens SCALANCE LPE 4903 and SINUMERIK Edge | CISA",
  "source": "ics-advisories",
  "id": "833b454a964848817f1e153db8da16bde8dd7feade8fb1f3bd34b913ed07bc75"
}