{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.4\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: SIMARIS configuration\nVulnerability: Incorrect Default Permissions\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-040-08 Siemens SIMARIS configuration that was published February 9, 2021, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain persistence or escalate privileges within the system.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SIMARIS configuration, an electrical planning software, are affected:\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMARIS configuration: All versions prior to 4.0.1\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INCORRECT DEFAULT PERMISSIONS CWE-276\nDuring installation to default target folder, incorrect permissions are configured for the application folder and subfolders, which may allow an attacker to gain persistence or potentially escalate privileges if a user with elevated credentials logs onto the machine.\nCVE-2020-28392 has been assigned to this vulnerability. A CVSS v3 base score of 4.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nRichard Davy from ECSC Group reported this vulnerability to Siemens.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nSiemens has released an update for SIMARIS configuration and recommends updating to v4.0.1 or later.\n--------- End Update A Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nSet installation path to a folder inside %APPDATA% for your user.\nApply the principle of least privileges operation of SIMARIS configuration and especially do not use any administrative accounts for executing the software.\n\nSiemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/Industrialsecurity\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-28392"
  ],
  "techniques": [],
  "advisory": "icsa-21-040-08",
  "title": "Siemens SIMARIS Configuration (Update A) | CISA",
  "source": "ics-advisories",
  "id": "f744d40394e1d87d4c99b69ddc533d562cfdcffd1e760479cbd2a808aa9096d1"
}