{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Exacq Technologies, a subsidiary of Johnson Controls, Inc.\nEquipment: exacqVision Server Bundle\nVulnerability: Improper Privilege Management=\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated remote user to be given access to credentials stored in the exacqVision Server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Exacq Technologies exacqVision products are affected:\n\nexacqVision Web Service Version 21.06.11.0 or older\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThe software does not properly assign, modify, track, or check privileges. This could allow unauthenticated users access to credentials stored in the exacqVision Server.\nCVE-2021-27664 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nTenable Research reported this vulnerability to Johnson Controls, Inc.\n4. MITIGATIONS\nExacq Technologies recommends the following mitigations:\n\nUpgrade exacqVision Web Service to Version 21.09\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\n\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-16 v1\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27664"
  ],
  "techniques": [],
  "advisory": "icsa-21-280-01",
  "title": "Johnson Controls exacqVision Server Bundle | CISA",
  "source": "ics-advisories",
  "id": "577baa49c51322db0128f9bee9849d818c2a7f80f6107d47c7683dba09bf2e94"
}