{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Schneider Electric\nEquipment: Struxureware Data Center Expert\nVulnerabilities: OS Command Injection, Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Struxureware Data Center Expert, a monitoring software, are affected:\n\nStruxureware Data Center Expert Versions 7.8.1 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NUETRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nThe affected product is vulnerable to an OS command injection, which may allow an attacker to remotely execute code over the network.\nCVE-2021-22795 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe affected product is vulnerable to directory traversal, which may allow an attacker to remotely execute code.\nCVE-2021-22794 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Energy, Food and Agriculture, Government Facilities, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nDavid Yesland, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to Schneider Electric.\n4. MITIGATIONS\nSchneider Electric has established a remediation plan for future versions of StruxureWare Data Center Expert to fix these vulnerabilities. Until the fix is released, users should immediately follow the security hardening guidelines found in Schneider Electric’s Data Center Expert Security Handbook to reduce the risk of exploit.\nSchneider Electric has released security advisory SEVD-2021-257-03 in response to these vulnerabilities.\nSchneider Electric strongly recommends the following industry cybersecurity best practices:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls so no unauthorized personnel can access industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in “Program” mode.\nLimit software updates to only those networks where devices targeted by the software updates reside.\nScan all methods of mobile data exchange with the isolated network (e.g., CDs, USB drives, etc.) before use in the terminals or any node connected to these networks.\nDo not allow mobile devices that have connected to any other network besides the intended network to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and systems, and ensure they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs). Recognize VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand VPNs are only as secure as the connected devices.\n\nFor more information, refer to the Schneider Electric Recommended Cybersecurity Best Practices document.\nFor more details and assistance on how to protect a user’s installation, contact the local Schneider Electric representative or Schneider Electric Industrial Cybersecurity Services.\nFor further information related to cybersecurity in Schneider Electric’s products, visit the company’s cybersecurity support portal page.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-22794",
    "CVE-2021-22795"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-03",
  "title": "Schneider Electric Struxureware Data Center Expert | CISA",
  "source": "ics-advisories",
  "id": "b3197cd8f3de902f5febf0e896760e43099ca35ae2f878b6a4ca9928c859c775"
}