{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.5\n\nATTENTION: Exploitable from an adjacent network/low skill level to exploit\nVendor: Siemens\nEquipment: Devices using the PROFINET Discovery and Configuration Protocol (DCP)\nVulnerability: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-17-129-01 Siemens devices using the PROFINET Discovery and Configuration Protocol (Update J) that was published June 21, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nAn attacker may be able to cause a denial-of-service condition requiring a manual restart by exploiting this vulnerability.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following products using the PROFINET DCP:\n\nSIMATIC WinCC (TIA Portal)\n\nv13: All versions prior to v13 SP2, and\nv14: All versions prior to v14 SP1\n\n\nSIMATIC STEP 7 (TIA Portal)\n\nv13: All versions prior to v13 SP2, and\nv14: All versions prior to v14 SP1\n\n\nSIMATIC STEP 7 v5.X: All versions prior to v5.6\nSTEP 7 - Micro/WIN SMART: All versions prior to v2.3\nSMART PC Access v2.3\nSIMATIC Automation Tool: All versions prior to v3.0\nSIMATIC WinCC\n\nv7.2 and prior: All versions\nv7.3: All versions prior to v7.3 Update 15\nv7.4: All versions prior to v7.4 SP1 Upd1\n\n\nSIMATIC PCS 7 v8.1: All versions\nSIMATIC PCS 7 v8.2: All versions prior to v8.2 SP1\nSIMATIC NET PC-Software: All versions prior to v14 SP1\nPrimary Setup Tool (PST): All versions prior to v4.2 HF1\nSecurity Configuration Tool (SCT): All versions prior to v5.0\nSINEMA Server: All versions prior to v14\n\n--------- Begin Update K Part 1 of 2 ----------\n\nSINAUT ST7CC: All versions installed in conjunction with SIMATIC WinCC prior to v7.3 Update 15\n\n--------- End Update K Part 1 of 2 ----------\n\nSINAUT ST7CC: All versions\nSIMATIC WinAC RTX 2010 SP2: All versions\nSIMATIC WinAC RTX F 2010 SP2: All versions\nSINUMERIK 808D Programming Tool: All versions prior to v4.7 SP4 HF2, and\nSIMATIC WinCC flexible 2008: All versions prior to flexible 2008 SP5.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted PROFINET DCP broadcast packets sent to the affected products on a local Ethernet segment (Layer 2) could cause a denial-of-service condition in some services. The services may require manual restart to recover.\nCVE-2017-6865 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nDuan JinTong, Ma ShaoShuai, and Cheng Lei from NSFOCUS Security Team reported this vulnerability directly to Siemens.\n5. MITIGATIONS\nSiemens provides updates that fix the vulnerability for the following affected products and recommends that users update to the new fixed version:\n\nSIMATIC WinCC (TIA Portal) v13: Update to v13 SP2\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746073\n\nSIMATIC WinCC (TIA Portal) v14: Update to v14 SP1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109745460\n\nSIMATIC STEP 7 (TIA Portal) v13: Update to v13 SP2\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109745155\n\nSIMATIC STEP 7 (TIA Portal) v14: Update to v14 SP1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109745984\n\nSIMATIC STEP 7 v5.X: Upgrade to v5.6\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109747706\n\nSTEP 7 - Micro/WIN SMART: Update to v2.3 by contacting the local Siemens representative or customer support\n\nhttps://w3.siemens.com/aspa_app/\n\nSIMATIC Automation Tool: Update to v3.0\n\nhttps://support.industry.siemens.com/cs/ww/en/view/98161300\n\nSIMATIC WinCC v7.3: Update to v7.3 Update 15\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109750182\n\nSIMATIC WinCC v7.4: Update to v7.4 SP1 Upd1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109748024\n\nSIMATIC PCS 7 v8.1: See recommendations and mitigations below, or upgrade to v9.0\n\nhttps://www.siemens.de/automation/partner\n\nSIMATIC PCS 7 v8.2: Update to v8.2 SP1. To obtain SIMATIC PCS 7 v8.2 SP1 contact local support\n\n\nSIMATIC NET PC-Software: Upgrade to v14 SP1:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109747482\n\nPrimary Setup Tool (PST): Update to v4.2 HF1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/19440762\n\nSecurity Configuration Tool (SCT): Update to v5.0\n\nhttps://support.industry.siemens.com/cs/de/en/view/109747539\n\nSINEMA Server: Upgrade to v14 [10]\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109748854\n--------- Begin Update K Part 2 of 2 --------\n\nSINAUT ST7CC: Update SIMATIC WinCC to v7.3 Update 15 or newerhttps://support.industry.siemens.com/cs/ww/en/view/109750182\n\n--------- End Update K Part 2 of 2 --------\n\nSMART PC Access: Update to v2.3 by contacting the local Siemens representative or customer support\n\nhttps://w3.siemens.com/aspa_app/\n\nSINUMERIK 808D Programming Tool: Update to v4.7 SP4 HF2 by contacting the local Siemens account manager\n\n\nSIMATIC WinCC flexible 2008: upgrade to WinCC flexible 2008 SP5\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109749111\nThe affected component is shared among all of the affected products on the host. Installing one fixed version will mitigate the vulnerability for all Siemens applications installed on that host.\nSiemens is preparing updates for the remaining affected products and recommends the following mitigations in the meantime:\n\nApply cell protection concept\n\nhttps://support.industry.siemens.com/cs/ww/en/view/60119725\n\nUse VPN for protecting network communication between cells\nApply Defense-in-Depth\n\nAs a general security measure, Siemens strongly recommends protecting industrial control systems networks with appropriate mechanisms. Siemens advises configuring the environment according to Siemens operational guidelines in order to run the devices in a protected IT environment.\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-275839 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2017-6865"
  ],
  "techniques": [],
  "advisory": "icsa-17-129-01",
  "title": "Siemens devices using the PROFINET Discovery and Configuration Protocol (Update K) | CISA",
  "source": "ics-advisories",
  "id": "9a33250322f2b5ed20402c291b214fc6785234057a5ced1f7b9855621bf9ff58"
}