{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Emerson\nEquipment: AMS Device Manager\nVulnerabilities: Improper Access Control, Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow arbitrary remote code execution and malware injection.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AMS Device Manager, an Asset Management System, are affected:\n\nAMS Device Manager: v12.0 to v13.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nA specially crafted script may be run that allows arbitrary remote code execution.\nCVE-2018-14804 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nNon-administrative users are able to change executable and library files on the affected products.\nCVE-2018-14808 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSergey Temnikov of Kaspersky Lab and Emerson discovered and reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nEmerson recommends users patch the affected products listed below:\nAMS Device Manager: v12.0 to v13.5  Software patches are available to users with access to the Guardian Support Portal at:\nhttps://guardian.emersonprocess.com/.\nPlease refer to the Knowledge Base Articles for AMS NK-1700-0324, NK-1700-0252 and DeltaV NK-1800-0880 (DSN 18006) for more information.\nVulnerability CVE-2018-14808 cannot be exploited if application whitelisting is implemented since it would prevent files from being overwritten.\nTo limit exposure to these and other vulnerabilities, Emerson recommends deploying and configuring AMS Device Manager as described in the AMS Device Manager Installation Guide which is available in Emerson’s Guardian Support Portal.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-14808",
    "CVE-2018-14804"
  ],
  "techniques": [],
  "advisory": "icsa-18-270-01",
  "title": "Emerson AMS Device Manager | CISA",
  "source": "ics-advisories",
  "id": "b6d34a9625b7fdc979da07c8b8e94568f4dcfa97c893444d2d324ff0e1e0850f"
}