{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Yokogawa\nEquipment: Wide Area Communication Router (WAC Router)\nVulnerability: Use of Insufficiently Random Values\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the functions provided by the WAC Router to stop.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nYokogawa reports this vulnerability affects the communication module for the following WAC Router: \n\nWide Area Communication Router (for AW810D) VI461: Vnet/IP firmware (F) R12 or earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nIf a WAC Router is subjected to a denial-of-service attack with malformed packets, the functions provided by the WAC Router may stop.\nCVE-2022-32284 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nYokogawa reported this vulnerability to JPCERT/CC.\n4. MITIGATIONS\nYokogawa recommends updating to R13 or later. Please contact Yokogawa sales or service staff to update Vnet/IP firmware. Vnet/IP firmware cannot be updated by the user, and update charges are borne by the user.\nYokogawa recommends users establish and maintain a full security program, including patch updates, anti-virus, backup and recovery, zoning, hardening, whitelisting, firewalls, etc. Yokogawa can assist in setting up and running the security program continuously. For considering the most effective risk mitigation plan, as a starting point, Yokogawa can perform a security risk assessment.\nPlease see Yokogawa’s full report (YSAR-22-0005) for update details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.  This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-32284"
  ],
  "techniques": [],
  "advisory": "icsa-22-181-02",
  "title": "Yokogawa Wide Area Communication Router | CISA",
  "source": "ics-advisories",
  "id": "babb3214010d968de0a4b7754556ff9a70c555cda24af6a48ec7b02a3ccba082"
}