{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\n\n--------- Begin Update A Part 1 of 4 ---------\n\nEquipment: MELSEC iQ-F, iQ-R, Q, and L series\n\n--------- Begin Update A Part 1 of 4 ---------\n\nVulnerability: Plaintext Storage of Password\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-23-061-01 Mitsubishi Electric MELSEC iQ-F Series that was published March 02, 2023, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker to login to an FTP server or web server by obtaining plaintext credentials stored in project files.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 2 of 4 ---------   \nThe following Mitsubishi Electric MELSEC products are affected:\n\nMELSEC iQ-F FX5U(C) CPU modules: All models, all versions\nMELSEC iQ-F FX5UJ CPU modules: All models, all versions\nMELSEC iQ-F FX5S CPU modules: All models, all versions\nMELSEC iQ-F FX5-ENET: All versions\nMELSEC iQ-F FX5-ENET/IP: All versions\nMELSEC iQ-R R00/01/02CPU: All versions\nMELSEC iQ-R R04/08/16/32/120(EN)CPU: All versions\nMELSEC iQ-R R08/16/32/120SFCPU: All versions\nMELSEC iQ-R R08/16/32/120PCPU: All versions\nMELSEC iQ-R R08/16/32/120PSFCPU: All versions\nMELSEC iQ-R RJ71EN71: All versions\nMELSEC iQ-R R12CCPU-V: All versions\nMELSEC-Q Q03UDECPU, Q04/06/10/13/20/26/50/100UDEHCPU: All versions\nMELSEC-Q Q03/04/06/13/26UDVCPU: All versions\nMELSEC-Q Q04/06/13/26UDPVCPU: All versions\nMELSEC-Q QJ71E71-100: All versions\nMELSEC-L L02/06/26CPU(-P), L26CPU-(P)BT: All versions\nMELSEC-L LJ71E71-100: All versions\n\n--------- End Update A Part 2 of 4 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1 PLAINTEXT STORAGE OF A PASSWORD CWE-256 \n--------- Begin Update A Part 3 of 4 ---------\nMitsubishi Electric MELSEC iQ-F, iQ-R, Q, and L series are vulnerable to an information disclosure vulnerability due to plaintext storage of a password.\n--------- End Update A Part 3 of 4 ---------\nCVE-2023-0457 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nJeongHoon Bae, YiJoon Jung, JinYoung Kim, HyeokJong Yun and HeeA Go of HelloT reported this vulnerability to Mitsubishi Electric.\n5. MITIGATIONS\nMitsubishi Electric recommends that customers take the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\nEncrypt the communication data or project files when sending and receiving or sharing these files.\nUse a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\n\n--------- Begin Update A Part 4 of 4 ---------\n\nRestrict physical access to affected products.\nFor MELSEC iQ-F or iQ-R series, use an IP filter function to block access from untrusted hosts.\n\nFor details on the IP filter function, please refer to the following manuals for each product;\n\"12.1 IP Filter Function\" in the MELSEC iQ-F FX5 User's Manual (Ethernet Communication)\n\"1.13 Security\" - \"IP filter\" in the MELSEC iQ-R Ethernet User’s Manual (Application).\n--------- End Update A Part 4 of 4 ---------\nFor specific update instructions and additional details see the Mitsubishi Electric advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-0457"
  ],
  "techniques": [],
  "advisory": "icsa-23-061-01",
  "title": "Mitsubishi Electric MELSEC iQ-F Series (Update A) | CISA",
  "source": "ics-advisories",
  "id": "7fd0fc5632348674939cae87cb9c874a9052d10d4219086cff5de2d718f05a20"
}