{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).View CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 9.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: CPCI85 for CP-8031/CP-8050, CPCI85, SICORE\nVulnerabilities: Unverified Password Change, Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to perform an unauthorized password reset which could lead to privilege escalation and potential leak of information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens SICAM product versions are affected:\n\nCPCI85 Central Processing/Communication: All versions prior to V5.40\nSICORE Base system: All versions prior to V1.4.0\n\n3.2 Vulnerability Overview\n3.2.1 UNVERIFIED PASSWORD CHANGE CWE-620\nThe password of administrative accounts of the affected applications can be reset without requiring the knowledge of the current password, given the auto login is enabled. This could allow an unauthorized attacker to obtain administrative access of the affected applications.\nCVE-2024-37998 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-37998. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.2 MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nAffected devices allow a remote authenticated user or an unauthenticated user with physical access to downgrade the firmware of the device. This could allow an attacker to downgrade the device to older versions with known vulnerabilities.\nCVE-2024-39601 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-39601. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:H/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nJan Kaestle from Siemens Energy reported the vulnerability CVE-2024-37998 to Siemens. Steffen Robertz, Gerhard Hechenberger, Stefan Viehböck, and Constantin Schieber-Knöbl from SEC Consult Vulnerability Lab reported the vulnerability CVE-2024-39601 to Siemens.\n4. MITIGATIONS\nSiemens recommends users to update to the latest version:\n\nCPCI85 Central Processing/Communication: Update to V5.40 or later\nSICORE Base system: Update to V1.4.0 or later\n\nSiemens has identified the following specific workarounds and mitigations that customers can apply to reduce the risk:\n\nCVE-2024-37998: Disable the auto login feature\n\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage\nFor more information see the associated Siemens security advisory SSA-071402 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJuly 25, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-37998",
    "CVE-2024-39601"
  ],
  "techniques": [],
  "advisory": "icsa-24-207-01",
  "title": "Siemens SICAM Products | CISA",
  "source": "ics-advisories",
  "id": "0233e2a9c372d28211d9d00f5c2741fce93a8a4b2ca110fa805849a502d92202"
}