{
  "markdown": "\nOVERVIEW\nAn anonymous researcher has identified several vulnerabilities in Trihedral Engineering Ltd.’s Trihedral VTScada and reported them to Zero Day Initiative (ZDI), which reported them to NCCIC/ICS-CERT. Trihedral Engineering Ltd. has produced a new version to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nTrihedral Engineering Ltd. reports that these vulnerabilities affect the following product:\n\nVTScada versions after Version 8 and before Version 11.2.02\n\nThese vulnerabilities only apply to the WAP interface (typically Port 9201/TCP/IP). Only a small fraction of the installed base of VTScada uses this legacy feature.\nIMPACT\nAn attacker may exploit these vulnerabilities to download or view arbitrary files, or to cause the server to crash and not come back without being manually relaunched.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nTrihedral Engineering Ltd. is a Canada-based company that maintains offices in the United States and the United Kingdom.\nThe affected product, VTScada (also known as VTS prior to 2013), is a Windows-based SCADA system with a web interface option. According to Trihedral Engineering Ltd, VTScada is deployed across Chemical, Critical Manufacturing, Communications, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems, and other sectors. Trihedral Engineering Ltd. estimates that this product is used primarily in North America and Europe.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nOUT-OF-BOUNDS READCWE-125: Out-of-bounds Read, http://cwe.mitre.org/data/definitions/125.html, web site last accessed June 7, 2016.\n\nThe software can be caused to read outside the intended buffer, causing a crash.\nCVE-2016-4523NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-4523, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H, web site last accessed June 7, 2016.\n\nPATH TRAVERSALCWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal'), http://cwe.mitre.org/data/definitions/22.html, web site last accessed June 7, 2016.\n\nAn attacker can replace the path in a request to retrieve any file.\nCVE-2016-4532NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-4532, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N, web site last accessed June 7, 2016.\n\nAUTHENTICATION BYPASS ISSUESCWE-592: Authentication Bypass Issues, http://cwe.mitre.org/data/definitions/592.html, web site last accessed June 7, 2016.\n\nThe software does not properly authenticate requests to read arbitrary files.\nCVE-2016-4510NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-4510, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N, web site last accessed June 7, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nTrihedral Engineering Ltd. has created an updated software version (version 11.2.02) to address these vulnerabilities. This software update is available on Trihedral Engineering Ltd.’s FTP site:\nftp://ftp.trihedral.com/VTS/\nHelp file notes for upgrading VTScada/VTS can be found at:\nhttp://www.trihedral.com/help/#Op_Welcome/Wel_UpgradeNotes.htm\nIf you have any questions or any difficulties with installing one of these updates, please call Trihedral Tech Support:\n1-855-887-2232\n1-902-835-1575\n+44 (0) 1224 258910 for the United Kingdom\nICS-CERT recommends, as quality assurance, that users test the update in a test development environment that reflects their production environment prior to installation. In addition, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-4523",
    "CVE-2016-4510",
    "CVE-2016-4532"
  ],
  "techniques": [],
  "advisory": "icsa-16-159-01",
  "title": "Trihedral Engineering Limited VTScada Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "75c5e62eaf61ff0edb0047b3121cf3892b6cc440ddbe6f7526850e8044277007"
}