{
  "markdown": " Fultek WinTr Directory Traversal \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryFultek WinTr Directory Traversal================================ Last Revised September 05, 2018 Alert Code ICSA\\-12\\-262\\-01Overview-------- Researcher Daiki Fukumori of [Cyber Defense Institute](http://www.cyberdefense.jp/en/)  has identified a directory traversal vulnerability in Fultek’s WinTr SCADA application. Fultek was unable to validate this vulnerability and has not offered any mitigation plans. ICS\\-CERT has validated the vulnerability. This vulnerability could be exploited remotely.Affected Products----------------- The following product is affected:* WinTr Scada 4\\.0\\.5 and earlier.Impact------ Successful exploitation of this vulnerability may result in information leakage. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- Fultek is a company based in Turkey. The affected product, WinTr Scada, is a Web\\-based SCADA system.Vulnerability Characterization------------------------------### **Vulnerability Overview**#### RELATIVE PATH TRAVERSALCWE, http://cwe.mitre.org/data/definitions/23\\.html, CWE\\-23: Relative Path Traversal, Web site last accessed September 18, 2012\\. The WinTr Web server does not sanitize user input. By sending a specially crafted request to the Web server, an attacker may retrieve arbitrary files. CVE\\-2012\\-3011NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2012\\-3011, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7\\.8 has been assigned; the CVSS vector string is [(AV:N/AC:L/Au:N/C:C/I:N/A:N)](http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:C/I:N/A:N)  .### **Vulnerability Details**#### Exploitability This vulnerability could be exploited remotely.#### Existence of Exploit No known public exploits specifically target this vulnerability.#### Difficulty An attacker with a low skill would be able to exploit this vulnerability.Mitigation---------- The vendor has not offered any mitigation plans. According to MITRE, the best mitigation for this type of vulnerability is to properly sanitize user input. MITRE also recommends, when the application is controlled by a third party and the code cannot be fixed, an application firewall may be used to validate input and mitigate the vulnerability. Running the application in a sandbox environment may also limit the scope of a compromise. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT Web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS\\-CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01A—Cyber Intrusion Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01A)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Fultek-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-262-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2012-3011"
  ],
  "techniques": [],
  "advisory": "icsa-12-262-01",
  "title": "Fultek WinTr Directory Traversal | CISA",
  "source": "ics-advisories",
  "id": "f76a12cf45532408e845661c4cd86ab128cb66aff608f943c1514cc6a55dd888"
}