{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.9\nATTENTION: Low attack complexity  \nVendor: RoboDK \nEquipment: RoboDK \nVulnerability: Incorrect Permission Assignment for Critical Resource \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to escalate privileges, which could allow attackers to write files to the RoboDK directory and achieve code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of RoboDK, a programming and simulation software, are affected: \n\nRoboDK v5.5.3 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INCORRECT PERMISSION ASSIGNMENT OR CRITICAL RESOURCE CWE-732 \nRoboDK versions 5.5.3 and prior contain an insecure permission assignment to critical directories vulnerability, which could allow a local user to escalate privileges and write files to the RoboDK process and achieve code execution.  \nCVE-2023-1516 has been assigned to this vulnerability. A CVSS v3 base score of 7.9 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:L/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing  \nCOUNTRIES/AREAS DEPLOYED: Worldwide  \nCOMPANY HEADQUARTERS LOCATION: Canada \n\n3.4 RESEARCHER\nNoam Moshe of Claroty reported this vulnerability to CISA. \n4. MITIGATIONS\nRoboDK has not responded to requests to work with CISA to mitigate this vulnerability. Users of the affected product are encouraged to contact RoboDK support for additional information. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should: \n\nLocate control system networks and remote devices behind firewalls and isolate them from business networks. \nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices. \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2023-1516"
  ],
  "techniques": [],
  "advisory": "icsa-23-082-01",
  "title": "RoboDK | CISA",
  "source": "ics-advisories",
  "id": "fcaede4514b809152fcec13c39cf1eddc1947d348db6eeeffec52b1bbdafc876"
}