{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ABB\nEquipment: Relion 650 and 670 Series\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to reboot the device, causing a denial of service.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Relion, a protection and control device, are affected:\n\nRelion 650 series versions 1.3.0.5 and prior\nRelion 670 series versions 1.2.3.18 and prior\nRelion 670 series versions 2.0.0.11 and prior\nRelion 670 series versions 2.1.0.1 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER INPUT VALIDATION CWE-20\nAn attacker may use a specially crafted message to force the device to reboot, which could cause a denial of service.\nCVE-2019-18247 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nIlya Karpov, Evgeniy Druzhinin, and Victor Nikitin of ScadaX reported this vulnerability to ABB.\n4. MITIGATIONS\nABB recommends that users apply the following or later versions at the earliest convenience:\n\nRelion 650 series version 1.3.0.6\nRelion 670 series version 1.2.3.19\nRelion 670 series version 2.0.0.12\nRelion 670 series version 2.1.0.2\n\nUpdates can be ordered by email at: sa.t-supportline@se.abb.com\nABB also recommends that these and other proper security practices and firewall configurations be implemented to help protect a process control network from attacks originating outside the network:\n\nProcess control systems are physically protected from direct access by unauthorized personnel.\nProcess control systems have no direct connections to the Internet.\nProcess control systems are separated from other networks by means of a firewall system that has a minimal number of ports/services exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving e-mails.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nMore information on recommended practices can be found in the ABB Cybersecurity Deployment Guidelines for each product version.\nABB has not identified any workaround; however, firewall rules could be set to block incoming traffic to Port 7001/TCP that originate from outside the network.\nIn the Relion 650 series Version 1.3, the SPA protocol over TCP/IP could be disabled if it is not in use.\nFor more information, see the ABB Cybersecurity Advisory 1MRG027165\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-18247"
  ],
  "techniques": [],
  "advisory": "icsa-19-330-02",
  "title": "ABB Relion 650 and 670 Series | CISA",
  "source": "ics-advisories",
  "id": "a6488793f96aa2358ab8b2b2de86e496a59a8a11acb938304ec2b65ce2a9f2fa"
}