{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Schneider Electric\nEquipment: ConneXium Network Manager (CNM) Software\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CNM, ethernet network management software, are affected:\n\nConneXium Network Manager: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThe affected product has an issue with privilege management, which could cause an arbitrary command execution when the software is configured with specially crafted event actions.\nCVE-2021-22801 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nDavid Yesland, working with Trend Micro’s Zero Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nSchneider Electric recommends users protect their installation with the following:\nSTEP 1: Download and run the CNM Alarms Disabler Tool.\nUsage: Place the disabler tool and the .cxn project file in the same directory. In a shell prompt, and in the chosen directory, execute the following command:\n\ndisabler -projectfile {source project filename} -resultfile {converted project filename}\n\nImportant: The converter secures and modifies the CNM database and stores it in a new project file. Before a database coming from an untrusted source is loaded into CNM, users must run the converter. Note the original database is not modified. Therefore, if the original database needs to be loaded once more, it must be converted first.\nSTEP 2: Set up the “Edit Password” in the CNM software. The “Edit Mode” is enabled by default. Users must activate the edit protection by switching to “Run mode” before exiting the application. Please refer to the chapter “Edit Mode” of the CNM user manual (packaged in the .iso file).\nSchneider Electric also recommends users should use appropriate patching methodologies when applying these patches to their systems. We strongly recommend the use of back-ups and evaluating the impact of these patches in a Test and Development environment or on an offline infrastructure. Contact Schneider Electric’s Customer Care Center if you need assistance removing a patch.\nIf users choose not to apply the remediation provided above, they should immediately apply the following mitigations to reduce the risk of exploit:\n\nHarden the workstation running ConneXium Network Manager (CNM) Software.\nDo not load .cxn files received from untrusted sources.\nUse session without administrator rights when it is not necessary.\n\nFor more information see Schneider Electric’s security notification: SEVD-2021-285-02\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nOnly uses project files from trusted sources.\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-22801"
  ],
  "techniques": [],
  "advisory": "icsa-21-287-01",
  "title": "Schneider Electric CNM | CISA",
  "source": "ics-advisories",
  "id": "0650cc1941aa17ca77d94769defd426a995b10c07371ced255ea476676e86dfd"
}