{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Low skill level to exploit/public exploits are available\nVendor: Schneider Electric\nEquipment: EcoStruxure Operator Terminal Expert\nVulnerabilities: SQL Injection, Path Traversal, Argument Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow unauthorized write access or remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports these vulnerabilities affect the following EcoStruxure products:\n\nEcoStruxure Operator Terminal Expert 3.1 Service Pack 1 and prior (formerly known as Vijeo XD)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    SQL INJECTION CWE-89\nAn attacker could exploit an SQL injection vulnerability by enticing a user to open a maliciously crafted project file.\nCVE-2020-7493 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.2.2    PATH TRAVERSAL CWE-22\nAn attacker could exploit this path traversal vulnerability by getting a user to visit a malicious page or open a malicious file.\nCVE-2020-7494 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.2.3    PATH TRAVERSAL CWE-22\nAn attacker could exploit this path traversal vulnerability by getting a user to visit a malicious page or open a malicious file.\nCVE-2020-7495 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N).\n3.2.4    ARGUMENT INJECTION CWE-88\nA remote attacker can trick a victim to open a specially crafted project file and gain unauthorized write access to the target system.\nCVE-2020-7496 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N).\n3.2.5    PATH TRAVERSAL CWE-22\nA vulnerability exists that could cause arbitrary application execution when the computer starts.\nCVE-2020-7497 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nThe following researchers reported these vulnerabilities to Schneider Electric:\n\nSharon Brizinov and Amir Preminger of Claroty Research working with Trend Micro’s Zero Day Initiative.\nSteven Seeley and Chris Anastasio of Incite Team working with Trend Micro’s Zero Day Initiative\nFredrik Østrem (Cognite), Emil Sandstø (Cognite), and Cim Stordal (Cognite)\n\n4. MITIGATIONS\nSchneider Electric recommends users update to EcoStruxure Operator Terminal Expert Version 3.1 Service Pack 1A. Schneider Electric offers two methods to get the update:\nIn addition to the update, Schneider Electric also recommends the following workarounds and mitigations to reduce the risk:\n\nUse EcoStruxure Operator Terminal Expert software only on a trusted workstation.\nDo not execute EcoStruxure Operator Terminal Expert software with Windows administrator privileges.\nHarden workstation following the best cybersecurity practices (antivirus, updated operating systems, strong password policies, application whitelisting software, etc.) and secure network using Schneider Electric's Cybersecurity Best Practices. \nManage your project file securely to avoid information disclosure or unexpected modifications of data.\nOnly accept project files from trusted users.\nUse project password when saving the project file.\nUser’s password in the application should be configured as a strong password according with the “use complex password” function described in the section titled “Security / Settings / use complex password.”\n\nFor more information on these vulnerabilities and updates, please see SEVD-2020-133-04\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThese vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-7495",
    "CVE-2020-7494",
    "CVE-2020-7493",
    "CVE-2020-7497",
    "CVE-2020-7496"
  ],
  "techniques": [],
  "advisory": "icsa-20-142-02",
  "title": "Schneider Electric EcoStruxure Operator Terminal Expert | CISA",
  "source": "ics-advisories",
  "id": "6ef2c1972a517f255b9fd9d39ce0e28ffef6b75d975efd9c19d3a8043db55a55"
}