{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.4\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-F Series\nVulnerability: Improper Check or Handling of Exceptional Conditions\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the device to enter a denial-of-service condition, and a reset of the CPU module is required for recovery.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports that the vulnerability affects the following MELSEC iQ-F series FX5U(C) CPU modules: \n\nFX5U(C) CPU module: firmware Version 1.060 or earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER CHECK OR HANDLING OF EXCEPTIONAL CONDITIONS CWE-703\nAn improper check or handling of exceptional conditions vulnerability exists in MELSEC iQ-F series modules, which may result in a denial-of-service condition.\nCVE-2020-5665 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends users update firmware to Version 1.061 or later.\nMitsubishi Electric recommends users take the following mitigation measures to minimize risk associated with this vulnerability:\n\nUse a firewall or virtual private network to prevent unauthorized access when Internet access is required.\nUse within the LAN and ensure that they are not accessible from untrusted networks and hosts. \n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-5665"
  ],
  "techniques": [],
  "advisory": "icsa-20-345-01",
  "title": "Mitsubishi Electric MELSEC iQ-F Series | CISA",
  "source": "ics-advisories",
  "id": "3f7f4c43ea328d112b35f9eb7136ca977edd2d6375e4746e5a3b7ab8598cfe83"
}