{
  "markdown": "\nOVERVIEW\nEmerson has released a publication to inform its users of a vulnerability that affects DeltaV Easy Security Management. Emerson is terminating support for the DeltaV Easy Security Management application and highly recommends all users uninstall it from all DeltaV and non-DeltaV workstations.\nAFFECTED PRODUCTS\nEmerson reports that the vulnerability affects the DeltaV Easy Security Management application, which is present on the following systems:\n\nDeltaV V12.3,\nDeltaV V12.3.1, and\nDeltaV V13.3\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a local attacker to elevate privileges within a DeltaV control system.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nEmerson is a US-based company that maintains offices in several countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia.\nThe affected product, DeltaV Easy Security Management, is an application included with DeltaV systems v12.3, v12.3.1, and v13.3 that manages the portable media ports and autorun feature for all DeltaV workstations and servers. The DeltaV Easy Security management application allows users to disable portable USB storage devices and autorun on workstations and servers in the DeltaV network. According to Emerson, DeltaV is deployed across several sectors including Chemical and Energy. Emerson estimates that this product is used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER PRIVILEGE MANAGEMENTCWE-269: Improper Privilege Management, https://cwe.mitre.org/data/definitions/269.html, web site last accessed November 29, 2016.\n\nCritical vulnerabilities may allow a local attacker to elevate privileges within the DeltaV control system.\nCVE-2016-9345NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9345, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:H/UI:N/S:C/C:H/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:H/PR:H/UI:N/S:C/C:H/I:L/A:L, web site last accessed November 29, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not exploitable remotely and cannot be exploited without user interaction.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult.\nMITIGATION\nThe DeltaV Easy Security Management server and monitoring agents can be manually uninstalled by users with privileges to install/uninstall Windows applications on each given workstation or server. A more detailed procedure to uninstall the DeltaV Easy Security application is available in the Emerson’s Knowledge Base Article # NK-1600-0336 through Emerson’s Guardian Support Knowledge Base. Simplified steps are as follows:\n1) Log into each one of the workstations/servers running DeltaV Easy Security and launch Windows Programs and Features.\n2) Uninstall the ‘Easy Security Server and Agent’ application using the uninstall button.\nA computer reboot is not required to complete these steps. The built-in user account created during the DeltaV Easy Security installation is also removed during the uninstall process.\nEmerson will provide additional details explaining how to manage USB ports and autorun features using Windows Group Policies in the near future as part of another Knowledge Base Article to be published through Emerson’s Guardian Support Knowledge Base.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-9345"
  ],
  "techniques": [],
  "advisory": "icsa-16-334-02",
  "title": "Emerson DeltaV Easy Security Management Application Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "0029f75455e8070ae7f081fa45e9c897b94d55a7d1b48d70b409f1ad3fe24ae7"
}