{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.3\nATTENTION: Low attack complexity\nVendor: Mitsubishi Electric\nEquipment: FA Engineering Software Products\nVulnerability: Incorrect Default Permissions\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a local attacker to execute code, which could result in information disclosure, tampering with and deletion of information, or a denial-of-service (DoS) condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Mitsubishi Electric FA Engineering Software Products are affected:\n\nAL-PCS/WIN-E: All versions\nCPU Module Logging Configuration Tool: All versions\nEZSocket: All versions\nFR Configurator2: All versions\nFX Configurator-EN: All versions\nFX Configurator-EN-L: All versions\nFX Configurator-FP: All versions\nGT Designer3 Version1(GOT1000): All versions\nGT Designer3 Version1(GOT2000): All versions\nGT SoftGOT1000 Version3: All versions\nGT SoftGOT2000 Version1: All versions\nGX LogViewer: All versions\nGX Works2: All versions\nGX Works3: All versions\nMELSOFT FieldDeviceConfigurator: All versions\nMELSOFT iQ AppPortal: All versions\nMELSOFT MaiLab: All versions\nMELSOFT Navigator: All versions\nMELSOFT Update Manager: All versions\nMX Component: All versions\nMX Sheet: All versions\nPX Developer: All versions\nRT ToolBox3: All versions\nRT VisualBox: All versions\nData Transfer: All versions\nData Transfer Classic: All versions\n\n3.2 Vulnerability Overview\n3.2.1 INCORRECT DEFAULT PERMISSIONS CWE-276\nIn all versions of the affected software products, code execution is possible due to permission issues. This could allow an attacker to cause information disclosure, tampering with and deletion of information, or a denial-of-service (DoS) condition.\nCVE-2023-4088 has been assigned to this vulnerability. A CVSS v3 base score of 9.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\n01dGu0 of ZHEJIANG QIAN INFORMATION & TECHNOLOGY CO., LTD reported this vulnerability to Mitsubishi Electric.\n4. MITIGATIONS\nMitsubishi Electric recommends that customers take the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\nInstall the affected products in their default installation locations. If users install CPU Module Logging Configuration Tool, EZSocket, FR Configurator2, GT Designer3 Version1(GOT2000), GT SoftGOT1000 Version3, GT SoftGOT2000 Version1, GX LogViewer, GX Works2, GX Works3, MELSOFT FieldDeviceConfigurator, MELSOFT Navigator, MX Component, RT ToolBox3 or Data Transfer, install the following versions or later, because products with versions prior to the following are vulnerable to CVE-2020-14496 and the mitigation measures are not effective. CPU Module Logging Configuration Tool: Ver 1.106K and later, EZSocket: Ver 4.6 and later, FR Configurator2: Ver 1.23Z and later, GT Designer3 Version1(GOT2000): Ver 1.236W and later, GT SoftGOT1000 Version3: Ver 3.245F and later, GT SoftGOT2000 Version1: Ver 1.236W and later, GX LogViewer: Ver 1.106K and later, GX Works2: Ver 1.595V and later, GX Works3: Ver 1.065T and later, MELSOFT FieldDeviceConfigurator: Ver 1.04E and later, MELSOFT Navigator: Ver 2.70Y and later, MX Component: Ver 4.20W and later, RT ToolBox3: Ver 1.80J and later, Data Transfer: Ver 3.41T and later.\nIf it is necessary to change the installation folder from the default, select a folder that only users with Administrator privileges have permission to change.\nInstall an anti-virus software on the computer using the affected product.\nUse your computer with the affected product within the LAN and block remote login from untrusted networks, hosts, and users.\nWhen connecting your computer with the affected product to the Internet, use a firewall, virtual private network (VPN),etc., and allow only trusted users to remote login.\nDon't open untrusted files or click untrusted links.\n\nFor more information, see the Mitsubishi Electric security advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nSeptember 26, 2023: Initial Publication\nJuly 09, 2024: Update A - Expanded affected products and updated mitigations section\n\n",
  "cves": [
    "CVE-2023-4088",
    "CVE-2020-14496"
  ],
  "techniques": [
    "T1000",
    "T2000"
  ],
  "advisory": "icsa-23-269-03",
  "title": "Mitsubishi Electric FA Engineering Software (Update A) | CISA",
  "source": "ics-advisories",
  "id": "81dabe589a264d6843eedb292b15743fa7c648608f8dd715082f2d218a725276"
}