{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: Automation License Manager\nVulnerabilities: Relative Path Traversal, Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution or allow an attacker to determine port status on another remote system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAccording to Siemens, the following products are affected:\n\nAutomation License Manager 5: All versions prior to 5.3.4.4, and\nAutomation License Manager 6: All versions prior to 6.0.1 (only affected by CVE-2018-11455).\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    RELATIVE PATH TRAVERSAL CWE-23\nA directory traversal vulnerability could allow a remote attacker to move arbitrary files, which can result in code execution, compromising system confidentiality, integrity, and availability. Successful exploitation requires a network connection to the affected device. The attacker does not need privileges or special conditions, but user interaction is required.\nCVE-2018-11455 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER INPUT VALIDATION CWE-20\nAn attacker with network access to the device could send specially crafted network packets to determine whether a network port on another remote system is accessible. This allows the attacker to do basic network scanning using the victim’s machine.\nSuccessful exploitation requires a network connection. The attacker does not need privileges, and no user interaction is required. The impact is limited to determining whether or not a port on a target system is accessible by the affected device.\nCVE-2018-11456 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nVladimir Dashchenko from Kaspersky Lab worked with Siemens to identify the vulnerabilities, and Siemens reported the vulnerabilities to NCCIC.\n4. MITIGATIONS\nSiemens has recommended the following mitigations:\n\nAutomation License Manager 5: Update to v5.3.4.4, and\nAutomation License Manager 6: Update to v6.0.1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/114358\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security (Download: https://www.siemens.com/cert/operational-guidelines-industrial-security) and following the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity\nFor more information on these vulnerabilities and associated software updates, please see Siemens security advisory SSA-920962 on their website:\nhttps://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-11456",
    "CVE-2018-11455"
  ],
  "techniques": [],
  "advisory": "icsa-18-226-03",
  "title": "Siemens Automation License Manager | CISA",
  "source": "ics-advisories",
  "id": "e9a51d05684b41e1b183888d3e93a1c2a2fd48ee885b5e1925e2f1e774deb8ce"
}