{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Triangle Microworks\nEquipment: TMW IEC 61850 Software Library and TMW IEC 60870-6 (ICCP/TASE.2) Software Library\nVulnerability: Access of Uninitialized Pointer\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to a denial-of-service condition to any server or client using the affected libraries\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n\nTMW Library: IEC 61850\n\nAny client or server using the C language library with a version number of 11.2.0 or earlier.\nAny client or server using the C++, C#, or Java language library with a version number of 5.0.1 or earlier.\n\n\nTMW Library: IEC 60870-6 (ICCP/Tase.2)\n\nAny client or server using a C++ language library with a version number of 4.4.3 or earlier.\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    ACCESS OF UNINITIALIZED POINTER CWE-824\nThe TMW IEC 61850 Library and TMW 60870-6 (ICCP/TASE.2) Library are vulnerable to access given to a small number of uninitialized pointers within their code. This could allow an attacker to target any client or server using the affected libraries to cause a denial-of-service condition.\nCVE-2022-38138 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Water, and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nVera Mens of Claroty Research reported this vulnerability to CISA.\n4. MITIGATIONS\nTriangle Microworks encourages those using the affected library to contact Triangle Microworks Support for mitigation guidance and strategies.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2022-38138"
  ],
  "techniques": [],
  "advisory": "icsa-22-249-01",
  "title": "Triangle Microworks Libraries | CISA",
  "source": "ics-advisories",
  "id": "f497fc225c00f501e6296c09f2449a5a84a9c6a7eab8d8cb25daf4b92b5bb357"
}