{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: APOGEE and TALON\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a low privilege authenticated attacker to gain high privilege access.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens APOGEE PXC and TALON TC Series, a building automation and control systems, are affected:\n\nAPOGEE PXC Series (BACnet): Versions prior to 3.5.5\nAPOGEE PXC Series (P2 Ethernet): Versions prior to 2.8.20\nTALON TC Series (BACnet): Versions prior to 3.5.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nSiemens APOGGEE PXC Series versions prior to 3.5.5, APOGEE PXC Series versions prior to 2.8.20, and TALON TC Series versions prior to 3.5.5 are vulnerable to an Improper Access Control vulnerability, which could allow a low privilege authenticated attacker with network access to the integrated web server to download sensitive information from the device containing user account credentials.\nCVE-2022-45937 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has prepared a fix and recommends updating to the following:\n\nAPOGEE PXC Series (BACnet): Update to version 3.5.5 or later\nAPOGEE PXC Series (P2 Ethernet): Update to version 2.8.20 or later\nTALON TC Series (BACnet): Update to version 3.5.5 or later\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends  configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals. \nFor more information, see Siemens Security Advisory SSA-180579 in HTML or CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-45937"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-16",
  "title": "Siemens APOGEE and TALON | CISA",
  "source": "ics-advisories",
  "id": "b9ee787f43bb28f37380710629287cd0720dc64c87120ef7c3053ad83a379903"
}