{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). \n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Xpedition Designer\nVulnerability: Incorrect Permission Assignment for Critical Resource\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated local attacker to inject arbitrary code and escalate privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following PCB design flow products: \n\nXpedition Designer: All versions prior to vX.2.11\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nThe affected application assigns improper access rights to the service executable. This could allow an authenticated local attacker to inject arbitrary code and escalate privileges.\nCVE-2022-31465 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released update vX.2.11 for the Xpedition Designer and recommends updating to the latest version. \nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nHarden the application server to prevent local access by untrusted personnel.\nRemove write permissions for every non-administrative user on files and folders located under the installation path.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor additional information, please refer to Siemens Security Advisory SSA-988345: \n\nSSA-988345: PDF Version\nSSA-988345: TXT Version\nSSA-988345: CSAF Version\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-31465"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-11",
  "title": "Siemens Xpedition Designer | CISA",
  "source": "ics-advisories",
  "id": "9ca8b543d66bf07667b1bedd112fad65a84f3154a7e7c19f3ec6af89af217b61"
}