{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: JTEKT Corporation\nEquipment: TOYOPUC products\nVulnerability: Allocation of Resources Without Limits or Throttling\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to deny Ethernet communications between affected devices without authorization.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of these TOYOPUC products are affected:\n\nTOYOPUC-PC10 Series:\n\nPC10G-CPU TCC-6353: All versions\nPC10GE TCC-6464: All versions\nPC10P TCC-6372: All versions\nPC10P-DP TCC-6726: All versions\nPC10P-DP-IO TCC-6752: All versions\nPC10B-P TCC-6373: All versions\nPC10B TCC-1021: All versions\nPC10B-E/C TCU-6521: All versions\nPC10E TCC-4637: All versions\nPC10PE TCC-1101: All versions\nPC10PE-1616P TCC-1102: All versions\nEF10 TCU-6982: All versions\n\n\nTOYOPUC-Plus Series:\n\nPlus CPU TCC-6740: All versions \nPlus EX TCU-6741: All versions\nPlus EX2 TCU-6858: All versions\nPlus EFR TCU-6743: All versions\nPlus EFR2 TCU-6859: All versions\nPlus 2P-EFR TCU-6929: All versions\nPlus BUS-EX TCU-6900: All versions\n\n\nTOYOPUC-PC3J/PC2J Series:\n\nFL/ET-T-V2H THU-6289: All versions\n2PORT-EFR THU-6404: All versions\n\n\nTOYOPUC-Nano Series\n\nNano 10GX TUC-1157: All versions\nNano CPU TUC-6941: All versions\nNano 2ET TUU-6949: All versions\nNano Safety TUC-1085: All versions\nNano Safety RS00IP TUU-1086: All versions\nNano Safety RS01IP TUU-1087: All versions\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    ALLOCATION OF RESOURCES WITHOUT LIMITS OR THROTTLING CWE-770\nThe affected product may not be able to properly process an ICMP flood, which may allow an attacker to deny Ethernet communications between affected devices.\nCVE-2021-33011 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nYenting Lee of Trend Micro, working with Trend Micro’s Zero Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nJTEKT recommends the following workaround for this vulnerability:\n\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nTo prevent unauthorized devices from being connected to the free ports of the HUB, use LAN port lock to close the free ports.\n\nRequests for additional information can be sent to JTEKT Corporation via website form. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-33011"
  ],
  "techniques": [],
  "advisory": "icsa-21-245-02",
  "title": "JTEKT TOYOPUC Products | CISA",
  "source": "ics-advisories",
  "id": "9e476f5f909d124428db4aefa7314b324522b07eead584d5c09d8ba41e2a8a0a"
}