{
  "markdown": "\nCVSS v3 7.0\nVendor: Rockwell Automation\nEquipment: Connected Components Workbench\nVulnerability: DLL Hijack\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on February 16, 2017, and is being released to the ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following Connected Components Workbench (CCW), a software configuration platform, versions are affected:\n\nConnected Components Workbench – Developer Edition, v9.01.00 and earlier.\n\n\n9328-CCWDEVENE,\n9328-CCWDEVZHE,\n9328-CCWDEVFRE,\n9328-CCWDEVITE,\n9328-CCWDEVDEE,\n9328-CCWDEVESE, and\n9328-CCWDEVPTE.\n\n\nConnected Components Workbench – Free Standard Edition (All Supported Languages), v9.01.00 and earlier.\n\nIMPACT\nSuccessful exploitation of this vulnerability could range from a denial of service (DoS) to the injection of malicious code into trusted processes, depending on the content of the DLL and the risk mitigations in place by the victim.\nMITIGATION\nRockwell Automation has released a new version of Connected Components Workbench, Version 10.00 and Version 10.01 (All supported languages) which addresses the identified vulnerability.\nRockwell Automation recommends updating to the latest version of Connected Components Workbench, Version 10.00 or later, which is available at the following location:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductFindDownloads.aspx?crumb=112&refSoft=1&toggleState=&versions=55834,55972\nFor more information on this vulnerability and more detailed mitigation instructions, please see Rockwell Automation advisory labeled Connected Components Workbench Software Dynamic Link Library (DLL) Hijack Version 1.0, February 16, 2017, at the following location:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1030688\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. Not remotely exploitable. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nDLL HIJACKING CWE-427\n\nCertain DLLs included with versions of CCW software can be potentially hijacked to allow an attacker to gain rights to a victim’s affected personal computer. Such access rights can be at the same or potentially higher level of privileges as the compromised user account, including and up to computer administrator privileges.\nCVE-2017-5176 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nIvan Sanchez reported this vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Defense Industrial Base, Energy, and Government Facilities\nCountries/Areas Deployed: Globally\nCompany Headquarters Location: Milwaukee, Wisconsin\n",
  "cves": [
    "CVE-2017-5176"
  ],
  "techniques": [],
  "advisory": "icsa-17-047-01",
  "title": "Rockwell Automation Connected Components Workbench | CISA",
  "source": "ics-advisories",
  "id": "822e120af249567b8bd3d0d2885a5b6f21de4b65bf2579b5b78b9b1e69c9d05c"
}