{
  "markdown": "\nOverview\nSiemens has reported a privilege escalation vulnerability in the Siemens COMOS database application. Siemens has produced an update that fixes this vulnerability. This vulnerability could be exploited remotely.\nAffected Products\nSiemens reports that the vulnerability affects the following versions of COMOS:\n\nall versions earlier than Version 9.1,\nVersion 9.1: Patch 412 and earlier,\nVersion 9.2: Update 3 Patch 022 and earlier, and\nVersion 10: Patch 004 and earlier.\n\nImpact\nAuthenticated users with read privileges could escalate their privileges by exploiting this vulnerability. Thus, the attacker is able to gain administrator access to the database.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nSiemens COMOS is an object oriented database system that supports collecting, processing, saving, and distributing of information through a design process. It allows the configuration of different user privileges to different users.\nVulnerability Characterization\nVulnerability Overview\nPrivilege EscalationCWE-250: Execution with Unnecessary Privileges, http://cwe.mitre.org/data/definitions/122.html, Web site last accessed August 14, 2012.\nAuthenticated users with read privileges could escalate their privileges by exploiting a documented method in the design of the database. As a result, the attacker gains administrator access to the database.\nCVE-2012-3009 has been assigned to this vulnerability. A CVSS v2 base score of 8.5 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:S/C:C/I:C/A:C).\nVulnerability Details\nExploitability\nThis vulnerability could be exploited remotely.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a medium skill level could exploit these vulnerabilities.\nMitigation\nFor COMOS Versions 9.1, 9.2, and 10.0, Siemense recommends installing the corresponding patches as soon as possible:\n\nVersion 9.1 Patch 413,\nVersion 9.2 Update 03 Patch 023, and\nVersion V10 Patch 005.\n\nThese software updates are available at Siemens customer support. For earlier versions, Siemens recommends upgrading to a newer version.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01A—Cyber Intrusion Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2012-3009"
  ],
  "techniques": [],
  "advisory": "icsa-12-227-01",
  "title": "Siemens COMOS Database Privilege Escalation Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "35d3c17ac5c706a9c786c840a839d81b5693aac3afc313238946ede697aef00b"
}