{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: JT2Go & Teamcenter Visualization\nVulnerabilities: Use After Free, Out-of-bounds Write, Out-of-bounds Read, NULL Pointer Dereference\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to crash an application or execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nJT2Go: All versions prior to v13.2.0.1\nTeamcenter Visualization: All versions prior to v13.2.0.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE AFTER FREE CWE-416\nA use-after-free issue exists in the DGN file-reading procedure in the Open Design Alliance Drawings SDK, all versions prior to 2022.4, resulting from the lack of proper validation of user-supplied data. This can result in a memory corruption or arbitrary code execution, allowing attackers to cause a denial-of-service condition or execute code in the context of the current process.\nCVE-2021-32944 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds write issue exists in the DXF file-recovering procedure in the Open Design Alliance Drawings SDK, all versions prior to 2022.4, resulting from the lack of proper validation of user-supplied data. This can result in a write past the end of an allocated buffer and allow attackers to cause a denial-of-service condition or execute code in the context of the current process.\nCVE-2021-32936 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds write issue exists in the DWG file-recovering procedure in the Open Design Alliance Drawings SDK, all versions prior to 2022.4, resulting from the lack of proper validation of user-supplied data. This can result in a write past the end of an allocated buffer and allow attackers to cause a denial-of-service condition or execute code in the context of the current process.\nCVE-2021-32948 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    OUT-OF-BOUNDS READ CWE-125\nOpen Design Alliance Drawings SDK, all versions prior to 2022.4, are vulnerable to an out-of-bounds read due to parsing of DWG files resulting from the lack of proper validation of user-supplied data. This can result in a read past the end of an allocated buffer and allows attackers to cause a denial-of-service condition or read sensitive information from memory.\nCVE-2021-32938 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:H).\n3.2.5    OUT-OF-BOUNDS READ CWE-125\nAn out-of-bounds read issue exists in the DWG file-recovering procedure in the Open Design Alliance Drawings SDK, all versions prior to 2022.4, resulting from the lack of proper validation of user-supplied data. This can result in a read past the end of an allocated buffer and allow attackers to cause a denial-of-service condition or read sensitive information from memory.\nCVE-2021-32940 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:H).\n3.2.6    OUT-OF-BOUNDS READ CWE-125\nAn out-of-bounds read issue exists in the DXF files in the Open Design Alliance Drawings SDK, all versions prior to 2022.4, resulting from the lack of proper validation of user-supplied data. This can result in a read past the end of an allocated buffer and allow attackers to cause a denial-of-service condition or read sensitive information from memory.\nCVE-2021-32950 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:H).\n3.2.7    NULL POINTER DEREFERENCE CWE-476\nWhen parsing specially crafted CGM files, a NULL pointer dereference condition could cause the application to crash. The application must be restarted to restore the service. An attacker could leverage this vulnerability to cause a denial-of-service condition in the application.\nCVE-2021-33717 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMat Powell and Brian Gorenc of Trend Micro’s Zero Day Initiative, Kai Wang from Codesafe Team of Legendsec at Qi’anxin Group, and Open Design Alliance reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens has released updates for the following products:\n\nJT2Go: Update to v13.2.0.1 or later\nTeamcenter Visualization: Update to v13.2.0.1 or later (login required)\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nAvoid opening untrusted files from unknown sources in JT2Go and Teamcenter Visualization\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-365397\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-33717",
    "CVE-2021-32948",
    "CVE-2021-32940",
    "CVE-2021-32938",
    "CVE-2021-32950",
    "CVE-2021-32936",
    "CVE-2021-32944"
  ],
  "techniques": [],
  "advisory": "icsa-21-222-01",
  "title": "Siemens JT2Go and Teamcenter Visualization products | CISA",
  "source": "ics-advisories",
  "id": "d380590d6c0c364159c307ded4ac64d861141a36b4f2513b4c0ee50418aac686"
}