{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Mitsubishi Electric\nEquipment: Factory Automation Engineering Software Products\nVulnerabilities: Improper Restriction of XML External Entity Reference and Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a local attacker to send files outside of the system as well as cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Factory Automation engineering software products are affected:\n\nCPU Module Logging Configuration Tool, Versions 1.94Y and prior\nCW Configurator, Versions 1.010L and prior\nEM Software Development Kit (EM Configurator), Versions 1.010L and prior\nGT Designer3（GOT2000), Versions 1.221F and prior\nGX LogViewer, Versions 1.96A and prior\nGX Works2, Versions 1.586L and prior\nGX Works3, Versions 1.058L and prior\nM_CommDTM-HART, Version 1.00A\nM_CommDTM-IO-Link, Versions 1.02C and prior\nMELFA-Works, Versions 4.3 and prior\nMELSEC-L Flexible High-Speed I/O Control Module Configuration Tool, Versions 1.004E and prior\nMELSOFT FieldDeviceConfigurator, Versions 1.03D and prior\nMELSOFT iQ AppPortal, Versions 1.11M and prior\nMELSOFT Navigator, Versions 2.58L and prior\nMI Configurator, Versions 1.003D and prior\nMotion Control Setting, Versions 1.005F and prior\nMR Configurator2, Versions 1.72A and prior\nMT Works2, Versions 1.156N and prior\nRT ToolBox2, Versions 3.72A and prior\nRT ToolBox3, Versions 1.50C and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nThe vulnerability could allow a malicious attacker to send a file on the computer running the product to the outside.\nCVE-2020-5602 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe vulnerability could allow a malicious attacker to cause the product to enter a denial-of-service condition.\nCVE-2020-5603 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric PSIRT reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends that affected users download the latest version of each software product from the following site and update it: https://www.mitsubishielectric.com/fa/#software\nThe fixed versions are as follows:\n\nCPU Module Logging Configuration Tool, Version 1.100E or later\nCW Configurator, Version 1.011M or later\nEM Software Development Kit (EM Configurator), Version 1.015R or later\nGT Designer3（GOT2000), Version 1.225K or later\nGX LogViewer, Version 1.100E or later\nGX Works2, Version 1.590Q or later\nGX Works3, Version 1.060N or later\nM_CommDTM-HART, Version 1.01B or later\nM_CommDTM-IO-Link, Version 1.03D or later\nMELFA-Works, Version 4.4 or later\nMELSEC-L Flexible High-Speed I/O Control Module Configuration Tool, Version 1.005F or later\nMELSOFT FieldDeviceConfigurator, Version 1.04E or later\nMELSOFT iQ AppPortal, Version 1.14Q or later\nMELSOFT Navigator, Version 2.62Q or later\nMI Configurator, Version 1.004E or later\nMotion Control Setting, Version 1.006G or later\nMR Configurator2, Version 1.100E or later\nMT Works2, Version 1.160S or later\nRT ToolBox2, Version 3.73B or later\nRT ToolBox3, Version 1.60N or later\n\nFor affected users who cannot immediately update the software products, Mitsubishi Electric recommends the following mitigation measures to minimize the risk of these vulnerabilities:\n\nMake sure that the file is obtained from the correct acquisition route when users receive a project file or a configuration data file from another person via mail, USB memory, file server, etc. (Or, check that there is no file of unknown source.)\nOperate the products under an account that does not have administrative privileges.\nInstall an antivirus software in your personal computer using the products.\nRestrict network exposure for all control system devices or systems to the minimum necessary, and ensure that they are not accessible from untrusted networks and hosts.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nUse Virtual Private Network (VPN) when remote access is required.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-5603",
    "CVE-2020-5602"
  ],
  "techniques": [],
  "advisory": "icsa-20-182-02",
  "title": "Mitsubishi Electric Factory Automation Engineering Software Products | CISA",
  "source": "ics-advisories",
  "id": "92982cfa8de2382822728c50bbb11eda3c19f73dbc15d6cca8feffee70da414b"
}