{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Delta Electronics\nEquipment: DOPSoft\nVulnerability: Stack-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-238-04 Delta Electronics DOPSoft that was published August 26, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow arbitrary code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of DOPSoft are affected:\n\nDOPSoft Version 4.00.11 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nA stack-based buffer overflow vulnerability may be exploited by processing a specially crafted project file, which may allow an attacker to execute arbitrary code.\nCVE-2021-33019 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n4.4 RESEARCHER\nAn anonymous researcher working with Trend Micro’s Zero Day Initiative reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 ---------\nDelta Electronics recommends users update to DOPSoft v4.00.11.22\nDOPSoft users can contact Delta Electronics customer support for additional information. \n--------- End Update A Part 1 of 1 ---------\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-33019"
  ],
  "techniques": [],
  "advisory": "icsa-21-238-04",
  "title": "Delta Electronics DOPSoft (Update A) | CISA",
  "source": "ics-advisories",
  "id": "6fdfbcc555c8454237beeed1c184423fda10b6618d83d94034433c10ef1fbfa8"
}