{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi ABB Power Grids\nEquipment: Ellipse APM\nVulnerability: Cross-site Scripting\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an authenticated user or integrated application to inject malicious data into the application that can then be executed in a victim’s browser.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi ABB Power Grids reports the vulnerability affects the following Ellipse APM products: \n\nEllipse APM Versions 5.3.0.1 and earlier\nEllipse APM Versions 5.2.0.3 and earlier\nEllipse APM Versions 5.1.0.6 and earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CROSS-SITE SCRIPTING CWE-79\nA stored XSS vulnerability in the main dashboard of Ellipse APM versions prior to 5.3.0.1, 5.2.0.3, and 5.1.0.6 allows an authenticated user or integrated application to inject malicious data into the application that can then be executed in a victim’s browser. \nCVE-2021-27887 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi ABB Power Grids reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi ABB Power Grids recommends users apply Ellipse APM Versions 5.3.0.2, 5.2.0.4, and 5.1.0.7 at the earliest convenience. Please see the advisory on the Hitachi ABB Power Grids website for more information.\nHitachi ABB Power Grids recommends the following general cybersecurity hygiene to reduce the risk of exploitation:\n\nEnsure the “Administrator” application role is only granted to fully trusted APM users who are trained not to import harmful data to APM (e.g., containing HTML or JavaScript).\nLimit all “Import” role API credentials and integrations to only those providing safe data. Introduce filters in the source applications to ensure data safety.\nIntroduce a Web Application Firewall solution in front of the APM web interfaces with a capability of blocking XSS attack payloads in HTTP(S) requests, both plain REST (JSON/XML) as well as Excel files wrapped in REST (JSON).\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27887"
  ],
  "techniques": [],
  "advisory": "icsa-21-110-01",
  "title": "Hitachi ABB Power Grids Ellipse APM | CISA",
  "source": "ics-advisories",
  "id": "98a629f2907ffd92ddae6d29613166fdafaec09374df3c30461f73d1013e690f"
}