{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Entes\nEquipment: EMG 12\nVulnerabilities: Improper Authentication, Information Exposure Through Query Strings in GET Request\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow attackers to gain unauthorized access and could allow the ability to change device configuration and settings.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of EMG 12, an Ethernet Modbus Gateway, are affected:\n\nEMG12 Ethernet Modbus Gateway Firmware Version 2.57 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe application uses a web interface where it is possible for an attacker to bypass authentication with a specially crafted URL. This could allow for remote code execution.  \nCVE-2018-14826 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    INFORMATION EXPOSURE THROUGH QUERY STRINGS IN GET REQUEST CWE-598\nAn information exposure through query strings vulnerability in the web interface has been identified, which may allow an attacker to impersonate a legitimate user and execute arbitrary code.\nCVE-2018-14822 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Turkey\n\n3.4 RESEARCHER\nCan Demirel of Biznet Bilisim reported this vulnerability to NCCIC.\n4. MITIGATIONS\nEntes recommends that users update to the latest available firmware version. This can be requested by calling, tel:+902163130110 or by email at teknikdestek@entes.com.tr\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-14822",
    "CVE-2018-14826"
  ],
  "techniques": [],
  "advisory": "icsa-18-275-03",
  "title": "Entes EMG 12 | CISA",
  "source": "ics-advisories",
  "id": "7887ce5c3b7ce2d1526948077e555d1379a8e4104708b0bbc4d8b27147a32364"
}