{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric Corporation\nEquipment: GT SoftGOT2000\nVulnerability: Operating System (OS) Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute malicious OS commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports this vulnerability affects OpenSSL in the following products:\n\nGT SoftGOT2000 1.275M—1.280S\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OS COMMAND INJECTION CWE-78\nA malicious OS command execution vulnerability in OpenSSL affects Mitsubishi Electric GT SoftGOT2000. If an attacker sends a specially crafted certificate, then this vulnerability could allow an attacker to execute malicious OS commands.\nCVE-2022-2068 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported to CISA that this known OpenSSL vulnerability affects GT SoftGOT2000.\n4. MITIGATIONS\nMitsubishi Electric recommends users install version 1.285X or later to mitigate this issue. Users should contact Mitsubishi Electric to obtain the fixed version of GT SoftGOT2000. For detailed installation procedures, users should refer to \"GT SoftGOT2000 Version1 Operation Manual (SH-081201ENG).\"\nRefer to the Mitsubishi Electric advisory for further details and instructions for determining installed versions.\nMitsubishi Electric recommends users take the following mitigations to minimize the risk of exploiting this vulnerability:\n\nUse affected products from inside a local area network (LAN) and block access from untrusted networks and hosts.\nInstall antivirus software on the host machine where affected products are installed.\nRestrict physical access to the host machine with the products installed and network equipment.\nDo not store untrusted certificates.\nDo not click on web links in emails or any other communications from untrusted sources.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has a low attack complexity.\n",
  "cves": [
    "CVE-2022-2068"
  ],
  "techniques": [],
  "advisory": "icsa-22-319-01",
  "title": "Mitsubishi Electric GT SoftGOT2000 | CISA",
  "source": "ics-advisories",
  "id": "5ca169052e92b7b0b170f0b6e6bbf1bdbbea4326c5604f0ea921cd57876eb223"
}