{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SIMATIC S7-300 CPUs and SINUMERIK Controller\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-315-04 Siemens SIMATIC S7-300 CPUs and SINUMERIK Controller that was published November 10, 2020, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following products:\n\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions\nSINUMERIK 840D sl: All versions\n\n--------- Begin Update A Part 1 of 1 ---------\n\nSIMATIC TDC CPU555: All versions\n\n--------- End Update A Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAn attacker may send multiple specially crafted packets to the affected devices, which may cause a denial-of-service condition. A cold restart is required to recover the service.\nCVE-2020-15783 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nWangFangLi from Beijing Winicssec Technology CO reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens is preparing updates and recommends users protect network access to Port 102/TCP of affected devices.\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: \nhttps://www.siemens.com/industrialsecurity\nFor additional information, please refer to Siemens Security Advisory SSA-492828\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-15783"
  ],
  "techniques": [],
  "advisory": "icsa-20-315-04",
  "title": "Siemens SIMATIC S7-300 CPUs and SINUMERIK Controller (Update A) | CISA",
  "source": "ics-advisories",
  "id": "ebd332f476294cf5814280cd888beaab6aeb5182eeb29e01d409455dac6be92b"
}