{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC CP Devices\nVulnerabilities: Heap-based Buffer Overflow, Command Injection, Code Injection\n\n2. UPDATE\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-195-12 Siemens SRCS VPN Feature in SIMATIC CP Devices that was published July 14, 2022, on the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nThese vulnerabilities, if successfully exploited when authorized personnel are using the SINEMA Remote Connect Server (SRCS) VPN feature, could allow an attacker to execute arbitrary code with elevated privileges under certain circumstances.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC CP Devices, communication processors, are affected:\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMATIC CP 1242-7 V2 (6GK7242-7KX31-0XE0): All versions prior to V3.3.46\nSIMATIC CP 1243-1 (6GK7243-1BX30-0XE0): All versions prior to V3.3.46\nSIMATIC CP 1243-7 LTE EU (6GK7243-7KX30-0XE0): All versions prior to V3.3.46\nSIMATIC CP 1243-7 LTE US (6GK7243-7SX30-0XE0): All versions prior to V3.3.46\nSIMATIC CP 1243-8 IRC (6GK7243-8RX30-0XE0): All versions prior to V3.3.46\nSIMATIC CP 1542SP-1 IRC (6GK7542-6VX00-0XE0): All versions v2.0 and later\nSIMATIC CP 1543-1 (6GK7543-1AX00-0XE0): All versions prior to v3.0.22\nSIMATIC CP 1543SP-1 (6GK7543-6WX00-0XE0): All versions v2.0 and later\nSIPLUS ET 200SP CP 1542SP-1 IRC TX RAIL (6AG2542-6VX00-4XE0): All versions v2.0 and later\nSIPLUS ET 200SP CP 1543SP-1 ISEC (6AG1543-6WX00-7XE0): All versions v2.0 and later\nSIPLUS ET 200SP CP 1543SP-1 ISEC TX RAIL (6AG2543-6WX00-4XE0): All versions v2.0 and later\nSIPLUS NET CP 1242-7 V2 (6AG1242-7KX31-7XE0): All versions prior to V3.3.46\nSIPLUS NET CP 1543-1 (6AG1543-1AX00-2XE0): All versions prior to v3.0.22\nSIPLUS S7-1200 CP 1243-1 (6AG1243-1BX30-2AX0): All versions prior to V3.3.46\nSIPLUS S7-1200 CP 1243-1 RAIL (6AG2243-1BX30-1XE0): All versions prior to V3.3.46\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe application lacks proper validation of user-supplied data when parsing specific messages. This could result in a heap-based buffer overflow. An attacker could leverage this vulnerability to execute arbitrary code in the context of the device.\nCVE-2022-34819 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nThe application does not correctly escape some user provided fields during the authentication process. This could allow an attacker to inject custom commands and execute arbitrary code with elevated privileges.\nCVE-2022-34820 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).\n4.2.3    IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94\nBy injecting code to specific configuration options for OpenVPN, an attacker could execute arbitrary code with elevated privileges.\nCVE-2022-34821 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends updating to the latest version of its software if available:\n--------- Begin Update A Part 2 of 2 ---------\n\nSIMATIC CP 1242-7 V2 (6GK7242-7KX31-0XE0): Update to V3.3.46 or later\nSIMATIC CP 1243-1 (6GK7243-1BX30-0XE0): Update to V3.3.46 or later\nSIMATIC CP 1243-7 LTE EU (6GK7243-7KX30-0XE0): Update to V3.3.46 or later\nSIMATIC CP 1243-7 LTE US (6GK7243-7SX30-0XE0): Update to V3.3.46 or later\nSIMATIC CP 1243-8 IRC (6GK7243-8RX30-0XE0): Update to V3.3.46 or later\nSIMATIC CP 1543-1 (6GK7543-1AX00-0XE0): Update to V3.0.22 or later\nSIPLUS NET CP 1242-7 V2 (6AG1242-7KX31-7XE0): Update to V3.3.46 or later\nSIPLUS NET CP 1543-1 (6AG1543-1AX00-2XE0): Update to V3.0.22 or later\nSIPLUS S7-1200 CP 1243-1 (6AG1243-1BX30-2AX0): Update to V3.3.46 or later\nSIPLUS S7-1200 CP 1243-1 RAIL (6AG2243-1BX30-1XE0): Update to V3.3.46 or later\n\n--------- End Update A Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations that customers can implement to reduce exploitation risk:\n\nConfigure the CP to only connect to trusted SINEMA Remote Connect Server instances.\nBlock access to port 5243/UDP with an external firewall if possible.\nDisable the SINEMA Remote Connect Server (SRCS) VPN feature.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ Operational Guidelines for Industrial Security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-517377.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n \n",
  "cves": [
    "CVE-2022-34820",
    "CVE-2022-34819",
    "CVE-2022-34821"
  ],
  "techniques": [],
  "advisory": "icsa-22-195-12",
  "title": "Siemens SRCS VPN Feature in SIMATIC CP Devices (Update A) | CISA",
  "source": "ics-advisories",
  "id": "9e71e2a09cafbb8865f23e98e26fa308fa1977fbca325455c585634dbf545396"
}