{
  "markdown": "\nOVERVIEW\nIndependent researcher Maxim Rupp has identified vulnerabilities in Honeywell’s XL Web II controller application. Honeywell has produced a new version to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following XL Web II controller versions are affected:\n\nXL1000C500 XLWebExe-2-01-00 and prior, and\nXLWeb 500 XLWebExe-1-02-08 and prior.\n\nIMPACT\nAn attacker may use these vulnerabilities to expose a password by accessing a specific URL. The XL Web II controller application effectively becomes an entry point into the network where it is located.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nHoneywell is a US-based company that maintains offices worldwide.\nThe affected products, XL Web II controllers, are web-based SCADA systems. According to Honeywell, XL Web II controllers are deployed across several sectors including Critical Manufacturing, Energy, Water and Wastewater Systems, and others. Honeywell estimates that these products are used primarily in Europe and the Middle East.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nPLAINTEXT STORAGE OF A PASSWORDCWE-256: Plaintext Storage of a Password, https://cwe.mitre.org/data/definitions/256.html, web site last accessed February 02, 2017.\n\nAny user is able to disclose a password by accessing a specific URL.\nCVE-2017-5139NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2017-5139, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed February 02, 2017.\n\nINSUFFICENTLY PROTECTED CREDENTIALSCWE-522: Insufficiently Protected Credentials https://cwe.mitre.org/data/definitions/522.html, web site last accessed February 02, 2017.\n\nPassword is stored in clear text.\nCVE-2017-5140NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2017-5140, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed February 02, 2017.\n\nSESSION FIXATIONCWE-384: Session Fixation, https://cwe.mitre.org/data/definitions/384.html, web site last accessed February 02, 2017.\n\nAn attacker can establish a new user session, without invalidating any existing session identifier, which gives the opportunity to steal authenticated sessions.\nCVE-2017-5141NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2017-5141, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:L/A:L, web site last accessed February 02, 2017.\n\nIMPROPER PRIVILEGE MANAGEMENTCWE-269: Improper Privilege Management, https://cwe.mitre.org/data/definitions/269.html, web site last accessed February 02, 2017.\n\nA user with low privileges is able to open and change the parameters by accessing a specific URL.\nCVE-2017-5142NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2017-5142, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:L, web site last accessed February 02, 2017.\n\nPATH TRAVERSALCWE-23: Relative Path Traversal, https://cwe.mitre.org/data/definitions/23.html, web site last accessed February 02, 2017.\n\nA user without authenticating can make a directory traversal attack by accessing a specific URL.\nCVE-2017-5143NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2017-5143, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L, web site last accessed February 02, 2017.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nHoneywell has developed Version 3.04.05.05 to fix the vulnerabilities in the XL Web II controllers. Users are encouraged to contact the local Honeywell HBS branch to have their sites updated to the latest version.\nIn the Centraline partner channel, Excel Web controllers also have been sold under the brand name “FALCON.” Users can obtain the latest versions by contacting Centraline:\nhttps://www.centraline.com/enGB/centraline/contact.html\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2017-5141",
    "CVE-2017-5140",
    "CVE-2017-5142",
    "CVE-2017-5143",
    "CVE-2017-5139"
  ],
  "techniques": [],
  "advisory": "icsa-17-033-01",
  "title": "Honeywell XL Web II Controller Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "76997d97c9eaeb0d461d1f8767c106cc6ef28cb9ba8a323acda58af34a5ecdbe"
}