{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: WebAccess/NMS\nVulnerabilities: Unrestricted Upload of File with Dangerous Type, SQL Injection, Relative Path Traversal, Missing Authentication for Critical Function, Improper Restriction of XML External Entity Reference, OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to gain remote code execution, upload files, delete files, cause a denial-of-service condition, and create an admin account for the application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WebAccess/NMS, a network management system, are affected:\n\nWebAccess/NMS versions prior to 3.0.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nMultiple issues exist that allow files to be uploaded and executed on the system.\nCVE-2020-10621 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThere are multiple ways an unauthenticated attacker could perform SQL injection to gain access to sensitive information.\nCVE-2020-10617 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nMultiple vulnerabilities could allow an attacker with low privileges to perform SQL injection to gain access to sensitive information.\nCVE-2020-10623 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.2.4    RELATIVE PATH TRAVERSAL CWE-23\nAn attacker could use a specially crafted URL to delete files outside the application’s control.\nCVE-2020-10619 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n3.2.5    RELATIVE PATH TRAVERSAL CWE-23\nAn attacker could use a specially crafted URL to delete or read files outside the application’s control.\nCVE-2020-10631 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H).\n3.2.6    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe application allows an unauthenticated remote user to create a new admin account.\nCVE-2020-10625 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.2.7    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nThe application does not sanitize XML input. Specially crafted XML input could allow an attacker to read sensitive files.\nCVE-2020-10629 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.8    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nThe application does not properly sanitize user input and may allow an attacker to inject system commands remotely.\nCVE-2020-10603 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, United States, Europe\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nrgod of 9sg working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAdvantech recommends updating to Version 3.0.2\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-10629",
    "CVE-2020-10621",
    "CVE-2020-10625",
    "CVE-2020-10623",
    "CVE-2020-10619",
    "CVE-2020-10603",
    "CVE-2020-10631",
    "CVE-2020-10617"
  ],
  "techniques": [],
  "advisory": "icsa-20-098-01",
  "title": "Advantech WebAccess/NMS | CISA",
  "source": "ics-advisories",
  "id": "606b4f07b9be3bb3c19830ae22733538ce7182995f4113cde0ea8c3cbd8ceadd"
}