{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.7\n\nVendor: Johnson Controls\nEquipment: exacqVision Enterprise System Manager (ESM)\nVulnerability: Improper Authorization\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow malicious code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThis vulnerability impacts exacqVision ESM v5.12.2 and prior. All Microsoft Windows operating systems are affected with the exception of Microsoft Windows Server.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHORIZATION CWE-285\nBy default, excessive permissions to directories are granted to authorized, low-privilege system accounts. This could be leveraged by an attacker to make application file changes or to enable privilege escalation attacks.\nCVE-2019-7588 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\n@bzyo_ reported this vulnerability to Johnson Controls. Johnson Controls reported this vulnerability to NCCIC.\n4. MITIGATIONS\nJohnson Controls recommends the following:\n\nUsers should upgrade to the latest product, Version 19.03\nFurther ICS security notices and product security guidance are located at the Johnson Controls product security website: https://www.johnsoncontrols.com/cyber-solutions/security-advisories\n\nFor questions concerning this product, contact Johnson Controls Global Product Security:\nhttps://www.johnsoncontrols.com/cyber-solutionsproductsecurity@jci.com\nNCCIC recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-7588"
  ],
  "techniques": [],
  "advisory": "icsa-19-164-01",
  "title": "Johnson Controls exacqVision Enterprise System Manager | CISA",
  "source": "ics-advisories",
  "id": "1da7d6a8b3ec2074e0a42ec384699f8b4203d19ea4e57fa617bd9c9834373ef6"
}