{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: 3S-Smart Software Solutions GmbH\nEquipment: CODESYS Control V3 products\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthorized access and exfiltration of sensitive data including user credentials.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n3S-Smart Software Solutions GmbH reports the vulnerability affects all variants of CODESYS Control V3 products containing the CmpSecureChannel or CmpUserMgr components prior to Version 3.5.14.0 of the following products, regardless of the CPU type or operating system:\n\nControl for BeagleBone,\nCODESYS Control for BeagleBone,\nCODESYS Control for emPC-A/iMX6,\nCODESYS Control for IOT2000,\nCODESYS Control for Linux,\nCODESYS Control for PFC100,\nCODESYS Control for PFC200,\nCODESYS Control for Raspberry Pi,\nCODESYS Control RTE V3,\nCODESYS Control RTE V3 (for Beckhoff CX),\nCODESYS Control Win V3 (also part of the CODESYS setup),\nCODESYS V3 Simulation Runtime (part of the CODESYS Development System),\nCODESYS Control V3 Runtime System Toolkit, and\nCODESYS HMI V3.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   IMPROPER ACCESS CONTROL CWE-284User access management and communication encryption is not enabled by default, which could allow an attacker access to the device and sensitive information, including user credentials.CVE-2018-10612 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nYury Serdyuk of Kaspersky Lab reported this vulnerability to CODESYS, who then reported it to NCCIC.\n4. MITIGATIONS\n3S-Smart Software Solutions GmbH recommends activating the CODESYS Control online user management and encryption of the online communication.3S-Smart Software Solutions GmbH recommends updating to the latest software Version 3.5.14.0 or newer.  The new software can be downloaded at the following location:https://www.codesys.com/download/3S-Smart Software Solutions GmbH also recommends updating the CODESYS Development System to the latest version.For more information, all public CODESYS advisories can be found at:https://www.codesys.com/security/security-reports.htmlIn general, 3S-Smart Software Solutions GmbH recommends, as part of the mitigation strategy, the following defensive measures to reduce the risk of exploitation of this vulnerability:\n\nUse controllers and devices only in a protected environment to minimize network exposure and ensure controllers are not accessible from outside\nUse firewalls to protect and separate the control system network from other networks\nUse VPN (Virtual Private Networks) tunnels if remote access is required\nActivate and apply user management and password features\nLimit the access to both development and control system by physical means, operating system features, etc.\nProtect both development and control system by using up-to-date virus detecting solutions.\n\nFor more information and general recommendations for protecting machines and plants, see also the CODESYS Security Whitepaper:https://customers.codesys.com/fileadmin/data/customers/security/CODESYS-Security-Whitepaper.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-10612"
  ],
  "techniques": [],
  "advisory": "icsa-18-352-03",
  "title": "3S-Smart Software Solutions GmbH CODESYS Control V3 Products | CISA",
  "source": "ics-advisories",
  "id": "cfc6d3675c6b917aca626c8faad441d46717c868ce511ae5d7edeb66a2e2bc02"
}