{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Honeywell\nEquipment: Experion PKS, LX, and PlantCruise\nVulnerabilities: Heap-based Buffer Overflow, Stack-based Buffer Overflow, Out-of-bounds Write, Uncontrolled Resource Consumption, Improper Encoding or Escaping of Output, Deserialization of Untrusted Data, Improper Input Validation, Incorrect Comparison\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause a denial-of-service condition, allow privilege escalation or allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHoneywell reports these vulnerabilities affect the following versions of Experion PKS, LX, and PlantCruise:  \n\nExperion PKS: versions prior to R520.2\nExperion LX: versions prior to R520.2\nExperion PlantCruise: versions prior to R520.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 HEAP-BASED BUFFER OVERFLOW CWE-122\nExperion Server or Console Station could experience a denial-of-service condition due to a heap overflow during the handling of a specially crafted message for a specific configuration operation.\nCVE-2023-23585 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2 STACK-BASED BUFFER OVERFLOW  CWE-121\nExperion Server or Console Station could experience a denial-of-service condition or remote code execution  due to a stack overflow during the handling of a specially crafted message for a specific configuration operation.\nCVE-2023-25078 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3 UNEXPECTED STATUS CODE OR RETURN VALUE CWE-394\nC300 could leak configuration data when an error is generated in response to a specially crafted message.\nCVE-2023-25948 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4 UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nC300 could experience a denial-of-service condition due to a buffer overflow in the handling of a specially crafted message received by the controller.\nCVE-2023-26597 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.5 IMPROPER ENCODING OR ESCAPING OF OUTPUT CWE-116\nC300 could experience a denial-of-service condition due to a stack overflow when decoding a message from the server.\nCVE-2023-24480 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.6 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nC300 could experience a denial-of-service condition due to a buffer overflow when an error is generated in response to a specially crafted message.\nCVE-2023-25770 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.7 INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nC300 may be loaded with malicious firmware which could enable remote code execution.\nCVE-2023-25178 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.8 INCORRECT COMPARISON CWE-697\nExperion Server may experience a denial-of-service condition due to an incorrect comparison when handling a specially crafted message.\nCVE-2023-22435 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.9 HEAP-BASED BUFFER OVERFLOW CWE-122 \nExperion Server may experience a denial-of-service condition due to a heap overflow which could occur when handling a specially crafted message.\nCVE-2023-24474 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nARMIS cyber researchers reported these vulnerabilities to Honeywell.\n4. MITIGATIONS\nHoneywell recommends users upgrade Experion Platforms to version R520.2. Download information includes the following:\n\nProduct: Experion PKS, LX, & PlantCruise\nVersion: R520.2\nFor instructions on this process:\n\nGo to the Honeywell Website and sign in.\nSelect “Support” at the top of the web page.\nSelect “Product Documents & Downloads.”\nIn the given search box, search for: “Experion PKS R520.2”, “Experion LX R520.2” or “Experion PlantCruise R520.2” and select the hyperlink for the given Experion platform.\n\n\n\nHoneywell advises users to follow security best practices for Experion platform environments to ensure access is limited to authorized users only. Users should ensure the backup files are maintained in a network location or physical drive with access limited to authorized users only and should not share them.\nHoneywell Security Notifications are available on the Honeywell website.  For access, users should visit the Honeywell website and sign in, select the search icon at the top of the web page, and search for “SN2023-06-22”.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have a low attack complexity.\n",
  "cves": [
    "CVE-2023-25078",
    "CVE-2023-25178",
    "CVE-2023-26597",
    "CVE-2023-23585",
    "CVE-2023-22435",
    "CVE-2023-25770",
    "CVE-2023-24474",
    "CVE-2023-25948",
    "CVE-2023-24480"
  ],
  "techniques": [],
  "advisory": "icsa-23-194-06",
  "title": "Honeywell Experion PKS, LX and PlantCruise | CISA",
  "source": "ics-advisories",
  "id": "52b487825bd8572bbbf2d48e30c155122b105672cdaf73daddb97bb7d24c92a3"
}