{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: PHOENIX CONTACT, Innominate Security Technologies\nEquipment: mGuard firmware\nVulnerability: Null Pointer Dereference\nAFFECTED PRODUCTS\nThe following versions of mGuard firmware versions 8.0.0 to 8.5.1, running on these mGuard Network Security Appliances, are affected:\n\nFL MGUARD RS4000 TX/TX VPN,\nFL MGUARD GT/GT,\nFL MGUARD GT/GT VPN,\nFL MGUARD RS4000 TX/TX,\nFL MGUARD SMART2 VPN,\nFL MGUARD SMART2,\nFL MGUARD RS2000 TX/TX VPN,\nFL MGUARD DELTA TX/TX,\nFL MGUARD DELTA TX/TX VPN,\nFL MGUARD PCI4000,\nFL MGUARD PCI4000 VPN,\nFL MGUARD PCIE4000 VPN,\nFL MGUARD RS2005 TX VPN,\nFL MGUARD RS4004 TX/DTX,\nFL MGUARD RS4004 TX/DTX VPN,\nFL MGUARD RS4000 TX/TX-P,\nFL MGUARD RS4000 TX/TX VPN-M,\nFL MGUARD CENTERPORT,\nFL MGUARD RS,\nFL MGUARD RS VPN ANALOG,\nTC MGUARD RS2000 3G VPN,\nTC MGUARD RS4000 3G VPN,\nTC MGUARD RS2000 4G VPN, and\nTC MGUARD RS4000 4G VPN.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow attackers to cause a remote denial of service and force a restart of all IPSec connections.\nMITIGATION\nPHOENIX CONTACT and Innominate Security Technologies recommend all users running mGuard devices with affected firmware versions to update to firmware Version 8.5.2 or higher, which fixes this vulnerability. Links to updates and additional information can be found in the CERT@VDE advisory at the following location:\nhttps://cert.vde.com/de-de/advisories/vde-2017-001\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is remotely exploitable.\nVULNERABILITY OVERVIEW\n\nNULL POINTER DEREFERENCE CWE-476\n\nOpenswan 2.6.39 and earlier, which is used in the mGuard firmware version 8.0.0 to 8.5.1, allows remote attackers to cause a denial of service (NULL pointer dereference and IKE daemon restart) via IKEv2 packets that lack expected payloads.\nCVE-2013-6466 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nPHOENIX CONTACT has reported this vulnerability via CERT@VDE to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Communications, Critical Manufacturing, Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2013-6466"
  ],
  "techniques": [],
  "advisory": "icsa-17-250-02",
  "title": "PHOENIX CONTACT, Innominate Security Technologies mGuard Firmware | CISA",
  "source": "ics-advisories",
  "id": "5a2b524db4be09c138fd0f6f3c6187c18bc00546a73f68183178bbffbd8f8c8c"
}