{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely\nVendor: Treck Inc.\nEquipment: TCP/IP\nVulnerability: Heap-based Buffer Overflow, Out-of-bounds Read, Out-of-bounds Write\n\nThe Treck TCP/IP stack may be known by other names such as Kasago TCP/IP, ELMIC, Net+ OS, Quadnet, GHNET v2, Kwiknet, or AMX.\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-353-01 Treck TCP/IP Stack that was published December 18, 2020, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow remote code execution and a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following components of Treck TCP/IP stack Version 6.0.1.67 and prior are affected:\n\nHTTP Server \nIPv6\nDHCPv6\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nA vulnerability in Treck HTTP Server components allow an attacker to cause a denial-of-service condition. This vulnerability may also result in arbitrary code execution.\nCVE-2020-25066 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds write in the IPv6 component may allow an unauthenticated user to potentially cause a possible denial-of-service via network access.\nCVE-2020-27337 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n4.2.3    OUT-OF-BOUNDS READ CWE-125\nAn issue was discovered in Treck IPv6. An out-of-bound read in the DHCPv6 client component may allow an unauthenticated user to cause a possible denial-of-service via adjacent network access.\nCVE-2020-27338 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:H).\n4.2.4    OUT-OF-BOUNDS READ CWE-125\nImproper input validation in the IPv6 component may allow an unauthenticated user to cause an out-of-bounds read of up to three bytes via network access.\nCVE-2020-27336 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Information Technology, Healthcare and Public Health, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\n--------- Begin Update A Part 1 of 1 ---------\nArie Haenel, Ofek Mostovoy, Yaakov Cohen, Yocheved Butterman, and Yossef Kuszer from Intel reported these vulnerabilities to Treck.\n--------- End Update A Part 1 of 1 ---------\n5. MITIGATIONS\nTreck recommends users apply the latest version of the affected products (Treck TCP/IP 6.0.1.68 or later versions). To obtain patches, email security@treck.com\nTreck recommends users who cannot apply the latest patches to implement firewall rules to filter out packets that contain a negative content length in the HTTP header.\nFor more detailed information on the vulnerabilities and the mitigating controls, please see the Treck advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nHigh skill level is needed to exploit. No known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-25066",
    "CVE-2020-27336",
    "CVE-2020-27338",
    "CVE-2020-27337"
  ],
  "techniques": [],
  "advisory": "icsa-20-353-01",
  "title": "Treck TCP/IP Stack (Update A) | CISA",
  "source": "ics-advisories",
  "id": "1b5f6e194504716a5c04ebee83d75d5e86625f299dd25c1cdb38fcbce53bf1c7"
}