{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: ABB\nEquipment: e-Design\nVulnerabilities: Incorrect Default Permissions\n\n2. RISK EVALUATION\n Exploitation of these vulnerabilities could allow privilege escalation or a denial-of service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n The following versions of e-Design engineering software are affected:\n\ne-Design: All versions prior to 1.12.2.0006\n\n3.2 VULNERABILITY OVERVIEW\n 3.2.1    INCORRECT DEFAULT PERMISSIONS CWE-276\nIncorrect default permissions in the affected product create a denial-of-service condition on the target machine, on which affected product is installed, after a reboot.\nCVE-2022-28702 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:H).\n3.2.2    INCORRECT DEFAULT PERMISSIONS CWE-276\nIncorrect default permissions in the affected product allows an attacker to install malicious software executed with SYSTEM permissions.\nCVE-2022-29483 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\n Michael DePlante (@izobashi) of Trend Micro's Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\n ABB recommends:\n\nUpdate to Version 1.12.2.0006 or later\nThe owner of the machine should not let any other user log in until the update is applied.\nThe machine owner should not leave the machine unlocked when not in use.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2022-28702",
    "CVE-2022-29483"
  ],
  "techniques": [],
  "advisory": "icsa-22-179-01",
  "title": "ABB e-Design | CISA",
  "source": "ics-advisories",
  "id": "59221941229ddc071614670ab3377333e00e63cf435c316515813f33c6c0c484"
}