{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.7\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: Allen-Bradley Stratix 5950\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to write a modified image to the component.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Allen-Bradley Stratix 5950 Security Appliance are affected:\n\n1783-SAD4T0SBK9\n1783-SAD4T0SPK9\n1783-SAD2T2SBK9\n1783-SAD2T2SPK9\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nA vulnerability in the logic that handles access control to one of the hardware components in Cisco's proprietary Secure Boot implementation could allow an authenticated, local attacker to write their own modified firmware image to the affected component.\nCVE-2019-1649 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nCisco Systems, Inc., reported this vulnerability to Rockwell Automation.\n4. MITIGATIONS\nRockwell Automation recommends users update to firmware version FRN v6.4.0, which addresses the reported vulnerability.\nRockwell also provides the following general security guidelines:\n\nUtilize proper network infrastructure controls, such as firewalls, to help ensure that requests from unauthorized sources are blocked and the controls are isolated from the business network.\nConsult the product documentation for specific features, such as access control lists and deep packet inspection, that may be used to block unauthorized changes, etc.\nBlock all traffic to EtherNet/IP or other CIP protocol-based devices from outside the manufacturing zone by blocking or restricting access to TCP and UDP Port 2222 and Port 44818, using proper network infrastructure controls such as firewalls, UTM devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation products, see Knowledgebase Article ID 898270.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\nEnsure the product is in a physically secure area.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-1649"
  ],
  "techniques": [],
  "advisory": "icsa-20-072-03",
  "title": "Rockwell Automation Allen-Bradley Stratix 5950 | CISA",
  "source": "ics-advisories",
  "id": "fded8c20c30b3a2f3e06020eb1021dd20a59c306aa51e9d95d004c962e23a5d8"
}