{
  "markdown": "\nOVERVIEW\nThis advisory was originally posted on the the US-CERT secure portal library (titled ICSA-12-150-01P Honeywell HMIWeb Browser Buffer Overflow Vulnerability) to allow customers time to download the vendor patch prior to full public disclosure.\nICS-CERT received a report from Honeywell and the Zero Day Initiative (ZDI),a concerning a buffer overflow vulnerability in all products using the Honeywell HMIWeb browser. This vulnerability was reported to ZDI by an anonymous researcher.\nHoneywell has created specific patches, based on the product version, that address this issue. These patches have not been independently validated.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe affected products and versions are:\n\nHoneywell Process Solutions:\n\nExperion Releases R400.x, R31x, R30x, and R2xx,\n\n\nHoneywell Building Solutions:\n\nEnterprise Building Manager Releases,\n\n\nR400 and R410.1 and SymmetrE R410.1 release,\nHoneywell Environmental Combustion & Controls, and\nSymmetrE R410.1 release.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow remote, unauthenticated attackers to execute arbitrary code on a vulnerable system.Impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nHoneywell Experion PKS is a distributed control system solution sold globally by Honeywell Process Solutions. Experion PKS is used for automation and control of industrial and manufacturing processes.\nHoneywell Enterprise Buildings Integrator (EBI) is a building system integration software product sold globally by Honeywell Building Solutions and Honeywell Process Solutions. Building operators and facility engineers use EBI to control HVAC, physical security, life safety, and energy systems. The EBI software monitors alarms and events and allows for system configuration and administration as required.\nHoneywell SymmetrE is a building system integration software product sold by Environmental and Combustion Controls in North and South America. Building operators and facility engineers use SymmetrE to primarily control HVAC systems and for open protocol integration. The SymmetrE software monitors alarms and events and allows for system configuration and administration as required.\nVULNERABILITY CHARACTERIZATION\nStack-Based Buffer Overflowhttp://cwe.mitre.org/data/definitions/121.html\nThe Honeywell HMIWeb Browser HSCDSPRenderDLL ActiveX control contains a stack buffer overflow that can allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.\nCVE-2012-0254http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2012-0254 , NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS V2 base score of 7.5 has also been assigned.\nExploitability\nThis vulnerability is exploitable remotely.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a medium skill would be able to exploit this vulnerability.\nMITIGATION\nHoneywell Process Solutions (HPS) and Honeywell Building Solutions (HBS) have released fixes for this vulnerability.HPS customers should download the security notification that describes the vulnerability and provides a link to the fixes at: www.honeywellprocess.com\n\nSelect Support, then select Latest Notifications (or use this LINK).\nOpen document SN 2012 03 09 01A Security Vulnerability in HMIWeb Browser.\n\nNo login is required to view the document. However, login is required to download software using links in Honeywell’s SN document.\nHBS customers should contact their local account manager to arrange for updates to be applied by HBS service technicians.\nHoneywell Environmental Combustion and Control (ECC) SymmetrE customers or their contractors should use the URL below to obtain HMIWeb Browser update. Users should install this update on the SymmetrE server and workstation clients following the Software Release Bulletin instructions.\nThe update can be found here: https://extranet.honeywell.com/ecc/TheBuildingsForum under the XL5000—SymmetrE section. Access to this Web site requires registration.\nAdditional Precautions\n\nDo not use a Station node to connect to the Internet for the purposes of Web browsing.\nIf a Station node is connected to the Internet, do not use Station or Internet Explorer to browse the Internet, or limit this usage only to trusted Web sites.\n\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click Web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2012-0254"
  ],
  "techniques": [],
  "advisory": "icsa-12-150-01",
  "title": "Honeywell HMIWeb Browser Buffer Overflow Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "bfcdc391f40b83ca9cc296a2b214fc0570d02fda9ca1770e40f54e9ca610e1d9"
}