{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: LOGO! 8 BM Devices\nVulnerabilities: Buffer Copy without Checking Size of Input; Improper Input Validation; Improper Validation of Specified Index, Position, or Offset in Input.\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute code remotely, put the device into a denial-of-service state, or retrieve parts of the memory.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following LOGO! 8 BM (Base Module) devices: \n\nLOGO! 8 BM (incl. SIPLUS variants): All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLASSIC BUFFER OVERFLOW CWE-120\nAffected devices do not properly validate the structure of TCP packets in several methods. This could allow an attacker to cause buffer overflows, obtain control over the instruction counter, and run custom code.\nCVE-2022-36361 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER INPUT VALIDATION CWE-20\nAffected devices do not conduct certain validations during interaction. This could allow an unauthenticated remote attacker to manipulate the device’s IP address, making the device unreachable until the device could be power cycled.\nCVE-2022-36362 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    IMPROPER VALIDATION OF SPECIFIED INDEX, POSITION, OR OFFSET IN INPUT CWE-1285\nAffected devices do not properly validate an offset value, which can be defined in TCP packets when calling a method. This could allow an attacker to retrieve parts of memory content.\nCVE-2022-36363 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nCyber Research Group from Raytheon UK reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens is preparing updates and recommends specific countermeasures for products where updates are not yet available:\n\nOnly for versions prior to V8.3: Restrict access to port 10005/TCP to only trusted IP addresses.\nOnly for versions including and since V8.3: Restrict access to port 8443/TCP to only trusted IP addresses.\nRestrict access to port 135/TCP to trusted IP addresses only.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and following the recommendations in the product manuals.\nSiemens has provided additional information on industrial security. \nFor more information, see the associated Siemens Security Advisory SSA-955858 in HTML or CSAF formats.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have a low attack complexity.\n",
  "cves": [
    "CVE-2022-36361",
    "CVE-2022-36362",
    "CVE-2022-36363"
  ],
  "techniques": [],
  "advisory": "icsa-22-286-13",
  "title": "Siemens LOGO! 8 BM Devices | CISA",
  "source": "ics-advisories",
  "id": "7dac222313ae86cb0e52bd2d4fa8a6969c54f38375a34e4a2319a9fb655a2e21"
}