{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Exploitable remotely\nVendor: Rockwell Automation\nEquipment: FactoryTalk Vantagepoint\nVulnerabilities: Insufficient Verification of Data Authenticity\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to impersonate an existing user or execute a cross site request forgery (CSRF) attack.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Rockwell Automation FactoryTalk Vantagepoint are affected:\n\n\nFactoryTalk Vantagepoint: All versions prior to 8.40\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nThe affected product is vulnerable to a CSRF attack, which could allow an attacker to impersonate a legitimate user.\nCVE-2023-2444 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation recommends users update to V8.40 or later.\nUsers of the affected software are also encouraged to implement Rockwell Automation’s suggested Security Best Practices to minimize risk associated with the vulnerability and provide training about social engineering attacks, such as phishing.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2023-2444"
  ],
  "techniques": [],
  "advisory": "icsa-23-136-03",
  "title": "Rockwell Automation FactoryTalk Vantagepoint | CISA",
  "source": "ics-advisories",
  "id": "37ee7b313af1d24cd5a4b3c0752c31a03c6d1ffc22c23a43a7775ed8227eec71"
}