{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ABB\nEquipment: IP Gateway\nVulnerabilities: Improper Authentication, Cross-site Request Forgery, Unprotected Storage of Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow attackers to perform actions using administrative privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of IP Gateway, a building management system, are affected. The IP Gateway is available under two brands; ABB and Busch-Jaeger. Busch-Jaeger Elektro GmbH is part of the ABB Group.\n\nIP Gateway Versions 3.39 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nBy accessing a specific uniform resource locator (URL) on the web server, a malicious user is able to access the configuration files and application pages without authentication.\nCVE-2017-7931 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    CROSS-SITE REQUEST FORGERY CWE-352\nThe web server does not sufficiently verify that a request was performed by the authenticated user, which may allow an attacker to launch a request impersonating that user.\nCVE-2017-7906 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    UNPROTECTED STORAGE OF CREDENTIALS CWE-256\nSome configuration files contain passwords stored in plain-text, which may allow an attacker to gain unauthorized access.\nCVE-2017-7933 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nMaxim Rupp reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nABB recommends users apply the update at earliest convenience. The update is available for download at the product page of the Busch-Jaeger catalogue in the Software section:\n(English) http://www.busch-jaeger-catalogue.com/artikel.php?bereich=1016301&programm=1016477&gruppe=1016493&produkt=1016494\n(Deutsch) http://www.busch-jaeger-katalog.de/artikel.php?bereich=1016301&programm=1016477&gruppe=1016493&produkt=1016494\nUsers can find more information in ABB’s security advisory ABB-VU-EPBP-R-2505 at the following location:\nhttp://new.abb.com/about/technology/cyber-security/alerts-and-notifications\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2017-7933",
    "CVE-2017-7906",
    "CVE-2017-7931"
  ],
  "techniques": [],
  "advisory": "icsa-18-156-01",
  "title": "ABB IP Gateway | CISA",
  "source": "ics-advisories",
  "id": "e7e4ea60984a728b1d84cbc7fc8a84eea90bc39af7c0ce49f79f54841e495ebb"
}