{
  "markdown": "\n1. EXECUTIVE SUMMARY\n--------- Begin Update A Part 1 of 5 ---------\nThis advisory was previously released with a set of Siemens products considered to be affected. Following further investigation by the Siemens’ team, it was determined all products previously advised are not affected by any vulnerability listed in this advisory or Siemens Security Advisory SSA-478893\n\nVendor: Siemens\nEquipment: SIMATIC ITC Industrial Thin Clients, SIMATIC WinCC Runtime Advanced/Professional, SIMATIC HMI Panels, SIPLUS extreme products\n\n--------- End Update A Part 1 of 5 --------- \n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-343-08 Siemens Products using TightVNC that was published December 8, 2020, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\n--------- Begin Update A Part 2 of 5 ---------\nAll products listed in the original advisory associated with ICSA-20-343-08 Siemens Products using TightVNC are unaffected by TightVNC vulnerabilities.\n--------- End Update A Part 2 of 5 --------- \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 3 of 5 ---------\nVulnerabilities in TightVNC (v1.X), a remote-control software package, do not affect the following Siemens products. The previous version of this advisory stated the following products were affected:\n\nSIMATIC HMI Comfort Outdoor Panels 7” and 15” (including SIPLUS variants): All versions prior to Version 16 update 3\nSIMATIC HMI Comfort Panel 4” to 22” (including SIPLUS variants): All versions prior to Version 16 update 3\nSIMATIC HMI KTP Mobile Panels KTP400F, KTP700, KTP700F, KTP900 and KTP900F: All versions prior to Version 16 update 3\nSIMATIC ITC1500 v3.1: All versions\nSIMATIC ITC1500 v3.1 PRO: All versions\nSIMATIC ITC1900 v3.1: All versions\nSIMATIC ITC1900 v3.1 Pro: All versions\nSIMATIC ITC2200 v3.1: All versions\nSIMATIC ITC2200 v3.1 PRO: All versions\nSIMATIC WinCC Runtime Advanced: All versions prior to Version 16 update 3\nSIMATIC WinCC Runtime Professional: All version prior to Version 16 update 3\n\n--------- End Update A Part 3 of 5 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nTightVNC code Version 1.3.10 contains a heap buffer overflow in rfbServerCutText handler, which can potentially result in code execution. The attack appears to be exploitable via network connectivity. \nCVE-2019-15678 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nTightVNC code Version 1.3.10 contains a heap buffer overflow in InitialiseRFBConnection function, which can potentially result in code execution. This attack appears to be exploitable via network connectivity. \nCVE-2019-15679 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    NULL POINTER DEREFERENCE CWE-476\nTightVNC code Version 1.3.10 contains a null pointer dereference in HandleZlibBPP function, which could result in a denial-of-service. This attack appears to be exploitable via network connectivity.  \nCVE-2019-15680 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.4    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT ('CLASSIC BUFFER OVERFLOW') CWE-120\nTightVNC code Version 1.3.10 contains a global buffer overflow in HandleCoRREBBP macro function, which can potentially result in code execution. This appears to be exploitable via network connectivity. \nCVE-2019-8287 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\n--------- Begin Update A Part 4 of 5 ---------\nSiemens reported this update information to CISA.\n--------- End Update A Part 4 of 5 ---------\n5. MITIGATIONS\n--------- Begin Update A Part 5 of 5 ---------\nThis advisory was previously released with a set of Siemens products considered to be affected. Following further investigation by the Siemens’ team, it was determined all products previously advised are not affected by any vulnerability listed in this advisory.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for industrial security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-478893\nContact Siemens or further inquiries on its security vulnerabilities.\n--------- End Update A Part 5 of 5 ---------\nISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2019-8287",
    "CVE-2019-15678",
    "CVE-2019-15679",
    "CVE-2019-15680"
  ],
  "techniques": [],
  "advisory": "icsa-20-343-08",
  "title": "Siemens Products using TightVNC (Update A) | CISA",
  "source": "ics-advisories",
  "id": "60ebab78c1c2592b017cf57125295708db4e584af15a586a7a29617635310b28"
}