{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Fuji Electric\nEquipment: Tellus Lite V-Simulator and V-Server Lite\nVulnerabilities: Stack-based Buffer Overflow, Out-of-Bounds Read, Out-of-Bounds Write, Access of Uninitialized Pointer, Heap-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute code under the privileges of the application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Fuji Electric products are affected:\n\nTellus Lite V-Simulator: Versions prior to v4.0.10.0\nV-Server Lite: Versions prior to v4.0.10.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nMultiple stack-based buffer overflow issues have been identified in the way the application processes project files, allowing an attacker to craft a special project file that may allow arbitrary code execution. \nCVE-2021-22637 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS READ CWE-125\nMultiple out-of-bounds read issues have been identified in the way the application processes project files, allowing an attacker to craft a special project file that may allow arbitrary code execution. \nCVE-2021-22655 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    OUT-OF-BOUNDS WRITE CWE-787\nMultiple out-of-bounds write issues have been identified in the way the application processes project files, allowing an attacker to craft a special project file that may allow arbitrary code execution. \nCVE-2021-22653 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    ACCESS OF UNINITIALIZED POINTER CWE-824\nAn uninitialized pointer issue has been identified in the way the application processes project files, allowing an attacker to craft a special project file that may allow arbitrary code execution. \nCVE-2021-22639 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.5    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap-based buffer overflow issue has been identified in the way the application processes project files, allowing an attacker to craft a special project file that may allow arbitrary code execution. \nCVE-2021-22641 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nKimiya, Khangkito – Tran Van Khang of VinCSS (Member of Vingroup), and an anonymous researcher, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nFuji Electric recommends updating to the current version v4.0.10.0. Both disks are required for updating. Login is required to download the files.\n\nv4.0.10.0 Disk 1\nv4.0.10.0 Disk 2\n\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-22655",
    "CVE-2021-22653",
    "CVE-2021-22637",
    "CVE-2021-22641",
    "CVE-2021-22639"
  ],
  "techniques": [],
  "advisory": "icsa-21-026-01",
  "title": "Fuji Electric Tellus Lite V-Simulator and V-Server Lite | CISA",
  "source": "ics-advisories",
  "id": "653f53501e113de676f2ac0ca53549c2156de20185ab8488c956bcc7b15b8762"
}