{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: AutomationDirect\nEquipment: DirectLOGIC with Ethernet Communication Modules\nVulnerabilities: Uncontrolled Resource Consumption, Cleartext Transmission of Sensitive Information\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22.167-03 AutomationDirect DirectLOGIC with Ethernet that was published June 16, 2022, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause a loss of sensitive information, unauthorized changes, and a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of DirectLOGIC with Ethernet communication modules, a PLC Ethernet module, are affected:\n\nAll versions of H0-ECOM and H0-ECOM100 when installed in the following D0-06 series CPUs versions prior to v2.72:\n\nD0-06DD1\nD0-06DD2\nD0-06DR\nD0-06DA\nD0-06AR\nD0-06AA\nD0-06DD1-D\nD0-06DD2-D\nD0-06DR-D\n\n\n\n--------- Begin Update A part 1 of 2 ---------\nAll versions of H0-ECOM and H0-ECOM100 when installed in the following D0-05 series CPUs versions prior to v5.41\n\nD0-05DD\nD0-05DR\nD0-05DA\nD0-05AR\nD0-05AA\nD0-05AD\nD0-05DD-D\nD0-05DR-D\n\nAll versions of H2-ECOM and H2-ECOM100 when installed in the following:\n\nD2-240: All versions\nD2-250: All versions\nD2-250-1: All versions prior to 4.91\nD2-260: All versions prior to 2.71\nD2-262: All versions prior to 1.06\n\nAll versions of H4-ECOM and All versions of H4-ECOM100 when installed in the following:\n\nD4-430: All versions\nD4-440: All versions\nD4-450: All versions\nD4-454: All versions prior to 1.04\n\n--------- End Update A part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nA specially crafted packet can be sent continuously to the PLC to prevent access from DirectSoft and other devices, causing a denial-of-service condition.\nCVE-2022-2004 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe product is vulnerable to a specifically crafted Ethernet packet that will cause the PLC to respond with the PLC password in cleartext. This could allow an attacker to access the system and make unauthorized changes.\nCVE-2022-2003 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nSam Hanson of Dragos reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A part 2 of 2 ---------\nFor CVE-2022-2003 AutomationDirect recommends users apply the following mitigations:\n\nUpdate all D0-06 series CPUs to firmware version 2.72 or later\nUpdate all DL05 series CPUs to firmware version 5.41 or later\nD2-240/250 is obsolete and cannot be upgraded. AutomationDirect recommends upgrading to a newer PLC (D2-262 or newer PLC families; CLICK, Do-more/BRX and Productivity Series).\nUpdate D2-250-1 to firmware version 4.91 or later\nUpdate D2-260 to firmware version 2.71 or later\nUpdate D2-262 to firmware version 1.06 or later\nD4-430/440/450 is obsolete and cannot be upgraded. AutomationDirect recommends upgrading to a newer PLC (D4-454 or newer PLC families; CLICK, Do-more/BRX and Productivity Series).\nUpdate D4-454 to firmware version 1.04 or later\n\nAll DirectLogic PLC firmware can be found on the Product Firmware page. The updated firmware will no longer respond with the password when requested with the specially crafted message.\nAdditional brute force mitigation for password access has been added. Three incorrect password entries will result in a 3 hour lock out of password entry. Power cycling will allow subsequent password attempts.\n--------- End Update A part 2 of 2 ---------\nUsers should see the security network practices below for CVE-2022-2004.\nWhile automation networks and systems have built-in password protection schemes, this is only one step in securing the affected systems. Automation control system networks must incorporate data protection and security measures at least as robust as a typical business computer system. AutomationDirect recommends users of PLCs, HMI products, and other SCADA system products perform independent network security analysis to determine the proper level of security required for the application.\nAutomationDirect has identified the specific mitigation actions listed below:\n\nSecure physical access.\nIsolate and air gap networks when possible.\nConsider some of the AutomationDirect newer PLC families.\n\nUsers can refer to the following link for supporting information related to security considerations.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-2004",
    "CVE-2022-2003"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-03",
  "title": "AutomationDirect DirectLOGIC with Ethernet (Update A) | CISA",
  "source": "ics-advisories",
  "id": "8260cf43ab46bf8a2796a70649a82d49fd086e3c69c5bd6d4b324578f726d1c8"
}