{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.9\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Phoenix Contact\nEquipment: RAD-80211-XD\nVulnerability: Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute system level commands with administrative privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAccording to Phoenix Contact, the following products are affected:\n\nRAD-80211-XD (2885728), and\nRAD-80211-XD/HP-BUS (2900047)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nA WebHMI utility may be exploited by any logged-in user, allowing the execution of arbitrary OS commands on the server. This provides the opportunity for a command injection attack.\nCVE-2019-9743 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Critical Manufacturing, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMaxim Rupp (RuppIT) working with Phoenix Contact and CERT@VDE reported this vulnerability to NCCIC.\n4. MITIGATIONS\nPhoenix Contact recommends the following:\n\nUsers using Phoenix Contact 80211-XD radio modules are recommended to operate the devices in closed networks or protected with a suitable firewall.\nThe affected products have been removed from active maintenance due to obsolescence. For this reason, it is recommended that concerned users upgrade to the active FL WLAN product line.\nFor detailed information on recommendations for measures to protect network-capable devices, please refer to the application note: https://www.phoenixcontact.com/assets/downloads_ed/local_pc/web_dwl_technical_info/ah_en_industrial_security_107913_en_01.pdf\n\nPlease see VDE-2019-007 at the following location for more details:\nhttps://cert.vde.com/en-us/advisories/vde-2019-007 \nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-9743"
  ],
  "techniques": [],
  "advisory": "icsa-19-085-02",
  "title": "PHOENIX CONTACT RAD-80211-XD | CISA",
  "source": "ics-advisories",
  "id": "824734b05d78ed158dafe83a8ebacd378d8cc45b061e2fcab11602f98a3532f1"
}