{
  "markdown": "\nOverview\nICS-CERT received a report from GE Intelligent Platforms and the Zero Day Initiative (ZDI). If exploited, this vulnerability could allow an attacker to create or overwrite a file on the system running Real-Time Information Portal. concerning a directory traversal vulnerability in the GE Intelligent Platforms Proficy Real-Time Information Portal. This vulnerability was reported to ZDI by independent security researcher Luigi Auriemma.\nGE Intelligent Platforms has created patches to address this issue.\nAffected Products\nAccording to GE Intelligent Platforms the following product and versions are affected.\nProficy Real-Time Information Portal Versions:\n\n3.5\n3.0 SP1\n3.0\n2.6\n\nNote: Proficy Real-Time Information Portal Versions 2.5 and prior are not affected by this vulnerability.\nImpact\nExploitation of this vulnerability could allow an attacker to create or overwrite a file on the system running Proficy Real-Time Information Portal.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nAccording to GE, Proficy Real-Time Information Portal is a web-based data visualization and reporting tool that is deployed across multiple industries worldwide.\nVulnerability Characterization\nVulnerability Overview\nA directory traversal vulnerability exists in the Remote Interface Service (rifsrvd.exe) that runs on Port 5159/TCP by default. The Remote Interface Service creates a file on the system and does not sufficiently validate two input strings that are used to create a configuration file on the server.\nThe vulnerability may allow a remote attacker to: vulnerability exists in the Remote Interface Service (rifsrvd.exe) that runs on Port 5159/TCP by default. The Remote Interface Service creates a file on the system and does not sufficiently validate two input strings that are used to create a configuration file on the server.\n\nSet the file’s name and extension (to create a new file or to overwrite an existing file)\nSupply text that will be inserted into the file.\n\nAccording to GE, the vulnerability does not allow the attacker to directly execute the file and does not allow the attacker to define the file’s entire contents.\nCVE-2012-0232 has been assigned to this vulnerability.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a moderate skill level may be able to exploit these vulnerabilities.\nMitigation\nGE Intelligent Platforms has released a security advisory and free product update Software Improvement Modules (SIMs) to address this vulnerability in Proficy Real-Time Information Portal Versions 3.5 and 3.0 SP1. Proficy Real-Time Information Portal customers using Versions 3.0 and 2.6 are encouraged to upgrade to one of the versions described above and apply the appropriate product update. GE Intelligent Platforms urges all customers to follow the recommendations in their security advisory, which can be found here: http://support.ge-ip.com/support/index?page=kbchannel&id=S:KB14768.\nNote: A valid GE user ID and Customer Service Number are required to access the advisories and updates. Proficy SIMs are cumulative. All future SIMs will include these updates.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls with properly configured rules addressing Port 5159/TCP, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2012-0232"
  ],
  "techniques": [],
  "advisory": "icsa-12-032-03",
  "title": "GE Intelligent Platforms Proficy Real-Time Information Portal Directory Traversal | CISA",
  "source": "ics-advisories",
  "id": "5994d51f5801527fa06f3c9f725954e1853542942e210a738e3296c001107341"
}