{
  "markdown": "\nOVERVIEW\nResearchers Adam Crain of Automatak and Chris Sistrunk of Mandiant have identified an improper input validation vulnerability in the CG Automation ePAQ-9410 Substation Gateway DNP3 protocol components. CG Automation has produced an updated software that mitigates this vulnerability. CG Automation has tested the updated software to validate that it resolves the vulnerability.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following CG Automation products are affected:\n\nePAQ-9410 Substation Gateway, all versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to affect the availability of the DNP3 Master Server software.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nCG Automation is a US-based company with other CG offices in several other countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia.\nThe affected product, ePAQ-9410 Substation Gateway, is a gateway used in electric utility. According to CG Automation, ePAQ-9410 Substation Gateway is deployed across the Energy Sector. CG Automation estimates that this product is used primarily in the United States and Europe with a small percentage in Asia and South America.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION-IP-BASEDCWE-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20.html, web site last accessed August 26, 2014.\n\nThe CG Automation Software DNP3 driver, used in the ePAQ-9410 Substation Gateway products, does not validate input correctly. An attacker could cause the software to go into an infinite loop by sending a specifically crafted TCP packet, causing the process to crash.\nThe following scoring is for IP-connected devices.\nCVE-2014-0761NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-0761, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7.1 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:N/I:N/A:C, web site last accessed August 26, 2014.\n\nIMPROPER INPUT VALIDATION-SERIAL-BASEDCWE-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20.html, web site last accessed August 26, 2014.\n\nThe CG Automation Software DNP3 driver, used in the ePAQ-9410 Substation Gateway products, does not validate input correctly. An attacker could cause the software to go into an infinite loop, causing the process to crash. The system must be restarted manually to clear the condition.\nThe following scoring is for serial-connected devices.\nCVE-2014-0762NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-0762, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 4.7 has been assigned; the CVSS vector string is (AV:L/AC:M/Au:N/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:M/Au:N/C:N/I:N/A:C, web site last accessed August 26, 2014.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThe IP-based vulnerability could be exploited remotely.\nThe serial-based vulnerability is not remotely exploitable. Local access to the serial-based outstation is required.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a moderate skill could craft a TCP packet that would be able to exploit the vulnerability for an IP-based device.\nAn attacker with a high skill could exploit the serial-based vulnerability because physical access to the device or some amount of social engineering is required.\nMITIGATION\nCG Automation has fixed this vulnerability with updated software. Users may obtain the updated software by downloading from this web address:\nhttp://mail.cgautomationusa.com/login.aspx\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT Web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Mitigation Strategies, that is available for download from the ICS-CERT Web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2014-0762",
    "CVE-2014-0761"
  ],
  "techniques": [],
  "advisory": "icsa-14-238-01",
  "title": "CG Automation Improper Input Validation | CISA",
  "source": "ics-advisories",
  "id": "9a253db32a9c2b5347238c323fbafd363464b02f0c2467f362d078f204e78ab8"
}