{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Low attack complexity\nVendor: Trane\nEquipment: Symbio 700 and Symbio 800 controllers\nVulnerability: Code Injection\n\n2. UPDATE INFORMATION\nThe updated advisory is a follow-up to the original advisory titled ICSA-21-266-01 Trane Symbio that was published on September 23, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\n--------- Begin Update B Part 1 of 1 --------\nSuccessful exploitation of this vulnerability could allow a user to execute arbitrary code on the controller.\n--------- End Update B Part 1 of 1 --------\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Trane building automation products deployed on the following HVAC equipment are affected:\nSymbio 700:\n\nOdyssey Split Systems: All versions prior to v1.00.0023\n\nSymbio 800:\n\nIntelliPak Rooftop Air Conditioner: All versions prior to v1.30.0008\nAscend Air-Cooled Chiller Model ACR: All versions prior to v1.10.0010\nAgility Water-Cooled Chiller Model HDWA: All versions prior to v1.00.0010\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94\nThe affected controllers do not properly sanitize the input containing code syntax. As a result, an attacker could craft code to alter the intended controller flow of the software.\nCVE-2021-38448 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:C/C:L/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n4.4 RESEARCHER\nTrane reported this vulnerability to CISA.\n5. MITIGATIONS\nAffected users should contact a Trane office to make arrangements to install updated firmware or to request additional information. Please reference Trane service database number HUB-205962 when contacting Trane. Trane recommends the applications below be updated to the versions listed below.\nSymbio 700:\n\nOdyssey Split Systems: All versions prior to v1.00.0023\n\nSymbio 800:\n\nIntelliPak Rooftop Air Conditioner: All versions prior to v1.30.0008\nAscend Air-cooled Chiller Model ACR: All versions prior to v1.10.0010\nAgility Water-Cooled Chiller Model HDWA: All versions prior to v1.00.0010\n\nIn addition to the specific recommendations above, Trane continues to recommend the following best practices as an additional protection against this and other controller vulnerabilities:\n\nRestrict physical controller access to trained and trusted personnel.\nUse secure remote access solutions, such as Trane Connect Remote Access, when needed.\nEnsure user credentials are not shared and follow best practices for appropriate complexity (e.g., strong passwords).\nHave a well-documented process and owner to ensure regular software/firmware updates and keep systems up to date.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-38448"
  ],
  "techniques": [],
  "advisory": "icsa-21-266-01",
  "title": "Trane Symbio (Update B) | CISA",
  "source": "ics-advisories",
  "id": "fdc7c6ab0cc1c6bbfc4cc3e19205c7e8b928372f61bcd5b8dee03eab508dc248"
}