{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.4\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: 3S-Smart Software Solutions GmbH\nEquipment: CODESYS V3 products\nVulnerabilities: Use of Insufficiently Random Values, Improper Restriction of Communication Channel to Intended Endpoints\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to disguise the source of malicious communication packets and also exploit a random values weakness affecting confidentiality and integrity of data stored on the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n3S-Smart Software Solutions GmbH reports these vulnerabilities affect the following CODESYS V3 products:\n\nCODESYS Control for BeagleBone,\nCODESYS Control for emPC-A/iMX6,\nCODESYS Control for IOT2000,\nCODESYS Control for Linux,\nCODESYS Control for PFC100,\nCODESYS Control for PFC200,\nCODESYS Control for Raspberry Pi,\nCODESYS Control RTE V3,\nCODESYS Control RTE V3 (for Beckhoff CX),\nCODESYS Control Win V3 (also part of the CODESYS Development System setup),\nCODESYS Control V3 Runtime System Toolkit,\nCODESYS V3 Embedded Target Visu Toolkit,\nCODESYS V3 Remote Target Visu Toolkit,\nCODESYS V3 Safety SIL2,\nCODESYS Gateway V3,\nCODESYS HMI V3,\nCODESYS OPC Server V3,\nCODESYS PLCHandler SDK,\nCODESYS V3 Development System, and\nCODESYS V3 Simulation Runtime (part of the CODESYS Development System).\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330The application suffers from weak random values that can affect the confidentiality and integrity of data stored on the device.CVE-2018-20025 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L).3.2.2    IMPROPER RESTRICTION OF COMMUNICATION CHANNEL TO INTENDED ENDPOINTS CWE-923The application does not properly restrict communication channels, allowing the source of communication packets to be spoofed.CVE-2018-20026 has been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nAlexander Nochvay from Kaspersky Lab reported these vulnerabilities to 3-S Smart Software Solutions GmbH.\n4. MITIGATIONS\n3-S Smart Software Solutions GmbH has released a new version of the software that can be downloaded from:https://www.codesys.com/download/For more information, all public CODESYS advisories can be found at:https://www.codesys.com/security/security-reports.html3S-Smart Software Solutions GmbH recommends the following general defensive measures to reduce the risk of exploitation of these vulnerabilities:\n\nUse controllers and devices only in a protected environment to minimize network exposure and ensure that they are not accessible from outside\nUse firewalls to protect and separate the control system network from other networks\nUse VPN (virtual private networks) tunnels if remote access is required\nActivate and apply user management and password features\nLimit the access to both development and control system by physical means, operating system features, etc.\nProtect both development and control system by using up to date virus detecting solutions\n\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.No known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-20025",
    "CVE-2018-20026"
  ],
  "techniques": [],
  "advisory": "icsa-18-352-04",
  "title": "3S-Smart Software Solutions GmbH CODESYS V3 Products | CISA",
  "source": "ics-advisories",
  "id": "c234e11a52f8658d7d698f75dbf24e16190ef30230c408e6a1c39579c039c131"
}