{
  "markdown": "\nCVSS v3 6.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Schneider Electric\nEquipment: Interactive Graphical SCADA System (IGSS) Software\nVulnerability: DLL Hijacking\nAFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following IGSS HMI desktop application:\n\nIGSS Software, Version 12 and previous versions.\n\nIMPACT\nAn attacker who exploits this vulnerability may be able to remotely execute arbitrary code.\nMITIGATION\nSchneider Electric recommends that users upgrade to Windows 10 to mitigate this vulnerability. Windows 10 enforces a fixed path to the DLL.\nMore information can be found by visiting Schneider Electric’s security notification number SEVD-2017-090-01 at:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-090-01/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability requires user interaction or social engineering to exploit.\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nThe software will execute a malicious file if it is named the same as a legitimate file and placed in a location that is earlier in the search path.\nCVE-2017-6033 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nKarn Ganeshen reported this vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy\nArea Deployed: Worldwide\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2017-6033"
  ],
  "techniques": [],
  "advisory": "icsa-17-094-01",
  "title": "Schneider Electric Interactive Graphical SCADA System Software | CISA",
  "source": "ics-advisories",
  "id": "4501787be4e222dd247576b474ae3140b30b818e2a7ebd5b7b36a3e0269fb7da"
}