{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity  \nVendor: Phoenix Contact \nEquipment: Automation Worx Software Suite \nVulnerabilities: Improper Restriction of Operations within the Bounds of a Memory Buffer, Out-of-bounds Read \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to a heap buffer overflow, release of unallocated memory, or a read access violation.  \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following components of Automation Worx Software Suite are affected: \n\nConfig+: Versions 1.89 and prior  \nPC Worx: Versions 1.89 and prior  \nPC Worx Express: Versions 1.89 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119 \nIn Phoenix Contact Automation Worx Software Suite up to version 1.89, manipulated PC Worx or Config+ files could lead to a heap buffer overflow or a read access violation. Availability, integrity, or confidentiality of an application programming workstation could be compromised by attacks using these vulnerabilities. \nCVE-2022-3461 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.2 OUT-OF-BOUNDS READ CWE-125 \nIn Phoenix Contact Automation Worx Software Suite up to version 1.89, unauthorized users could read memory beyond the intended scope due to insufficient validation of input data. Availability, integrity, or confidentiality of an application programming workstation could be compromised by attacks using these vulnerabilities. \nCVE-2022-3737 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nMichael Heinzl reported these vulnerabilities to CISA. CERT@VDE coordinated these vulnerabilities with Phoenix Contact. \n4. MITIGATIONS\nPhoenix Contact recommends users update to the latest version of Automation Worx Software Suite and exchange project files only via secure file exchange services. Project files should not be exchanged via unencrypted email. \nCERT@VDE has released an advisory on these vulnerabilities, accessible here. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.  \n",
  "cves": [
    "CVE-2022-3461",
    "CVE-2022-3737"
  ],
  "techniques": [],
  "advisory": "icsa-22-326-03",
  "title": "Phoenix Contact Automation Worx | CISA",
  "source": "ics-advisories",
  "id": "13a542ecf07f8168f4831387a0e8ca63e58e0cd36eba7148240424f6b73045e9"
}