{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Low skill level to exploit\nVendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls\nEquipment: American Dynamics victor Web Client\nVulnerability: Improper Authorization\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-282-01 Johnson Controls Sensormatic Electronics American Dynamics victor Web Client and Software House C•CURE Web Client that was published October 8, 2020, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote unauthenticated attacker to delete arbitrary files on the system or render the system unusable through a denial-of-service attack.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nJohnson Controls reports that the vulnerability affects the following versions of victor Web Client and C•CURE Web Client software:\n\nAmerican Dynamics victor Web Client: All versions up to and including v5.4.1\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSoftware House C•CURE Web Client: All versions up to and including v2.80\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHORIZATION CWE-285\nAmerican Dynamics victor Web Client does not perform an authorization check when an attacker with access from an adjacent network attempts to delete arbitrary files on the system. \nCVE-2020-9048 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n4.4 RESEARCHER\nJoachim Kerschbaumer reported this vulnerability to Johnson Controls, Inc.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nJohnson Controls recommends users upgrade all versions of victor Web Client to v5.6. Registered users can download the update.\n\nC•CURE Web v2.60 and earlier -- upgrade to a minimum of v2.70 and install the relevant update below:\nC•CURE Web v2.70 – install the update WebClient_c2.70_5.2_Update02\nC•CURE Web v2.80 – install the update WebClient_c2.80_v5.4.1_Update04\n\nRegistered users can obtain the software update by downloading the update.\n--------- End Update A Part 2 of 2 ---------\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2020-09\nFurther ICS security notices and product security guidance are located at the Johnson Controls product security website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-9048"
  ],
  "techniques": [],
  "advisory": "icsa-20-282-01",
  "title": "Johnson Controls Sensormatic Electronics American Dynamics victor Web Client and Software House C•CURE Web Client (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c38d5f04863d71bfd1a79da0c72671e63b52566483ec1e399ea2423465e9f272"
}