{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available \nVendor: Panasonic \nEquipment: Sanyo CCTV Network Camera \nVulnerability: Cross-Site Request Forgery (CSRF) \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow attackers to perform actions via HTTP without validity checks.  \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Panasonic Sanyo CCTV Network Camera are affected:  \n\nVCC-HD5600P version 2.03-06  \nVDC-HD3300P version 2.03-08   \nVDC-HD3300P version 1.02-05  \nVCC-HD3300 version 2.03-02  \nVDC-HD3100P version 2.03-00  \nVCC-HD2100P version 2.03-02  \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nPanasonic Sanyo CCTV Network Cameras versions 1.02-05 and 2.03-0x are vulnerable to CSRFs that can be exploited to allow an attacker to perform changes with administrator level privileges. \nCVE-2022-4621 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities  \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan \n\n3.4 RESEARCHER\nCISA discovered a public PoC as authored by Gjoko Krstic of Zero Science Lab.\n4. MITIGATIONS\nPanasonic has stated that Sanyo Electric Camera Systems are no longer in production and released this advisory. All repair requests and other support requests via email or phone will longer be available.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-4621"
  ],
  "techniques": [],
  "advisory": "icsa-23-012-04",
  "title": "Panasonic Sanyo CCTV Network Camera | CISA",
  "source": "ics-advisories",
  "id": "3cf24dd38ca8c8ea283f3f129ff2171508378cc48e9b79bd5924f5305d041184"
}