{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: Claroty\nEquipment: Secure Remote Access (SRA) Site\nVulnerability: Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability enables an attacker with local (Linux) system access to bypass access controls for the central configuration file of the SRA Site software.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SRA are affected:\n\nVersions 3.0 through 3.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nSuccessful exploitation of this vulnerability allows an attacker with local command line interface access to gain the secret key, subsequentially allowing them to generate valid session tokens for the web user interface (UI). With access to the web UI an attacker can access assets managed by the SRA installation and could compromise the installation.\nCVE-2021-32958 has been assigned to this vulnerability. A CVSS v3 base score 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Healthcare and Public Health, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAlphastrike Labs reported this vulnerability to Claroty.\n4. MITIGATIONS\nClaroty recommends users upgrade their SRA installation to Version 3.2.1 (released April 27, 2021). Users unable to apply the latest patch should restrict non-admin access to the system hosting the SRA Site software as an interim mitigation.\nUsers may contact either Claroty Support or a Customer Success Manager to obtain the latest release of SRA, which includes the fix to this vulnerability\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-32958"
  ],
  "techniques": [],
  "advisory": "icsa-21-180-06",
  "title": "Claroty Secure Remote Access Site | CISA",
  "source": "ics-advisories",
  "id": "4ec410cc471ddb245289f77d0f948ce7ed1e1495271620d2469b82d37defb375"
}