{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Emerson\nEquipment: Emerson WirelessHART Gateways (1410, 1420 and 1552WU)\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could disable the internal gateway firewall. Once the gateway's firewall is disabled, a malicious user could issue specific commands to the gateway, which could then be forwarded on to the end user's wireless devices.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nEmerson reports that the vulnerability affects the following products when the VLAN feature is enabled:\n\nWireless 1410 Gateway, revisions 4.6.43 to 4.7.84\nWireless 1420 Gateway, revisions 4.6.43 to 4.7.84\nWireless 1552WU Gateway, revisions 4.6.43 to 4.7.84\n\nNote that this is not an issue with the WirelessHART communication protocol. Wireless field devices, Smart Wireless Field Link, AMS Wireless SNAP-ON, and AMS Wireless Configurator are unaffected.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThere is a flaw in the code used to configure the internal gateway firewall when the gateway's VLAN feature is enabled. If a user enables the VLAN setting, the internal gateway firewall becomes disabled resulting in exposure of all ports used by the gateway.\nCVE-2020-12030 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nEmerson discovered this vulnerability and reported it to CISA once there was a solution.\n4. MITIGATIONS\nEmerson recommends end users update the firmware on VLAN-enabled Version 4 gateways as soon as possible.\nIf the VLAN feature is not enabled, no immediate action is necessary.\nPlease see Emerson’s cybersecurity notification alert number EMR.RMT20001-1 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nDisable any unused features. \nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-12030"
  ],
  "techniques": [],
  "advisory": "icsa-20-135-02",
  "title": "Emerson WirelessHART Gateway | CISA",
  "source": "ics-advisories",
  "id": "98392fdfcdd768cb9c2eabec403b3618e349b4ffdc3bb68138b49784407945cf"
}