{
  "markdown": " OSIsoft PI AF Incorrect Default Permissions Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryOSIsoft PI AF Incorrect Default Permissions Vulnerability========================================================= Last Revised August 27, 2018 Alert Code ICSA\\-15\\-132\\-01OVERVIEW-------- OSIsoft has identified and reported to NCCIC/ICS\\-CERT a default permissions vulnerability in PI AF product. OSIsoft has produced a mitigation plan to remove this vulnerability. This vulnerability could be exploited remotely.AFFECTED PRODUCTS----------------- OSIsoft reports that the vulnerability affects the following products:* PI AF 2\\.6 new installs,* PI AF 2\\.7 upgrade, and* PI SQL for AF 2\\.1\\.IMPACT------ Under certain conditions, SQL statements can be executed that result in data tampering, information disclosure, repudiation, elevation of privilege, and denial of service. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- OSIsoft is a US\\-based company that maintains its headquarters in San Leandro, California, with operations globally. The affected product, PI AF, allows definition of organizational assets and/or equipment. PI AF uses Microsoft SQL Server database. According to OSIsoft, PI AF is deployed in several critical infrastructure sectors. OSIsoft estimates that these products are used worldwide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### INCORRECT DEFAULT PERMISSIONSCWE\\-276: Incorrect Default Permissions, http://cwe.mitre.org/data/definitions/276\\.html, web site last accessed May 12, 2015\\. Some product installations insert the “Everyone” account in the “PI SQL (AF) Trusted Users” group on the PI AF Server. Users in the “PI SQL (AF) Trusted Users” group can bypass most of the security checks that would normally be applied to various types of SQL statements, and can execute commands on the PI AF SQL Database without authorization. CVE\\-2015\\-1013NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-1013, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. OSIsoft has calculated a CVSS v2 base score of 6\\.5; the CVSS vector string is (AV:N/AC:L/Au:S/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:S/C:P/I:P/A:P, web site last accessed May 12, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY An attacker with a low skill would be able to exploit this vulnerability.MITIGATION---------- OSIsoft recommends the following mitigation actions, depending on the version of PI WebParts installed, to remove this vulnerability: If a system with PI WebParts is installed, the recommended action depends on the version:* PI WebParts 2013 or later* Remove the group “ *PI SQL (AF) Trusted Users”*  (if it exists) from the AF server.* No further action is required.* PI WebParts 2010 (or 2010 R2\\) – pick one of the two following options:* Upgrade to PI WebParts 2013 or later and follow the steps above, or* Follow the mitigation steps below.* Remove the “Everyone” user from the “ *PI SQL (AF) Trusted Users”*  group on the AF server.* If the SharePoint application pool hosting PI WebParts runs as a domain service account, add that service account to the Windows group.* If the SharePoint application pool hosting PI WebParts runs as the built in “Network Services” identity, add the PI WebParts web server’s machine account to the Windows group. After these configuration changes are made, an IISRESET must be performed on the PI WebParts web server. If the PI WebParts web server and the AF Server are on the same machine, the built\\-in “Network Services” identity must be added, and the machine must be restarted.* If PI WebParts is NOT installed:* Remove the group “PI SQL (AF) Trusted Users” (if it exists) from the AF server. For more information regarding this vulnerability and the recommended mitigation plan, please see OSIsoft’s security bulletin titled “AL00280 \\- Security Bulletin Vulnerability in PI SQL (AF) Trusted Users group could allow bypassing of security” at the following location:<https://techsupport.osisoft.com/Troubleshooting/Alerts/AL00280> Users may also visit the OSIsoft technical support web site: https://techsupport.osisoft.com/ ICS\\-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* OSIsoft-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-132-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2015-1013"
  ],
  "techniques": [],
  "advisory": "icsa-15-132-01",
  "title": "OSIsoft PI AF Incorrect Default Permissions Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "c7ff6778d8a836b113dbdb348a0343b1a87e55184ee475b3164bcfcdc5985019"
}