{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 6.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Moxa\nEquipment: MXview One, MXview One Central Manager Series\nVulnerabilities: Cleartext Storage In A File or On Disk, Path Traversal, Time-of-Check Time-of-Use Race Condition\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to expose local credentials and write arbitrary files to the system, resulting in execution of malicious code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Moxa products are affected:\n\nMXview One Series: Versions 1.4.0 and prior\nMXview One Central Manager Series: Version 1.0.0\n\n3.2 Vulnerability Overview\n3.2.1 CLEARTEXT STORAGE IN A FILE OR ON DISK CWE-313\nThe configuration file stores credentials in cleartext. An attacker with local access rights can read or modify the configuration file, potentially resulting in the service being abused because of sensitive information exposure.\nCVE-2024-6785 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-6785. A base score of 6.8 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:L/SI:N/SA:N).\n3.2.2 PATH TRAVERSAL: '../filedir' CWE-24\nThe vulnerability allows an attacker to craft MQTT messages that include relative path traversal sequences, enabling them to read arbitrary files on the system. This could lead to the disclosure of sensitive information, such as configuration files and JWT signing secrets.\nCVE-2024-6786 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-6786. A base score of 6.0 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:P/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.2.3 TIME-OF-CHECK TIME-OF-USE (TOCTOU) RACE CONDITION CWE-367\nThis vulnerability occurs when an attacker exploits a race condition between the time a file is checked and the time it is used (TOCTOU). By exploiting this race condition, an attacker can write arbitrary files to the system. This could allow the attacker to execute malicious code and potentially cause file losses.\nCVE-2024-6787 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-6787. A base score of 6.0 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:H/AT:P/PR:L/UI:N/VC:N/VI:H/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nNoam Moshe of Claroty Research - Team82 reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMoxa recommends the following to address the vulnerabilities:\n\nMXview One Series: Upgrade to v1.4.1\nMXview One Cerntral Manager Series: Upgrade to v1.0.3\nMinimize network exposure to ensure the device is not accessible from the Internet.\nChange the default credentials immediately upon first login to the service. This helps enhance security and prevent unauthorized access.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this these vulnerabilities, such as:\n\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nSeptember 24, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-6787",
    "CVE-2024-6786",
    "CVE-2024-6785"
  ],
  "techniques": [],
  "advisory": "icsa-24-268-05",
  "title": "Moxa MXview One | CISA",
  "source": "ics-advisories",
  "id": "3fa05f7923434ee52efe10b8fb34357acb0cfde275500059aab2cc42b1489556"
}