{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Red Lion Controls\nEquipment: Crimson (Windows configuration software)\nVulnerabilities: Use After Free, Improper Restriction of Operations within the Bounds of a Memory Buffer, Pointer Issues, Use of Hard-coded Cryptographic Key\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute code, crash the device, or view protected data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Crimson, windows configuration software, are affected:\n\nCrimson Versions 3.0 and prior\nCrimson Versions 3.1 prior to release 3112.00\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE AFTER FREE CWE-416\nMultiple vulnerabilities can be exploited when a valid user opens a specially crafted, malicious input file that can reference memory after it has been freed.\nCVE-2019-10996 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nMultiple vulnerabilities can be exploited when a valid user opens a specially crafted, malicious input file that operates outside of the designated memory area.\nCVE-2019-10978 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.3    POINTER ISSUES CWE-465\nMultiple vulnerabilities can be exploited when a valid user opens a specially crafted, malicious input file that causes the program to mishandle pointers.\nCVE-2019-10984 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nCrimson uses a hard-coded password to encrypt protected files in transit and at rest, which may allow an attacker to access configuration files.\nCVE-2019-10990 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMichael DePlante, Anthony Fuller, and Todd Manning of Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nRed Lion Controls recommends users migrate to Crimson 3.1 release 3112.00 or later where the model choice allows. Updated software can be found at the following link:\nhttps://www.redlion.net/red-lion-software/crimson\nThe use of a hardcoded key vulnerability (CVE-2019-10990) can be mitigated in two ways:\n\nThe user manual for Crimson 3.1 release 3112.00 now includes a paragraph describing the intended use of the database protection mechanism, noting the software is not designed to provide a cryptographically secure method of database protection.\nIn a later release, targeted for September 2019, Red Lion Controls will modify the existing database protection scheme to include an option for a second file access password designed to encrypt the file.\n\nFor more information, Red Lion Controls has released a security bulletin that can be found at the following link:\nhttps://support.redlion.net/hc/en-us/articles/360033077531\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-10984",
    "CVE-2019-10996",
    "CVE-2019-10978",
    "CVE-2019-10990"
  ],
  "techniques": [],
  "advisory": "icsa-19-248-01",
  "title": "Red Lion Controls Crimson | CISA",
  "source": "ics-advisories",
  "id": "650d0edf897e3e9d5d2fafeb8bcbc012adc650f7173c76800427f52a6a013caa"
}