{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: EN100 Ethernet module\nVulnerabilities: Improper Input Validation\n\n2. RISK EVALUATION\nThe EN100 Ethernet module for the SWT 3000 management platform is affected by security vulnerabilities that could allow an attacker to conduct a denial-of-service attack over the network.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of EN100 Ethernet module, a communication module for SWT 3000 management platform, are affected:\n\nFirmware variant IEC 61850 for EN100 Ethernet module version prior to 4.33\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets to Port 102/TCP could cause a denial-of-service condition in the affected products. A manual restart is required to recover the EN100 module functionality of the affected devices.CVE-2018-11451 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).3.2.2    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets to Port 102/TCP could cause a denial-of-service condition in the EN100 module if oscillographs are running. A manual restart is required to recover the EN100 module functionality.CVE-2018-11452 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nVictor Nikitin, Vladislav Suchkov, and Ilya Karpov from ScadaX reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens has released update v4.33 for several affected products, is working on updates for the remaining affected products, and recommends specific countermeasures until fixes are available:https://support.industry.siemens.com/cs/us/en/view/109745821\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nBlock access to Port 102/TCP.\n\nFor additional information see Siemens’ security advisory SSA-325546 at the following location:http://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-11452",
    "CVE-2018-11451"
  ],
  "techniques": [],
  "advisory": "icsa-19-038-02",
  "title": "Siemens EN100 Ethernet Module | CISA",
  "source": "ics-advisories",
  "id": "fb96be6b52e70d3b3b8c0ea3942350ae54b4ac87ab4f70a9a6b34eef6efecf59"
}