{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: Exploitable remotely/low attack complexity\nVendor: BirdDog\nEquipment: STUDIO R3, 4K QUAD, MINI, A300 EYES\nVulnerabilities: Cross-Site Request Forgery, Use of Hard-Coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to remotely execute code or obtain unauthorized access to the product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following BirdDog camera and encoder versions are affected:\n\n4K QUAD:  Versions 4.5.181 and 4.5.196\nMINI: Version 2.6.2\nA300 EYES: Version 3.4\nSTUDIO R3: Version 3.6.4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nThe affected products have a CSRF vulnerability that could allow an attacker to execute code and upload malicious files.\nCVE-2023-2505 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:N/I:H/A:N).\n3.2.2 USE OF HARD-CODED CREDENTIALS CWE-798\nFiles present on firmware images could allow an attacker to gain unauthorized access as a root user using hard-coded credentials.\nCVE-2023-2504 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Australia\n\n3.4 RESEARCHER\nAlan Cao reported these vulnerabilities to CISA.\n4. MITIGATIONS\nBirdDog has released a firmware patch for this issue and users are encouraged to update their devices by going to BirdDog’s download page here.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2023-2505",
    "CVE-2023-2504"
  ],
  "techniques": [],
  "advisory": "icsa-23-131-11",
  "title": "BirdDog Cameras and Encoders | CISA",
  "source": "ics-advisories",
  "id": "fe8151d91d6258d719e89489f33a472411e51013bd9d2b2baa613e880cef731c"
}