{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: FATEK Automation\nEquipment: FvDesigner\nVulnerabilities: Use After Free, Access of Uninitialized Pointer, Stack-based Buffer Overflow, Out-of-Bounds Write, Out-of-Bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to read/modify information, execute arbitrary, and/or crash the application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of FATEK Automation FvDesigner, a software tool used to design and develop FATEK FV HMI series product projects, are affected:\n\nFvDesigner Version 1.5.76 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE AFTER FREE CWE-416\nA use after free issue has been identified in the way the application processes project files, allowing an attacker to craft a special project file that may permit arbitrary code execution.\nCVE-2021-22662 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    ACCESS OF UNINITIALIZED POINTER CWE-824\nAn uninitialized pointer may be exploited while the application is processing project files, allowing an attacker to craft a special project file that may permit arbitrary code execution.\nCVE-2021-22670 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow while project files are being processed, allowing an attacker to craft a special project file that may permit arbitrary code execution.\nCVE-2021-22666 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to an out-of-bounds write while processing project files, allowing an attacker to craft a special project file that may permit arbitrary code execution.\nCVE-2021-22683 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.5    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read while processing project files, allowing an attacker to craft a special project file that may permit arbitrary code execution.\nCVE-2021-22638 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nFrancis Provencher {PRL} and rgod, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nFATEK Automation is aware of the issue and is currently developing a solution. For more information, contact FATEK via email or by phone: +886-2-2808-2192\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nOnly open project files from trusted sources.\nEnsure the least-privilege user principle is followed.\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-22670",
    "CVE-2021-22683",
    "CVE-2021-22662",
    "CVE-2021-22666",
    "CVE-2021-22638"
  ],
  "techniques": [],
  "advisory": "icsa-21-056-02",
  "title": "FATEK Automation FvDesigner | CISA",
  "source": "ics-advisories",
  "id": "1763a8682bdf17086dd2e053689df26e0cd82bcfcda3ba05fad111afde122978"
}