{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Low attack complexity \nVendor: ICONICS, Mitsubishi Electric \nEquipment: ICONICS Product Suite \nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to write arbitrary files.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThis vulnerability could affect the ICONICS Suite including GENESIS64, Hyper Historian, AnalytiX, and MobileHMI: \n\nVersions v10.96 to v10.97.2 \n\nNote: ICONICS version 10.97.2 CFR1 and later versions are not vulnerable to this vulnerability \n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22 \nA crafted PKGX file could force ICONICS Workbench to write an arbitrary file through path traversal. \nCVE-2022-40264 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:C/C:N/I:H/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: ICONICS is headquartered in the United States. Mitsubishi Electric is headquartered in Japan. \n\n3.4 RESEARCHER\nNoam Moshe of Claroty Research, working with Trend Micro Zero Day Initiative, reported this vulnerability to CISA. \n4. MITIGATIONS\nICONICS and Mitsubishi Electric recommend updating the ICONICS Suite software with the latest security patches when available (login required). Security updates are released as critical fixes or rollup releases.  \nICONICS and Mitsubishi Electric recommend users take the following mitigation steps:  \n\nLocate control system networks and devices behind firewalls and isolate them from untrusted networks and hosts. \nMinimize network exposure for all control system devices. Control system devices should not directly face the internet.  \nAvoid clicking on web links in emails or opening email attachments from untrusted sources.  \nFor systems without patches or fixes, users should:  \n\nOnly unpack files received from trusted sources. \nProtect and encrypt Pack&Go packages with a password to prevent modifications by untrustworthy users. \nAvoid unpacking a Pack&Go package file using a relative path (Note: this would show in the Workbench UI). \n\n\n\nUsers should refer to the ICONICS whitepaper on security vulnerabilities for information on security update availability.  \nRefer to the Mitsubishi Electric advisory for further details and instructions for determining installed versions. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.  This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-40264"
  ],
  "techniques": [],
  "advisory": "icsa-22-347-01",
  "title": "ICONICS and Mitsubishi Electric Products | CISA",
  "source": "ics-advisories",
  "id": "6ea555f149dbc0c676a1038067357beed0b94aadbe1be1cff7692c1bdba619bd"
}