{
  "markdown": "\nCVSS v3 6.1\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Certec EDV GmbH\nEquipment: atvise scada\nVulnerabilities: Cross-Site Scripting, Header Injection\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-096-01 Certec EDV GmbH atvise scada that was published April 6, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following versions of atvise scada, a human machine interface configuration platform, are affected:\n--------- Begin Update A Part 1 of 2 --------\n\natvise scada prior to Version 3.0 without the vendor built-in security mechanism activated.\n\n--------- End Update A Part 1 of 2 ----------\nIMPACT\nSuccessful exploitation of these vulnerabilities could cause the device that the attacker is accessing to execute arbitrary code, affecting the integrity of the device.\nMITIGATION\n--------- Begin Update A Part 2 of 2 --------\nCertec EDV GmbH advises affected users to activate the built-in security mechanism (login, https, protected calls, etc.) of the product as described in the documentation. Users can also upgrade to the newest version of the software available on the Certec EDV GmbH web site (a user login will be needed to obtain the latest version):\nhttp://www.atvise.com/en/component/phocadownload/category/65-patches\nIn order to fully mitigate the vulnerabilities Certec EDV GmbH recommends that users follow the guidelines in the atvise scada documentation for enabling security measures that can be found in the following sections:\n\nHTTP/HTTPS support,\nProtected calls,\nLogin and user management, and\nUser and rights.\n\n--------- End Update A Part 2 of 2 ----------\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER NEUTRALIZATION OF HTTP HEADERS FOR SCRIPTING SYNTAX CWE-644\n\nThe header injection vulnerability has been identified, which may allow remote code execution.\nCVE-2017-6031 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n\nCROSS-SITE SCRIPTING CWE-79\n\nThe cross-site scripting vulnerability has been identified, which may allow remote code execution.\nCVE-2017-6029 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N).\nRESEARCHER\nSebastian Neef of Internetwache.org discovered the vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Eisenstadt, Austria\n",
  "cves": [
    "CVE-2017-6031",
    "CVE-2017-6029"
  ],
  "techniques": [],
  "advisory": "icsa-17-096-01a",
  "title": "Certec EDV GmbH atvise scada (Update A) | CISA",
  "source": "ics-advisories",
  "id": "e44eb80b6e3c810a1db63e1e37aed708abe48fa1a1cc54d860994af0f6e5846c"
}