{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Remotely exploitable\nVendor: Hyundai Motor America\nEquipment: Blue Link\nVulnerability: Man-in-the-Middle, Use of Hard-Coded Cryptographic Key\nAFFECTED PRODUCTS\nThe following versions of Blue Link, a mobile application for Hyundai vehicle management, are affected:\n\nBlue Link Version 3.9.5, and\nBlue Link Version 3.9.4.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow a remote attacker to gain access to insecurely transmitted sensitive information, which could allow the attacker to locate, unlock, and start a vehicle associated with the affected application.\nRapid7 working with Hyundai Motor America reports that it would be difficult to impossible to conduct this attack at scale, since an attacker would typically need to first subvert physically local networks, or gain a privileged position on the network path from the app user to their service instance.\nMITIGATION\nHyundai Motor America released Blue Link, Version 3.9.6, a mandatory update to the application, which mitigates the aforementioned vulnerabilities on March 6, 2017, for Android devices and March 8, 2017, for iOS devices.\nRapid7 has released a security advisory that can be found at https://community.rapid7.com/community/infosec/blog/2017/04/25/r7-2017-02-hyundai-blue-link-potential-info-disclosure-fixed\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nMAN-IN-THE-MIDDLE CWE-300\n\nCommunication channel endpoints are not verified, which may allow a remote attacker to access or influence communications between the identified endpoints.\nCVE-2017-6052 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N).\n\nUSE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\n\nThe application uses a hard-coded decryption password to protect sensitive user information.\nCVE-2017-6054 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nRESEARCHER\nThese vulnerabilities were discovered by Will Hatzer and Arjun Kumar working with Rapid7.\nBACKGROUND\nCritical Infrastructure Sector(s): Transportation Systems\nCountries/Areas Deployed: United States\nCompany Headquarters Location: Fountain Valley, California\n",
  "cves": [
    "CVE-2017-6054",
    "CVE-2017-6052"
  ],
  "techniques": [],
  "advisory": "icsa-17-115-03",
  "title": "Hyundai Motor America Blue Link | CISA",
  "source": "ics-advisories",
  "id": "50285e405473f3f3985b00630ac01369a7b0b1b6f3c28bae7d64e14b0d5412be"
}