{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: RUGGEDCOM ROS\nVulnerability: Improper Control of Generation of Code\n\n2. UPDATE\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-195-18 Siemens RUGGEDCOM ROS that was published July 14, 2022, on the ICS webpage on cisa.gov/ics\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause malicious behavior through legitimate user accounts accessing certain web resources on affected devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following RUGGEDCOM ROS-based devices: \n\nRUGGEDCOM ROS i800: All versions\nRUGGEDCOM ROS i801: All versions\nRUGGEDCOM ROS i802: All versions\nRUGGEDCOM ROS i803: All versions\nRUGGEDCOM ROS M969: All versions\nRUGGEDCOM ROS M2100: All versions\nRUGGEDCOM ROS M2200: All versions\nRUGGEDCOM ROS RMC: All versions\nRUGGEDCOM ROS RMC20: All versions\nRUGGEDCOM ROS RMC30: All versions\nRUGGEDCOM ROS RMC40: All versions\nRUGGEDCOM ROS RMC41: All versions\nRUGGEDCOM ROS RMC8388: All versions prior to v5.6.0\nRUGGEDCOM ROS RP110: All versions\nRUGGEDCOM ROS RS400: All versions\nRUGGEDCOM ROS RS401: All versions\nRUGGEDCOM ROS RS416: All versions\nRUGGEDCOM ROS RS416v2: All versions prior to v5.6.0\nRUGGEDCOM ROS RS900 (32M): All versions prior to v5.6.0\nRUGGEDCOM ROS RS900G: All versions\nRUGGEDCOM ROS RS900G (32M): All versions prior to v5.6.0\nRUGGEDCOM ROS RS900GP: All versions\nRUGGEDCOM ROS RS900L: All versions\nRUGGEDCOM ROS RS900W: All versions\nRUGGEDCOM ROS RS910: All versions\nRUGGEDCOM ROS RS910L: All versions\nRUGGEDCOM ROS RS910W: All versions\nRUGGEDCOM ROS RS920L: All versions\nRUGGEDCOM ROS RS920W: All versions\nRUGGEDCOM ROS RS930L: All versions\nRUGGEDCOM ROS RS930W: All versions\nRUGGEDCOM ROS RS940G: All versions\nRUGGEDCOM ROS RS969: All versions\n\n--------- Begin Update A Part 1 of 1 ---------\n\nRUGGEDCOM ROS RS900: All versions\nRUGGEDCOM ROS RS1600: All versions\nRUGGEDCOM ROS RS1600F: All versions\nRUGGEDCOM ROS RS1600T: All versions\n\n--------- End Update A Part 1 of 1 ---------\n\nRUGGEDCOM ROS RS8000: All versions\nRUGGEDCOM ROS RS8000A: All versions\nRUGGEDCOM ROS RS8000H: All versions\nRUGGEDCOM ROS RS8000T: All versions\nRUGGEDCOM ROS RSG907R: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG908C: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG909R: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG910C: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG920P: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG2100: All versions\nRUGGEDCOM ROS RSG2100 (32M): All versions prior to v5.6.0\nRUGGEDCOM ROS RSG2100P: All versions\nRUGGEDCOM ROS RSG2200: All versions\nRUGGEDCOM ROS RSG2288: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG2300: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG2300P: All versions prior to v5.6.0\nRUGGEDCOM ROS RSG2488: All versions prior to v5.6.0\nRUGGEDCOM ROS RSL910: All versions prior to v5.6.0\nRUGGEDCOM ROS RST916C: All versions prior to v5.6.0\nRUGGEDCOM ROS RST916P: All versions prior to v5.6.0\nRUGGEDCOM ROS RST2228: All versions prior to v5.6.0\nRUGGEDCOM ROS RST2228P: All versions prior to v5.6.0\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CODE INJECTION CWE-94\nAffected devices are vulnerable to web-based code injection attacks via the console.  An attacker could exploit this vulnerability to inject code into the web server and cause malicious behavior in legitimate users accessing certain web resources on affected devices.\nCVE-2022-34663 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nAarón Flecha Menéndez and Gabriel Vía Echezarreta from S21Sec reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has released updates for several affected products and recommends updating to the latest versions. Siemens recommends specific countermeasures for products where updates are not, or not yet, available.\n\nRUGGEDCOM ROS RMC8388: Update to v5.6.0 or later version\nRUGGEDCOM ROS RS416v2: Update to v5.6.0 or later version\nRUGGEDCOM ROS RS900 (32M): Update to v5.6.0 or later version\nRUGGEDCOM ROS RS900G (32M): Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG907R: Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG908C: Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG909R: Update to v5.6.0 or later version \nRUGGEDCOM ROS RSG910C: Update to v5.6.0 or later version \nRUGGEDCOM ROS RSG920P: Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG2100 (32M): Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG2288: Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG2300: Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG2300P: Update to v5.6.0 or later version\nRUGGEDCOM ROS RSG2488: Update to v5.6.0 or later version\nRUGGEDCOM ROS RSL910: Update to v5.6.0 or later version \nRUGGEDCOM ROS RST916C: Update to v5.6.0 or later version \nRUGGEDCOM ROS RST916P: Update to v5.6.0 or later version \nRUGGEDCOM ROS RST2228: Update to v5.6.0 or later version \nRUGGEDCOM ROS RST2228P: Update to v5.6.0 or later version\n\nSiemens recommends implementing the following specific workarounds and mitigations that customers can apply to reduce the risk:\n\nRestrict network access to only trusted IP addresses in affected systems to ports 443/TCP and 22/TCP.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals to help ensure security within an environment.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity \nFor more information about this issue, please see Siemens’ security advisory SSA-840800\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-34663"
  ],
  "techniques": [
    "T2228"
  ],
  "advisory": "icsa-22-195-18",
  "title": "Siemens RUGGEDCOM ROS (Update A) | CISA",
  "source": "ics-advisories",
  "id": "90a318aa5dc1198fe377560cec57199054205bab84c2cc5f31ce799a9702fa02"
}