{
  "markdown": "\nOVERVIEW\nAlexander Tlyapov, Gleb Gritsai, Kirill Nesterov, Artem Chaykin and Ilya Karpov of the Positive Technologies Research Team and Security Lab have identified vulnerabilities in Honeywell’s Experion Process Knowledge System (EPKS) application. Honeywell has produced several patch updates (R400.6, R410.6 and 430.6) that resolve these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Honeywell Experion PKS versions are affected:\n\nAll supported Experion PKS R40x versions prior to Experion PKS R400.6\nAll supported Experion PKS R41x versions prior to Experion PKS R410.6\nAll supported Experion PKS R43x versions prior to Experion PKS R430.2\n\nNote - Experion PKS R311.2 is impacted by these vulnerabilities but is no longer supported by Honeywell. Customers running Experion PKS R311.2 should upgrade to a supported version of Experion PKS.\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow remote, unauthenticated attackers to execute arbitrary code on a vulnerable system.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nHoneywell EPKS is a distributed control system solution sold globally by Honeywell Process Solutions. EPKS is used for automation and control of industrial and manufacturing processes.\nHoneywell’s integrated process automation EPKS consists of web-based SCADA systems. Experion PKS is deployed across several sectors including Chemical, Critical Manufacturing, Energy and Healthcare and Public Health.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nHEAP-BASED BUFFER OVERFLOWCWE-122: Heap-based Buffer Overflow, http://cwe.mitre.org/data/definitions/122.html, web site last accessed December 18, 2014.\n\nMultiple heap-based buffer overflow vulnerabilities exist in the confd.exe, dual_onsrv.exe, hscodbcn.exe, and ripsd.exe modules, which could lead to possible remote code execution or denial of service.\nCVE-2014-9187NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-9187, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7.6 has been assigned; the CVSS vector string is (AV:N/AC:H/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:H/Au:N/C:C/I:C/A:C, web site last accessed December 18, 2014.\n\nSTACK-BASED BUFFER OVERFLOWCWE-121: Stack-Based Buffer Overflow, http://cwe.mitre.org/data/definitions/121.html, web site last accessed December 18, 2014.\n\nMultiple stack-based buffer overflow vulnerabilities were found in confd.exe, hscodbcn.exe and pscdasrv.exe modules that could lead to possible remote code execution, dynamic memory corruption, or denial of service.\nCVE-2014-9189NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-9189, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:C/I:C/A:C, web site last accessed December 18, 2014.\n\nARBITRARY MEMORY WRITECWE-123: Write-what-where Condition, http://cwe.mitre.org/data/definitions/123.html, web site last accessed December 18, 2014.\n\nAn arbitrary memory write vulnerability exists in the dual_onsrv.exe module that could lead to possible remote code execution or denial of service.\nCVE-2014-5435NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-5435, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 9.3 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:C/I:C/A:C, web site last accessed December 18, 2014.\n\nDIRECTORY TRAVERSALCWE-22: Directory Traversal, http://cwe.mitre.org/data/definitions/22.html, web site last accessed December 18, 2014.\n\nA directory traversal vulnerability exists in the confd.exe module, which could lead to possible information disclosure.\nCVE-2014-5436NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-5436, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:P/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:P/I:N/A:N, web site last accessed December 18, 2014.\n\nFILE INCLUSIONCWE-98 File Inclusion, http://cwe.mitre.org/data/definitions/98.html, web site last accessed December 18, 2014.\n\nA file inclusion vulnerability exists in the confd.exe module, which could lead to accepting an arbitrary file into the function, and potential information disclosure or remote code execution.\nCVE-2014-9186NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-9186, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:N/I:P/A:N, web site last accessed December 18, 2014.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a moderate skill would be able to exploit these vulnerabilities.\nMITIGATION\nHoneywell currently supports EKPS Versions R400.6, R410.6, and 430.2.\nHoneywell strongly encourages and recommends all customers running unsupported versions of EKPS prior to R400 to upgrade to a supported version.\nAvailable patches that resolve the vulnerabilities are listed below:\nSoftware Downloads\n\nExperion Update Patch R400.6\nExperion Update Patch R410.6\nExperion Update Patch R430.2\n\nPlease contact your Honeywell technical support for registration and installation instructions for these patches at :\nhttps://www.honeywellprocess.com/en-US/support/pages/request-support.aspx\nhttps://www.honeywellprocess.com/en-US/contact-us/pages/default.aspx\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2014-9187",
    "CVE-2014-5436",
    "CVE-2014-9186",
    "CVE-2014-5435",
    "CVE-2014-9189"
  ],
  "techniques": [],
  "advisory": "icsa-14-352-01",
  "title": "Honeywell Experion PKS Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "3e1d82abff54697b5d790a13b2827e5398ea62dff631067662c5716b4d19dbf6"
}