{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Emerson\nEquipment: DeltaV Distributed Control System Controllers and Workstations\nVulnerabilities: Missing Authentication for Critical Function, Uncontrolled Search Path Element\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to achieve local privilege escalation or restart a controller, resulting in a denial-of-service condition. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nEmerson reports these vulnerabilities affect the following versions:\n\nDeltaV Distributed Control System Controllers and Workstations: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nA specially crafted script could cause a controller to restart and cause a denial-of-service condition.\nCVE-2021-26264 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.2    UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nMissing DLLs, if replaced by an insider, could allow an attacker to achieve local privilege escalation when some DeltaV services are started.\nCVE-2021-44463 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy \nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov of Claroty reported these vulnerabilities to Emerson.\n4. MITIGATIONS\nEmerson recommends users apply the vendor patch to affected products listed below:\n\nDeltaV DCS Versions 13.3.1, 14.LTS, 14.FP1, 14.FP2, and R6\n\nSoftware patches are available to users with access to the Guardian Support Portal (login required). Please refer to the Knowledge Base Article NK-2100-0497 (DSN21008) on the Guardian Support Portal for more information.\nTo limit exposure to these and other vulnerabilities, Emerson recommends DeltaV systems and related components be deployed and configured as described in the DeltaV Security Manual, which can be found in Emerson’s Guardian Support Portal (login required).\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n\n\n",
  "cves": [
    "CVE-2021-26264",
    "CVE-2021-44463"
  ],
  "techniques": [],
  "advisory": "icsa-21-355-04",
  "title": "Emerson DeltaV | CISA",
  "source": "ics-advisories",
  "id": "87076b44283522084314cb3f854c879a90937e57cc952a0bf636c9d946b329ad"
}