{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: xArrow\nEquipment: xArrow SCADA\nVulnerabilities: Cross-site Scripting, Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of xArrow, a SCADA/HMI, are affected:\n\nVersions 7.2 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe affected product is vulnerable to cross-site scripting due to parameter ‘edate’ of the resource xhisalarm.htm, which may allow an unauthorized attacker to execute arbitrary code.\nCVE-2021-33021 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n3.2.2    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe affected product is vulnerable to cross-site scripting due to parameter ‘bdate’ of the resource xhisvalue.htm, which may allow an unauthorized attacker to execute arbitrary code.\nCVE-2021-33001 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n3.2.3    IMPROPER INPUT VALIDATION CWE-22\nThe affected product permits unvalidated registry keys to be run with application-level privileges.\nCVE-2021-33025 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:L/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: China\n\n3.4 RESEARCHER\nSharon Brizinov from Claroty, and Michael Heinzl reported these vulnerabilities to CISA.\n4. MITIGATIONS\nxArrow has not responded to requests to work with CISA to mitigate these vulnerabilities. Users of these affected products who would like to see more responsible security are invited to contact xArrow customer support.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nDisable web server implementation. Web server is disabled by default.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-33025",
    "CVE-2021-33001",
    "CVE-2021-33021"
  ],
  "techniques": [],
  "advisory": "icsa-21-229-03",
  "title": "xArrow SCADA | CISA",
  "source": "ics-advisories",
  "id": "9d0144672b7d32dc37cca3b6e46d8f0a5708db95c58034711f6e6570dc28cbe1"
}