{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). \n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: LOGO! 8 BM\nVulnerability: Improper Handling of Exceptional Conditions\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition if a user is tricked into loading a malicious project file.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LOGO! 8, a programmable logic controller, are affected:\n\nLOGO! 8 BM (incl. SIPLUS variants): All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER HANDLING OF EXCEPTIONAL CONDITIONS CWE-755\nControl logic (CL) the LOGO! 8 could be manipulated in a way to cause the device executing the CL to improperly handle the manipulation and crash, resulting in a denial-of-service condition. The device must then be manually reset.\nCVE-2020-25236 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMax Bäumler reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nSiemens recommends limiting the possibilities to execute untrusted code if possible.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security for Siemens devices can be found at: https://www.siemens.com/industrialsecurity\nFor more information, please see Siemens Security Advisory SSA-783481\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-25236"
  ],
  "techniques": [],
  "advisory": "icsa-21-068-05",
  "title": "Siemens LOGO! 8 BM | CISA",
  "source": "ics-advisories",
  "id": "8c9f0307c9b271eb794ed7ac3ba4be076ac4ddfc8b09e5709d03bc4145410e40"
}