{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: INEA\nEquipment: ME RTU\nVulnerabilities: OS Command Injection, Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Inea ME RTU are affected:\n\nME RTU: versions 3.36b and prior\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND (‘OS COMMAND INJECTION')CWE-78\nVersions of INEA ME RTU firmware 3.36b and prior are vulnerable to operating system (OS) command injection, which could allow remote code execution.\nCVE-2023-35762 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.2.2 IMPROPER AUTHENTICATION CWE-287\nVersions of INEA ME RTU firmware 3.36b and prior do not require authentication to the \"root\" account on the host system of the device. This could allow an attacker to obtain admin-level access to the host system.\nCVE-2023-29155 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater, Transportation\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Slovenia\n\n3.4 RESEARCHER\nFloris Hendriks of Radboud University reported these vulnerabilities to CISA.\n4. MITIGATIONS\nINEA recommends users to upgrade ME RTU to firmware version 3.37.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\n\n\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\n\n\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nOctober 31, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-35762",
    "CVE-2023-29155"
  ],
  "techniques": [],
  "advisory": "icsa-23-304-02",
  "title": "INEA ME RTU | CISA",
  "source": "ics-advisories",
  "id": "bec0e663195dda0855d7ea429c0630a15a3a21b842cf04760000edf16d13334d"
}