{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SICAM GridEdge Essential ARM\nVulnerabilities: Missing Authentication for Critical Function, Resource Leak\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker access to critical API functions, cross-origin resource sharing, and credentials.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSICAM GridEdge Essential ARM: All versions prior to v2.6.6\nSICAM GridEdge Essential Intel: All versions prior to v2.6.6\nSICAM GridEdge Essential with GDS ARM: All versions prior to v2.6.6\nSICAM GridEdge Essential with GDS Intel: All versions prior to v2.6.6\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected software does not require authenticated access for privileged functions. This could allow an unauthenticated attacker to change the data of a user.\nCVE-2022-30229 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n 3.2.2    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected software does not require authenticated access for privileged functions. This could allow an unauthenticated attacker to create a new user with administrative permissions.\nCVE-2022-30230 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    TRANSMISSION OF PRIVATE RESOURCES INTO A NEW SPHERE ('RESOURCE LEAK') CWE-402\nThe affected software discloses password hashes of other users upon request. This could allow an authenticated user to retrieve another user’s password hash.\nCVE-2022-30231 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nAbian Blome from Siemens Energy reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens recommends updating to the latest version of its software:\n\nSICAM GridEdge Essential ARM: Update to v2.6.6 or later\nSICAM GridEdge Essential Intel: Update to v2.6.6 or later\nSICAM GridEdge Essential with GDS ARM: Update to v2.6.6 or later\nSICAM GridEdge Essential with GDS Intel: Update to v2.6.6 or later\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nLimit access to Port 8900/TCP trusted users and systems only\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-631336\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-30231",
    "CVE-2022-30229",
    "CVE-2022-30230"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-08",
  "title": "Siemens SICAM GridEdge | CISA",
  "source": "ics-advisories",
  "id": "38cc5ca0ca20be3a002d9d0b153587f4a3b45a8e83da465eaa3d748aecfdecc4"
}