{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Yokogawa\nEquipment: CENTUM VP & CS 3000 Controller FCS\nVulnerability: Denial of Service\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the affected device, resulting in a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nYokogawa reports this vulnerability affects the following CENTUM VP/CS 3000 Controller FCS products:\n\nCENTUM VP/CS 3000 controller FCS:\n\nCP31, CP33, CP345\nCP401, CP451\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    RESOURCE MANAGEMENT ERRORS CWE-399\nThe Yokogawa CENTUM VP/CS 3000 Controller FCS is vulnerable to a denial-of-service attack caused by a malformed packet. This attack may stop inter-station data link block (ADL) communications.\nCVE-2022-33939 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nYokogawa reported this vulnerability to JPCERT/CC.\n4. MITIGATIONS\nYokogawa has listed the following products as vulnerable due to end-of-life status, with no software patch available:\n\nCENTUM CS 3000\nCENTUM CS 3000 Entry Class\nCENTUM VP (R4.01.00 to R4.03.00)\nCENTUM VP Entry Class (R4.01.00 to R4.03.00)\n\nYokogawa has provided software patches for the following vulnerable products:\n\nCENTUM VP (R5.01.00 to R5.04.20)\nCENTUM VP Entry Class (R6.01.00 to R6.03.00)\n\nFor more information and details on implementing these mitigations and downloading the latest patch, users should see the Yokogawa advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-33939"
  ],
  "techniques": [],
  "advisory": "icsa-22-228-01",
  "title": "Yokogawa CENTUM Controller FCS | CISA",
  "source": "ics-advisories",
  "id": "15f67065db99971b4b96cc504a3a375097150761744f78a3ed338af700d5da44"
}