{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Mitsubishi Electric Europe B.V.\nEquipment: E-Designer\nVulnerabilities: Heap-Based Buffer Overflow, Stack-Based Buffer Overflow, Out-of-Bounds Write\nAFFECTED PRODUCTS\nThe following version of E-Designer, a Mitsubishi Electric Europe B.V. product to program HMIs for E1000 products, is affected:\n\nE-Designer, Version 7.52 Build 344.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities can result in corruption of sensitive information, system crash, denial of service, and arbitrary code execution.\nMITIGATION\nMitsubishi recommends the following actions to mitigate these vulnerabilities:\n\nUse E-Designer in a safe, firewalled network.\nReplace E-Designer HMIs with interfaces built with Mitsubishi’s new product, GT Works. E-Designer has been discontinued.\n\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nSix code sections have been identified in which exploiting this vulnerability can overwrite the stack. This can result in arbitrary code execution, compromised data integrity, denial of service, and system crash.\nCVE-2017-9638 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nHEAP-BASED BUFFER OVERFLOW CWE-122\n\nFive code sections have been identified in which exploiting this vulnerability can overwrite the heap. This can result in arbitrary code execution, compromised data integrity, denial of service, and system crash.\nCVE-2017-9636 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nOUT-OF-BOUNDS WRITE CWE-787\n\nTwo code sections have been identified in which exploiting this vulnerability can allow a remote attacker to write data to arbitrary memory locations. This can result in arbitrary code execution, compromised data integrity, denial of service, and system crash.\nCVE-2017-9634 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nAndrea “rgod” Micalizzi, working with Trend Micro’s Zero Day Initiative, disclosed these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Tokyo, Japan\n",
  "cves": [
    "CVE-2017-9636",
    "CVE-2017-9638",
    "CVE-2017-9634"
  ],
  "techniques": [],
  "advisory": "icsa-17-213-01",
  "title": "Mitsubishi Electric Europe B.V. E-Designer | CISA",
  "source": "ics-advisories",
  "id": "4054e22dcdef64c9308170f4d868ea618a1314f4cc508e73dabd44b4f8883f3b"
}