{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC WinCC OA\nVulnerability: Use of Client-side Authentication\n\nCISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to impersonate other users or exploit the client-server protocol without being authenticated.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC WinCC OA, a SCADA HMI system, are affected:\n\nSIMATIC WinCC OA v3.16: All versions\nSIMATIC WinCC OA v3.17: All versions\nSIMATIC WinCC OA v3.18: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF CLIENT-SIDE AUTHENTICATION CWE-603\nAffected applications use client-side only authentication when neither server-side authentication nor Kerberos authentication is enabled. In this configuration, attackers could impersonate other users or exploit the client-server protocol without being authenticated.\nCVE-2022-33139 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n•    CRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\n•    COUNTRIES/AREAS DEPLOYED: Worldwide\n•    COMPANY HEADQUARTERS LOCATION: Germany\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forecout Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends the following mitigations or workarounds:\n\nEnable server-side authentication (SSA) or Kerberos authentication for your WinCC OA project (login required).\n\nSIMATIC WinCC OA v3.16 SSA\nSIMATIC WinCC OA v3.17 SSA\nSIMATIC WinCC OA v3.18 SSA\n\n\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-111512\nRemarks by ETM regarding SSA-11512 for SIMATIC WinCC OA\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-33139"
  ],
  "techniques": [],
  "advisory": "icsa-22-172-06",
  "title": "Siemens WinCC OA | CISA",
  "source": "ics-advisories",
  "id": "99d1181e170f7644aa73130084cac06f91f27ff34a3ac77920666b1b0eaf9516"
}