{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: AFS660/AFS665\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to overflow an internal buffer and fully compromise the target device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi Energy reports this vulnerability affects the following AFS660/AFS665 industrial switches: \n\nReleases 7.0.02 or prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nImproper parsing of URL arguments could allow an attacker to exploit this vulnerability by crafting specially formed HTTP requests to overflow an internal buffer. Successful exploitation could fully compromise the device.\nCVE-2020-6994 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi Energy recommends users update to 7.1.05 or later or apply mitigation strategies.\nHitachi Energy recommends the following security practices and firewall configurations to protect process control networks from attacks originating from outside the network: \n\nPhysically protect process control systems from unauthorized direct access.\nSeparate process control systems from the internet and other networks using a firewall system with minimal open ports.\nProcess control systems should not be used for internet surfing, instant messaging, or email.\nPortable computers and removable storage media should be carefully scanned for viruses before connecting to a control system.\n\nFor more information, see Hitachi Energy advisory 8DBD000122.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has a low attack complexity.\n",
  "cves": [
    "CVE-2020-6994"
  ],
  "techniques": [],
  "advisory": "icsa-22-270-01",
  "title": "Hitachi Energy AFS660/AFS665 | CISA",
  "source": "ics-advisories",
  "id": "4939c2216f14eec7bbd459cc82fec41e57d96c80eb49077b3f410940fef12676"
}