{
  "markdown": "\n1. SUMMARY\nThis advisory identifies vulnerabilities affecting versions of the Dominion Voting Systems Democracy Suite ImageCast X, which is an in-person voting system used to allow voters to mark their ballot. The ImageCast X can be configured to allow a voter to produce a paper record or to record votes electronically. While these vulnerabilities present risks that should be mitigated as soon as possible, CISA has no evidence that these vulnerabilities have been exploited in any elections. \nExploitation of these vulnerabilities would require physical access to individual ImageCast X devices, access to the Election Management System (EMS), or the ability to modify files before they are uploaded to ImageCast X devices. Jurisdictions can prevent and/or detect the exploitation of these vulnerabilities by diligently applying the mitigations recommended in this advisory, including technical, physical, and operational controls that limit unauthorized access or manipulation of voting systems. Many of these mitigations are already typically standard practice in jurisdictions where these devices are in use and can be enhanced to further guard against exploitation of these vulnerabilities.\n2. TECHNICAL DETAILS\n2.1 AFFECTED PRODUCTS\nThe following versions of the Dominion Voting Systems ImageCast X software are known to be affected (other versions were not able to be tested):\n\nImageCast X firmware based on Android 5.1, as used in Dominion Democracy Suite Voting System Version 5.5-A\nImageCast X application Versions 5.5.10.30 and 5.5.10.32, as used in Dominion Democracy Suite Voting System Version 5.5-A\n\nNOTE: After following the vendor’s procedure to upgrade the ImageCast X from Version 5.5.10.30 to 5.5.10.32, or after performing other Android administrative actions, the ImageCast X may be left in a configuration that could allow an attacker who can attach an external input device to escalate privileges and/or install malicious code. Instructions to check for and mitigate this condition are available from Dominion Voting Systems.\n\n\n\nAny jurisdictions running ImageCast X are encouraged to contact Dominion Voting Systems to understand the vulnerability status of their specific implementation. \n2.2 VULNERABILITY OVERVIEW\nNOTE: Mitigations to reduce the risk of exploitation of these vulnerabilities can be found in Section 3 of this document.\n2.2.1    IMPROPER VERIFICATION OF CRYPTOGRAPHIC SIGNATURE CWE-347\nThe tested version of ImageCast X does not validate application signatures to a trusted root certificate. Use of a trusted root certificate ensures software installed on a device is traceable to, or verifiable against, a cryptographic key provided by the manufacturer to detect tampering. An attacker could leverage this vulnerability to install malicious code, which could also be spread to other vulnerable ImageCast X devices via removable media. \nCVE-2022-1739 has been assigned to this vulnerability. \n2.2.2    MUTABLE ATTESTATION OR MEASUREMENT REPORTING DATA CWE-1283\nThe tested version of ImageCast X’s on-screen application hash display feature, audit log export, and application export functionality rely on self-attestation mechanisms. An attacker could leverage this vulnerability to disguise malicious applications on a device.\nCVE-2022-1740 has been assigned to this vulnerability. \n2.2.3    HIDDEN FUNCTIONALITY CWE-912\nThe tested version of ImageCast X has a Terminal Emulator application which could be leveraged by an attacker to gain elevated privileges on a device and/or install malicious code.\nCVE-2022-1741 has been assigned to this vulnerability. \n2.2.4    IMPROPER PROTECTION OF ALTERNATE PATH CWE-424\nThe tested version of ImageCast X allows for rebooting into Android Safe Mode, which allows an attacker to directly access the operating system. An attacker could leverage this vulnerability to escalate privileges on a device and/or install malicious code.\nCVE-2022-1742 has been assigned to this vulnerability. \n2.2.5    PATH TRAVERSAL: '../FILEDIR' CWE-24\nThe tested version of ImageCast X can be manipulated to cause arbitrary code execution by specially crafted election definition files. An attacker could leverage this vulnerability to spread malicious code to ImageCast X devices from the EMS. \nCVE-2022-1743 has been assigned to this vulnerability. \n2.2.6    EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250\nApplications on the tested version of ImageCast X can execute code with elevated privileges by exploiting a system level service. An attacker could leverage this vulnerability to escalate privileges on a device and/or install malicious code.\nCVE-2022-1744 has been assigned to this vulnerability. \n2.2.7    AUTHENTICATION BYPASS BY SPOOFING CWE-290\nThe authentication mechanism used by technicians on the tested version of ImageCast X is susceptible to forgery. An attacker with physical access may use this to gain administrative privileges on a device and install malicious code or perform arbitrary administrative actions.\nCVE-2022-1745 has been assigned to this vulnerability. \n2.2.8    INCORRECT PRIVILEGE ASSIGNMENT CWE-266\nThe authentication mechanism used by poll workers to administer voting using the tested version of ImageCast X can expose cryptographic secrets used to protect election information. An attacker could leverage this vulnerability to gain access to sensitive information and perform privileged actions, potentially affecting other election equipment.\nCVE-2022-1746 has been assigned to this vulnerability. \n2.2.9    ORIGIN VALIDATION ERROR CWE-346\nThe authentication mechanism used by voters to activate a voting session on the tested version of ImageCast X is susceptible to forgery. An attacker could leverage this vulnerability to print an arbitrary number of ballots without authorization.\nCVE-2022-1747 has been assigned to this vulnerability. \n2.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS Government Facilities / Election Infrastructure\nCOUNTRIES/AREAS DEPLOYED: Multiple\nCOMPANY HEADQUARTERS LOCATION: Denver, Colorado\n\n2.4 RESEARCHER\nJ. Alex Halderman, University of Michigan, and Drew Springall, Auburn University, reported these vulnerabilities to CISA.\n3. MITIGATIONS\nCISA recommends election officials continue to take and further enhance defensive measures to reduce the risk of exploitation of these vulnerabilities. Specifically, for each election, election officials should: \n\nContact Dominion Voting Systems to determine which software and/or firmware updates need to be applied. Dominion Voting Systems reports to CISA that the above vulnerabilities have been addressed in subsequent software versions.\nEnsure all affected devices are physically protected before, during, and after voting.\nEnsure compliance with chain of custody procedures throughout the election cycle. \nEnsure that ImageCast X and the Election Management System (EMS) are not connected to any external (i.e., Internet accessible) networks.\nEnsure carefully selected protective and detective physical security measures (for example, locks and tamper-evident seals) are implemented on all affected devices, including on connected devices such as printers and connecting cables.\nClose any background application windows on each ImageCast X device.\nUse read-only media to update software or install files onto ImageCast X devices.\nUse separate, unique passcodes for each poll worker card.\nEnsure all ImageCast X devices are subjected to rigorous pre- and post-election testing.\nDisable the “Unify Tabulator Security Keys” feature on the election management system and ensure new cryptographic keys are used for each election.\nAs recommended by Dominion Voting Systems, use the supplemental method to validate hashes on applications, audit log exports, and application exports.\nEncourage voters to verify the human-readable votes on printout. \nConduct rigorous post-election tabulation audits of the human-readable portions of physical ballots and paper records, to include reviewing ballot chain of custody and conducting voter/ballot reconciliation procedures. These activities are especially crucial to detect attacks where the listed vulnerabilities are exploited such that a barcode is manipulated to be tabulated inconsistently with the human-readable portion of the paper ballot. (NOTE: If states and jurisdictions so choose, the ImageCast X provides the configuration option to produce ballots that do not print barcodes for tabulation.)\n\n",
  "cves": [
    "CVE-2022-1745",
    "CVE-2022-1740",
    "CVE-2022-1743",
    "CVE-2022-1739",
    "CVE-2022-1742",
    "CVE-2022-1744",
    "CVE-2022-1746",
    "CVE-2022-1747",
    "CVE-2022-1741"
  ],
  "techniques": [],
  "advisory": "icsa-22-154-01",
  "title": "Vulnerabilities Affecting Dominion Voting Systems ImageCast X | CISA",
  "source": "ics-advisories",
  "id": "d9eed632f96933d8c14fc3a3ad474b30dbaa5ecbb3cfe555fdf74a64bb6a92e6"
}