{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 5.9\n\nATTENTION: Low skill level to exploit.\nVendor: WECON Technology Co., Ltd. (WECON)\nEquipment: LeviStudio HMI Editor, and PI Studio HMI Project Programmer\nVulnerabilities: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LEVI Studio HMI Editor and PI Studio HMI Project Programmer, HMI programming software products, are affected:\n\nWECON LeviStudioU Version 1.10 part of Wecon LeviStudioU 1.8.29 and prior, and\nPI Studio HMI Project Programmer Build: November 11, 2017 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 STACK-BASED BUFFER OVERFLOW CWE-121\nA buffer overflow can be triggered by opening a specially crafted file.\nCVE-2018-7527 has been assigned to these vulnerabilities. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\n\n3.4 RESEARCHER\nSergey Zelenyuk of RVRT and Michael DePlante of Leahy Center for Digital Investigation at Champlain College, both working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nWECON recommends that users update to the latest version, which can be found at the following location (download):\nhttp://wecon-disk.oss-ap-southeast-1.aliyuncs.com/LeviStudioU20180420%20TEST.exe\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-7527"
  ],
  "techniques": [],
  "advisory": "icsa-18-116-02",
  "title": "WECON Technology Co., Ltd. LeviStudio HMI Editor and PI Studio HMI Project Programmer | CISA",
  "source": "ics-advisories",
  "id": "a16cf1fcf55dc3208a7e54252760807428341f3be0591fc6d48fad28803635a0"
}