{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Low attack complexity\nVendor: Advantech\nEquipment: R-SeeNet\nVulnerabilities: SQL Injection, Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow authenticated users to perform a local privilege escalation and retrieve any information from the product’s database.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of R-SeeNet, a monitoring application, are affected:\n\nR-SeeNet: Versions 2.4.16 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nAdvantech is aware of multiple SQL injection vulnerabilities in the following pages: group_list, company_list, user_list, and device_list. An attacker could send a specially crafted HTTP request to trigger the vulnerabilities.\nCVE-2021-21915, CVE-2021-21916, CVE-2021-21917, CVE-2021-21918, CVE-2021-21919, CVE-2021-21920, CVE-2021-21921, CVE-2021-21922, CVE-2021-21923, CVE-2021-21924, CVE-2021-21925, CVE-2021-21926, CVE-2021-21927, CVE-2021-21928, CVE-2021-21929, CVE-2021-21930, CVE-2021-21931, CVE-2021-21932, CVE-2021-21933, CVE-2021-21934, CVE-2021-21935, CVE-2021-21936, and CVE-2021-21937 have been assigned to these vulnerabilities. A CVSS v3 base score of 7.7 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N).\n3.2.2    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nAdvantech is aware of multiple privilege escalation vulnerabilities that could be triggered when an authenticated user replaces a specially crafted file in the system to escalate privileges to NT SYSTEM authority.\nCVE-2021-21910, CVE-2021-21911, and CVE-2021-21912 have been assigned to these vulnerabilities. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, Middle East, South America, United States\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nYuri Kramarz of Cisco Talos reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAdvantech recommends updating to Version 2.4.17 or later.\nSee Advantech Czech’s Security Advisory SA-2021-03 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-21923",
    "CVE-2021-21917",
    "CVE-2021-21931",
    "CVE-2021-21937",
    "CVE-2021-21934",
    "CVE-2021-21919",
    "CVE-2021-21922",
    "CVE-2021-21911",
    "CVE-2021-21932",
    "CVE-2021-21927",
    "CVE-2021-21933",
    "CVE-2021-21924",
    "CVE-2021-21925",
    "CVE-2021-21910",
    "CVE-2021-21921",
    "CVE-2021-21915",
    "CVE-2021-21916",
    "CVE-2021-21920",
    "CVE-2021-21936",
    "CVE-2021-21912",
    "CVE-2021-21930",
    "CVE-2021-21929",
    "CVE-2021-21935",
    "CVE-2021-21928",
    "CVE-2021-21926",
    "CVE-2021-21918"
  ],
  "techniques": [],
  "advisory": "icsa-21-348-01",
  "title": "Advantech R-SeeNet | CISA",
  "source": "ics-advisories",
  "id": "a836f47e1c0454981a9b74317142705592b6dd15605443588ab66fb08cce672f"
}