{
  "markdown": "\nCVSS v3 6.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Progea\nEquipment: Movicon SCADA/HMI\nVulnerability: Uncontrolled Search Path Element, Unquoted Search Path or Element\nAFFECTED PRODUCTS\nThe following versions of Movicon HMI, an HMI software platform, are affected:\n\nMovicon Version 11.5.1181 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow privilege escalation or arbitrary code execution.\nMITIGATION\nProgea has not provided an update to address these vulnerabilities. However, Progea has issued a knowledge base article about DLL Hijacking, which can be found at the following location:\nhttp://www.movicon.info/Support/MoviconKB/WebHelp/Knowledgebase/kb000035.htm\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks which could lead a user to download a malicious DLL file accidentally:\n1.Do not click web links or open unsolicited attachments in email messages.\n2.Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\n3.Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nAn uncontrolled search path element vulnerability has been identified, which may allow a remote attacker without privileges to execute arbitrary code in the form of a malicious DLL file.\nCVE-2017-14017 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\n\nUNQUOTED SEARCH PATH OR ELEMENT CWE-428\n\nAn unquoted search path or element vulnerability has been identified, which may allow an authorized local user to insert arbitrary code into the unquoted service path and escalate his or her privileges.\nCVE-2017-14019 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\n\nRESEARCHER\nKarn Ganeshen reported these vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCountries/Areas Deployed: Europe, India, and United States\nCompany Headquarters Location: Italy\n",
  "cves": [
    "CVE-2017-14017",
    "CVE-2017-14019"
  ],
  "techniques": [],
  "advisory": "icsa-17-290-01",
  "title": "Progea Movicon SCADA/HMI | CISA",
  "source": "ics-advisories",
  "id": "362a071d602a757771e9131cd1d4f0679a14ea1a8d2b3381ee8f64064274e159"
}