{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Omron\nEquipment: PLC CJ Series\nVulnerability: Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Omron programmable logic controllers are affected:\n\nOmron PLC CJ series, all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAn attacker can send a series of specific data packets within a short period, causing a service error on the PLC Ethernet module, which in turn causes a PLC service denied result.\nCVE-2020-6986 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nJipeng You (XDU) reported this vulnerability to CISA.\n4. MITIGATIONS\nOmron recommends the following mitigation measures:\n\nFilter FINS port: Protect access to Omron’s PLC with a firewall and by blocking unnecessary remote access to FINS port (default: 9600).\nFilter IP addresses: Protect access to Omron’s PLC with a firewall and filtering devices connected to the PLC by IP address.\n\nFor more information on Omron PLC CJ Series vulnerabilities, refer to Vulnerabilities in Omron CJ series CPU PLCs.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-6986"
  ],
  "techniques": [],
  "advisory": "icsa-20-063-03",
  "title": "Omron PLC CJ Series | CISA",
  "source": "ics-advisories",
  "id": "5b20ea9ce549452882cfaa074bc6a3b044f76f1834213d6f6bae5cc9a95529be"
}