{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: Viewport for Web Office Portal\nVulnerability: Improper Authentication\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following ViewPort for Web Office Portal products:\n\nViewPort for Web Office Portal: versions prior to revision number 1453\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a remote attacker to upload and execute arbitrary code.\nMITIGATION\nSiemens has released software revision number 1453 for ViewPort for Web Office Portal to address the vulnerability. It is recommended that users update to the fixed version. This new version can be obtained by emailing Siemens Energy Customer Support Center at: support.energy@siemens.com\nSiemens recommends the following mitigations until patches can be applied:\n\nProtect access to Port 443/TCP and Port 80/TCP of the affected product with appropriate measures.\nDisable Port 80/TCP and use TLS client certificates (PKI) to access Port 443/TCP.\nApply Defense-in-Depth.\n\nhttps://www.siemens.com/gridsecurity\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-545214 at the following location:\nhttp://www.siemens.com/cert/advisories\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nAn unauthenticated remote attacker may be able to use specially crafted network packets to upload arbitrary code to Port 443/TCP or Port 80/TCP and execute with the permissions of the operating system user.\nCVE-2017-6869 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nHannes Trunde from Kapsch BusinessCom AG reported this vulnerability to Siemens.\nBACKGROUND\nCritical Infrastructure Sector(s): Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-6869"
  ],
  "techniques": [],
  "advisory": "icsa-17-180-03",
  "title": "Siemens Viewport for Web Office Portal | CISA",
  "source": "ics-advisories",
  "id": "ad44657293df09ef9dc98a0c9081cd6e21ae2d8432644cc21ce1e16b16fc55ff"
}