{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SINUMERIK MC\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow local attackers to escalate privileges to root.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following versions of the SINUMERIK MC CNC system control system for customized machines.\n\nSINUMERIK MC: All versions prior to v1.15 SP1\nSINUMERIK ONE: All versions prior to v6.15 SP1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThe sc SUID binary on affected devices provides several commands used to execute system commands or modify system files. A specific set of operations using sc could allow local attackers to escalate their privileges to root.\nCVE-2022-24408 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends updating to the latest versions.\n\nSINUMERIK MC: Update to v1.15 SP1 or later versions\nSINUMERIK ONE: Update to v6.15 SP1 or later versions\n\nSINUMERIK software can be obtained from a Siemens account manager.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/Industrialsecurity\nFor additional information, please refer to Siemens Security Advisory SSA-337210\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-24408"
  ],
  "techniques": [],
  "advisory": "icsa-22-069-11",
  "title": "Siemens SINUMERIK MC | CISA",
  "source": "ics-advisories",
  "id": "ec2a43fa65ae31d73b5b9ba28f7f96a325359a25bfc1897de5491f25e846c57f"
}