{
  "markdown": " Yokogawa Multiple Products Buffer Overflow Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryYokogawa Multiple Products Buffer Overflow Vulnerabilities========================================================== Last Revised September 10, 2015 Alert Code ICSA\\-15\\-253\\-01OVERVIEW-------- Yokogawa Electric Corporation has notified NCCIC/ICS\\-CERT of stack\\-based buffer overflow vulnerabilities in multiple Yokogawa products. Yokogawa has released product revisions that mitigate the vulnerabilities for many of the vulnerable products. These vulnerabilities could be exploited remotely.AFFECTED PRODUCTS----------------- The following Yokogawa products are affected:* CENTUM series:\t+ CENTUM CS 1000 (R3\\.08\\.70 or earlier),\t+ CENTUM CS 3000 (R3\\.09\\.50 or earlier),\t+ CENTUM CS 3000 Entry (R3\\.09\\.50 or earlier),\t+ CENTUM VP (R5\\.04\\.20 or earlier),\t+ CENTUM VP Entry (R5\\.04\\.20 or earlier),* ProSafe\\-RS (R3\\.02\\.10 or earlier),* Exaopc (R3\\.72\\.00 or earlier),* Exaquantum (R2\\.85\\.00 or earlier),* Exaquantum/Batch (R2\\.50\\.30 or earlier),* Exapilot (R3\\.96\\.10 or earlier),* Exaplog (R3\\.40\\.00 or earlier),* Exasmoc (R4\\.03\\.20 or earlier),* Exarqe (R4\\.03\\.20 or earlier),* Field Wireless Device OPC Server (R2\\.01\\.02 or earlier),* PRM (R3\\.12\\.00 or earlier),* STARDOM VDS (R7\\.30\\.01 or earlier),* STARDOM OPC Server for Windows (R3\\.40 or earlier),* FAST/TOOLS (R10\\.01 or earlier),* B/M9000CS (R5\\.05\\.01 or earlier),* B/M9000 VP (R7\\.03\\.04 or earlier), and* FieldMate (R1\\.01 or R1\\.02\\).IMPACT------ Successful exploitation of these vulnerabilities could result in a denial\\-of\\-service condition impacting network communications and allow arbitrary code execution. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.BACKGROUND---------- Yokogawa is based in Japan and maintains offices in several countries around the world, including the Americas, Europe, the Middle East, Africa, South Asia, and East Asia. The condensed descriptions of the affected products are provided as a quick reference.* The CENTUM series products are Windows\\-based control systems. According to Yokogawa, these products are deployed across several sectors, including Critical Manufacturing, Energy, Food and Agriculture, and others.* ProSafe\\-RS is an integrated distributed control system and safety instrumented system PLC for process industries.* Exaopc is an interface package that is OPC compliant.* Exaquantum is a plant information management system.* Exapilot is an online navigation tool that guides operators through plant operating procedures.* Exaplog is an event analysis package.* Exasmoc is a multivariable model predictive controller. This controller is widely used in oil and petrochemical plants.* Exarqe is a software package that provides product quality information. This controller is widely used in oil and petrochemical plants.* Field Wireless Device OPC Server provides field wireless gateway data to the OPC client via an OPC interface.* PRM is a plant asset management software tool.* STARDOM VDS stands for Versatile Data Server software, which is web\\-based HMI and SCADA software.* STARDOM is a network\\-based control system.* FAST/TOOLS is a software package that implements a web\\-based supervisory control HMI.* B/M9000CS and B/M9000 VP are quality control systems.* FieldMate is a device management tool. Yokogawa estimates that its products are used worldwide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### STACK\\-BASED BUFFER OVERFLOWCWE\\-121: Stack\\-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121\\.html, web site last accessed September 10, 2015\\. A specially crafted packet transmitted to the process that executes control over network communications can cause network communications to become unresponsive. CVE\\-2015\\-5626NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-5626, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Yokogawa has assigned a CVSS v2 base score of 10\\.0; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:C/I:C/A:C, web site last accessed September 10, 2015\\.### STACK\\-BASED BUFFER OVERFLOWCWE\\-121: Stack\\-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121\\.html, web site last accessed September 10, 2015\\. A specially crafted packet is transmitted to the process that executes control over network communications can cause the process that uses the communication function to become unavailable. CVE\\-2015\\-5627NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-5627, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Yokogawa has assigned a CVSS v2 base score of 10\\.0; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:C/I:C/A:C, web site last accessed September 10, 2015\\.### STACK\\-BASED BUFFER OVERFLOWCWE\\-121: Stack\\-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121\\.html, web site last accessed September 10, 2015\\. A specially crafted packet transmitted to the process that executes control over network communication may allow a remote attackers to execute arbitrary code. CVE\\-2015\\-5628NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-5628, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Yokogawa has assigned a CVSS v2 base score of 10\\.0; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:C/I:C/A:C, web site last accessed September 10, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY These vulnerabilities could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target these vulnerabilities.#### DIFFICULTY An attacker with low skill would be able to exploit these vulnerabilities.MITIGATION---------- Yokogawa has released product revisions for multiple affected products that remediate the identified vulnerabilities. Yokogawa’s Security Advisory Report, YSAR\\-15\\-0003 Vulnerabilities of Communication Functions in CENTUM, and other YOKOGAWA products are available at the following URL: http://www.yokogawa.com/dcs/security/ysar/dcs\\-ysar\\-index\\-en.htm For additional information about the vulnerabilities and to obtain Yokogawa’s product revisions, contact Yokogawa via its Security web site at: https://plus.yokogawa.co.jp/gw/gw.po?c\\-id\\=000498 Yokogawa offers the following recommendations to minimize the risk associated with these vulnerabilities by applying the actions: Apply properly configured firewall between the external network and control system network to prevent external communication with the affected devices. Prevent unapproved devices from being connected to the network where vulnerable products are connected. ICS\\-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should: Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet. Locate control system networks and remote devices behind firewalls, and isolate them from the business network. When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS\\-CERT web site (http://ics\\-cert.us\\-cert.gov/). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Yokogawa-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-253-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2015-5628",
    "CVE-2015-5626",
    "CVE-2015-5627"
  ],
  "techniques": [],
  "advisory": "icsa-15-253-01",
  "title": "Yokogawa Multiple Products Buffer Overflow Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "ca984103a1d34870d35ebed5a210c0171d0294efcb031cf9e5d969b08473ff6c"
}