{
  "markdown": " Beijer Electronics ADP and H\\-Designer Buffer Overflow Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryBeijer Electronics ADP and H\\-Designer Buffer Overflow Vulnerability==================================================================== Last Revised September 05, 2018 Alert Code ICSA\\-13\\-024\\-01Overview-------- This advisory provides details about a buffer overflow vulnerability in multiple Beijer Electronics ADP and H\\-designer products. Independent researcher Kuang\\-Chun Hung of Information and Communication Security Technology Center (ICST) has identified a buffer overflow vulnerability in Beijer ADP and H\\-Designer applications. This vulnerability can allow attackers to execute arbitrary code and gain unauthorized access. This vulnerability affects systems deployed in the critical manufacturing, food and agriculture, transportation, and energy sectors. Beijer has created a new version that corrects this vulnerability. Researcher Morgan Hung has tested this version to verify that it mitigates the reported problem.Affected Products----------------- The following Beijer products are affected:* ADP V6\\.5\\.0\\-180\\_R1967* ADP V6\\.5\\.1\\-186\\_R2942* H\\-Designer 6\\.5\\.0 B180\\_R1967Impact------ Successful exploitation of this vulnerability may allow an attacker the ability to execute arbitrary code and gain the privileges of the currently logged in user. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- Beijer is a Sweden\\-based industrial automation and data communications company that aintains offices in several countries around the world, including the US, UK, Germany, France, Taiwan, China and Brazil. ADP is a configuration tool used to create applications for operator terminals, and H\\-Designer is HMI configuration software. According to Beijer, their products are deployed across several sectors including critical manufacturing, food and agriculture, transportation, energy, and others.Vulnerability Characterization------------------------------Vulnerability Overview----------------------### Buffer Overflow An attacker can input a long string into a dll file used by ADP and H\\-Designer, which can cause a buffer overflow. This vulnerability could allow arbitrary code execution, which could affect the integrity of the system.Vulnerability Details---------------------#### Exploitability This vulnerability is not exploitable remotely and cannot be exploited without user interaction. The exploit is only triggered when a local user runs the vulnerable application and loads the malformed dll file.#### Existence of Report No known public exploits specifically target this vulnerability.#### Difficulty Crafting a working exploit for this vulnerability could be difficult.Mitigation---------- Beijer Electronics created Version 6\\.1\\.1 to address this vulnerability. The researcher who originally reported the vulnerability has tested the newest version and verified that it fixes the issue. Users can obtain the latest version by contacting their local distributor. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT Web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS\\-CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B—(UPDATE) Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT Web page ( [http://ics\\-cert.us\\-cert.gov](/ics)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Beijer Electronics-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-13-024-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-13-024-01",
  "title": "Beijer Electronics ADP and H-Designer Buffer Overflow Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "d6e64d66cfa866bf2eda8e5aae1cfea2e7252a4db21e01298361570e7be9732c"
}