{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: ARC Informatique\nEquipment: PcVue\nVulnerabilities: Cleartext Storage of Sensitive Information, Insertion of Sensitive Information into Log File\n\n2. UPDATE OR REPOSTED INFORMATION \nThis updated advisory is a follow-up to the original advisory titled ICSA-22-354-03 ARC Informatique PcVue that was published December 20, 2022 on the ICS webpage on cisa.gov/ICS. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthorized user to access the email account, SIM card, and other data sources associated with the affected device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of PcVue, a supervisory control and data acquisition (SCADA) monitoring and control software, are affected:\n\nPcVue Versions 15 through 15.2.2 (CVE-2022-4311 only)\n\n--------- Begin Update A part 1 of 2 ---------\n\nPcVue Versions 8.10 through 15.2.3 (CVE-2022-4312 only) \n\nPcVue 12 products are only affected until Version 12.0.28 \n\n\n\n--------- End Update A part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nA cleartext storage of sensitive information vulnerability exists in PcVue versions 8.10 through 15.2.3. This could allow an unauthorized user to access the email and short messaging service (SMS) accounts configuration files to discover the associated simple mail transfer protocol (SMTP) account credentials and the SIM card PIN code. Successful exploitation of this vulnerability could allow an unauthorized user access to the underlying email account and SIM card.\nCVE-2022-4312 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.2.2    INSERTION OF SENSITIVE INFORMATION INTO LOG FILE CWE-532\nAn insertion of sensitive information into log file vulnerability exists in PcVue versions 15 through 15.2.2. This could allow a user with access to the log files to discover connection strings of data sources configured for the DbConnect, which could include credentials. Successful exploitation of this vulnerability could allow other users unauthorized access to the underlying data sources.\nCVE-2022-4311 has been assigned to this vulnerability. A CVSS v3 base score of 4.7 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Transportation, Water and Wastewater, Energy, Critical Manufacturing, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n4.4 RESEARCHER\nARC Informatique reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A part 2 of 2 ---------\nARC Informatique has released a fix for CVE-2022-4312 for PcVue 12 in Version 12.0.28 and recommends users install the latest version of PcVue regardless of release. Users should contact their ARC Informatique representative to request the latest update files or submit a request via their web form. \n--------- End Update A part 2 of 2 ---------\nFor additional information and mitigation recommendations, see ARC Informatique’s security bulletins for these vulnerabilities (login required):\n\nCVE-2022-4311: SB2022-6\nCVE-2022-4312: SB2022-7\n\nARC Informatique recommends users take steps to harden system configurations. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\nExercise principles of least privilege.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2022-4311",
    "CVE-2022-4312"
  ],
  "techniques": [],
  "advisory": "icsa-22-354-03",
  "title": "ARC Informatique PcVue (Update A) | CISA",
  "source": "ics-advisories",
  "id": "78dd62d5c2f1d994cfd7b6f010d36ca58106e56feac5d39b94d25b8d31894a3d"
}