{
  "markdown": "\nOverview\nThis advisory provides mitigation details for a vulnerability that impacts the i-GEN opLYNX Central software. Exploitation of this vulnerability would allow partial leakage of information and access to system settings.\nIndependent researcher Anthony Cicalla has identified an authentication bypass vulnerability in i-GEN Solutions opLYNX Central application. i-GEN Solutions has produced a new version that mitigates this vulnerability. The researcher has tested the new version to validate that it resolves the vulnerability. This vulnerability impacts the energy sector, mainly in Canada.\nThis vulnerability could be exploited remotely.\nAffected Products\nThe following i-GEN products are affected:\n\nopLYNX, Version 2.01.8 and prior.\n\nImpact\nExploitation of this vulnerability could allow access to configuration settings and other information in the opLYNX Central application.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\ni-GEN Solutions Corporation is a Canada-based company that provides human-machine interface (HMI), supervisory control and data acquisition (SCADA), and plant historian software to oil and gas, pipelines, chemicals, utilities, and waste water management facilities around the world.\nThe affected product, opLYNX Central, is a Web-based application. According to i-GEN Solutions, opLYNX Central is deployed in the energy sector in Canada.\nVulnerability Characterization\nVulnerability Overview\nAuthentication BypassCWE-592: Authentication Bypass Issues, http://cwe.mitre.org/data/definitions/592 html, Web site last accessed December 27, 2012.\nThe i-GEN opLYNX Central system provides an interface for remote connections. Publicly available tools to disable Javascript can be used to bypass authentication on the opLYNX Central interface. This allows a user to access configuration settings and other information.\nCVE-2012-4688NVD, http://web.nvd nist.gov/view/vuln/detail?vulnId=CVE-2012-4688, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:P/I:P/A:P).\nVulnerability Details\nExploitability\nThis vulnerability could be exploited remotely.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a low skill would be able to exploit this vulnerability with publicly available tools.\nMitigation\ni-GEN Solutions has released a new version, opLYNX 2.01.9, that resolves this vulnerability. The new version is installed during logon and automatically applied. Anthony Cicalla has tested  the new version and validated that it resolves the vulnerability. To manually obtain the new version, ICS-CERT recommends customers contact i-GEN Solutions customer service.i-GEN’s customer service, http://www.i-gen.com, support@i-gen.com, Web site last accessed December, 27, 2012.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01—Cyber Intrusion Mitigation Strategies,\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2012-4688"
  ],
  "techniques": [],
  "advisory": "icsa-12-362-01",
  "title": "I-GEN opLYNX Central Authentication Bypass | CISA",
  "source": "ics-advisories",
  "id": "dd9ff5f91c4b0ce56712445c883c6bdc13c255df07b5f86f91021f7afb3b5174"
}