{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Exploitable remotely\nVendor: Rockwell Automation\nEquipment: Micro800, MicroLogix 1400\nVulnerability: Channel Accessible by Non-endpoint\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may result in denial-of-service conditions, which may require a firmware flash to recover.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following controllers are affected:\n\nMicro800: All versions\nMicroLogix 1400: Version 21 and later when Enhanced Password Security enabled\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CHANNEL ACCESSIBLE BY NON-ENDPOINT CWE-300\nWhen an authenticated password change request takes place, this vulnerability could allow the attacker to intercept the message that includes the legitimate, new password hash and replace it with an illegitimate hash. The user would no longer be able to authenticate to the controller causing a denial-of-service condition.\nCVE-2021-32926 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nHyunguk Yoo from The University of New Orleans, Adeen Ayub and Irfan Ahmed from Virginia Commonwealth University reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell recommends confirming that setting and updating the password for the controller is done within a trusted network environment.\nIf this vulnerability is successfully exploited, the password can be reset by performing a firmware flash on the controller. Firmware flashing will put the controller into the default state and the user program and data will be lost.\nA comprehensive defense-in-depth strategy can reduce the risk of this vulnerability. To leverage the vulnerability, an unauthorized user would require access to the same network as the controller. Users should confirm they are employing proper networking segmentation and security controls.\nUsers can refer to the Converged Plantwide Ethernet (CPwE) Design and Implementation Guide for best practices for deploying network segmentation and broader defense-in-depth strategies. Users can also refer to the Rockwell Automation System Security Design Guidelines on how to use Rockwell Automation products to improve the security of their industrial automation systems.\nFor more information see Rockwell Automation Security Advisory (login required).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-32926"
  ],
  "techniques": [],
  "advisory": "icsa-21-145-02",
  "title": "Rockwell Automation Micro800 and MicroLogix 1400 | CISA",
  "source": "ics-advisories",
  "id": "93330cf5c1f46bfd3cb61ec51854a332f327796b39967530924dcee3e4421cff"
}