{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: HEIDENHAIN\nEquipment: HEIDENHAIN TNC 640 controlling a HARTFORD 5A-65E CNC machine\nVulnerability: Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a loss of sensitive data, manipulation of information, and denial-of-service.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version HEIDENDAIN Controller TNC, a computer numerical control (CNC) controller, is affected:\n\nHEIDENHAIN Controller TNC 640: Version 340590 07 SP5 Running HEROS 5.08.3 controlling HARTFORD 5A-65E CNC machine\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe HEIDENHAIN Controller TNC 640, version 340590 07 SP5, running HEROS 5.08.3 controlling the HARTFORD 5A-65E CNC machine is vulnerable to improper authentication, which may allow an attacker to deny service to the production line, steal sensitive data from the production line, and alter any products created by the production line.\nCVE-2022-41648 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMarco Balduzzi of Trend Micro reported this vulnerability to CISA.\n4. MITIGATIONS\nHEIDENHAIN is working with HARTFORD Machinery of She Hong Industrial Co. Ltd. to develop mitigations. HEIDENHAIN also recommends that users do the following to reduce the risk of exploitation:\n\nBlock LSV2 and DNC communication by means of the integrated firewall in the controller’s HEROS operating system\nUse zone-firewalls to isolate and segment the network of the affected devices\nAsk your machinery vendor (running HEIDENHAIN controllers) for updates to a recent Software-Version, where SSH-tunneling is standard\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-41648"
  ],
  "techniques": [],
  "advisory": "icsa-22-298-02",
  "title": "HEIDENHAIN Controller TNC on HARTFORD Machine | CISA",
  "source": "ics-advisories",
  "id": "f344c6c0d4962055895149ed03ce3ddeb6d7f2ae0134b9dcff27c0d10af8f147"
}