{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: Low skill level to exploit\nVendor: Yokogawa\nEquipment: Exaopc, Exaplog, Exaquantum, Exasmoc, Exarqe, GA10, and InsightSuiteAE\nVulnerability: Unquoted Search Path or Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a local attacker to execute malicious files.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nYokogawa reports this vulnerability affects the following products:\n\nExaopc (R1.01.00 - R3.77.00)\nExaplog (R1.10.00 - R3.40.00)\nExaquantum (R1.10.00 - R3.02.00)\nExaquantum/Batch (R1.01.00 - R2.50.40)\nExasmoc (All Revisions)\nExarqe (All Revisions)\nGA10 (R1.01.01 - R3.05.01)\nInsightSuiteAE (R1.01.00 - R1.06.00)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nService paths in some Yokogawa applications are unquoted and contain spaces. This may allow a local attacker to execute malicious files by the service privilege.\nCVE-2019-6008 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nYokogawa reported this vulnerability to JPCERT and CISA.\n4. MITIGATIONS\nYokogawa has provided the following countermeasures for this vulnerability in each of the affected products:\n\nExaopc R1.01.00 – R3.77.00: Update to the latest revision (R3.78.00)\nExaplog:\nR1.10.00 - R3.30.00: Update to the latest revision (R3.40.00) and apply patch software for R3.40.06\nR3.40.00: Apply patch software for R3.40.06\nExaquantum R1.10.00 - R3.02.00: Update to the latest revision (R3.15.00)\nExaquantum/Batch R1.01.00 - R2.50.40: Update to the latest revision (R3.10.00\nExasmoc:  Support will end for all revisions of Exasmoc on Sep 30, 2019. Consider migrating to Platform for Advanced Control and Estimation which is the successor to Exasmoc\nExarqe:  Support will end for all revisions of Exarqe on Sep 30, 2019. Consider migrating to Platform for Advanced Control and Estimation which is the successor to Exarqe\nGA10 R1.01.01 - R3.05.01: Update to the latest revision (R3.05.06)\nInsightSuiteAE R1.01.00 - R1.06.00: Update to the latest revision (R1.07.00)\n\nYokogawa states patching is the best protection against this vulnerability. If it is not possible to patch, please consult with specialists at Yokogawa on the next best course of action.\nYokogawa recommends all users have a security program consisting of patch updates, anti-virus, backup and recovery, zoning, hardening, whitelisting, firewall, etc. Yokogawa can assist in setting up the security program and can perform security risk\nassessments.\nFor more information about this vulnerability and the associated mitigations, please see Yokogawa’s security advisory report YSAR-19-0003.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-6008"
  ],
  "techniques": [],
  "advisory": "icsa-19-274-02",
  "title": "Yokogawa Products | CISA",
  "source": "ics-advisories",
  "id": "c7da49e9cd7e967777839e7a0c9af06e4ef3d0995afc9cf7bce0e5005c295b54"
}