{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Exploitable with adjacent access/low attack complexity\nVendor: ETIC Telecom\nEquipment: Remote Access Server (RAS)\nVulnerability: Insecure Default Initialization of Resource\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to reconfigure the device or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ETIC Telecom RAS are affected: \n\nETIC Telecom RAS: All versions 4.7.0 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INSECURE DEFAULT INITIALIZATION OF RESOURCE CWE-1188 \nETIC Telecom RAS versions 4.7.0 and prior the web management portal authentication disabled by default. This could allow an attacker with adjacent network access to alter the configuration of the device or cause a denial-of-service condition.\nCVE-2023-3453 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nHaviv Vaizman, Hay Mizrachi, Alik Koldobsky, Ofir Manzur, and Nikolay Sokolik of OTORIO reported these vulnerabilities to CISA.\n4. MITIGATIONS\nETIC Telecom recommends updating the affected devices’ firmware to the following versions:\n\nETIC Telecom RAS: version 4.9.0 or later\n\nETIC Telecom recommends enabling the authentication mechanism on the administration interface. This can be done on the page “> Setup > Security > Administration right” by creating an administrator on the “List of administrators” table, enabling the parameter “Password protect the configuration interface,” then setting the parameter “Protocols to use for configuration” to “HTTPs only”.\nNOTE: for firmware versions 4.9.0 or later, enabling the administration protection is mandatory after the first product start.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2023-3453"
  ],
  "techniques": [],
  "advisory": "icsa-23-208-01",
  "title": "ETIC Telecom RAS Authentication | CISA",
  "source": "ics-advisories",
  "id": "9a18e648c3cda70b30d306b3cf961e5e0d335e7d8b473b2c847aef7cdcec443d"
}