{
  "markdown": "\nCVSS v3 8.6\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Ctek, Inc.\nEquipment: SkyRouter\nVulnerability: Improper Authentication\nAFFECTED PRODUCTS\nThe following versions of SkyRouter, a wireless and automation solution, are affected:\n\nSkyRouter Series 4200 and 4400 all versions prior to V6.00.11\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an unauthorized user to view and edit settings without authenticating.\nMITIGATION\nCtek, Inc., reports they have addressed this issue and addressed additional security requirements in their latest security release V6.00.11, which is now available on all models currently in production. These models are identified as Z4500, Z4550, and Z4400. The update can be obtained via the wireless device’s Tool and Utilities Section, which provides an Over-The-Air Firmware update mechanism. Ctek, Inc., reports that due to industry demand, wireless carriers are rapidly eliminating 2G and 3G CDMA service and they will not be creating any additional update releases for those products.\nCtek, Inc., reports they are now selling a 4G version of the SkyRouter which they confirm the latest firmware release in this product does address the issues that were reported in the 3G device. They no longer sell the 2G/3G version of the SkyRouter on which the vulnerability was originally reported.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability.\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nBy accessing a specific uniform resource locator (URL) on the web server, a malicious user is able to access the application without authenticating.\nCVE-2017-14000 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\nRESEARCHER\nMaxim Rupp reported the vulnerability to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Communications, Food and Agriculture, Transportation Systems, and Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: San Pedro, California\n",
  "cves": [
    "CVE-2017-14000"
  ],
  "techniques": [],
  "advisory": "icsa-17-264-02",
  "title": "Ctek, Inc. SkyRouter | CISA",
  "source": "ics-advisories",
  "id": "8409e1ab5ce8411bc24c0288da1ec204a1914cc9dfba5d830bef4db572b45297"
}