{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: FactoryTalk Linx and FactoryTalk Services Platform\nVulnerabilities: Classic Buffer overflow, Improper Check or Handling of Exceptional Conditions\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may result in denial-of-service conditions.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports these vulnerabilities affect the following products:\n\nFactoryTalk Linx software: Versions 6.20 and prior (CVE-2020-5806 only affects Versions 6.10, 6.11, and 6.20)\nFactoryTalkServices Platform: Versions 6.20 and prior (Only affected by CVE-2020-5807)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER CHECK OR HANDLING OF EXCEPTIONAL CONDITIONS CWE-703\nUnhandled exception vulnerabilities exist within a .dll in FactoryTalk Linx. These vulnerabilities could allow a remote, unauthenticated attacker to send a malicious packet resulting in the termination of RSLinxNG.exe, causing a denial-of-service condition.\nCVE-2020-5801 and CVE-2020-5802 have been assigned to these vulnerabilities. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT CWE-120\nA buffer overflow vulnerability exists within a .dll in FactoryTalk Linx. This vulnerability could allow a local, unauthenticated attacker to send a malicious packet resulting in the termination of RSLinxNG.exe, causing a denial-of-service condition.\nCVE-2020-5806 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT CWE-120\nA buffer overflow vulnerability exists within a .dll in FactoryTalk Services Platform. This vulnerability could be exploited via a phishing attack where an attacker sends a specially crafted log file to a local user. When the malicious log file is opened by a local user, it can cause a buffer overflow in the FactoryTalk Services Platform resulting in temporary denial-of-service conditions. Users can recover from the condition by reopening the impacted software.\nCVE-2020-5806 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nTenable reported these vulnerabilities to Rockwell Automation.\n4. MITIGATIONS\nRockwell Automation published PN1540 to inform users of the risk of these vulnerabilities and instruct users on the proper use of patches.\nRockwell Automation recommends the following network-based vulnerability mitigations for embedded products:\n\nUtilize proper network infrastructure controls, such as firewalls, to help ensure traffic from unauthorized sources is blocked.\nConsult the product documentation for specific features, such as a hardware keyswitch setting, which may be used to block unauthorized changes, etc.\nBlock all traffic to EtherNet/IP or other CIP protocol-based devices from outside the manufacturing zone by blocking or restricting access to TCP and UDP Port 2222 and Port 44818 using proper network infrastructure controls, such as firewalls, UTM devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation products, see Knowledgebase Article ID BF7490.\n\nRockwell Automation recommends the following software/PC-based mitigation strategies:\n\nRun all software as a User, not as an Administrator, to minimize the impact of malicious code on the infected system.\nUse Microsoft AppLocker or other similar allow list applications to help mitigate risk. Information on using AppLocker with Rockwell Automation products is available at Knowledgebase Article ID QA17329.\nConfirm the least-privilege user principle is followed and the user/service account access to shared resources (such as a database) is only granted with a minimum number of rights as needed.\n\nRockwell Automation recommends the following social engineering mitigation strategies:\n\nDo not open untrusted .ftd files with FactoryTalk Services Platform.\nDo not click on or open URL links from untrusted sources.\nEmploy training and awareness programs to educate users on the warning signs of a phishing or social engineering attack.\n\nRockwell Automation recommends the following general mitigations:\n\nUse trusted software, software patches, antivirus/antimalware programs and interact only with trusted websites and attachments.\nMinimize network exposure for all control system devices and/or systems and ensure they are not accessible from the Internet. For further information about the risks of unprotected Internet accessible control systems, please see Knowledgebase Article ID PN715.\nLocate control system networks and devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), and recognize VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize a VPN is only as secure as the connected devices.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-5802",
    "CVE-2020-5801",
    "CVE-2020-5806",
    "CVE-2020-5807"
  ],
  "techniques": [],
  "advisory": "icsa-21-028-01",
  "title": "Rockwell Automation FactoryTalk Linx and FactoryTalk Services Platform | CISA",
  "source": "ics-advisories",
  "id": "f7d9fd6f31e1bc3bfe8163617c6361a02f6d6fb03fdc51340b309c19a3e18864"
}