{
  "markdown": "\nOVERVIEW\nHoneywell reported a denial-of-service condition caused by an improper input validation vulnerability in Honeywell’s Experion Process Knowledge System (PKS) platform. Honeywell has produced patches to mitigate this vulnerability.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Experion PKS versions are affected:\n\nExperion PKS, Release 3xx and prior,\nExperion PKS, Release 400,\nExperion PKS, Release 410,\nExperion PKS, Release 430, and\nExperion PKS, Release 431\n\nIMPACT\nSuccessful exploitation of the vulnerability would prevent the Experion PKS client tools from uploading firmware to Series-C devices.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nHoneywell is a US-based company that maintains offices worldwide.\nThe affected product, Experion PKS, is a client tool used to configure firmware in Series-C devices. According to Honeywell, Experion PKS is deployed across several sectors including Commercial Facilities, Critical Manufacturing, Energy, Water and Wastewater Systems, and others. Honeywell estimates that this product is used primarily in the United States and Europe with a small percentage in Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATIONCWE-20: Improper Input Validation, https://cwe.mitre.org/data/definitions/20.html, web site last accessed October 27, 2016.\n\nExperion PKS does not properly validate input. By sending a specially crafted packet, an attacker could cause the process to terminate. A successful exploit would prevent firmware uploads to the Series-C devices.\nCVE-2016-8344NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8344, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L, web site last accessed October 27, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a medium skill would be able to exploit this vulnerability.\nMITIGATION\nHoneywell recommends that Experion users download and apply the appropriate patch to protect themselves from this vulnerability.\nHoneywell’s software downloads to resolve the vulnerabilities include the following:\n\nR400.8 HOTFIX1,\nR410.8 HOTFIX6,\nR430.5 HOTFIX1, and\nR431.2 HOTFIX2\n\nIn the event that a patch is not yet available for a current Experion release, Honeywell recommends users either isolate the network traffic when using the client tools (eNAP Server service) or turn the eNAP Server service off when not uploading new firmware until a patch is available.\nUsers can contact Honeywell technical support for registration and installation instructions for these patches at the following URLs:\nhttps://www.honeywellprocess.com/en-US/support/pages/request-support.aspx\nhttps://www.honeywellprocess.com/en-US/contact-us/pages/default.aspx\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-8344"
  ],
  "techniques": [],
  "advisory": "icsa-16-301-01",
  "title": "Honeywell Experion PKS Improper Input Validation Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "0150f5a3a9ce41e85ece78c31838d05eadd625ebb54d41e21434dea0293a9a5c"
}