{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.6\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: PEPPERL+FUCHS\nEquipment: CT50-Ex\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a malicious third-party application to gain elevated privileges and obtain access to sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the CT50-Ex ecom mobile computer, are affected:\n\nCT50-Ex running Android OS v4.4 and v6.0, the original manufacturer was Honeywell.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nA skilled attacker with advanced knowledge of the target system could exploit this vulnerability by creating an application that would bind to the service and gain elevated system privileges. This could enable the attacker to obtain access to keystrokes, passwords, personally identifiable information, photos, emails, or business-critical documents.\nCVE-2018-14825 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Critical Manufacturing, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nPEPPERL+FUCHS reported this vulnerability to CERT@VDE, which reported this vulnerability to NCCIC.\n4. MITIGATIONS\nAn update is available that resolves this vulnerability. All users of the affected products should update products as follows: if using Android v6.0, update to CommonES 4.01.00.4134 or later. Update ECP to Version 2.30.00.0167 or later (if applicable). If using Android 4.4, update to CommonES 3.17.3445 or later. Additionally, according to PEPPERL+FUCHS, only the products mentioned herein are affected by this vulnerability. Updates are available via the PEPPERL+FUCHS ecom product support channel or directly from the original manufacturer Honeywell at:\nhttps://hsmftp.honeywell.com\nFor more information CERT @ VDE has released a security advisory found at:\nhttps://cert.vde.com/de-de/advisories/vde-2018-016\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability.  Specifically, users should:\n\nKeep mobile device software fully updated where application and system updates are available.\nOnly obtain updates and applications from known trusted sources.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\nDisable unnecessary and unutilized services such as Wi-Fi and Bluetooth if not in use.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-14825"
  ],
  "techniques": [],
  "advisory": "icsa-18-303-01",
  "title": "PEPPERL+FUCHS CT50-Ex | CISA",
  "source": "ics-advisories",
  "id": "67c54138823dd84e825f3f0b20430431c209d926a61b7ad211cc9fac7a8af905"
}