{
  "markdown": "\nCVSS v3 8.3\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Automated Logic Corporation (ALC)\nEquipment: WebCTRL, i-VU, SiteScan\nVulnerabilities: Unquoted Search Path or Element; Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal'); Unrestricted Upload of File with Dangerous Type\nAFFECTED PRODUCTS\nThe following versions of WebCTRL, i-Vu, SiteScan Web, building automation platforms, are affected:\n\nALC WebCTRL, i-Vu, SiteScan Web 6.5 and prior,\nALC WebCTRL, SiteScan Web 6.1 and prior,\nALC WebCTRL, i-Vu 6.0 and prior,\nALC WebCTRL, i-Vu, SiteScan Web 5.5  and prior, and\nALC WebCTRL, i-Vu, SiteScan Web 5.2 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an authenticated user to elevate his or her privileges to execute arbitrary code on the system.\nMITIGATION\nALC provides support for WebCTRL, i-Vu, SiteScan Web versions 6.0 and greater. Those users using prior versions, including 5.5 and 5.2, must upgrade to supported versions in order to install these mitigation patches.\nALC applications should always be installed and maintained in accordance with the guidelines found here:\nhttp://www.automatedlogic.com/Pages/Security.aspx.\nIn addition ALC has released the following patches, which address these vulnerabilities:\n\nWebCTRL 6.0, Cumulative Patch #13\nWebCTRL 6.1, Cumulative Patch  #7\nWebCTRL 6.5, Cumulative Patch #7 + WS65_Security_Update2.update\n\nThese patch releases may be obtained on the ALC accounts web site or calling Technical Support at 770-429-3002\n\ni-Vu 6.0, Cumulative Patch #13\ni-Vu 6.5, Cumulative Patch #7 + WS65_Security_Update2.update\n\nThe patch release may be obtained by calling Technical Support at 800-277-9852\n\nSiteScan Web Version 6.1, Cumulative Patch  #7, and\nSiteScan Web Version 6.5, Cumulative Patch #7 + WS65_Security_Update2.update.\n\nThese patches may be obtained by contacting Liebert Services at 1-800-543-2378.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nUNQUOTED SEARCH PATH OR ELEMENT CWE-428\n\nAn unquoted search path vulnerability may allow a non-privileged local attacker to change files in the installation directory and execute arbitrary code with elevated privileges.\nCVE-2017-9644 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:L/UI:R/S:U/C:L/I:L/A:L).\n\nIMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\n\nAn authenticated attacker may be able to overwrite files that are used to execute code. This vulnerability does not affect version 6.5 of the software.\nCVE-2017-9640 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n\nUNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\n\nAn authenticated attacker may be able to upload a malicious file allowing the execution of arbitrary code.\nCVE-2017-9650 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:N).\nRESEARCHER\nGjoko Krstic from Zero Science Lab identified the vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Kennesaw, Georgia\n",
  "cves": [
    "CVE-2017-9650",
    "CVE-2017-9644",
    "CVE-2017-9640"
  ],
  "techniques": [],
  "advisory": "icsa-17-234-01",
  "title": "Automated Logic Corporation WebCTRL, i-VU, SiteScan | CISA",
  "source": "ics-advisories",
  "id": "2a0621ba8b6c11352a4b71d34b6be1c6b4e0ed34a76a4d6fb98adb080ca7c3dc"
}