{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: PXC and DXR Devices\nVulnerabilities: Special Element Injection, Uncontrolled Resource Consumption, Use of Password Hash with Insufficient Computational Effort, Insufficient Session Expiration, Observable Discrepancy, Improper Restriction of Excessive Authentication Attempts, Sensitive Cookie in HTTPS Session Without ‘Secure’ Attribute, Uncaught Exception\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-132-10 Siemens SIMATIC WinCC (Update A) that was published May 12, 2022, to the ICS webpage at cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to potentially intercept unencrypted transmission of sensitive information, cause a denial-of-service condition, perform remote code execution, or disable and reset a device to factory state.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following Desigo DXR and PXC controllers:\n•    Desigo DXR2: All versions prior to v01.21.142.5-22\n•    Desigo PXC3: All versions prior to v01.21.142.4-18\n•    Desigo PXC4: All versions prior to v02.20.142.10-10884\n•    Desigo PXC5: All versions prior to v02.20.142.10-10884\n4.2 VULNERABILITY OVERVIEW\n4.2.1    FAILURE TO SANITIZE SPECIAL ELEMENTS INTO A DIFFERENT PLANE (SPECIAL ELEMENT INJECTION) CWE-75\nThe “addCell” JavaScript function fails to properly sanitize user-controllable input before including it into the generated XML body of the XLS report document as it is possible to inject arbitrary content (e.g., XML tags) into the generated file. An attacker with restricted privileges could corrupt the content used to generate XLS reports to leverage the application to deliver malicious files against higher-privileged users and obtain remote code execution (RCE) against the administrator’s workstation.\nCVE-2022-24039 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H).\n4.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe web application fails to enforce an upper bound to the cost factor of the PBKDF2 derived key during the creation or update of an account. An attacker with the user profile access privilege could cause a denial-of-service condition through CPU consumption by setting a PBKDF2 derived key with a high-cost effort, followed by a login attempt to the modified account.\nCVE-2022-24040 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n4.2.3    USE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORT CWE-916\nThe web application stores the PBKDF2 derived key of user’s passwords with a low iteration count. An attacker with user profile access privilege can retrieve the stored password hashes of other accounts and then successfully perform an offline cracking attack and recover the plaintext passwords of other users.\nCVE-2022-24041 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.2.4    INSUFFICIENT SESSION EXPIRATION CWE-613\nThe web application returns an AuthToken that does not expire at the defined auto logoff delay timeout. An attacker could capture this token and re-use old session credentials or session IDs for authorization.\nCVE-2022-24042 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.2.5    OBSERVABLE DISCREPANCY CWE-203\nThe login functionality of the application fails to normalize the response times of login attempts performed with wrong usernames with the ones executed with correct usernames. A remote unauthenticated attacker could exploit this side-channel information to perform a username enumeration attack and identify valid usernames.\nCVE-2022-24043 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.6    IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\nThe login functionality of the application does not employ countermeasures against password spraying attacks or credential stuffing attacks. An attacker could obtain a list of valid usernames on the device and use that list to perform a precise password spraying or credential stuffing attack to obtain access to at least one account.\nCVE-2022-24044 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.7    SENSITIVE COOKIE IN HTTPS SESSION WITHOUT ‘SECURE’ ATTRIBUTE CWE-614\nFollowing a successful login, the application sets the session cookie on the browser via client-side JavaScript code without applying security attributes (such as “Secure” “HttpOnly” or “SameSite”). Any attempts to browse the application via unencrypted HTTP protocol would lead to the transmission of all session cookies in plaintext through the network. An attacker could then sniff the network and capture sensitive information.\nCVE-2022-24045 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.2.8    UNCAUGHT EXCEPTION CWE-248\nWhen the controller receives a specific BACnet protocol packet, an exception causes the BACnet communication function to go into a “out of work” state and could result in the controller going into a “factory reset” state.\nCVE-2021-41545 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nAndrea Palanca, of Nozomi Networks, reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends updating to the latest software version:\n--------- Begin Update A Part 1 of 1 ---------\n\nDesigo DXR2: Update to v01.21.142.5-22 or later \nDesigo PXC3: Update to v01.21.142.4-18 or later \nDesigo PXC4: Update to v02.20.142.10-10884 or later \nDesigo PXC5: Update to v02.20.142.10-10884 or later \n\n--------- End Update A Part 1 of 1 ---------\nContact Siemens for update information.\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-626968\nFor additional information, please refer to Siemens Security Advisory SSA-662649\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-24042",
    "CVE-2022-24039",
    "CVE-2022-24040",
    "CVE-2022-24041",
    "CVE-2022-24043",
    "CVE-2022-24045",
    "CVE-2022-24044",
    "CVE-2021-41545"
  ],
  "techniques": [],
  "advisory": "icsa-22-132-10",
  "title": "Siemens Desigo PXC and DXR Devices (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c9804009b28b6d39c86bb06cc4c33efde2cc3575eb7eea2080817493a4ccf414"
}