{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Open Design Alliance\nEquipment: Drawings SDK\n\n--------- Begin Update A Part 1 of 3 ---------\n\nVulnerabilities: Stack-based Buffer Overflow, Type Confusion, Untrusted Pointer Dereference, Incorrect Type Conversion or Cast, Memory Allocation with Excessive Size Value, Out of Bounds Write\n\n--------- End Update A Part 1 of 3 ---------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-047-01 Open Design Alliance Drawings SDK that was published February 16, 2021, to the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow code execution in the context of the current process or cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Drawings SDK, a software development kit for DWG and DGN, are affected:\n--------- Begin Update A Part 2 of 3 ---------\n\nDrawings SDK: All versions prior to 2021.6 on all supported by ODA platforms in static configuration. Note: CVE-2021-31784 only affects this version.\n\n--------- End Update A Part 2 of 3 ---------\n\nDrawings SDK: All versions prior to 2021.12 (Version 2021.11 is only affected by CVE-2021-25174 and CVE-2021-25173)\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow while processing malformed DXF and DWG files. This could allow an attacker to execute code or cause a denial-of-service condition.\nCVE-2021-25178 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nA type confusion issue exists when rendering malformed DXF and DWG files. This could allow an attacker to execute code or cause a denial-of-service condition.\nCVE-2021-25177 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.3    UNTRUSTED POINTER DEREFERENCE CWE-822\nA NULL pointer dereference exists when rendering malformed DXF and DWG files. This could allow an attacker to execute code or cause a denial-of-service condition.\nCVE-2021-25176 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.4    INCORRECT TYPE CONVERSION OR CAST CWE-704\nA type conversion issue exists when rendering malformed DXF and DWG files. This could allow an attacker to execute code or cause a denial-of-service condition.\nCVE-2021-25175 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.5    MEMORY ALLOCATION WITH EXCESSIVE SIZE VALUE CWE-789\nA memory corruption issue exists when reading malformed DGN files. This could allow an attacker to execute code or cause a denial-of-service condition.\nCVE-2021-25174 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.6    MEMORY ALLOCATION WITH EXCESSIVE SIZE VALUE CWE-789\nA memory allocation with excessive size issue exists when reading malformed DGN files. This could allow an attacker to execute code or cause a denial-of-service condition.\nCVE-2021-25173 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- Begin Update A Part 3 of 3 ---------\n4.2.7    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds write issue exists in the file-reading procedure Drawings SDK before 2021.6 on all supported by ODA platforms in static configuration. This could allow an attacker to execute code or cause a denial-of-service condition.\nCVE-2021-31784 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- End Update A Part 3 of 3 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nMichael DePlante (@izobashi) and rgod, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA. Siemens ProductCERT assisted coordination with Open Design Alliance.\n5. MITIGATIONS\nOpen Design Alliance recommends updating to v2021.12 or later. Instructions for ODA members can be found here (Login Required).\nFor more information refer to Open Design Alliance’s Security Advisories.\nFor more information on products dependent on the affected Drawings SDK see the following vendor security advisories:\n\nSiemens: SSA-663999\n\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nOnly use project files from trusted sources.\nEnsure the least-privilege user principle is followed.\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-31784",
    "CVE-2021-25176",
    "CVE-2021-25177",
    "CVE-2021-25175",
    "CVE-2021-25178",
    "CVE-2021-25173",
    "CVE-2021-25174"
  ],
  "techniques": [],
  "advisory": "icsa-21-047-01",
  "title": "Open Design Alliance Drawings SDK (Update A) | CISA",
  "source": "ics-advisories",
  "id": "93646348c1369dadae832269028f0369075960ab2b73dbe8e38a3ca6a3a04060"
}