{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 4.3\n\nATTENTION: Exploitable on an adjacent network/low skill level to exploit\nVendor: Johnson Controls\nEquipment: Metasys and BCPro\nVulnerability: Information Exposure Through an Error Message\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain technical information about the Metasys or BCPro server, allowing an attacker to target a system for attack.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports that the vulnerability affects the following products:\n\nMetasys System, Versions 8.0 and prior, and\nBCPro (BCM), all versions prior to 3.0.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INFORMATION EXPOSURE THROUGH AN ERROR MESSAGE CWE-209\nThis vulnerability results from improper error handling in HTTP-based communications with the server, which could allow an attacker to obtain technical information.\nCVE-2018-10624 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Milwaukee, Wisconsin\n\n3.4 RESEARCHER\nDan Regalado of Zingbox reported this vulnerability to NCCIC.\n4. MITIGATIONS\nJohnson Controls recommends the following mitigations:\n\nThis issue was remediated in Metasys v8.1 (April, 2016). Users should upgrade to the latest product version (9.0). For Metasys information, contact your Metasys field service/sales representative.\nThis issue was remediated in the BCPro Workstation in BCPro v3.0 (October, 2017) and mitigated for the BACnet Router and Gateway in BCPro v3.0.2 (June, 2018). Users should upgrade to the latest product versions. For more BCPro information, contact your BCPro sales and support representative.\n\nAdditional information for Johnson Controls:\n\nProduct security contact information, Building Automation System hardening, and security resources are located at our product security website http://www.johnsoncontrols.com/buildings/specialty-pages/product-security\nContact information: Johnson Controls Global Product Security at productsecurity@jci.com\n\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-10624"
  ],
  "techniques": [],
  "advisory": "icsa-18-212-02",
  "title": "Johnson Controls Metasys and BCPro | CISA",
  "source": "ics-advisories",
  "id": "7449e8db00ba147f097206913c015917979ff261fa21956f05d9b8f73c268d9f"
}