{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.0\nVendor: LCDS - Leão Consultoria e Desenvolvimento de Sistemas LTDA ME\nEquipment: LAquis SCADA\nVulnerability: Improper Check or Handling of Exceptional Conditions\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the device an attacker is accessing to crash, resulting in a structured exception handler overflow condition, which may allow code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LAquis SCADA, an industrial automation software, are affected:\n\nLAquis SCADA software versions 4.1.0.3391 and prior.\n\n3.2 VULNERABILITY\n3.2.1 IMPROPER CHECK OR HANDLING OF EXCEPTIONAL CONDITIONS CWE-703\nA structured exception handler overflow vulnerability has been identified that may allow code execution.\nCVE-2018-5463 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Chemical, Commercial Facilities, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCountries/Areas Deployed: South America\nCompany Headquarters Location: Joinville-SC, Brazil\n\n3.4 RESEARCHER\nKarn Ganeshen reported the vulnerability to NCCIC.\n4. MITIGATIONS\nLCDS recommends that users update to version 4.1.0.3774, which can be found at the following location:\nhttp://laquisscada.com/instale1.php\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-5463"
  ],
  "techniques": [],
  "advisory": "icsa-18-095-03",
  "title": "LCDS - Leão Consultoria e Desenvolvimento de Sistemas Ltda ME LAquis SCADA | CISA",
  "source": "ics-advisories",
  "id": "e3fe4faaf492f5f5c27a04b27498cd971e9a0bf04ca547227f2aaa9267de72a4"
}