{
  "markdown": "\nOVERVIEW\nZhou Yu working with Trend Micro’s Zero Day Initiative and Gu Ziqiang from Huawei Weiran Labs have identified vulnerabilities in Moxa’s SoftCMS Webserver Application. Moxa has produced an update to mitigate these vulnerabilities. Both researchers have tested the update to validate that it resolves these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nMoxa reports that the vulnerabilities affect the following versions of SoftCMS:\n\nSoftCMS versions prior to Version 1.6\n\nIMPACT\nA successful exploit could allow an attacker to execute arbitrary commands on the target system, as well as gain access to administrative functions of the application.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nMoxa is a Taiwan-based company that maintains offices in several countries around the world, including the US, UK, India, Germany, France, China, Russia, and Brazil.\nThe affected product, SoftCMS, is a central management software that manages large scale surveillance systems. According to Moxa, SoftCMS is deployed across several sectors including Commercial Facilities, Critical Manufacturing, Energy, and Transportation Systems. Moxa estimates that this product is used primarily in the United States and Europe with a small percentage in Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATIONCWE-20: Improper Input Validation, https://cwe.mitre.org/data/definitions/20.html, web site last accessed November 17, 2016.\n\nMoxa SoftCMS Webserver does not properly validate input. An attacker could provide unexpected values and cause the program to crash or excessive consumption of resources could result in a denial-of-service condition.\nCVE-2016-9332NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9332, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H, web site last accessed November 17, 2016.\n\nDOUBLE FREECWE-415: Double Free, https://cwe.mitre.org/data/definitions/415.html, web site last accessed November 17, 2016.\n\nA specially crafted URL request sent to the SoftCMS ASP Webserver can cause a double free condition on the server allowing an attacker to modify memory locations and possibly cause a denial of service or the execution of arbitrary code.\nCVE-2016-8360NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8360, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed November 17, 2016.\n\nSQL INJECTIONCWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection'), http://cwe.mitre.org/data/definitions/89.html, web site last accessed November 17, 2016.\n\nThe SoftCMS Application does not properly sanitize input that may allow a remote attacker access to SoftCMS with administrator’s privilege through specially crafted input.\nCVE-2016-9333NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9333, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed November 17, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nMoxa’s suggested mitigation is to update the application (SoftCMS v1.6), which is available for download from Moxa’s web site at the following link:\nhttp://www.moxa.com/support/download.aspx?type=support&id=11362\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-8360",
    "CVE-2016-9333",
    "CVE-2016-9332"
  ],
  "techniques": [],
  "advisory": "icsa-16-322-02",
  "title": "Moxa SoftCMS Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "962fbfb5fec41f2f2df6d54357d65f266f3dc6289d2db3163c9ec6bb73ae7829"
}