{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). View CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE W700 devices\nVulnerabilities: Improper Control of a Resource Through its Lifetime, Acceptance of Extraneous Untrusted Data With Trusted Data, Use of Hard-coded Cryptographic Key, Use of Weak Hash, Injection, Unsynchronized Access to Shared Data in a Multithreaded Context, OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an authenticated attacker to execute arbitrary code, extract configuration information, or execute system-level commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products of Siemens, are affected:\n\nSiemens SCALANCE WAM763-1 (6GK5763-1AL00-7DA0): All Versions\nSiemens SCALANCE WAM763-1 (ME) (6GK5763-1AL00-7DC0): All Versions\nSiemens SCALANCE WAM763-1 (US) (6GK5763-1AL00-7DB0): All Versions\nSiemens SCALANCE WAM766-1 (EU) (6GK5766-1GE00-7DA0): All Versions\nSiemens SCALANCE WAM766-1 (ME) (6GK5766-1GE00-7DC0): All Versions\nSiemens SCALANCE WAM766-1 (US) (6GK5766-1GE00-7DB0): All Versions\nSiemens SCALANCE WAM766-1 EEC (EU) (6GK5766-1GE00-7TA0): All Versions\nSiemens SCALANCE WAM766-1 EEC (ME) (6GK5766-1GE00-7TC0): All Versions\nSiemens SCALANCE WAM766-1 EEC (US) (6GK5766-1GE00-7TB0): All Versions\nSiemens SCALANCE WUM763-1 (6GK5763-1AL00-3AA0): All Versions\nSiemens SCALANCE WUM763-1 (6GK5763-1AL00-3DA0): All Versions\nSiemens SCALANCE WUM763-1 (US) (6GK5763-1AL00-3AB0): All Versions\nSiemens SCALANCE WUM763-1 (US) (6GK5763-1AL00-3DB0): All Versions\nSiemens SCALANCE WUM766-1 (EU) (6GK5766-1GE00-3DA0): All Versions\nSiemens SCALANCE WUM766-1 (ME) (6GK5766-1GE00-3DC0): All Versions\nSiemens SCALANCE WUM766-1 (US) (6GK5766-1GE00-3DB0): All Versions\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER CONTROL OF A RESOURCE THROUGH ITS LIFETIME CWE-664\nAffected devices do not properly process CLI commands after a user forcefully quit the SSH connection. This could allow an authenticated attacker to make the CLI via SSH or serial interface unresponsive.\nCVE-2022-46144 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.2 ACCEPTANCE OF EXTRANEOUS UNTRUSTED DATA WITH TRUSTED DATA CWE-349\nAffected products do not properly validate the content of uploaded X509 certificates which could allow an attacker with administrative privileges to execute arbitrary code on the device.\nCVE-2023-44317 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.2.3 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nAffected devices use a hard-coded key to obfuscate the configuration backup that an administrator can export from the device. This could allow an authenticated attacker with administrative privileges or an attacker that obtains a configuration backup to extract configuration information from the exported file.\nCVE-2023-44318 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been assigned; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n3.2.4 USE OF WEAK HASH CWE-328\nAffected devices use a weak checksum algorithm to protect the configuration backup that an administrator can export from the device. This could allow an authenticated attacker with administrative privileges or an attacker that tricks a legitimate administrator to upload a modified configuration file to change the configuration of an affected device.\nCVE-2023-44319 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been assigned; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:N).\n3.2.5 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS IN OUTPUT USED BY A DOWNSTREAM COMPONENT ('INJECTION') CWE-74\nAffected devices do not properly sanitize an input field. This could allow an authenticated remote attacker with administrative privileges to inject code or spawn a system root shell. Follow-up of CVE-2022-36323.\nCVE-2023-44373 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).\n3.2.6 UNSYNCHRONIZED ACCESS TO SHARED DATA IN A MULTITHREADED CONTEXT CWE-567\nAffected devices allow to change the password, but insufficiently check which password is to be changed. With this an authenticated attacker could, under certain conditions, be able to change the password of another, potential admin user allowing her to escalate her privileges.\nCVE-2023-44374 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N).\n3.2.7 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nAn Improper Neutralization of Special Elements used in an OS Command with root privileges vulnerability exists in the handling of the DDNS configuration. This could allow malicious local administrators to issue commands on system level after a successful IP address update.\nCVE-2023-49691 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical Sector, Critical Manufacturing, Energy Sector, Nuclear Reactors, Materials, and Waste Sector\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends users follow the General Security Recommendations described below.\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage\nFor more information see the associated Siemens security advisory SSA-690517 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJune 13, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-44317",
    "CVE-2023-44318",
    "CVE-2022-36323",
    "CVE-2022-46144",
    "CVE-2023-44374",
    "CVE-2023-44373",
    "CVE-2023-44319",
    "CVE-2023-49691"
  ],
  "techniques": [],
  "advisory": "icsa-24-165-12",
  "title": "Siemens SCALANCE W700 | CISA",
  "source": "ics-advisories",
  "id": "27cb15b04ff57862c6e9f88590ef053c33ec3ad23410f74848253ef8d8565f84"
}