{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Schneider Electric\nEquipment: PowerLogic ION7400 / PM8000 / ION8650 / ION8800 / ION9000\nVulnerability: Cleartext Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a disclosure of sensitive information, a denial of service, or modification of data if an attacker is able to intercept network traffic.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following components of Schneider Electric PowerLogic, a power meter, are affected:\n\nPowerLogic ION9000: All versions prior to 4.0.0\nPowerLogic ION7400: All versions prior to 4.0.0\nPowerLogic PM8000: All versions prior to 4.0.0\nPowerLogic ION8650: All versions\nPowerLogic ION8800: All versions\nLegacy ION products: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nA cleartext transmission of sensitive information vulnerability exists that could cause disclosure of sensitive information, denial of service, or modification of data if an attacker is able to intercept network traffic.\nCVE-2022-46680 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nJos Wetzels of Forescout Technologies reported these vulnerabilities to Schneider Electric.\n4. MITIGATIONS\nSchneider Electric has released the following remediations for users to implement:\n\nUpdate affected components to current firmware versions for available vulnerability fixes:\n\nPowerLogic ION9000: Version 4.0.0 is available for download.\nPowerLogic ION7400: Version 4.0.0 is available for download.\nPowerLogic PM8000: Version 4.0.0 is available for download.\n\n\nUsers should use appropriate patching methodologies when applying these patches to their systems. Schneider Electric recommends using backups and evaluating the impact of these patches in a “testing and development environment” or on an offline infrastructure.\nUsers should contact Schneider Electric for assistance in removing a patch.\nSchneider Electric recommends that users ensure devices supporting ION protocol are not exposed to the internet or other untrusted networks. Users should apply the best practices for network hardening as documented in the product user guide and the Schneider Electric Recommended Cybersecurity Best Practices.\nAdditional configuration steps and supporting software are required to utilize the secure ION feature. Please refer to the relevant product documentation or contact customer care for additional details and support.\n\nFor more information, see Schneider Electric’s security advisory SEVD-2023-129-03.\nSchneider Electric strongly recommends the following industry cybersecurity best practices:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls so no unauthorized personnel can access your industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in the “Program” mode.\nNever connect programming software to any network other than the network intended for that device.\nScan all methods of mobile data exchange with the isolated network such as CDs, USB drives, etc. before use in the terminals or any node connected to these networks.\nNever allow mobile devices that have connected to any other network besides the intended network to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and systems and ensure that they are not accessible from the internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs). Recognize that VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand that VPNs are only as secure as the connected devices.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically targeting these vulnerabilities have been reported to CISA at this time. \n",
  "cves": [
    "CVE-2022-46680"
  ],
  "techniques": [],
  "advisory": "icsa-23-229-03",
  "title": "Schneider Electric PowerLogic ION7400 / PM8000 / ION8650 / ION8800 / ION9000 Power Meters | CISA",
  "source": "ics-advisories",
  "id": "39089200bcf53bafc1ccc2bc871f9c90f4971f4c247624ccb534b79b5b4f73a6"
}