{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.2\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SINEMA Remote Connect Server\nVulnerabilities: Improperly Implemented Security Check for Standard\n\n2. RISK EVALUATION\nThe affected application is missing general HTTP security headers in the web servers configured on both Port 443 and Port 6220. This could aid attackers by making the servers more prone to clickjacking, channel downgrade attacks, and other similar client-based attack vectors.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following SINEMA Remote Connect management platform: \n\nSINEMA Remote Connect Server: all versions prior to v3.0 SP2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPERLY IMPLEMENTED SECURITY CHECK FOR STANDARD CWE-358\nThe affected application is missing general HTTP security headers in the web server configured on Port 443. This could aid attackers by making the servers more prone to clickjacking, channel downgrade attacks, and other similar client-based attack vectors.\nCVE-2022-27219 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated. the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:N)\n3.2.2    IMPROPERLY IMPLEMENTED SECURITY CHECK FOR STANDARD CWE-358\nThe affected application is missing general HTTP security headers in the web server configured on Port 6220. This could aid attackers by making the servers more prone to clickjacking, channel downgrade attacks, and other similar client-based attack vectors.\nCVE-2022-27220 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated. the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:N)\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens has released update v3.0 SP2 for the SINEMA Remote Connect Server and recommends updating to the latest version. \nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor additional information, please refer to Siemens security advisory SSA-911567:\n\nSSA-911567: PDF Version\nSSA-911567: TXT Version\nSSA-911567: CSAF Version\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a high attack complexity.\n",
  "cves": [
    "CVE-2022-27219",
    "CVE-2022-27220"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-07",
  "title": "Siemens SINEMA Remote Connect Server | CISA",
  "source": "ics-advisories",
  "id": "b88f3d2f49c001e2dee3631bb2c1c3819f0e40de7a993a5e18f504294f4dfa80"
}