{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.7\n\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SIMATIC IT Production Suite\nVulnerability: Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to compromise confidentiality, integrity and availability of the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following products:\n\nSIMATIC IT LMS all versions, \nSIMATIC IT Production Suite: Versions 7.1 prior to Version 7.1 Upd3, and\nSIMATIC IT UA Discrete Manufacturing versions prior to Version 2.4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nAn attacker with network access to the installation could bypass the application-level authentication.\nCVE-2018-13804 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSiemens provides updates to address this vulnerability in these products and recommends users update to the new version.\nhttps://www.plm.automation.siemens.com/global/en/support/\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict network access to affected installations.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security (https://www.siemens.com/cert/operational-guidelines-industrial-security), and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and associated software updates, please see Siemens’ security advisory SSA-886615 on their website:\nhttps://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-13804"
  ],
  "techniques": [],
  "advisory": "icsa-18-317-07",
  "title": "Siemens SIMATIC IT Production Suite | CISA",
  "source": "ics-advisories",
  "id": "a9ecf4f0a479571d169f8ac012092a70df47aebc152f3be3b436c46639d2ab14"
}