{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Low attack complexity \nVendor: EnOcean Edge Inc, a subsidiary of EnOcean GmbH \nEquipment: SmartServer with i.LON Vision \nVulnerability: Use of Hard-coded Credentials \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain unauthorized access to the servers. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following EnOcean Edge products are affected: \n\nEnOcean SmartServer: v2.2 SR8/SP8 (4.12.006) with i.LON Vision v2.2 SR8/SP8 (4.12.006) \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 USE OF HARD-CODED CREDENTIALS CWE-798 \nThe affected product, Echelon SmartServer 2.2 with i.LON Vision 2.2, stores cleartext credentials in a file, which could allow an attacker to obtain cleartext usernames and passwords of the SmartServer. If the attacker obtains the file, then the credentials could be used to control the web user interface and file transfer protocol (FTP) server. \nCVE-2022-3089 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:L/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Information Technology \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nChizuru Toyama of Trend Micro reported this vulnerability to CISA. \n4. MITIGATIONS\nEnOcean Edge released SmartServer 3.5 Update 2 (v3.52.003). \nFor additional mitigations and workarounds, users should refer to EnOcean’s hardening guide. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.  \n",
  "cves": [
    "CVE-2022-3089"
  ],
  "techniques": [],
  "advisory": "icsa-23-037-01",
  "title": "EnOcean SmartServer | CISA",
  "source": "ics-advisories",
  "id": "d119cfc1519ff5ead740bf59bcb14de04375265edf3ad08af2fd3c5c28e3b030"
}