{
  "markdown": "\nCVSS v3 7.3\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Miele Professional\nEquipment: PG 85 Series\nVulnerability: Path Traversal\nUPDATED INFORMATION\nThis advisory is a follow-up to the original alert titled ICS-ALERT-17-089-01 Miele Professional PG 8528 Vulnerability that was published March 30, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nMiele Professional reports that the following versions of the PG 85 product series, a large capacity cleaner and disinfector, and their embedded webservers are affected:\n\nPG8527, version 2.02, 2.51, 2.52, and 2.54\nPG8528, version 2.02, 2.51, 2.52, and 2.54\nPG8535, version 1.00 and 1.04\nPG8536, version 1.10 and 1.14\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a remote attacker to read or modify sensitive data or files, execute unauthorized code or commands, and possibly cause a system crash.\nMITIGATION\nMiele Professional issued patches for this vulnerability on May 4, 2017. Miele Professional is in the process of contacting all affected users via registered mail.\nUsers of affected machines can contact Miele Professional at 1-800-991-9380 to schedule service for a software update, which must be performed by a Miele Professional technician.\nThe following updates are available for affected Miele Professional PG 85 series products:\n\nPG8527, version 2.02\n\nUpdate to version 2.12\n\n\nPG8527, version 2.51\n\nUpdate to version 2.61\n\n\nPG8527, version 2.52\n\nUpdate to version 2.62\n\n\nPG8527, version 2.54\n\nUpdate to version 2.64\n\n\nPG8528, version 2.02\n\nUpdate to version 2.12\n\n\nPG8528, version 2.51\n\nUpdate to version 2.61\n\n\nPG8528, version 2.52\n\nUpdate to version 2.62\n\n\nPG8528, version 2.54\n\nUpdate to version 2.64\n\n\nPG8535, version 1.00\n\nUpdate to version 1.10\n\n\nPG8535, version 1.04\n\nUpdate to version 1.14\n\n\nPG8536, version 1.10\n\nUpdate to version 1.20\n\n\nPG8536, version 1.14\n\nUpdate to version 1.24\n\n\n\nMiele Professional issued a press release addressing this vulnerability on March 29, 2017, which can be found here:\nhttps://www.miele.de/en/m/miele-admits-communication-glitch-4072.htm\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nPATH TRAVERSAL CWE-22\n\nThe path traversal vulnerability has been identified, which may allow a remote attacker to access sensitive information by using special elements in the pathname to resolve to a location outside of a restricted directory.\nCVE-2017-7240 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\nRESEARCHER\nJens Regel of Schneider & Wulf publicly disclosed this vulnerability without ICS-CERT coordination.\nBACKGROUND\nCritical Infrastructure Sector: Healthcare and Public Health\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-7240"
  ],
  "techniques": [],
  "advisory": "icsa-17-138-01",
  "title": "Miele Professional PG 85 Series | CISA",
  "source": "ics-advisories",
  "id": "1f537bbca771ba5762d56ad3092ec22f9ca2a9b84a62d15f26e04183202a663f"
}