{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.6\nATTENTION: Low skill level to exploit\nVendor: Honeywell\nEquipment: INNCOM INNControl 3\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to escalate user privileges within the INNControl application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of INNCOM INNControl 3, an energy management platform, are affected:\n\nINNControl 3, Versions 3.21 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThe affected product allows workstation users to escalate application user privileges through the modification of local configuration files.\nCVE-2020-6968 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nHoneywell reported this vulnerability to CISA.\n4. MITIGATIONS\nHoneywell encourages users to contact an INNCOM sales representative or authorized systems integrator to obtain information on upgrading their system(s) to the latest version. Honeywell also offers online INNCOM support. Additional information about the vulnerability can be found in the Honeywell Security Notification.\nHoneywell recommends that, subject to each user’s individual assessment of the potential impact(s) of the vulnerabilities and/or recommendations on their specific operational building control network environment(s), users with potentially affected products are recommended to take the following steps to mitigate the effects of potential vulnerabilities:\n\nUpdate the software of potentially impacted systems as per the Security Notification.\nDisable unnecessary accounts and services.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-6968"
  ],
  "techniques": [],
  "advisory": "icsa-20-049-01",
  "title": "Honeywell INNCOM INNControl 3 | CISA",
  "source": "ics-advisories",
  "id": "5d906f11d0acad790555ea0ae6cc0bd66cc78d28876d95b2162ee12d225a7866"
}