{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.3\n\nATTENTION: Exploitable from an adjacent network/low skill level to exploit\nVendor: GAIN Electronic Co. Ltd\nEquipment: SAGA1-L series \nVulnerabilities: Authentication Bypass by Capture-replay, Improper Access Control, Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution and potentially delete the product’s firmware.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAccording to GAIN Electronic Co. Ltd, the following product is affected:\n\nSAGA1-L8B: All firmware versions prior to A0.10\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nThis product is vulnerable to a replay attack and command forgery.\nCVE-2018-17903 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.2.2    IMPROPER ACCESS CONTROL CWE-284\nThis vulnerability may allow an attacker to force-pair the device without human interaction.\nCVE-2018-17921 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER AUTHENTICATION CWE-287\nAn attacker with physical access to the product may able to reprogram it.\nCVE-2018-17923 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: United States \nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nMarco Balduzzi, Philippe Z Lin, Federico Maggi, Jonathan Andersson, Urano Akira, Stephen Hilt, and Rainer Vosseler working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nGAIN Electronic Co. Ltd has recommended that users update to firmware version A0.10. The new firmware can be obtained through a distributor.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should ensure the product is in a physically secure area.\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-17923",
    "CVE-2018-17903",
    "CVE-2018-17921"
  ],
  "techniques": [],
  "advisory": "icsa-18-296-02",
  "title": "GAIN Electronic Co. Ltd SAGA1-L Series | CISA",
  "source": "ics-advisories",
  "id": "00d5dba0ef8464fcc74f937246c329adde4e81e2aad3bbff5aa0677835dee652"
}