{
  "markdown": "\nOVERVIEW\nIndependent researcher Lee Ryman has identified a credential management vulnerability in Black Box’s AlertWerks ServSensor devices. ICS-CERT and CERT Australia have coordinated with Black Box that has produced a new firmware version to mitigate this vulnerability. Lee Ryman has tested the new firmware version to validate that it resolves the vulnerability.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following AlertWerks ServSensor versions are affected:\n\nBlack Box’s AlertWerks ServSensor, model numbers EME105A, EME106A, EME108A-R2, EME109A-R2, and EME110A-R2, firmware versions prior to Version SP473;\nBlack Box’s AlertWerks ServSensor Junior, model numbers EME102A-R2, EME103A-R2, and EME104A-R2, firmware versions prior to Version SP473;\nBlack Box’s AlertWerks ServSensor Junior with PoE, model numbers EME152A, EME153A, EME154A, EME155A, and EME158A, firmware versions prior to Version SP473; and\nBlack Box’s AlertWerks ServSensor Contact, model numbers EME111A-20-R2, EME111A‑60-R2, EME112A-20-R2, EME112A-60-R2, EME113A-20-R2, and EME113A‑60-R2, firmware versions prior to Version SP473.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an authenticated user to gain the administrator and user passwords compromising the system.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nBlack Box is a US-based company that maintains offices in several countries around the world.\nThe affected product, AlertWerks ServSensor, is the central hub for an environmental monitoring system. According to Black Box, these products are deployed across several sectors including Commercial Facilities. Black Box estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nCREDENTIALS MANAGEMENTCWE-255: Credentials Management, http://cwe.mitre.org/data/definitions/255.html, web site last accessed May 26, 2016.\n\nAn authenticated user may be able to query administrator and user passwords.\nCVE-2016-2311NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-2311, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N, web site last accessed May 26, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with low skill would be able to exploit this vulnerability.\nMITIGATION\nBlack Box has released a new firmware, Version SP473, which addresses the identified vulnerability in all the affected AlertWerks ServSensor models and is available at the following location:\nftp://ftp.blackbox.com/AlertWerks%20Firmware/fw%20SP-473%20for%20EME102%20-EME113%20and%20EME152%20-%20EME158.zip\nBlack Box recommends that users should install the new firmware version.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-2311"
  ],
  "techniques": [],
  "advisory": "icsa-16-147-03",
  "title": "Black Box AlertWerks ServSensor Credential Management Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "28e8cba747a5edc375de43b36a54ede0b49e663461a9b3896ae3d561129dea81"
}