{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: Medium Voltage SINAMICS Products\nVulnerabilities: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-128-01 Siemens Medium Voltage SINAMICS Products that was published May 10, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in a denial-of-service condition, resulting in a manual restart of the affected devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that these vulnerabilities affect the following products:\n\nSINAMICS GH150 V4.7 w. PROFINET: All versions prior to V4.7 SP5 HF7,\nSINAMICS GL150 V4.7 w. PROFINET: All versions prior to V4.8 SP2,\nSINAMICS GM150 V4.7 w. PROFINET: All versions prior to V4.8 SP2,\nSINAMICS SL150 V4.7.0 w. PROFINET: All versions prior to V4.7 HF30,\nSINAMICS SL150 V4.7.4 w. PROFINET: All versions prior to V4.8 SP2,\nSINAMICS SL150 V4.7.5 w. PROFINET: All versions prior to V4.8 SP2,\nSINAMICS SM120 V4.7 w. PROFINET: All versions prior to V4.8 SP2, and\n\n--------- Begin Update A Part 1 of 2 --------\n\nSINAMICS GM150 v4.7 w. PROFINET: All versions prior to v4.7 HF31, and\nSIMOTION D4xx v4.4 for SINAMICS SM150i-2 w. PROFINET: All versions prior to v4.4 HF26\n\n--------- End Update A Part 1 of 2 --------\n4.2 VULNERABILITY OVERVIEW\n4.2.1   IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets sent to Port 161/UDP could cause a denial-of-service condition. The affected devices must be restarted manually.\nCVE-2017-12741 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2   IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted PROFINET DCP broadcast packets could cause a denial-of-service condition of affected products on a local Ethernet segment (Layer 2). Human interaction is required to recover the systems. PROFIBUS interfaces are not affected.\nCVE-2017-2680 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n\n4.4 RESEARCHER\nSiemens ProductCERT reported these vulnerabilities to NCCIC.\n5. MITIGATIONS\nSiemens recommends users implement the following updates. These updates can be obtained from a Siemens representative or via Siemens customer service.\n\nSINAMICS GH150 V4.7 w. PROFINET: Update to V4.7 SP5 HF7 or upgrade to V4.8 SP2,\nSINAMICS GL150 V4.7 w. PROFINET: Upgrade to V4.8 SP2,\nSINAMICS SL150 V4.7.0 w. PROFINET: Update to V4.7 HF30 or upgrade to V4.8 SP2,\nSINAMICS SL150 V4.7.4 w. PROFINET: Upgrade to V4.8 SP2,\nSINAMICS SL150 V4.7.5 w. PROFINET: Upgrade to V4.8 SP2, and\nSINAMICS SM120 V4.7 w. PROFINET: Upgrade to V4.8 SP2\n\n--------- Begin Update A Part 2 of 2 --------\n\nSINAMICS GM150 v4.7 w. PROFINET: Upgrade to v4.7 HF31 or v4.8 SP2, and\nSIMOTION D4xx v4.4 for SINAMICS SM150i-2 w. PROFINET: Update to v4.4 HF26\n\n--------- End Update A Part 2 of 2 --------\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security (Download: https://www.siemens.com/cert/operational-guidelines-industrial-security), and following the recommendations in the product manuals. Additional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on these vulnerabilities and associated mitigation practices, please see Siemens security advisory SSA-546832 on their website:\nhttps://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2017-12741",
    "CVE-2017-2680"
  ],
  "techniques": [],
  "advisory": "icsa-18-128-01",
  "title": "Siemens Medium Voltage SINAMICS Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "befd32a3da249cfc5f18467061f402696a240588e15d463522d007f1030e6f1b"
}