{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.7\nATTENTION: Exploitable remotely\nVendor: JTEKT\nEquipment: TOYOPUC Products\nVulnerability: Missing Authentication for Critical Function\n\nCISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition, change control logic, or disable communication links.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of TOYOPUC products, a programmable logic controller, are affected:\n\nPC10G-CPU Type=TCC-6353: All versions\nPC10GE Type=TCC-6464: All versions\nPC10P Type=TCC-6372: All versions\nPC10P-DP Type=TCC-6726: All versions\nPC10P-DP-IO Type=TCC-6752: All versions\nPC10B-P Type=TCC-6373: All versions\nPC10B Type=TCC-1021: All versions\nPC10E Type=TCC-4737: All versions\nPC10EL Type=TCC-4747: All versions\nPlus CPU Type=TCC-6740: All versions\nPC3JX Type=TCC-6901: All versions\nPC3JX-D Type=TCC-6902: All versions\nPC10PE Type=TCC-1101: All versions\nPC10PE-1616P Type=TCC-1102: All versions\nPCDL Type=TKC-6688: All versions\nNano 10GX Type=TUC-1157: All versions\nNano CPU Type=TUC-6941: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product lacks authentication functionality, which could allow an attacker to change controller configurations, manipulate data, or cause a denial-of-service condition.\nCVE-2022-29951 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.2.2    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nThe affected product lacks privilege separation capabilities, which could allow an attacker to execute arbitrary machine code.\nCVE-2022-29958 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels of Forescout Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nJTEKT has provided the following workarounds:\n\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nMinimize network exposure for all control system devices and/or systems, use IP filter functions to allow only specific personal computer/device to connect, and ensure they are not accessible from the Internet.\nTo prevent unauthorized devices from being connected to the free ports of the HUB, use a LAN port lock to close the free ports.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-29958",
    "CVE-2022-29951"
  ],
  "techniques": [],
  "advisory": "icsa-22-172-02",
  "title": "JTEKT TOYOPUC | CISA",
  "source": "ics-advisories",
  "id": "82b7399c2212d36096b5a5fea5d58281c9008a961751a43212e9d072c378a1b7"
}