{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELFA FR Series, MELFA CR Series, MELFA ASSISTA\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-021-04 Mitsubishi Electric MELFA that was published January 21, 2021, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the vulnerability affects the following MELFA robot controllers: \n\nMELFA FR Series\nMELFA CR Series\nMELFA ASSISTA\n\nFor more detailed information on affected models and firmware versions, please see the Mitsubishi Electric advisory.\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThese robot controllers may allow an attacker to cause a denial-of-service condition in the execution of the robot program and the Ethernet communication by sending many packets in a burst over a short period. As a result of this denial-of-service condition, an error may occur\nCVE-2021-20586 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nIndustrial Control Security Laboratory of Qi An Xin Group Inc., from China reported this vulnerability to Mitsubishi Electric.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 ---------\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\nUse a firewall or VPN, etc., to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\nUse an IP filter function and block access from untrusted networks and hosts. The product models and firmware versions that support the IP filter function are:\n\nMELFA FR Series: firmware Version “C2” or later\nMELFA CR Series: firmware Version “C2” or later\nMELFA ASSISTA: firmware Version “C2” or later\n\n\n\nTo obtain a product that supports the IP filter function, contact your local Mitsubishi Electric representative.\n--------- End Update A Part 1 of 1 ---------\nPlease refer to the Mitsubishi Electric advisory for details on how to check firmware version. \nAdditional information about the vulnerabilities or Mitsubishi Electric’s compensating control is available by contacting a Mitsubishi Electric representative.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-20586"
  ],
  "techniques": [],
  "advisory": "icsa-21-021-04",
  "title": "Mitsubishi Electric MELFA (Update A) | CISA",
  "source": "ics-advisories",
  "id": "50a7722e89713ea8360ec62ef6ee4c6cc91ef1beeb5c7f43d392d8f7b4412f76"
}