{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).View CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.2\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SIMATIC WinCC\nVulnerability: Exposure of Private Personal Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated remote attacker to retrieve information such as users and passwords.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports that the following versions of SIMATIC WinCC are affected:\n\nSiemens SIMATIC PCS 7 V9.1: all versions\nSiemens SIMATIC WinCC Runtime Professional V18: all versions\nSiemens SIMATIC WinCC Runtime Professional V19: all versions\nSiemens SIMATIC WinCC V7.4: versions prior to V7.4 SP1 Update 23\nSiemens SIMATIC WinCC V7.5: versions prior to V7.5 SP2 Update 17\nSiemens SIMATIC WinCC V8.0: versions prior to V8.0 Update 5\n\n3.2 Vulnerability Overview\n3.2.1 EXPOSURE OF PRIVATE PERSONAL INFORMATION TO AN UNAUTHORIZED ACTOR CWE-359\nThe affected products do not properly handle certain requests to their web application, which may lead to the leak of privileged information. This could allow an unauthenticated remote attacker to retrieve information such as users and passwords.\nCVE-2024-30321 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-30321. A base score of 8.2 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released new versions for several affected products and recommends updating to the latest versions. Siemens is preparing further fix versions and recommends countermeasures for products where fixes are not, or not yet available.\n\nSIMATIC PCS 7 V9.1: Update WinCC to V7.5 SP2 Update 17 or later version\nSIMATIC WinCC V7.4: Update to V7.4 SP1 Update 23 or later version\nSIMATIC WinCC V7.5: Update to V7.5 SP2 Update 17 or later version\nSIMATIC WinCC V8.0: Update to V8.0 Update 5 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nRestrict access to application webserver for trusted users only\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage\nFor more information see the associated Siemens security advisory SSA-883918 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nJuly 11, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-30321"
  ],
  "techniques": [],
  "advisory": "icsa-24-193-16",
  "title": "Siemens SIMATIC WinCC | CISA",
  "source": "ics-advisories",
  "id": "cc2c8016fb389be38615148dfcb434fa850db3385ffd7b53213338b562c93d08"
}