{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.5\n\nATTENTION: Exploitable from an adjacent network/low skill level to exploit\nVendor: Siemens\nEquipment: Industrial Products\nVulnerabilities: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-023-02 Siemens Industrial Products that was published January 23, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the targeted device to enter a denial-of-service condition, which may require human interaction to recover the system.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that this vulnerability affects the following products using PROFINET DCP:\n\nSIMATIC CP 1242-7 GPRS v2: All versions prior to v2.1.82,\nSIMATIC CP 1243-7 LTE EU/US: All versions prior to v2.1.82,\nSIMATIC CP 1243-8: All versions prior to v2.1.82,\n\n--------- Begin Update A Part 1 of 2 --------\n\nSIMATIC CP 1626: All versions prior to v1.1,\n\n--------- End Update A Part 1 of 2 ----------\n\nExtension Unit 12” PROFINET: All versions prior to v01.01.01,\nExtension Unit 15” PROFINET: All versions prior to v01.01.01,\nExtension Unit 19” PROFINET: All versions prior to v01.01.01, and\nExtension Unit 22” PROFINET: All versions prior to v01.01.01.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted PROFINET DCP broadcast packets could cause a denial-of-service condition of affected products on a local Ethernet segment (Layer 2). Human interaction is required to recover the systems. PROFIBUS interfaces are not affected.\nCVE-2017-2680 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to NCCIC.\n5. MITIGATIONS\nThe attacker must have network access to the local Ethernet segment (Layer 2).\nSiemens recommends upgrading latest firmware versions. This vulnerability is resolved in the following versions for each product listed:\n\nv01.01.01(https://support.industry.siemens.com/cs/document/109750351):\n\nExtension Unit 12” PROFINET\nExtension Unit 15” PROFINET\nExtension Unit 19” PROFINET\nExtension Unit 22” PROFINET\n\n\nv2.1.82 (https://support.industry.siemens.com/cs/ww/en/view/109749515):\n\nSIMATIC CP 1242-7 GPRS V2\nSIMATIC CP 1243-7 LTE EU/US\nSIMATIC CP 1243-8 IRC\n\n\n\n--------- Begin Update A Part 2 of 2 ---------\n\nv1.1(https://support.industry.siemens.com/cs/ww/en/view/109763307):\n\nSIMATIC CP 1626\n\n\n\n--------- End Update A Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations that customers can apply to reduce the risk:\n\nApply cell protection concept\nUse VPN for protecting network communication between cells\nApply defense-in-depth\n\nAs a general security measure, Siemens strongly recommends to protect network access to devices with appropriate mechanisms. In order to run the devices in a protected IT environment, Siemens particularly recommends to configure the environment according to Siemens’ Operational Guidelines for Industrial Security and to follow the recommendations in the product manuals. The Operational Guidelines for Industrial Security can be found at:https://www.siemens.com/cert/operational-guidelines-industrial-security\nAdditional information on Industrial Security by Siemens can be found at:  https://www.siemens.com/global/en/home/company/topic-areas/future-of-manufacturing/industrial-security.html\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-284673 at the following location:http://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2017-2680"
  ],
  "techniques": [],
  "advisory": "icsa-18-023-02",
  "title": "Siemens Industrial Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "1fab31e51be2e9625e53c7347f2294f31e9607e9f87ad440a8d5ecb579ff4de6"
}