{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 X8.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: mySCADA\nEquipment: myPRO\nVulnerabilities: Improper Access Control, Unrestricted Upload of File with Dangerous Type, Path Traversal, Exposure of Information Through Directory Listing\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow unauthorized users the ability to access sensitive information and upload arbitrary files.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of myPro are affected:\n\nAll versions prior to 8.20.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected product does not restrict unauthorized read access to sensitive system information.\nCVE-2021-33013 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N).\n3.2.2    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nThe affected product allows an unauthenticated remote attacker to upload arbitrary files to the file system.\nCVE-2021-33009 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.2.3    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe affected product allows an unauthenticated remote attacker to upload arbitrary files to arbitrary directories.\nCVE-2021-33005 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AAV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.2.4    EXPOSURE OF INFORMATION THROUGH DIRECTORY LISTING  CWE-548\nThe affected product does not restrict unauthorized read access to sensitive directory listing information.\nCVE-2021-27505 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Food and Agriculture, Transportation Systems, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Czech Republic\n\n3.4 RESEARCHER\nMichael Heinzl reported these vulnerabilities to CISA.\n4. MITIGATIONS\nmySCADA recommends users apply update v8.20.0 or later. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-33013",
    "CVE-2021-33009",
    "CVE-2021-33005",
    "CVE-2021-27505"
  ],
  "techniques": [],
  "advisory": "icsa-21-217-03",
  "title": "mySCADA myPRO | CISA",
  "source": "ics-advisories",
  "id": "d4a36eb29afddb58f46cb392750c426f2b0ae7f59d9aee930c708187b75c864b"
}