{
  "markdown": "\nOVERVIEW\nMatthias Niedermaier and Michael Kapfer of HSASec Hochschule Augsburg have identified authentication vulnerabilities in Phoenix Contact’s ILC (inline controller) PLCs. Phoenix Contact GmbH & Co. KG has produced a mitigation plan that includes an update and recommended security practices to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nPhoenix Contact reports that these vulnerabilities affect the following versions of ILC PLCs:\n\nAll ILC 1xx PLCs.\n\nIMPACT\nThe identified vulnerabilities could allow an unauthenticated user to access human-machine interface (HMI) pages and to modify programmable logic controller (PLC) variables.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nPhoenix Contact GmbH & Co. KG is a German-based automation company.\nThe affected products, ILC 1xx PLCs, are inline controllers with an Ethernet interface for coupling to other controllers and systems. According to Phoenix Contact, ILC PLCs are deployed across several sectors including Commercial Facilities, Critical Manufacturing, Energy, and Water and Wastewater Systems. Phoenix Contact estimates that these products are used primarily in Europe, North America, and Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nCLEARTEXT STORAGE OF SENSITIVE INFORMATIONCWE-312: Cleartext Storage of Sensitive Information, http://cwe.mitre.org/data/definitions/312.html, web site last accessed November 08, 2016.\n\nWebvisit offers a password macro to protect HMI pages on the PLC against casual or coincidental opening of HMI pages by the user. The password macro can be configured in a way that the password is stored and transferred in clear text.\nCVE-2016-8366NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8366, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed November 08, 2016.\n\nAUTHENTICATION BYPASS ISSUESCWE-592: Authentication Bypass Issues, http://cwe.mitre.org/data/definitions/592.html, web site last accessed November 08, 2016.\n\nThe web server can be accessed without authenticating even if the authentication mechanism is enabled.\nCVE-2016-8371NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8371, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed November 08, 2016.\n\nACCESS TO CRITICAL PRIVATE VARIABLE VIA PUBLIC METHODCWE-767: Access to Critical Private Variable via Public Method, http://cwe.mitre.org/data/definitions/767.html, web site last accessed November 08, 2016.\n\nThe web server allows access to read and write PLC variables without authentication.\nCVE-2016-8380NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-8380, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed November 08, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nPhoenix Contact has released an update for Webvisit to mitigate the plaintext password storage issue. Users may obtain this update by contacting Phoenix Contact customer support at automation-service@phoenixcontact.com, or +49 52 81/9 46 28 88 (Germany).\nConnecting devices to a network via Ethernet always entails the risk of unauthorized access to the network. Phoenix Contact recommends that users implement an adequate defense–in-depth networking architecture (including the following) for control systems where these devices are operating.\n\nDevices should not be exposed to public networks without the use of virtual private networks (VPNs) for remote access.\nFirewalls should be used for network segmentation or controller isolation.\nAvailable communication channels or ports not needed in the application should be turned off. Administrators and users should check whether the application offers any option of deactivating active communication channels (e.g., SNMP, FTP, BootP, DCP), or setting passwords to prevent third parties from unauthorized accessing the controller and modifying the system.\nAccess to the devices should be limited to the fewest possible authorized personnel.\nChange standard or default passwords when first installing every component. Passwords should be changed in regular interval in order to reduce risks of becoming public. Passwords should have a maximum strength by the use of small and capital letters as well as numbers and special characters with a length of at least 10 characters.\nConduct regular thread analyses to discover whether current measures meet the safety requirements.\nInstall and maintain security software in order to defend new or recurring risks; such as viruses, Trojans, phishing attacks.\nUsers may decide to use the ILC 1x1 PLCs with the latest Firmware 4.42, because it offers the HTTPS protocol and HTML5 for the web server-based HMI system.\nWith regard to the controller's communication interfaces, Phoenix Contact recommends not to use the ILC 1xx controller in safety-critical applications unless using additional security devices.\n\nFor more information on this vulnerability and the associated update and mitigation strategies, please email Phoenix Contact at the following address:\nautomation-service@phoenixcontact.com\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-8366",
    "CVE-2016-8371",
    "CVE-2016-8380"
  ],
  "techniques": [],
  "advisory": "icsa-16-313-01",
  "title": "Phoenix Contact ILC PLC Authentication Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "121277cd6e010a6cc95605a937e1d213e16f82941811d9f4401b4fe490d56cb0"
}