{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: OSIsoft LLC\nEquipment: OSIsoft PI SQL Client\nVulnerability: Integer Overflow or Wraparound\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote code execution or cause a denial of service, resulting in disclosure, deletion, or modification of information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of OSIsoft PI SQL Client, a component interface that enables data access via SQL queries to the PI System, are affected:\n\nPI SQL Client 2018 (PI SQL Client OLEDB 2018)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INTEGER OVERFLOW OR WRAPAROUND CWE-190\nAn attacker could exploit this vulnerability in a third-party component to remotely execute code on the client computer with the same permissions as the PI SQL Client user.\nCommunication with a malicious PI SQL Data Access Server (RTQP Engine) is needed to expose a PI SQL client to this vulnerability.\nCVE-2017-9765 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Government Facilities, Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nOSIsoft reported this vulnerability to CISA.\n4. MITIGATIONS\nOSIsoft recommends users upgrade to PI SQL Client 2018 R2 or later to resolve this issue. To download PI SQL Client 2018 R2, please access the OSIsoft customer portal (login required).\nOSIsoft also provides the following measures to be used to avoid exploitation:\nConfigure the PI SQL Client OLEDB 2018 Data Link Advanced Properties to use NetTcp (Port 5465) and delete Https/Soap (Port 5464) from the network protocol order.\nThe following measures can be used to lower the likelihood of exploitation: \n\nRestrict PI SQL Client outbound network connections to trusted servers.\nMonitor network infrastructure for spoofing attacks on PI SQL Data Access Servers.\nMonitor PI SQL Data Access Servers for unauthorized access.\n\nThe following measures can be used to lower the potential impact of exploitation: \n\nExecute PI SQL Client using a least privilege account.\nUse application whitelisting on the PI SQL Client to block unauthorized code execution.\n\nFor more information on this vulnerability, please refer to OSIsoft’s security bulletin (login required): OSIsoft releases security update to PI SQL Client 2018\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2017-9765"
  ],
  "techniques": [],
  "advisory": "icsa-19-253-06",
  "title": "OSIsoft PI SQL Client | CISA",
  "source": "ics-advisories",
  "id": "ef11db6f7e06a9b30f95f0b6b889474876c01b46c23c551d1ef68fb5ad8e63fb"
}