{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Yokogawa\nEquipment: CENTUM and ProSafe-RS\nVulnerabilities: OS Command Injection, Improper Authentication, NULL Pointer Dereference, Improper Input Validation, Resource Management Errors\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow leakage/tampering of data, cause a denial-of-service condition, or allow a local attacker to execute arbitrary programs.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CENTUM (a Distributed Control System) and ProSafe-RS (Safety Instrumented System), are affected:\nCVE-2022-27188: \n\nCENTUM VP series: CENTUM VP (Including CENTUM VP Entry Class): R4.01.00 through R4.03.00 (if VP6E5150 is installed)\nB/M9000 VP: R6.01.01 through R6.03.02\n\nCVE-2022-26034:\n\nCENTUM VP (Including CENTUM VP Entry Class): R6.01.10 through R6.09.00 (if VP6E5000 is installed)\nB/M9000 VP R8.01.01 through R8.03.01 \nProsafe-RS: R4.01.00 through R4.07.00 – if RS4E5000 is installed\n\nCVE-2019-0203, CVE-2018-11782, CVE-2015-0248:\n\nCENTUM VP (Including CENTUM VP Entry Class): R6.01.10 through R6.07.10 if VP6E5000 or VP6E5100 are installed\nB/M9000 VP R8.01.01 through R8.03.01\nProsafe-RS: R4.01.00 through R4.05.00 – if RS4E5000 or RS4E5100 are installed\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nA local attacker could tamper with files generated by the graphic builder, which may allow arbitrary programs to be executed on a computer that has installed standard operation and monitoring function (HIS).\nCVE-2022-27188 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:H).\n3.2.2    IMPROPER AUTHENTICATION CWE-287\nImproper authentication of the communication protocol provided by the Automation Design (AD) server allows an attacker to use the functions provided by the AD server. This may lead to leakage or tampering of data managed by the AD server.\nCVE-2022-26034 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:L/A:L).\n3.2.3    NULL POINTER DEREFERENCE CWE-476\nThe AD suite version management function is subjected to malformed packets, which the functions provided by the AD server may stop.\nCVE-2019-0203 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    IMPROPER INPUT VALIDATION CWE-20\nThe AD suite version management function is subjected to malformed packets, which the functions provided by the AD server may stop.\nCVE-2018-11782 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.5    RESOURCE MANAGEMENT ERRORS CWE-399\nThe AD suite version management function is subjected to malformed packets, which the functions provided by the AD server may stop.\nCVE-2015-0248 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nJPCERT/CC notified CISA of these vulnerabilities.\n4. MITIGATIONS\nYokogawa recommends the following: \n\nUsers of CENTUM Versions R6.01.10 through R6.09.00: Update to R6.09.00 and apply patch software (R6.09.04). In an environment where the AD server and Plant Resource Manager (PRM) are linked, there are some precautions to be taken when applying patch software (R6.09.04). Please be sure to check R6.09.04 install manual for details before applying R6.09.04\nUsers of CENTUM Versions R4.01.00 though R4.03.00: No patch software will be available because these products are no longer supported by the vendor.\nB/M9000 VP: This product is not affected by these vulnerabilities. However, this product is affected by the existence of CENTUM installed on the same PC. If CENTUM is installed, perform update, and update B/M9000 to suitable revision.\nUsers of Prosafe-RS: Update to R4.07.02 or later\n\nYokogawa also recommends checking the patch software install manual for details before applying patch software as there are some precautions for the following:\n\nThe environment where both CENTUM VP and ProSafe-RS are installed.\nThe environment where CENTUM VP’s AD server and PRM are linked.\nThe environment where ProSafe-RS’s AD server and PRM are linked.\n\nContact Yokogawa support for more mitigation information.\nFor more information see Yokogawa security advisory report: YSAR-22-0004\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2019-0203",
    "CVE-2015-0248",
    "CVE-2022-26034",
    "CVE-2018-11782",
    "CVE-2022-27188"
  ],
  "techniques": [],
  "advisory": "icsa-22-123-01",
  "title": "Yokogawa CENTUM and ProSafe-RS | CISA",
  "source": "ics-advisories",
  "id": "4c90180d6ff1a47f76163a41b684c6d515219b43a5c923cb352f660daefdd006"
}