{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: FactoryTalk Activation Manager\nVulnerabilities: Out-of-Bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in a buffer overflow and allow the attacker to gain full access to the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Factory Talk are affected:\n\nFactory Talk: V4.00 (Utilizes Wibu-Systems CodeMeter <7.60c)\n\n3.2 Vulnerability Overview\n3.2.1 OUT-OF-BOUNDS WRITE CWE-787\nRockwell Automation FactoryTalk Activation Manager and Studio 5000 Logix Designer uses the affected Wibu-Systems' products which internally use a version of libcurl that is vulnerable to a buffer overflow attack if curl is configured to redirect traffic through a SOCKS5 proxy. A malicious proxy can exploit a bug in the implemented handshake to cause a buffer overflow. If no SOCKS5 proxy has been configured, there is no attack surface.\nCVE-2023-38545 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2 OUT-OF-BOUNDS WRITE CWE-787\nRockwell Automation FactoryTalk Activation Manager and Studio 5000 Logix Designer uses the affected Wibu-Systems' products which contain a heap buffer overflow vulnerability in Wibu CodeMeter Runtime network service up to Version 7.60b that allows an unauthenticated, remote attacker to achieve RCE and gain full access of the host system.\nCVE-2023-3935 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAn anonymous researcher reported these vulnerabilities to CISA.\n4. MITIGATIONS\nUsers of the affected software are encouraged to apply the risk mitigations, if possible:\n\nUpgrade to FactoryTalk Activation Manager 5.01 which has been patched to mitigate these issues.\nFor information on how to mitigate security risks on industrial automation control systems see our suggested security best practices.\nRockwell Automation encourages users to implement their suggested security best practices to minimize risk of the vulnerability.\n\nFor more information, please see the security advisory from Rockwell Automation\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits that specifically target these vulnerabilities have been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJanuary 4, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-38545",
    "CVE-2023-3935"
  ],
  "techniques": [],
  "advisory": "icsa-24-004-01",
  "title": "Rockwell Automation FactoryTalk Activation | CISA",
  "source": "ics-advisories",
  "id": "b1eee4fdeded9eb355448a3fc854c6a81cf915480a3c1847f74d646f12a87061"
}