{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: PADS Standard/Plus Viewer\nVulnerabilities: Out-of-bounds Read, Out-of-bounds Write, Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. RISK EVALUATION\nSuccessful exploitations of these vulnerabilities could allow an attacker to trick a user into opening a malicious file within the affected application, which could result in code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of PADS Standard and Standard Plus, a PCB schematic design and layout environment, are affected:\n\nPADS Standard/Plus Viewer: All versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to execute code in the context of the current process (FG-VD-22-037, FG-VD-22-059).\nCVE-2022-34272 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-038). \nCVE-2022-34273 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PCB files. This could allow an attacker to execute code in the context of the current process. (FG-VD-22-039)\nCVE-2022-34274 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-040). \nCVE-2022-34275 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.5    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-041). \nCVE-2022-34276 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.6    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-042). \nCVE-2022-34277 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.7    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-043). \nCVE-2022-34278 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.8    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to execute code in the context of the current process (FG-VD-22-044). \nCVE-2022-34279 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.9    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to execute code in the context of the current process (FG-VD-22-045). \nCVE-2022-34280 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.10    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to execute code in the context of the current process (FG-VD-22-046). \nCVE-2022-34281 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.11    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to leak information in the context of the current process (FG-VD-22-047). (FG-VD-22-047)\nCVE-2022-34282 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.12    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to leak information in the context of the current process (FG-VD-22-048).\nCVE-2022-34283 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.13    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-049). \nCVE-2022-34284 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.14    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to leak information in the context of the current process (FG-VD-22-050). \nCVE-2022-34285 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.15    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-051). \nCVE-2022-34286 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.16    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe affected application contains a stack corruption vulnerability while parsing PCB files. An attacker could leverage this vulnerability to leak information in the context of the current process (FG-VD-22-052, FG-VD-22-056). \nCVE-2022-34287 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.17    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing PCB files. An attacker could leverage this vulnerability to leak information in the context of the current process (FG-VD-22-053). \nCVE-2022-34288 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.18    OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated structure while parsing specially crafted PCB files. This could allow an attacker to execute code in the context of the current process (FG-VD-22-054). \nCVE-2022-34289 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.19    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe affected application contains a stack corruption vulnerability while parsing PCB files. An attacker could leverage this vulnerability to leak information in the context of the current process (FG-VD-22-055). \nCVE-2022-34290 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.20    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe affected application contains a stack corruption vulnerability while parsing PCB files. An attacker could leverage this vulnerability to leak information in the context of the current process (FG-VD-22-057, FG-VD-22-058, FG-VD-22-060). \nCVE-2022-34291 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations that customers can implement to\nreduce exploitation risk:\n\nDo not open untrusted PCB files in PADS Standard/Plus Viewer\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ Operational Guidelines for Industrial Security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-439148.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2022-34275",
    "CVE-2022-34287",
    "CVE-2022-34278",
    "CVE-2022-34276",
    "CVE-2022-34290",
    "CVE-2022-34273",
    "CVE-2022-34277",
    "CVE-2022-34285",
    "CVE-2022-34283",
    "CVE-2022-34286",
    "CVE-2022-34289",
    "CVE-2022-34274",
    "CVE-2022-34288",
    "CVE-2022-34284",
    "CVE-2022-34280",
    "CVE-2022-34281",
    "CVE-2022-34282",
    "CVE-2022-34279",
    "CVE-2022-34272",
    "CVE-2022-34291"
  ],
  "techniques": [],
  "advisory": "icsa-22-195-08",
  "title": "Siemens PADS Standard/Plus Viewer | CISA",
  "source": "ics-advisories",
  "id": "63ffae44097bea0c409fa7a0caf392a7052ed4213a8087e711e3b0415d575941"
}