{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Elcomplus\nEquipment: SmartPTT\nVulnerabilities: Path Traversal, Unrestricted Upload of File with Dangerous Type, Improper Authorization, Cross-site Scripting\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could provide attackers a way to traverse the file system to access files or directories that are outside of the restricted directory; allow the upload or transfer files of dangerous types that can be automatically processed within the product's environment; allow an unauthorized access to an action or a resource; or allow a user to store dangerous data in a trusted database.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version of SmartPTT SCADA, an integrated voice and data dispatch software, is affected:\n\nSmartPTT SCADA v1.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nAn attacker can inject JavaScript code into a specific parameter that can executed upon accessing the dashboard or the main page.\nCVE-2021-43932 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H).\n3.2.2    IMPROPER AUTHORIZATION CWE-285\nA low-authenticated user can access higher level administration authorization by issuing requests directly to the desired endpoints.\nCVE-2021-43939 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434 \nThe backup and restore system does not adequately validate upload requests, enabling a malicious user to potentially upload arbitrary files.\nCVE-2021-43934 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY (‘PATH TRAVERSAL’) CWE-22\nThe backup and restore system does not adequately validate download requests, enabling malicious users to perform path traversal attacks and potentially download arbitrary files from the system.\nCVE-2021-43930 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Russia\n\n3.4 RESEARCHER\nMichael Heinzl reported these vulnerabilities to CISA.\n4. MITIGATIONS\nElcomplus has released an update to fix these vulnerabilities and recommends users upgrade to Version 2.3.4 or later.\nFor more information, please contact Elcomplus support.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-43939",
    "CVE-2021-43932",
    "CVE-2021-43934",
    "CVE-2021-43930"
  ],
  "techniques": [],
  "advisory": "icsa-22-109-04",
  "title": "Elcomplus SmartPTT SCADA | CISA",
  "source": "ics-advisories",
  "id": "a1a95a67fa180fe20fa21e7deb3ae3ec90e934ae39fbb36ed3570a3e3408e635"
}