{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: NetComm Wireless\nEquipment: 4G LTE Light Industrial M2M Router\nVulnerabilities: Information Exposure, Cross-site Request Forgery, Cross-site Scripting, Information Exposure through Directory Listing\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow for the exposure of sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the 4G LTE Light Industrial M2M Router (NWL-25), a cellular router, are affected:\n\n4G LTE Light Industrial M2M Router (NWL-25) with firmware 2.0.29.11 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INFORMATION EXPOSURE CWE-200\nThe device allows access to configuration files and profiles without authenticating the user. \nCVE-2018-14782 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    CROSS-SITE REQUEST FORGERY CWE-352\nA cross-site request forgery condition can occur, allowing an attacker to change passwords of the device remotely. \nCVE-2018-14783 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe device is vulnerable to several cross-site scripting attacks, allowing a remote attacker to run arbitrary code on the device. \nCVE-2018-14784 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    INFORMATION EXPOSURE THROUGH DIRECTORY LISTING CWE-548\nThe directory of the device is listed openly without authentication. \nCVE-2018-14785 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Australia\n\n3.4 RESEARCHER\nAditya K. Sood reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nNetComm Wireless has released a new firmware version to mitigate the vulnerabilities. Affected users may download the firmware from: https://support.netcommwireless.com/product/nwl-25#Firmware\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2018-14782",
    "CVE-2018-14783",
    "CVE-2018-14784",
    "CVE-2018-14785"
  ],
  "techniques": [],
  "advisory": "icsa-18-221-02",
  "title": "NetComm Wireless 4G LTE Light Industrial M2M Router | CISA",
  "source": "ics-advisories",
  "id": "d0fd6ad4e9deb4cdf5689058b8901142a64eceb04d332f8ee5be6fd68d6d83ed"
}