{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Low skill level to exploit\nVendor: Zebra\nEquipment: Industrial Printers\nVulnerability: Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to send specially crafted packets to a port on the printer, resulting in the retrieval of a front control panel passcode.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Zebra Industrial Printers are affected:\n\nAll Zebra Industrial Printers\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICENTLY PROTECTED CREDENTIALS CWE-522\nZebra printers are shipped with unrestricted end-user access to front panel options. If the option to use a passcode to limit the functionality of the front panel is applied, specially crafted packets could be sent over the same network to a port on the printer and the printer will respond with an array of information that includes the front panel passcode for the printer. Once the passcode is retrieved, an attacker must have physical access to the front panel of the printer to enter the passcode to access the full functionality of the front panel.\nCVE-2019-10960 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nTri Quach reported this vulnerability to CISA.\n4. MITIGATIONS\nZebra has released a new version of the software that can be obtained at: https://www.zebra.com/linkos\nZebra recommends its printers should not be configured to be fully accessible via the Internet. Zebra further recommends that if a Zebra printer needs to be accessed from outside an organization’s secure network architecture, users use Weblink Technology (or similar tools) that provide a secure, encrypted connection to the user’s printer.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-10960"
  ],
  "techniques": [],
  "advisory": "icsa-19-232-01",
  "title": "Zebra Industrial Printers | CISA",
  "source": "ics-advisories",
  "id": "d20f901c45fda9ec64e63f14d2c5be51b23aae2931866b4ce9fa538db168564c"
}