{
  "markdown": "\nOVERVIEW\nAriele Caltabiano (kimiya) working with Trend Micro’s Zero Day Initiative (ZDI) has identified a heap memory corruption and two stack buffer overflow vulnerabilities in Fatek’s Automation PM and FV Designer applications. Fatek has not produced an update to mitigate these vulnerabilities. ZDI has coordinated with NCCIC/ICS-CERT. ZDI has published the PM Designer vulnerability.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following FATEK Automation products are affected:\n\nAutomation PM Designer V3 Version 2.1.2.2, and\nAutomation FV Designer Version 1.2.8.0\n\nIMPACT\nSuccessful exploitation of the reported vulnerabilities may allow an attacker to perform a number of malicious actions including denial of service and arbitrary code execution.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nFatek is a Taiwan-based company that maintains distribution offices in several countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia.\nThe affected products, Automation PM Designer and Automation FV Designer, are HMI programming software. According to Fatek, these products are deployed across several sectors including Commercial Facilities and Critical Manufacturing. Fatek estimates that these products are used primarily in Europe and Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFERCWE-119: Improper Restriction of Operations within the Bounds of a Memory Buffer, http://cwe.mitre.org/data/definitions/119.html, web site last accessed October 13, 2016.\n\nSending additional valid packets could allow the attacker to cause a crash or to execute arbitrary code.\nCVE-2016-5796NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-5796, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H, web site last accessed October 13, 2016.\n\nSTACK-BASED BUFFER OVERFLOWCWE-121: Stack-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121.html, web site last accessed October 13, 2016.\n\nBy sending additional valid packets, an attacker could trigger an overflow and cause a crash.\nCVE-2016-5798NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-5798 , NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H, web site last accessed October 13, 2016.\n\nBUFFER OVERFLOWCWE-121: Stack Buffer Overflow, http://cwe.mitre.org/data/definitions/121.html, web site last accessed October 13, 2016.\nA malicious attacker can trigger a remote buffer overflow on the Fatek Communication Server.\nCVE-2016-5800NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-5800, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H, web site last accessed October 13, 2016.\n\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nFATEK Automation has not responded to requests to work with ICS-CERT to mitigate these vulnerabilities.\nZDI has published the PM Designer vulnerability. It is available at:\nhttp://www.zerodayinitiative.com/advisories/ZDI-16-525/.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-5798",
    "CVE-2016-5800",
    "CVE-2016-5796"
  ],
  "techniques": [],
  "advisory": "icsa-16-287-06",
  "title": "FATEK Automation Designer Memory Corruption Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "f2d85bb22f578dd9e20f91eea405c76b8c2b52c9aa2faeb41957d6a9598d369c"
}