{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC CN 4100\nVulnerabilities: Improper Access Control, Incorrect Default Permissions\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain privilege escalation and bypass network isolation.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SIMATIC CN 4100, a communication node, are affected:\n\nSIMATIC CN 4100: all versions prior to V2.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER ACCESS CONTROL CWE-284\nAffected device consists of improper access controls in the configuration files that could lead to privilege escalation. An attacker could gain admin access with this vulnerability, leading to complete device control.\nCVE-2023-29130 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.2.2 INCORRECT DEFAULT PERMISSIONS CWE-276\nAffected device consists of an incorrect default value in the SSH configuration. This could allow an attacker to bypass network isolation.\nCVE-2023-29131 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:L).\n3.3 BACKGROUND\n\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\n\n\n\n\nCOUNTRIES/AREAS DEPLOYED: Worldwide\n\n\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n\n3.4 RESEARCHER\nMichael Klassen and Martin Floeck of BASF Security Team reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens  identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nSIMATIC CN 4100: Update to V2.5 or later version.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nFor more information, see the associated Siemens Security Advisory SSA-313488 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2023-29131",
    "CVE-2023-29130"
  ],
  "techniques": [],
  "advisory": "icsa-23-194-03",
  "title": "Siemens SIMATIC CN 4100 | CISA",
  "source": "ics-advisories",
  "id": "67b0cc01b65049074aee9425b2920570a52b5943232d205bc641323dec9f2662"
}