{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Nucleus\nVulnerability: Use of Insufficiently Random Values\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-103-14 Siemens Nucleus DNS that was published April 13, 2021, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to poison the DNS cache or spoof DNS resolving.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Nucleus products and versions are affected:\n--------- Begin Update A Part 1 of 1 ---------\n\nNucleus NET, All versions\nNucleus RTOS, All versions that include affected DNS modules\nNucleus ReadyStart, All versions prior to v2013.08\nNucleus Source Code, All versions that include the affected DNS modules\nVSTAR, All versions that include the affected DNS modules\n\n--------- End Update A Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nThe DNS client does not properly randomize UDP port numbers of DNS requests. This could allow an attacker to poison the DNS cache or spoof DNS resolving.\nCVE-2021-27393 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nNucleus NET users should upgrade to the latest versions of Nucleus ReadyStart or Nucleus 4.\nNucleus ReadyStart users should update to v2013.08 or later versions.\nAvoid using DNS client of affected versions.\nFor additional mitigation advice please contact customer support or the a Nucleus sales team.\n\nFor additional information, please refer to Siemens Security Advisory SSA-201384\nFor further inquiries on security vulnerabilities in Siemens’ products and solutions, please contact Siemens ProductCERT.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27393"
  ],
  "techniques": [],
  "advisory": "icsa-21-103-14",
  "title": "Siemens Nucleus DNS (Update A) | CISA",
  "source": "ics-advisories",
  "id": "e729a7a34715d7fd9724b12153a5615578fd6c31845e0a7c5ecfe666e7016f6b"
}