{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.4\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: LOGO! CMR, SIMATIC RTU 3000\nVulnerability: Use of Insufficiently Random Values\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-257-13 Siemens LOGO! CMR and SIMATIC RTU 3000 that was published September 14, 2021, on the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker with network access to the LAN interface of an affected device to hijack an ongoing connection or spoof a new one.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of LOGO! controllers and SIMATIC monitors are affected:\n--------- Begin Update A Part 1 of 2 ---------\n\nLOGO! CMR2020 (6GK7142-7BX00-0AX0): All versions prior to v2.2\nLOGO! CMR2040 (6GK7142-7EX00-0AX0): All versions prior to v2.2\nSIMATIC RTU 3000 family: All versions\nSIMATIC RTU3010C (6NH3112-0BA00-0XX0): All versions prior to v4.0.9\nSIMATIC RTU3030C (6NH3112-3BA00-0XX0): All versions prior to v4.0.9\nSIMATIC RTU3031C (6NH3112-3BB00-0XX0): All versions prior to v4.0.9\nSIMATIC RTU3041C (6NH3112-4BB00-0XX0): All versions prior to v4.0.9\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nThe underlying TCP/IP stack does not properly calculate the random numbers used as ISN (Initial Sequence Numbers). An adjacent attacker with network access to the LAN interface could interfere with traffic, spoof the connection, and gain access to sensitive information.\nCVE-2021-37186 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nLOGO! CMR2020 and CMR2040: Update to v2.2 or later version\n\n--------- Begin Update A Part 2 of 2 ---------\n\nSIMATIC RTU 3000 family: Update to v4.0.9 or later version\n\n--------- End Update A Part 2 of 2 ---------\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-316383\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-37186"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-13",
  "title": "Siemens LOGO! CMR and SIMATIC RTU 3000 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "eae6e01dd0981e419511923b0ec194f42bae3fb70ff0e500df313afc373307e3"
}