{
  "markdown": " Sixnet Universal Protocol Undocumented Function Codes (Update B) \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisorySixnet Universal Protocol Undocumented Function Codes (Update B)================================================================ Last Revised September 06, 2018 Alert Code ICSA\\-13\\-231\\-01BOVERVIEW-------- This updated advisory is a follow\\-up to the updated advisory titled ICSA\\-13\\-231\\-01A Sixnet Universal Protocol Undocumented Function Codes that was published August 26, 2013, on the ICS\\-CERT Web page.### **\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin Update B Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-** Researchers Kyle Stone and Mehdi Sabraoui have independently identified undocumented function codes in Sixnet’s universal protocol. Sixnet has produced a new version of the remote terminal unit (RTU) firmware that mitigates this vulnerability.### **\\-\\-\\-\\-\\-\\-\\-\\-\\- End Update B Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-\\-\\-** The Intelligent Systems Research Lab at the University of Louisville has tested the new version to validate that it resolves the vulnerability. This vulnerability could be exploited remotely.AFFECTED PRODUCTS----------------- The following Sixnet products are affected:* Versions older than UDR 2\\.0, and* RTU firmware older than Version 4\\.8IMPACT------ An attacker who has access to the network where this RTU is located may use undocumented function codes to obtain file descriptors and file sizes, to read and write to files, to create new files, or to open a shell on the target machine to execute arbitrary code. Impact to individual organizations depends on many factors that are unique to each organization. ICS‑CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Sixnet is a US\\-based company owned by Red Lion Controls. The affected RTU products, RTU firmware, are SCADA systems that send real\\-time data from distributed locations to a human\\-machine interface in a central location. According to Sixnet, their RTU products are deployed across several sectors including energy, transportation, commercial facilities, and finance. Sixnet estimates that these products are used primarily in North America, Europe, and Asia.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW#### UNDOCUMENTED FUNCTION CODESCWE\\-912: Hidden Functionality, http://cwe.mitre.org/data/definitions/912\\.html, Web site last accessed September 17, 2013\\. There are undocumented functions available to use in the Sixnet universal protocol. The researcher found six different opcodes that allow a user (or an attacker) to execute file and shell tasks. The device does not require an authenticated session before it accepts these opcodes. CVE\\-2013\\-2802NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2013\\-2802, Web site last accessed September 17, 2013\\. has been assigned to this vulnerability. A CVSS v2 base score of 10\\.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:C/I:C/A:C, Web site last accessed September 17, 2013\\.### VULNERABILITY DETAILS#### EXPLOITABILITY An attacker must have access to the network where the RTU is located.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY An attacker with a low skill would be able to exploit this vulnerability.MITIGATION---------- Sixnet has released a new version of the RTU firmware, Version 4\\.8, which adds authentication so that only authorized users may access the device. Please contact Sixnet supportContact Sixnet Tech Support, http://www.sixnet.com/department/technical\\-support\\-155\\.cfm, Web site last accessed September 17, 2013\\. for more information about this issue and firmware Version 4\\.8 at (518\\) 877\\-5173 or [support@sixnet.com](mailto:support@sixnet.com)  . Sixnet software and firmware downloads are available at the following location on its Web site:[http://www.sixnet.com/department/automation\\-devices\\-software\\-firmware\\-180\\.cfm](http://www.sixnet.com/department/automation-devices-software-firmware-180.cfm)  ICS‑CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. ICS\\-CERT also provides [a section for control systems security recommended practices](/ics/recommended-practices)  on the ICS\\-CERT Web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS‑CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B—Targeted Cyber Intrusion Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT Web page ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS‑CERT for tracking and correlation against other incidents.![]() This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Sixnet-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-13-231-01b)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2013-2802"
  ],
  "techniques": [],
  "advisory": "icsa-13-231-01b",
  "title": "Sixnet Universal Protocol Undocumented Function Codes (Update B) | CISA",
  "source": "ics-advisories",
  "id": "541718908501c29cd7ae1ac9a34b6cf5ceac678ba20add400e89d9b359750d46"
}