{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: Spectre RT Industrial Routers\nVulnerabilities: Improper Neutralization of Input During Web Page Generation, Cleartext Transmission of Sensitive Information, Improper Restriction of Excessive Authentication Attempts, Use of a Broken or Risky Cryptographic Algorithm, Use of Platform-Dependent Third-party Components\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow information disclosure, deletion of files, and remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Advantech Spectre RT Industrial Routers are affected:\n\nSpectre RT ERT351 firmware Versions 5.1.3 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION CWE-79\nThe affected product does not neutralize special characters in the error response, allowing attackers to use a reflected XSS attack.\nCVE-2019-18233 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N).\n3.2.2    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nLogin and password are transmitted in clear text form, which may allow an attacker to intercept the request.\nCVE-2019-18231 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3    IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\nInsufficient login authentication parameters required for the web application may allow an attacker to gain full access using a brute-force password attack.\nCVE-2019-18235 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nOutdated version of BusyBox password encryption is in use, which may allow an attacker to discover passwords.\nCVE-2018-20679, CVE-2016-6301, CVE-2015-9261, and others have been assigned to this version of BusyBox. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.5     USE OF PLATFORM-DEPENDENT THIRD-PARTY COMPONENTS CWE-1103\nOutdated version of OpenSSL is in use, which may allow an attacker to exploit known vulnerabilities in OpenSSL.\nCVE-2016-2842, CVE-2016-0799, CVE-2016-6304 and others have been assigned to this version of OpenSSL. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States, South America, Middle East\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nIlya Karpov and Evgeniy Druzhinin of Rostelecom-Solar and Vlad Komarov of ScadaX reported these vulnerabilities to CISA.\n4. MITIGATIONS\nFor additional information, please see Advantech Security Advisory SA-2021-01-01\nAdvantech recommends users update to Version 6.2.7 or later.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize a VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-18231",
    "CVE-2015-9261",
    "CVE-2016-6304",
    "CVE-2016-6301",
    "CVE-2016-2842",
    "CVE-2019-18235",
    "CVE-2018-20679",
    "CVE-2016-0799",
    "CVE-2019-18233"
  ],
  "techniques": [],
  "advisory": "icsa-21-054-03",
  "title": "Advantech Spectre RT Industrial Routers | CISA",
  "source": "ics-advisories",
  "id": "bbb08dc7ee2c9c7687b3bc0ef8cfb5401de16f8f44cfe0621717be13d15787e7"
}