{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.5\nATTENTION: Exploitable remotely\nVendor: OSIsoft LLC\nEquipment: OSIsoft PI Web API\nVulnerabilities: Inclusion of Sensitive Information in Log Files, Protection Mechanism Failure\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow direct attacks against the product and disclose sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of OSIsoft PI Web API, a RESTful service access layer, are affected:\n\nPI Web API 2018 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCLUSION OF SENSITIVE INFORMATION IN LOG FILES CWE-532\nSuccessful exploitation of this vulnerability may allow disclosure of sensitive information.\nCVE-2019-13515 has been assigned to this vulnerability. A CVSS v3 base score of 8.5 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    PROTECTION MECHANISM FAILURE CWE-693\nThe affected product is vulnerable to a direct attack due to a cross-site request forgery protection setting that has not taken effect.\nCVE-2019-13516 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Government Facilities, Healthcare and Public Health, Information Technology, Metals and Mining, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nOSIsoft reported these vulnerabilities to CISA.\n4. MITIGATIONS\nOSIsoft recommends users upgrade to PI Web API 2018 SP1 or later to resolve these issues. To download PI Web API 2018 SP1, please access the OSIsoft customer portal (login required).\nTo avoid exposing sensitive information in the PI Web API Application Debug log, ensure that the Debug log is disabled on the Windows machine running PI Web API. Follow these steps to disable the Debug log:\n1.    Open Command Prompt and run the command eventvwr.msc.\n2.    Navigate to View > Show Analytic and Debug Logs.\n3.    Under Applications and Services Logs, find the PIWebAPI folder.\n4.    Right click on the log entitled Debug, and click Disable Log.\nAlso be sure to clear existing entries in the Debug log.\nAssuming the log is Disabled but contains Events (e.g., after a troubleshooting session), enable the log and then disable it immediately.\nIf the log is already enabled, disable it, enable it, and finally disable it again to wipe out the contents.\nThe CSRF defense is enabled by default in new installations of PI Web API. OSIsoft recommends leaving the EnableCSRFDefense configuration setting unchanged so that the CSRF defense is always in effect. If it is necessary to toggle this setting, OSIsoft recommends restarting the PI Web API service after changing the state.\nFor more information on these vulnerabilities, please refer to OSIsoft’s Security Bulletin:\nPI Web API Multiple security vulnerabilities resolved\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-13516",
    "CVE-2019-13515"
  ],
  "techniques": [],
  "advisory": "icsa-19-225-02",
  "title": "OSIsoft PI Web API | CISA",
  "source": "ics-advisories",
  "id": "2ed22e58f3e7d49e37f1214fcc2302b3f5ebd8a130b677e47c93143ee7a8124b"
}