{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SICAM TOOLBOX II\nVulnerability: Use of Hard-coded Credentials\n\n2. UPDATE INFORMATION\nThis advisory update is a follow-up to the original advisory titled ICSA-22-041-05 SICAM TOOLBOX II that was published February 10, 2022, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker access through an exploitable access control.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SICAM TOOLBOX II, a software platform, are affected:\n\nSICAM TOOLBOX II: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nAffected applications use an exploitable access control within a database service, which could allow an attacker to access the database.\nCVE-2021-45106 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\n------- Begin Update A Part 1 of 2 -------\nThomas Riedmaier from Siemens Energy, and Matan Dobrushin and Eran Jacob from OTORIO reported this vulnerability to Siemens.\n------- End Update A Part 1 of 2 -------\n5. MITIGATIONS\nSiemens has identified the following mitigation users can apply to reduce the risk:\n------- Begin Update A Part 2 of 2 --------\n\nRestrict Port 1522/TCP access to localhost or specific IP addresses only, as documented in the updated security manual (chapter 3.6.7) included in the SICAM TOOLBOX II v07.01 package.\n\n------- End Update A Part 2 of 2 -------\n\nThe security manual is included within the SICAM TOOLBOX II package that can be downloaded from SIOS.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.  \nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens Security Advisory SSA-669737\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2021-45106"
  ],
  "techniques": [],
  "advisory": "icsa-22-041-05",
  "title": "Siemens SICAM TOOLBOX II (Update A) | CISA",
  "source": "ics-advisories",
  "id": "9f4391fda7f14fa828e21a3cee79ad36f33b76180b6bdeeb1e0485c436d0ec54"
}