{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ABB\nEquipment: Asset Suite\nVulnerability: Authorization Bypass Through User-Controlled Key\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker access to unauthorized information in the application by direct resource access.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Asset Suite are affected:\n\nAsset Suite Versions 9.6 and prior, excluding 9.4.2.6 and 9.5.3.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHORIZATION BYPASS THROUGH USER-CONTROLLED KEY CWE-639\nThere is a flaw in the access controls used to limit user access to resources. If an attacker knows, or were to discover, the URL for a resource they do not have permissions to, they would be able to access the resource by browsing directly to the URL. \nCVE-2019-18998 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nABB reported this vulnerability to CISA.\n4. MITIGATIONS\nABB recommends users apply the update as soon as they are able. The following updates mitigate this vulnerability:\n\nVersions 9.4.2.6, 9.5.3.2, and 9.6.1\n\nFor additional information and support, please contact your local ABB service organization. For contact information, see https://new.abb.com/contact-centers or visit http://www.abb.com/cybersecurity\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-18998"
  ],
  "techniques": [],
  "advisory": "icsa-20-072-02",
  "title": "ABB Asset Suite | CISA",
  "source": "ics-advisories",
  "id": "eb5441adf818da72f44dc9134a8213b146485b9123230bb1cf2227659f36d4c9"
}