{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: Reyrolle\nVulnerabilities: Missing Authorization, Improper Input Validation, Improper Authentication\nAFFECTED PRODUCTS\nSiemens reports that the vulnerabilities affect the following Reyrolle integration, control, measurement, and automation products:\n\nEN100 Ethernet modules as optional for Reyrolle: All versions prior to V4.29.01\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to access sensitive device information, circumvent authentication, and perform administrative actions.\nMITIGATION\nSiemens has released a new firmware version (V4.29.01) to address these vulnerabilities. It can be found at the SIPROTEC 4 downloads area at the following Siemens web site:\nhttp://www.siemens.com/downloads/siprotec-4\nSiemens recommends users protect network access with appropriate mechanisms such as firewalls, segmentation, and VPN. Siemens also advises that users configure the operational environment according to Siemens’ Operational Guidelines for Industrial Security. Please see the specific product manual for more information. Manuals can be obtained from the downloads menu at the following Siemens web site:\nhttp://www.siemens.com/gridsecurity\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-452237 at the following location:\nhttp://www.siemens.com/cert/advisories\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nMISSING AUTHORIZATION CWE-862\n\nThe integrated web server (Port 80/TCP) of the affected devices could allow remote attackers to obtain sensitive device information if network access was obtained.\nCVE-2016-4784 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nMISSING AUTHORIZATION CWE-862\n\nThe integrated web server (Port 80/TCP) of the affected devices could allow remote attackers to obtain a limited amount of device memory content if network access was obtained.\nCVE-2016-4785 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nMISSING AUTHORIZATION CWE-862\n\nAttackers with network access to the device’s web interface (Port 80/TCP) could possibly circumvent authentication and perform certain administrative operations.\nCVE-2016-7112 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nIMPROPER INPUT VALIDATION CWE-20\n\nSpecially crafted packets sent to Port 80/TCP could cause the affected device to go into defect mode.\nCVE-2016-7113 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nIMPROPER AUTHENTICATION CWE-287\n\nAttackers with network access to the device’s web interface (Port 80/TCP) could possibly circumvent authentication and perform certain administrative operations. A legitimate user must be logged into the web interface for the attack to be successful.\nCVE-2016-7114 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\nRESEARCHER\nSiemens reported these vulnerabilities to ICS-CERT when they made firmware available to fix them.\nBACKGROUND\nCritical Infrastructure Sector: Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2016-7112",
    "CVE-2016-7113",
    "CVE-2016-7114",
    "CVE-2016-4784",
    "CVE-2016-4785"
  ],
  "techniques": [],
  "advisory": "icsa-17-187-02",
  "title": "Siemens Reyrolle | CISA",
  "source": "ics-advisories",
  "id": "726a830e0a624fcb772f5bc50440cedf9e07e445e2833dfa2dc50667343287b7"
}