{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.7\n\nATTENTION: Exploitable remotely\nVendor: Schneider Electric\nEquipment: Modicon M221\nVulnerabilities: Information Management Errors, Permissions, Privileges, and Access Controls\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow unauthorized users to replay authentication sequences, overwrite passwords, or decode passwords.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports the vulnerabilities affect the following Modicon M221 products: \n\nModicon M221, all references, all versions prior to firmware v1.6.2.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INFORMATION MANAGEMENT ERRORS CWE-199\nThis vulnerability allows unauthorized users to replay authentication sequences.If an attacker exploits this vulnerability and connects to a Modicon M221, the attacker may upload the original program from the PLC. \nCVE-2018-7790 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:L).\n3.2.2    PERMISSIONS, PRIVILEGES, AND ACCESS CONTROLS CWE-264\nThis vulnerability allows unauthorized users to overwrite the original password.If an attacker exploits this vulnerability and overwrites the password, the attacker may upload the original program from the PLC. \nCVE-2018-7791 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:L).\n3.2.3    PERMISSIONS, PRIVILEGES, AND ACCESS CONTROLS CWE-264\nThis vulnerability allows unauthorized users to decode the password using a rainbow table. \nCVE-2018-7792 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nIrfan Ahmed, Hyunguk Yoo, Sushma Kalle, and Nehal Ameen of the University of New Orleans reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nA fix for these vulnerabilities is implemented in Modicon M221 Firmware v1.6.2.0, delivered within SoMachine Basic v1.6 SP2, which is available for download below, or by using Schneider Electric Software Update tool:\nhttps://www.schneider-electric.com/en/download/document/SoMachineBasicV1.6SP2/\nAs a temporary mitigation, Modicon M221 users should take the following measures:\n\nSet up a firewall blocking all remote/external access to Port 502.\nWithin the Modicon M221 application, users must disable all unused protocols, especially programming protocol, as described in section “Configuring Ethernet Network” of SoMachine Basic online help. This will prevent remote programming of the M221 PLC.\n\nSchneider Electric’s security notice SEVD-2018-235-01 is available at the following location:\nhttps://www.schneider-electric.com/en/download/document/SEVD-2018-235-01/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-7790",
    "CVE-2018-7792",
    "CVE-2018-7791"
  ],
  "techniques": [],
  "advisory": "icsa-18-240-01",
  "title": "Schneider Electric Modicon M221 | CISA",
  "source": "ics-advisories",
  "id": "126ae288098bbdf49826d12ac1d06963199118087594b18b0d2b625b8976addd"
}