{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: ThinManager\nVulnerabilities: Inadequate Encryption Strength\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to decrypt traffic sent between the client and server application programming interface (API), resulting in unauthorized access to information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ThinManager, a software management platform, are affected:\n\nThinManager: Versions 13.0 to 13.0.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INADEQUATE ENCRYPTION STRENGTH CWE-326\nThe affected product allows the use of medium-strength ciphers. If the client requests an insecure cipher, then a malicious actor could decrypt traffic sent between the client and server API.\nCVE-2023-2443 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nUsers of the affected software are encouraged to apply risk mitigations when possible and implement Rockwell Automation’s suggested security best practices to minimize risk of vulnerability exploitation.\n\nUpgrade to v13.0.2.\nDo not use 3DES encryption algorithm.\nReference Recommended Security Guidelines from Rockwell Automation.\nFor additional information, refer to Rockwell Automation’s Security Bulletin.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-2443"
  ],
  "techniques": [],
  "advisory": "icsa-23-131-15",
  "title": "Rockwell Automation ThinManager | CISA",
  "source": "ics-advisories",
  "id": "d1ffdf3f4eb9d703930d362fcb3bf122d113affd53ad9474dd720e85d1af68e6"
}