{
  "markdown": "\nOVERVIEW\nTencent’s Keen Security Lab has identified a Gateway ECU vulnerability in Tesla Motors Inc.’s (Tesla) Model S automobile. Tesla has produced an over-the-air firmware update to mitigate this vulnerability.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nThe following vehicle firmware build versions are affected:\n\nAll firmware versions before version 7.1 (2.36.31) with web browser functionality enabled.\n\nIMPACT\nThe vulnerability allows the vehicle’s software and driving functions to be controlled remotely through the web browser, which must be launched or already running from a previous launch. This allows attackers to gain access to the vehicle’s CAN bus through a firmware validation flaw in the Gateway ECU of the vehicle.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nTesla is a US-based company that maintains offices in several countries around the world, including the US, Netherlands, and Japan.\nThe affected vehicle firmware manages the car’s software and driving functions. According to Tesla, the software is deployed in the Transportation sector. Tesla reports that this product is used primarily in the United States, Europe, and Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nCOMMAND INJECTIONCWE-77: Improper Neutralization of Special Elements used in a Command ('Command Injection'), https://cwe.mitre.org/data/definitions/77.html, web site last accessed December 06, 2016.\n\nThe vehicle’s Gateway ECU is susceptible to commands that may allow an attacker to install malicious software allowing the attacker to send messages to the vehicle’s CAN bus.\nCVE-2016-9337NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9337, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:H/A:H, web site last accessed December 06, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult. A complex chain of exploits is required, including a web browser compromise, local privilege escalation, and custom-built firmware.\nMITIGATION\nOn September 18, 2016, Tesla produced an over-the-air firmware update for vehicles affected by this vulnerability. Owners of the vehicles are encouraged to update their vehicle to the latest firmware.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nNot use the web browser in their vehicles if they have not updated to the latest firmware.\nContact Tesla support if they need more information on how to upgrade to the latest firmware.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-9337"
  ],
  "techniques": [],
  "advisory": "icsa-16-341-01",
  "title": "Tesla Gateway ECU Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "7aa0c35cc4853ea3d0d0930138425a6bd50106a94c5a3f6ef3cec97c48ab6bc3"
}