{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: RTU500 Series\nVulnerabilities: Type Confusion, Reachable Assertion\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause a denial-of-service condition in the affected version of the RTU500 series product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of RTU500 Series, a remote terminal unit, are affected:\n\nRTU500 Series CMU Firmware Version 12.4.X\nRTU500 Series CMU Firmware Version 12.6.X\nRTU500 Series CMU Firmware Version 12.7.X\nRTU500 Series CMU Firmware Version 13.0.X\nRTU500 Series CMU Firmware Version 13.1.X\nRTU500 Series CMU Firmware Version 13.2.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nA vulnerability exists in the affected OpenLDAP versions leading to an LDAP service crash in the parsing of a keystring, resulting in a denial-of-service condition.\nCVE-2020-36229 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    REACHABLE ASSERTION CWE-617\nA vulnerability exists in the affected OpenLDAP versions leading in an assertion failure in an LDAP service in the parsing of a file, resulting in a denial-of-service condition.\nCVE-2020-36230 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy recommends users update to the following versions:\n\nRTU500 series CMU Firmware Versions 12.4.X to Version 12.4.11 (to be released by end of January 2022)\nRTU500 series CMU Firmware Versions 12.6.X to Version 12.6.7\nRTU500 series CMU Firmware Versions 12.7.X to Version 12.7.2\nRTU500 series CMU Firmware Versions 13.0.X to Version 13.2.3\nRTU500 series CMU Firmware Versions 13.1.X to Version 13.2.3\nRTU500 series CMU Firmware Versions 13.2.X to Version 13.2.3\n\nAs the vulnerabilities affect only the RTU500 series in which CAM function is configured and enabled, a possible mitigation is to disable the CAM function if it is not used.\nThe CAM function is disabled by default.\nHitachi Energy recommends the following security practices and firewall configurations to help protect process control networks from attacks that originate outside the network:\n\nPhysically protect process control systems from direct access by unauthorized personnel.\nDo not directly connect to the Internet.\nSeparate from other networks by means of a firewall system that has a minimal number of ports exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving emails.\n\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system. Please see Hitachi Energy advisory 8DBD000066 for further mitigation and update information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-36230",
    "CVE-2020-36229"
  ],
  "techniques": [],
  "advisory": "icsa-21-341-01",
  "title": "Hitachi Energy RTU500 OpenLDAP | CISA",
  "source": "ics-advisories",
  "id": "beddc452142d080c51e2f8f2cd158612fa8ae90e1fb11f682136d9be9c6005ac"
}