{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: Advantech\nEquipment: Advantech WebAccess HMI Designer\nVulnerabilities: Heap-based Buffer Overflow, Double Free, Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to remotely execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version of Advantech WebAccess HMI Designer, a Human Machine Interface (HMI) Runtime Development Software, is affected:\n\nAdvantech WebAccess HMI Designer, Version 2.1.7.32 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 HEAP-BASED BUFFER OVERFLOW CWE-122\nHeap-based buffer overflow vulnerabilities caused by processing specially crafted .pm3 files may allow remote code execution.\nCVE-2018-8833 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n3.2.2 DOUBLE FREE CWE-415\nDouble free vulnerabilities caused by processing specially crafted .pm3 files may allow remote code execution.\nCVE-2018-8835 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n3.2.3 OUT-OF-BOUNDS WRITE CWE-787\nProcessing specially crafted .pm3 files may cause the system to write outside the intended buffer area and may allow remote code execution.\nCVE-2018-8837 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: East Asia, United States, Europe\nCompany Headquarters Location: Taiwan\n\n3.4 RESEARCHER\nSteven Seeley of Source Incite working with Trend Micro’s Zero Day Initiative (ZDI) reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nNCCIC is working with Advantech to provide mitigation steps to resolve the issues that have been reported in Advantech’s WebAccess HMI Designer.\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-8837",
    "CVE-2018-8835",
    "CVE-2018-8833"
  ],
  "techniques": [],
  "advisory": "icsa-18-114-03",
  "title": "Advantech WebAccess HMI Designer | CISA",
  "source": "ics-advisories",
  "id": "3f26800cd96afb8b36c4ca90aa7e9fda8ee77d9235855bcd5a4c349656e4308e"
}