{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Low attack complexity\nVendor: Delta Electronics\nEquipment: CNCSoft\nVulnerability: Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow information disclosure or an application crash.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CNCSoft industrial automation software are affected:\n\nCNCSoft Versions 1.01.30 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read while processing a specific project file, which may allow an attacker to disclose information.\nCVE-2021-44768 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nMichael Heinzl reported this vulnerability to CISA.\n4. MITIGATIONS\nDelta Electronics recommends users upgrade to the latest available patch.\nDelta Electronics also recommends users apply the following mitigations to reduce the risk of exploit:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThis vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-44768"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-02",
  "title": "Delta Electronics CNCSoft | CISA",
  "source": "ics-advisories",
  "id": "2cc3f494b1be2c556bbab759ec21ee05d037e110613bbf5819a782be630b25f9"
}