{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4,3\nATTENTION: Exploitable from adjacent network/low skill level to exploit\nVendor: Tridium\nEquipment: Niagara\nVulnerability: Synchronous Access of Remote Resource without Timeout\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Niagara are affected:\n\nNiagara: Versions 4.6.96.28, 4.7.109.20, 4.7.110.32, 4.8.0.110\nNiagara Enterprise Security: Versions 2.4.31, 2.4.45, 4.8.0.35\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    SYNCHRONOUS ACCESS OF REMOTE RESOURCE WITHOUT TIMEOUT CWE-1088\nA timeout during a TLS handshake can result in the connection failing to terminate. This can result in a Niagara thread hanging and requires a manual restart to correct. \nCVE-2020-14483 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Government Facilities, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nHoneywell reported this vulnerability to CISA.\n4. MITIGATIONS\nTridium has released updates that mitigate this vulnerability and recommends users update to the versions identified below:\n\nNiagara 4.9.0.198\nNiagara Enterprise Security 4.9.0.60\n\nUpdates are available by contacting the sales support channel or by contacting the Tridium support team at support@tridium.com\nAll Tridium Niagara users for all supported platforms are encouraged to update their systems with these releases to mitigate risk. For further guidance, please contact a Tridium account manager or Customer Support.\nIn addition to updating to the latest version, Tridium recommends users with affected products take the following steps:\n\nReview and validate the list of authorized users who can authenticate to Niagara.\nAllow only trained and trusted persons to have physical access to the system, including devices with connection to the system though the Ethernet port.\nIf remote connections to the network are required, consider using a VPN or other means to ensure secure remote connections into the network.\n\nFor more information please refer to Security Bulletin SB 2020-Tridium-2.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-14483"
  ],
  "techniques": [],
  "advisory": "icsa-20-224-03",
  "title": "Tridium Niagara | CISA",
  "source": "ics-advisories",
  "id": "090c7a07b80bf311bd3cbecbdbe1c263ff0ae0104701df1cf3f44534a230a801"
}