{
  "markdown": "\nCVSS V3 7.3\nATTENTION: Remotely exploitable/Low skill level to exploit\nVendor: Schneider Electric\nEquipment: Wonderware Historian\nVulnerability: Credentials Management\nAFFECTED PRODUCTS\nThe following Wonderware Historian versions are affected:\n\nWonderware Historian 2014 R2 SP1 P01 and earlier.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a malicious entity to compromise Historian databases. In some installation scenarios, SQL resources beyond those created by Wonderware Historian may be compromised as well.\nMITIGATION\nSchneider Electric strongly recommends that the following steps be taken to mitigate this vulnerability:\n\nIdentify where the logins are used. Some likely places for the logins to have been used are:\n\n\nWonderware Historian Client,\nWonderware InTouch and Application Object scripts,\nWonderware Information Server configuration, and\nCustom applications not supplied by Schneider Electric that interact with Historian data.\n\n\nLogins that are not used should be disabled from the SQL Server Management Studio.\nFor logins that are still in use, the passwords should be changed from the default.\n\nFor an increased level of security, Schneider Electric and Microsoft further advise that connectivity to SQL Server be accomplished with Windows Integrated Security as opposed to using native SQL logins.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable. Low skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nCREDENTIALS MANAGEMENT CWE-255\n\nWonderware Historian creates logins with default passwords, which can allow a malicious entity to compromise Historian databases. In some installation scenarios, resources beyond those created by Wonderware Historian may be compromised as well.\nCVE-2017-5155 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\nRESEARCHER\nRuslan Habalov and Jan Bee of the Google ISA Assessments Team discovered this vulnerability.\n",
  "cves": [
    "CVE-2017-5155"
  ],
  "techniques": [],
  "advisory": "icsa-17-024-01",
  "title": "Schneider Electric Wonderware Historian | CISA",
  "source": "ics-advisories",
  "id": "0a627452cc8bbb85a2c266652ba81a444ae6a8bb8d4867a6827f913c126857e8"
}