{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: IDEC\nEquipment: PLCs (Programmable Logic Controllers)\nVulnerabilities: Unprotected Transport of Credentials, Plaintext Storage of a Password\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to upload, alter, and/or download the PLC user program. An attacker could also access the PLC web server and hijack the controllers, resulting in the manipulation and/or suspension of the PLC output.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following IDEC PLCs are affected:\n\nFC6A MICROSmart All-in-One CPU Module: v2.32 and earlier\nFC6B MICROSmart All-in-One CPU Module: v2.31 and earlier\nFC6A MICROSmart Plus CPU Module: v1.91 and earlier\nFC6B MICROSmart Plus CPU Module: v2.31 and earlier\nFT1A Controller SmartAXIS Pro/Lite: v2.31 and earlier\nWindLDR: v8.19.1 and earlier\nWindEDIT Lite: v1.3.1 and earlier\nData File Manager: v2.12.1 and earlier\nFC6A MICROSmart All-in-One CPU Module: v2.32 and earlier\nFC6A MICROSmart Plus CPU Module: v1.91 and earlier\nWindLDR: v8.19.1 and earlier\nWindEDIT: Lite v1.3.1 and earlier\nData File Manager: v2.12.1 and earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNPROTECTED TRANSPORT OF CREDENTIALS CWE-523\nAn attacker may obtain the user credentials from the communication between the PLC and the software. As a result, the PLC user program may be uploaded, altered, and/or downloaded.\nCVE-2021-37400 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n3.2.2    PLAINTEXT STORAGE OF A PASSWORD CWE-256\nAn attacker may obtain the user credentials from file servers, backup repositories, or ZLD files saved in SD cards. As a result, the PLC user program may be uploaded, altered, and/or downloaded.\nCVE-2021-37401 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n3.2.3    UNPROTECTED TRANSPORT OF CREDENTIALS CWE-523\nAn attacker may obtain the PLC web server user credentials from the communication between the PLC and the software. As a result, the complete access privileges to the PLC web server may be obtained, and manipulation of the PLC output and/or suspension of the PLC may be conducted.\nCVE-2021-20826 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n3.2.4    PLAINTEXT STORAGE OF A PASSWORD CWE-256\nAn attacker may obtain the PLC web server user credentials from file servers, backup repositories, or ZLD files saved in SD cards. As a result, the attacker may access the PLC web server and hijack the PLC, and manipulation of the PLC output and/or suspension of the PLC may be conducted.\nCVE-2021-20827 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nKhalid Ansari of FM Approvals reported these vulnerabilities to IDEC Corporation.\n4. MITIGATIONS\nApply the appropriate software update according to the information provided by the developer.\n\nFC6A MICROSmart All-in-One CPU Module: v2.40 and later\nFC6B MICROSmart All-in-One CPU Module: v2.40 and later\nFC6A MICROSmart Plus CPU Module: v2.00 and later\nFC6B MICROSmart Plus CPU Module: v2.40 and later\nFT1A Controller SmartAXIS Pro/Lite: v2.40 and later\nWindLDR: v8.20.0 and later\nWindEDIT Lite: v1.4.0 and later\nData File Manager: v2.13.0 and later\n\nApplying the below workarounds can mitigate the impacts of these vulnerabilities.\n\nRestrict the network appropriately to prevent suspicious connections from untrusted devices\nRestrict the devices that can access PLCs\nManage ZLD files appropriately\n\nFor more information, refer to the information provided by the developer (document in Japanese).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-37401",
    "CVE-2021-20826",
    "CVE-2021-37400",
    "CVE-2021-20827"
  ],
  "techniques": [],
  "advisory": "icsa-22-006-03",
  "title": "IDEC PLCs | CISA",
  "source": "ics-advisories",
  "id": "8627f52a9164f33bd63b9666b416c42be6ca50aede93042e345588f73215192e"
}