{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low skill level to exploit\nVendor: M&M Software GmbH, a subsidiary of WAGO Kontakttechnik\nEquipment: fdtCONTAINER\nVulnerability: Deserialization of Untrusted Data\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-021-05 WAGO M&M Software fdtCONTAINER (Update B) that was published February 16, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nIf an attacker can socially engineer a valid user into loading a manipulated project file, malicious code can be executed without notice.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products are affected:\n\nfdtCONTAINER component\n\nVersions between 3.5.0 and 3.5.20304.x\nVersions between 3.6.0 and 3.6.20304.x\nVersions older than 3.5\n\n\nfdtCONTAINER application\n\nVersions between 4.5.0 and 4.5.20304.x\nVersions between 4.6.0 and 4.6.20304.x\nVersions older than 4.5\n\n\ndtmINSPECTOR Version 3 (Based on FDT 1.2.x)\n\nThere are reports indicating the following products incorporate the affected component:\n\nEmerson Rosemount Transmitter Interface Software (RTIS) SKUs: 04088-9000-0001, 4088-9000-0002, and 7000003-312\nPEPPERL+FUCHS PACTware 5.0, up to and including Version 5.0.5.31\nWeidmüller WI Manager up to and including Version 2.5.1\n\n--------- Begin Update C Part 1 of 1 ---------\n\nMitsubishi Electric MELSOFT FieldDeviceConfigurator, Versions 1.05 F and prior\n\n--------- End Update C Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA vulnerability has been discovered in the fdtCONTAINER component issued by M&M Software and used by other products, including RTIS and PACTware. An attacker could exploit this vulnerability on the workstation by supplying/providing a manipulated project file. If that manipulated project file is loaded, malicious code could be executed without notice. \nCVE-2020-12525 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nEmerson reported this vulnerability to CISA and M&M Software.\n5. MITIGATIONS\nM&M Software recommends users choose one of the following solutions:\n\nUpdate the fdtCONTAINER component/fdtCONTAINER application to a version that provides a more secure deserialization of the project data. This version will still use a deprecated serialization technology but will fix the currently known attack vector and will be compatible with existing, non-manipulated project files.\nUpdate the fdtCONTAINER component/fdtCONTAINER application to a version (fdtCONTAINER component: 3.7 or newer, fdtCONTAINER application: 4.7 or newer) that provides a secure deserialization of the project data with an updated serialization technology. This will break the compatibility to existing, non-manipulated project files.\n\nThe CERT@VDE advisory for M&M Software also recommends the following mitigation practices:\n\nExchange project data only via secure exchange services.\nUse appropriate means to protect the project storage from unauthorized manipulation.\nDo not open project data from an unknown source.\nReduce the user rights of the host application to the necessary minimum.\n\nEmerson has published a notification (EMR.RMT20004.Rev3) for this vulnerability in RTIS. RTIS users should review this notification for additional information specific to RTIS.\nCERT@VDE has published an advisory (VDE-2021-001) for this vulnerability in PEPPERL+FUCHS PACTware.\nCERT@VDE has published an advisory (VDE-2021-002) for this vulnerability in Weidmüller FDT/DTM Software with WI Manager.\nMitsubishi Electric has published advisory 2020-020 concerning the vulnerability in MELSOFT FieldDeviceConfigurator.\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nEnsure the least-privilege user principle is followed.\nDo not open project files from untrusted sources.\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2020-12525"
  ],
  "techniques": [],
  "advisory": "icsa-21-021-05",
  "title": "WAGO M&M Software fdtCONTAINER (Update C) | CISA",
  "source": "ics-advisories",
  "id": "410b5e383afa0e73b3796a8add8669f23991e8f8c13f6668133e8ff04d1d07da"
}