{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 7.1\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available\nVendor: Advantech\nEquipment: WebAccess/SCADA\nVulnerability: SQL Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated attacker to read or modify a remote database.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Advantech WebAccess/SCADA, a browser-based SCADA software, are affected:\n\nWebAccess/SCADA: Version 9.1.5U\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89:\nThere is a SQL Injection vulnerability in Advantech's WebAccess/SCADA software that allows an authenticated attacker to remotely inject SQL code on the database. Successful exploitation of this vulnerability could allow an attacker to read or modify data on the remote database.\nCVE-2024-2453 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:N).\nCVE-2024-2453 has been assigned to this vulnerability. A CVSS v4 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:L/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nCISA discovered a public Proof of Concept (PoC) as authored by Prześlij Komentarz and reported it to Advantech.\n4. MITIGATIONS\nAdvantech recommends updating WebAccess/SCADA to version 9.1.6 or higher to mitigate this vulnerability.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n5. UPDATE HISTORY\n\nMarch 21, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-2453"
  ],
  "techniques": [],
  "advisory": "icsa-24-081-01",
  "title": "Advantech WebAccess/SCADA | CISA",
  "source": "ics-advisories",
  "id": "cc3e2583a46fb34f2dae9cdc9a389a3248226e97f65c3510e6d351e479a3f3e4"
}