{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: CODESYS, GmbH\nEquipment: CODESYS V2 web server\nVulnerabilities: Stack-based Buffer Overflow, Improper Access Control, Buffer Copy without Checking Size of Input, Improperly Implemented Security Check, Out-of-bounds Write, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to read or write arbitrary memory or files in the CODESYS Control runtime system, cause invalid memory accesses to execute code, or crash the CODESYS web server or CODESYS Control runtime system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nCODESYS reports all CODESYS V2 web servers running stand-alone or as part of the CODESYS runtime system prior to Version 1.1.9.20 are affected.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nCrafted web server requests may cause a stack-based buffer overflow. This could allow an attacker to execute arbitrary code on the CODESYS web server or trigger a denial-of-service condition due to a crash in the CODESYS web server.\nCVE-2021-30189 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER ACCESS CONTROL CWE-284\nThe user management of the CODESYS v2.3 WebVisu allows user dependent control of access to the visualization pages. However, subordinate requests to read or write values are forwarded to the CODESYS Control runtime system regardless of successful authentication. This enables crafted web server requests to bypass user management and read or write values on the PLC without authentication.\nCVE-2021-30190 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    CLASSIC BUFFER OVERFLOW CWE-120\nCrafted web server requests can cause an over-read or over-write of a buffer in the CODESYS web server, which typically leads to a denial-of-service condition.\nCVE-2021-30191 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    IMPROPERLY IMPLEMENTED SECURITY CHECK CWE-358\nCrafted web server requests can bypass the security checks for boot project-related files on the CODESYS Control runtime system and be uploaded from the CODESYS Control runtime system.\nCVE-2021-30192 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.5    OUT-OF-BOUNDS WRITE CWE-787\nCrafted web server requests can be utilized to write arbitrary memory in the CODESYS Control runtime system. This could allow an attacker to execute code on the CODESYS Control runtime system or cause a denial-of-service condition due to a crash of the CODESYS Control runtime system.\nCVE-2021-30193 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.6    OUT-OF-BOUNDS READ CWE-125\nCrafted web server requests can be utilized to read arbitrary memory in the CODESYS Control runtime system or crash the CODESYS web server.\nCVE-2021-30194 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nVyacheslav Moskvin, Sergey Fedonin, and Anton Dorfman of Positive Technologies reported these vulnerabilities to CODESYS.\n4. MITIGATIONS\nCODESYS GmbH has released Version 1.1.9.20 of the CODESYS V2 web server to address these vulnerabilities. This version of the CODESYS V2 web server is also part of the CODESYS Development System setup Version 2.3.9.66\nPlease visit the CODESYS update area for more information on how to obtain the software updates.\nAs part of a security strategy, CODESYS recommends the following general defense measures to reduce the risk of exploits:\n\nUse controllers and devices only in a protected environment to minimize network exposure, ensuring they are not accessible from outside.\nUse firewalls to protect and separate the control system network from other networks.\nUse VPN (virtual private network) tunnels if remote access is required.\nActivate and apply user management and password features.\nUse encrypted communication links.\nLimit access to both development and control system by physical means, operating system features, etc.\nProtect both development and control system operations by using up to date virus detecting solutions.\n\nFor more information and general recommendations for protecting machines and plants, see also the CODESYS Security Whitepaper.\nPlease see CODESYS Advisory 2021-07 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-30192",
    "CVE-2021-30190",
    "CVE-2021-30189",
    "CVE-2021-30193",
    "CVE-2021-30194",
    "CVE-2021-30191"
  ],
  "techniques": [],
  "advisory": "icsa-21-173-02",
  "title": "CODESYS V2 web server | CISA",
  "source": "ics-advisories",
  "id": "55c6bce68aa833c659e27da093af91c09c59f4dacba6c01bf46b1e529284eee3"
}