{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC, SINEC-NMS, SINEMA, SINEMURIK Industrial Control Products with OPC UA\nVulnerability: Uncaught Exception\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-19-099-03 Siemens Industrial Products with OPC UA (Update G) that was posted April 14, 2022, on the ICS webpage on www.cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition on the affected service or device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens industrial products are affected:\n\nSIMATIC CP443-1 OPC UA (including SIPLUS NET variants): all versions\nSIMATIC ET 200 Open Controller CPU 1515SP PC2 (including SIPLUS variants): all versions prior to v2.7\nSIMATIC HMI Comfort Outdoor Panels 7\" & 15\" (including SIPLUS variants): all versions prior to v15.1 Upd 4\nSIMATIC HMI Comfort Panels 4\" 22\" (including SIPLUS variants): all versions prior to v15.1 Upd 4\nSIMATIC HMI KTP Mobile Panels KTP400F, KTP700, KTP700F, KTP900, KTP900F (including SIPLUS variants): all versions prior to v15.1 Upd 4\nSIMATIC IPC DiagMonitor: all versions prior to v5.1.3\nSIMATIC NET PC Software v13: all versions\nSIMATIC NET PC Software v14: all versions prior to v14 SP1 Update 14\nSIMATIC NET PC Software v15: all versions\nSIMATIC RF188C: all versions prior to v1.1.0\nSIMATIC RF600R: all versions prior to v3.2.1\nSIMATIC S7-1500 CPU Family (including related ET200 CPUs and SIPLUS variants): all versions, v2.5 and newer, and prior to v2.6.1\nSIMATIC S7-1500 Software Controller: all versions between v2.5 (including) and v2.7 (excluding)\nSIMATIC WinCC OA: all versions prior to v3.15-P018\nSIMATIC WinCC Runtime Advanced: all versions prior to v15.1 Upd 4\nSINEC-NMS: all versions prior to v1.0 SP1\nSINEMA Server: all versions prior to v14 SP2\nSINUMERIK OPC UA Server: all versions prior to v2.1\n\n--------- Begin Update H Part 1 of 2 ---------\n\nTeleControl Server Basic: all versions prior to v3.1.1\n\n--------- End Update H Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCAUGHT EXCEPTION CWE-248\nSpecially crafted network packets sent to affected devices on Port 4840/TCP could allow an unauthenticated remote attacker to cause a denial-of-service condition in the OPC communication or crash the device.\nAn attacker with network access to the affected systems could exploit the vulnerability. Successful exploitation requires no system privileges and no user interaction. An attacker could use the vulnerability to compromise availability of the OPC communication.\nCVE-2019-6575 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens ProductCERT reported this vulnerability to CISA. Artem Zinenko of Kaspersky identified that SIPLUS is also affected.\n5. MITIGATIONS\nSiemens currently has updates for the following products:\nSIMATIC ET 200 Open Controller CPU 1515SP PC2: Update to v2.7\n\nSIMATIC HMI Comfort Outdoor Panels 7\" & 15\" (including SIPLUS variants): Update to v15.1 Upd 4\nSIMATIC HMI Comfort Panels 4\" 22\" (including SIPLUS variants): Update to v15.1 Upd 4\nSIMATIC HMI KTP Mobile Panels KTP400F, KTP700, KTP700F, KTP900, KTP900F (including SIPLUS variants): Update to v15.1 Upd 4\nSIMATIC IPC DiagMonitor: Update to v5.1.3\nSIMATIC NET PC Software v14: Update to v14 SP1 Update 14 or later version\nSIMATIC RF188C: Update to v1.1.0\nSIMATIC RF600R: Update to v3.2.1\nSIMATIC S7-1500 CPU Family (including related ET200 CPUs and SIPLUS variants): Update to v2.6.1\nSIMATIC S7-1500 Software Controller: Update to v2.7\nSIMATIC WinCC OA: Update to v3.15-P018 (logon required)\nSIMATIC WinCC Runtime Advanced: Update to v15.1 Upd 4\nSINEC-NMS: Update to v1.0 SP1\nSINEMA Server: Update to v14 SP2\nSINUMERIK OPC UA Server: Update to v2.1 or newer\n\n--------- Begin Update H Part 2 of 2 ---------\n\nTeleControl Server Basic: Update to V3.1.1 or later version\n\n--------- End Update H Part 2 of 2 ---------\nFor the balance of the listed products, Siemens is preparing further updates and recommends users apply the following specific workarounds and mitigations to reduce risk until patches are available:\n\nDeactivate the OPC UA Service if supported by the product.\nApply cell protection concept.\nUse VPN for protecting network communication between cells.\nApply Defense-in-Depth.\n\nSiemens recommends users configure their environment according to Siemens’ operational guidelines for Industrial Security (Download) and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-307392\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-6575"
  ],
  "techniques": [],
  "advisory": "icsa-19-099-03",
  "title": "Siemens Industrial Products with OPC UA (Update H) | CISA",
  "source": "ics-advisories",
  "id": "be59daa4139050ea2fbd39fd96c53a25e5038c7fa4bae2be2475bd07fb1fc132"
}