{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\n\n--------- Begin Update A part 1 of 3 ---------\n\nATTENTION: Low attack complexity\nVendor: Prosys OPC\nEquipment: UA Simulation Server, UA Modbus Server\n\n--------- End Update A part 1 of 3 ---------\n\nVulnerability: Insufficiently Protected Credentials\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-349-01 Prosys OPC UA Simulation Server that was published December 15, 2022, to the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain credentials and gain access to system data.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following version of Prosys OPC UA simulation servers are affected:\n--------- Begin Update A part 2 of 3 ---------\n\nProsys OPC UA Simulation Server versions prior to 5.3.0-64\n\n--------- End Update A part 2 of 3 ---------\n\nProsys OPC UA Modbus Server 1.4.18-5 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nProsys OPC UA Simulation server v5.03-64 does not sufficiently protect credentials, which could allow an attacker to obtain user credentials and gain access to system data.\nCVE-2022-2967 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Finland\n\n4.4 RESEARCHER\nParvin Kumar, Dr. Sriharsha Etigowni, and Prof. Dongyan Xu of Purdue University West Lafayette reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A part 3 of 3 ---------\nProsys has released updates for the following products:\n\nSimulation Server: Update to v5.4.0\nModbus Server: Update to 1.4.20\n\n--------- End Update A part 3 of 3 ---------\nProsys also recommends additional workarounds to mitigate exploitation of this vulnerability:\n\nRestart the application after modifying user passwords.\n\nFor more information, users can refer to the Prosys OPC security blog.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-2967"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-01",
  "title": "Prosys OPC UA Simulation Server (Update A) | CISA",
  "source": "ics-advisories",
  "id": "398413dd022baa0759b6f3eb748383ac7f1fbf9efc316198ac5a4a4bdb28f10d"
}