{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Delta Electronics \nEquipment: CNCSoft and ScreenEditor\nVulnerabilities: Stack-based Buffer Overflow, Out-of-Bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain remote code execution with administrator privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAccording to Delta Electronics, the following products are affected:\n\nCNCSoft Version 1.00.83 and prior, and the accompanying,\nScreenEditor Version 1.00.54\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nMultiple stack-based buffer overflow vulnerabilities cause the software to crash due to lacking user input validation before copying data from project files onto the stack.   \nCVE-2018-10636 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS READ CWE-125\nTwo out-of-bounds read vulnerabilities cause the software to crash due to lacking user input validation for processing project files.\nCVE-2018-10598 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nMat Powell working with Trend Micro’s Zero Day Initiative reported CVE-2018-10598 to NCCIC. Natnael Samson (Natti) working with Trend Micro Zero Day Initiative reported CVE-2018-10636 to NCCIC.\n4. MITIGATIONS\nDelta Electronics recommends the following:\n\nUpdate to the latest version of CNCSoft, v1.01.09. The updated version can be found at: http://www.deltaww.com/Products/PluginWebUserControl/downloadCenterCounter.aspx?DID=84&DocPath=1&hl=en-US\nRestrict the interaction with the application to trusted files.\n\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-10598",
    "CVE-2018-10636"
  ],
  "techniques": [],
  "advisory": "icsa-18-219-01",
  "title": "Delta Electronics CNCSoft and ScreenEditor | CISA",
  "source": "ics-advisories",
  "id": "d5a7372929756ad89ed5d3f72316e803ed121b408ab2ddd3e225a57b876418df"
}