{
  "markdown": "\n1. EXECUTIVE SUMMARY.\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Parasolid\nVulnerabilities: Out-of-bounds Read, Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute code in the context of the current process.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following Parasolid 3D geometric modeling tools:\n•    Parasolid V34.0: versions prior to V34.0.252\n•    Parasolid V34.0: versions prior to V34.0.254\n•    Parasolid V34.1: versions prior to V34.1.242\n•    Parasolid V34.1: versions prior to V34.1.244\n•    Parasolid V35.0: versions prior to V35.0.184\n•    Parasolid V35.0: versions prior to V35.0.170\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nSiemens Parasolid contains an out-of-bounds read past the end of an allocated structure while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process. \nCVE-2022-39157 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS WRITE CWE-787\nSiemens Parasolid contains an out-of-bounds write past the end of an allocated buffer while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2022-43397 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n•    CRITICAL INFRASTRUCTURE SECTORS:  Critical Manufacturing\n•    COUNTRIES/AREAS DEPLOYED: Worldwide\n•    COMPANY HEADQUARTERS LOCATION: Germany\n3.4 RESEARCHER\nAn anonymous researcher working with Trend Micro Zero Day Initiative reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends updating to the latest versions:\n•    Parasolid V34.0: Update to V34.0.252 or later version.\n•    Parasolid V34.0: Update to V34.0.254 or later version.\n•    Parasolid V34.1: Update to V34.1.242 or later version.\n•    Parasolid V34.1: Update to V34.1.244 or later version.\n•    Parasolid V35.0: Update to V35.0.184 or later version.\n•    Parasolid V35.0: Update to V35.0.170 or later version.\nSiemens has identified the following specific workaround and mitigation customers can apply to reduce the risk:\n•    Do not open untrusted X_T files in Parasolid.\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and to follow the recommendations in the product manuals.\nSiemens also provides additional information on industrial security on their website. For more information on security vulnerabilities in Siemens' products, users should contact Siemens.\nFor more information, see the associated Siemens security advisory SSA-853037 in HTML or CSAF formats.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. These vulnerabilities have a low attack complexity\n",
  "cves": [
    "CVE-2022-43397",
    "CVE-2022-39157"
  ],
  "techniques": [],
  "advisory": "icsa-22-314-01",
  "title": "Siemens Parasolid | CISA",
  "source": "ics-advisories",
  "id": "30eace0c518c53837777dde7b857bdce49e9dfd349ed0a42597d189634ca18e9"
}