{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Johnson Controls\nEquipment: Metasys Reporting Engine (MRE) Web Services\nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote unauthenticated attacker to access and download arbitrary files from the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports the vulnerability affects the following versions of Metasys Reporting Engine (MRE) Web Services: \n\nMRE – v2.0\nMRE – v2.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PATH TRAVERSAL CWE-22\nMetasys Reporting Engine (MRE) Web Services does not properly sanitize pathname elements that can resolve to a location that is outside of the restricted directory. \nCVE-2020-9050 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nAlessandro Bosco, Luca Di Giuseppe, Stefano Scipioni, and Massimiliano Brolli of TIM Security Red Team Research reported this vulnerability to Johnson Controls, Inc.\n4. MITIGATIONS\nJohnson Controls recommends users upgrade to MRE v2.2 or later. Users with licenses for MRE should contact their local branch office for remediation.   \nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-02 \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-9050"
  ],
  "techniques": [],
  "advisory": "icsa-21-049-01",
  "title": "Johnson Controls Metasys Reporting Engine (MRE) Web Services | CISA",
  "source": "ics-advisories",
  "id": "70689e0fca74171bb91c55e1336ce42ccb593abd1ded394493d780bed93821f2"
}