{
  "markdown": "\nOVERVIEW\nICS-CERT has received a report from independent security researcher Jeremy Brown regarding a buffer overflow vulnerability in a Wonderware InBatch Client ActiveX control.\nAccording to the researcher’s report, the client ActiveX control is vulnerable to a buffer overflow that could cause denial of service (DoS) or the possible execution of arbitrary code in older versions. In order to successfully exploit this vulnerability, the attacker must direct the InBatch client user to a malicious host. This exploit requires the attacker to perform social engineering. Invensys has validated the researcher’s claim and has developed a patch to mitigate this vulnerability. ICS-CERT has verified that the provided security patch resolves the vulnerability.\nAFFECTED PRODUCTS\nThis vulnerability affects custom runtime client programs of all supported versions of the Wonderware InBatch Server products. Invensys has supplied Table 1, which identifies which currently supported products are\n\n\n\nProduct and Component\nSupported Operating System\nSecurity Impact\nSeverity Rating\n\n\n\n\nWonderware InBatch 8.1--InBatch Runtime Clients (all versions)\nWindows XP Professional\nWindows 2000 Server\nWindows Server 2003\n\nDenial of Service\nRemote code execution\n\nMedium\n\n\nWonderware InBatch 9.0--InBatch Runtime Clients (all versions)\nWindows XP Professional\nWindows Server 2003\nWindows Server 2008\n\nDenial of Service\nMedium\n\n\n\nIMPACT\nWhile a successful exploit of the buffer overflow could allow a DoS or arbitrary code execution, the specific impact to an individual organization depends on many factors that are unique to the organization.\nICS CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and operational product implementation.\nBACKGROUND\nAccording to Invensys, Wonderware InBatch is used to develop batch management capabilities for control system applications that run on the Microsoft Windows platforms. The ActiveX control is supplied for end users to build custom runtime client interfaces to the InBatch Server.\nWonderware InBatch software is used in a wide variety of batching processes including pharmaceutical production; food and beverage production, including breweries and milk production; and various Chemical Sector batching processes. InBatch software is estimated to be deployed in Europe (60%), North America (30%), and other areas around the world (10%).\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\nAccording to the researcher’s report, the InBatch client ActiveX control will connect to an InBatch servervia TCP. If an attacker successfully employs social engeneering (i.e., phishing e-mail), the user could be connected to a malicious server. Once connected to this server, the InBatch client ActiveX is vulnerable to a buffer overflow that could allow a DoS or possibly lead to arbitrary code execution.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not remotely exploitable.\nEXISTENCE OF EXPLOIT\nCurrently, no known exploits are specifically targeting this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult. Social engineering is required to convince the user to access a malicious host.\nMITIGATION\nICS-CERT and Invensys recommend that users of the Wonderware InBatch runtime client ActiveX control take the following mitigation steps:\n\nInstall the patch provided from Invensys. Registered users please log into the Wonderware Developer Network or contact Wonderware Tech Support.\nLog onto Cyber Security Updates site where Invensys provides information and useful links related to their security updates: http://iom.invensys.com/EN/Pages/CyberSecurityUpdates.aspx\n\nOrganizations that observe any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nThe Control System Security Program also provides a recommended practices section for control systems on the US-CERT website. Several recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n \n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-094-01",
  "title": "Wonderware InBatch Client ActiveX Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "65f13713054b62d0c26f89579263e3f607c89ee69a81d6f8662ac31efdf4a39e"
}