{
  "markdown": "\n1. EXECUTIVE SUMMARY\n--------- Begin Update K Part 1 of 2 ---------\n\nCVSS v3 8.8\n\n--------- End Update K Part 1 of 2 ---------\n\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SIMATIC, SINAMICS, SINEC, SINEMA, SINUMERIK\nVulnerability: Unquoted Search Path or Element\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-161-04 Siemens SIMATIC, SINAMICS, SINEC, SINEMA, SINUMERIK (Update J) that was published April 14, 2022, to the ICS webpage on www.cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow authorized local users with administrative privileges to execute custom code with SYSTEM level privileges.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATIC Automation Tool: All versions\nSIMATIC NET PC software: All versions after v16 and prior to v16 Upd3\nSIMATIC PCS neo: All versions prior to v3.0 SP1\nSIMATIC ProSave: All versions\nSIMATIC S7-1500 Software Controller: All versions prior to v21.8\nSINAMICS STARTER: All versions prior to v5.4 HF2\nSIMATIC STEP 7: All versions prior to v5.6 SP2 HF3\nSIMATIC STEP 7 (TIA Portal) v13: All versions prior to SP2 Update 4\nSIMATIC STEP 7 (TIA Portal) v14: All versions prior to v14 SP1 Update 10\nSIMATIC WinCC Runtime Professional v14: All versions prior to v14 SP1 Update 10\nSIMATIC STEP 7 (TIA Portal) v15: All versions prior to v15.1 Update 5\nSIMATIC STEP 7 (TIA Portal) v16: All versions prior to v16 Update 2\nSIMATIC WinCC OA v3.16: All versions prior to P018\nSIMATIC WinCC OA v3.17: All versions prior to P003\nSIMATIC WinCC Runtime Advanced: All versions prior to v16 Update 2\nSIMATIC WinCC Runtime Professional v13: All versions prior to v13 SP2 Update 4\nSIMATIC WinCC Runtime Professional v14: All versions\nSIMATIC WinCC Runtime Professional v15: All versions prior to v15.1 Update 5\nSIMATIC WinCC Runtime Professional v16: All versions prior to v16 Update 2\nSIMATIC WinCC v7.4: All versions prior to v7.4 SP1 Update 14\nSIMATIC WinCC v7.5: All versions prior to v7.5 SP1 Update 3\nSINAMICS Startdrive: All versions\nSINEMA Server: All versions prior to v14 SP3\nSIMATIC ProSave: All versions prior to v17\n\n\nSIMATIC NET PC software v14: All versions prior to v14 Update 14\nSIMATIC NET PC software v15: All versions\nSIMATIC NET PC software v16: All versions prior to v16 Upd3 \n\n\nSINUMERIK ONE virtual: All versions prior to v6.14\nSINUMERIK Operate: All versions prior to v6.14\nSIMATIC Automation Tool: All versions prior to v4 SP2\nSINEC NMS: All versions prior to v1.0 SP2\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\n--------- Begin Update K Part 2 of 2 ---------\nThe affected product is vulnerable due to a common component of the affected applications that regularly calls a helper binary with SYSTEM privileges while the call path is not quoted. This could allow a local unauthorized user to execute arbitrary code with SYSTEM privileges.\nCVE-2020-7580 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n--------- End Update K Part 2 of 2 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nAnder Martinez of Titanium Industrial Security and INCIBE reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has released updates for the following affected products and is working on further updates. For the remaining affected products, Siemens recommends specific countermeasures until fixes are available:\n\nSIMATIC NET PC software: Update to v16 Upd3\nSIMATIC PCS neo: Update to v3.0 SP1 (Contact your local support to obtain update software)\nSIMATIC S7-1500 Software Controller: Update to v21.8\nSIMATIC STEP 7: Update to v5.6 SP2 HF3\nSIMATIC STEP 7 (TIA Portal) v13: Update to v13 SP2 Update 4\nSIMATIC STEP 7 (TIA Portal) v15: Update to v15.1 Update 5\nSIMATIC STEP 7 (TIA Portal) v16: Update to v16 Update 2\nSIMATIC WinCC OA v3.16: Update to v3.15-P018 or newer\nSIMATIC WinCC OA v3.17: Update to v3.17-P003 or newer\nSIMATIC WinCC Runtime Advanced: Update to v16 Update 2\nSIMATIC WinCC Runtime Professional v13: Update to v13 SP2 Update 4\nSIMATIC WinCC Runtime Professional v15: Update to v15.1 Update 5\nSIMATIC WinCC Runtime Professional v16: Update to v16 Update 2\nSIMATIC WinCC v7.4: Update to v7.4 SP1 Update 14\nSIMATIC WinCC v7.5: Update to v7.5 SP1 Update 3\nSINAMICS STARTER: Update to v5.4 HF2\nSINAMICS Startdrive: Update to v16 Update 3\nSINEC NMS: Install provided patch\nSINEMA Server: Install provided patch\nSIMATIC STEP 7 (TIA Portal) v14: Update to v14 SP1 Update 10\nSIMATIC WinCC Runtime Professional v14: Update to v14 SP1 Update 10\nSINUMERIK ONE virtual: Update to v6.14 (Update can be obtained from Siemens Customer Service)\nSINUMERIK Operate: Update to v6.14 (Update can be obtained from Siemens Customer Service)\nSIMATIC Automation Tool: Update to v4 SP2 or newer\nSINEC NMS: Update to v1.0 SP2\nSINEMA Server: Update to v14 SP3 or later\nSIMATIC ProSave: Update to v17 or later\n\nNOTE: Some versions of SIMATIC ProSave are not available as separate download (e.g., v17). In this case, use the version of SIMATIC ProSave as bundled with the corresponding version of SIMATIC WinCC (TIA Portal).\n\n\n\n--------- Begin Update J Part 2 of 2 ---------\n\nSIMATIC NET PC software 14: Update to v14 SP1 Update 14 or later\nSIMATIC NET PC software 15: Currently no fix planned\nSIMATIC NET PC software 16: Update to v16 Upd3 or later\n\n--------- End Update J Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations that can be applied to reduce the risk:\n\nEnsure there is no executable at the following locations:\n\nC:\\Program.exe\nC:\\Program Files\\Common.exe\nC:\\Program Files\\Common Files\\Siemens\\Automation\\Simatic.exe\n\n\nDeactivate the Windows service called TraceConceptX. This leads to loss of tracing functionality and should only be considered a temporary workaround.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-312271\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThis vulnerability is not exploitable remotely. No known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-7580"
  ],
  "techniques": [],
  "advisory": "icsa-20-161-04",
  "title": "Siemens SIMATIC, SINAMICS, SINEC, SINEMA, SINUMERIK (Update K) | CISA",
  "source": "ics-advisories",
  "id": "c375bbaa8b2d2e4ab8c8aa441c7b8a2cbeb2bf320b8e6cdff52cedcaaa947de5"
}