{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.4\nATTENTION: High attack complexity\nVendor: Yokogawa\nEquipment: Consolidation Alarm Management Software for Human Interface Station (CAMS for HIS)\nVulnerability: Violation of Secure Design Principles\n\n2. RISK EVALUATION\nIf a computer using CAMS for HIS software is compromised, it can be used to compromise any number of other computers using CAMS for HIS software with the potential to crash any affected software.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products that use CAMS for HIS, are affected:\n\nCENTUM CS 3000 (including CENTUM CS 3000 Entry Class): Versions R3.08.10 through R3.09.00. These vulnerabilities affect this product if LHS4800 (CAMS for HIS) is installed.\nCENTUM VP (including CENTUM VP Entry Class): Versions R4.01.00 through R4.03.00 (these product versions are affected only if CAMS function is used), Versions R5.01.00 through R5.04.20, and R6.01.00 through R6.09.00 (these product versions are affected regardless of whether CAMS function is used or not).\nExaopc: Versions R3.72.00 through R3.80.00 (these product versions are affected if NTPF100-S6 \"For CENTUM VP Support CAMS for HIS\" is installed).\nB/M9000CS: Versions R5.04.01 - R5.05.01\nB/M9000 VP: Versions R6.01.01 - R8.03.01\n\n3.2VULNERABILITY OVERVIEW\n3.2.1    VIOLATION OF SECURE DESIGN PRINCIPLES CWE-657\nIf an attacker successfully compromises a computer using CAMS for HIS software, they can use credentials from the compromised machine to access data from another machine using CAMS for HIS software. This can lead to a disabling of CAMS for HIS software functions on any affected machines.\nCVE-2022-30707 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nJacob Baines from Dragos, Inc., reported this vulnerability to Yokogawa.\n4. MITIGATIONS\nYokogawa has produced the following mitigations for the affected products:\n\nCENTUM CS 3000 (Including CENTUM CS 3000 Entry Class):\n\nNo software patch will be made available as these products are end-of-life. Upgrade systems to the latest version of CENTUM VP.\n\n\nCENTUM VP (Including CENTUM VP Entry Class):\n\nVersions R4.01.00 through R4.03.00, and R5.01.00 through R5.04.20\n\nNo software patch will be made available as these products are end-of-life. Consider upgrading systems to the latest version of CENTUM VP.\n\n\nVersions R6.01.00 through R6.09.00\n\nUpdate systems to Version R6.09.00 and apply software patch R6.09.03\n\n\n\n\nExaopc:\n\nUpdate systems to Version R3.80.00 and apply software patch R3.80.01\n\n\nB/M9000CS and B/M9000 VP:\n\nThese products are not directly affected by the vulnerability. However, these products are affected if CENTUM is installed on the same PC. If CENTUM is installed, update as described above. Also update B/M9000 to the latest version.\n\n\n\nPlease see Yokogawa Security Advisory Report YSAR-22-0006 at the following locations for more information:\nEnglish\nJapanese\nFor questions related to these mitigations, please contact Yokogawa.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-30707"
  ],
  "techniques": [],
  "advisory": "icsa-22-174-02",
  "title": "Yokogawa CAMS for HIS | CISA",
  "source": "ics-advisories",
  "id": "cc94a5e4c616cd3df2bb4f9755ca2ee18498e205f9e085c820d0f14f84b05d98"
}