{
  "markdown": " Meinberg Radio Clocks LANTIME M\\-Series XSS \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryMeinberg Radio Clocks LANTIME M\\-Series XSS=========================================== Last Revised September 06, 2018 Alert Code ICSA\\-14\\-275\\-01OVERVIEW-------- This advisory was originally posted to the US\\-CERT secure Portal library on October 2, 2014, and is being released to the ICS\\-CERT web site. Martem Telecontrol Systems security researcher Aivar Liimets has identified a reflected cross‑site scripting vulnerability in the Meinberg Radio Clocks GmbH \\& Co. KG LANTIME M400 web interface. Meinberg has produced a firmware update that mitigates this vulnerability in all LANTIME M\\-Series. Aivar Liimets has tested the firmware update to validate that it resolves the vulnerability. This vulnerability could be exploited remotely.AFFECTED PRODUCTS----------------- The following Meinberg Network Time Protocol (NTP) Server firmware versions are affected:* LANTIME M\\-Series models: V6\\.15\\.019 and prior.IMPACT------ The reflected cross\\-site scripting vulnerability could cause the time server to provide misinformation to devices. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Meinberg Radio Clocks GmbH \\& Co. KG is an international provider of electronic modules, based in Bad Pyrmont, Germany. The affected products, the LANTIME M\\-Series, are NTP Servers. According to Meinberg, the Meinberg NTP Servers are deployed across several sectors including Commercial Facilities, Communications, Energy, Financial Services, and Transportation Systems. Meinberg estimates that these products are used primarily in the United States and Europe.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### CROSS\\-SITE SCRIPTINGCWE\\-79: Improper Neutralization of Input During Web Page Generation ('Cross\\-site Scripting'), http://cwe.mitre.org/data/definitions/79\\.html, web site last accessed October 30, 2014\\. The web interface for LANTIME M\\-Series contains a flaw that allows a reflected cross\\-site scripting vulnerability. CVE\\-2014\\-5417NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-5417, NIST uses this advisory to create the CVE web site report. has been assigned to this vulnerability. A CVSS v2 base score of 7\\.5 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:P/I:P/A:P, web site last accessed October 30, 2014\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.### DIFFICULTY An attacker with a low skill would be able to exploit this vulnerability.MITIGATION---------- Meinberg’s firmware update, Version 6\\.15\\.020, resolves this vulnerability. Please contact Meinberg customer service for information on how to download and install the firmware update, or obtain the update at the following online location:<http://news.meinberg.de/259> Meinberg – Radio Clocks Lange Wand 9 D\\-31812 Bad Pyrmont Phone: \\+\\+49(0\\)5281\\-9309 0 Fax: \\+\\+49(0\\)5281\\-9309 30[http:www.meinberg.de](http://www.meinberg.de/)  Email: info@meinberg.de ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B—Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [www.ics\\-cert.org](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks: 1\\. Do not click web links or open unsolicited attachments in email messages. 2\\. Refer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us\\-cert.gov/reading\\_room/emailscams\\_0905\\.pdf, web site last accessed October 30, 2014\\. for more information on avoiding email scams. 3\\. Refer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04\\-014, http://www.us\\-cert.gov/cas/tips/ST04\\-014\\.html, web site last accessed October 30, 2014\\. for more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Meinberg-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-14-275-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2014-5417"
  ],
  "techniques": [],
  "advisory": "icsa-14-275-01",
  "title": "Meinberg Radio Clocks LANTIME M-Series XSS | CISA",
  "source": "ics-advisories",
  "id": "8697b208281c09f1a23bbc402464f4424649d01247129959d50583571c515796"
}