{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.6\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: SMA Solar Technology AG\nEquipment: Sunny WebBox\nVulnerability: Cross-Site Request Forgery\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to generate a denial-of-service condition, modify passwords, enable services, achieve man-in-the-middle, and modify input parameters associated with devices such as sensors.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version of Sunny WebBox is affected:\n\nFirmware Version 1.6 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nAn attacker could send a malicious link to an authenticated operator, which may allow remote attackers to perform actions with the permissions of the user. This device uses IP addresses to maintain communication after a successful login, which would increase the ease of exploitation.\nCVE-2019-13529 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nBorja Merino and Eduardo Villaverde of the Technical Inspection Laboratory of the Mining School (University of León), through Adenda 2, coordinated this vulnerability with Carlos del Canto and Victor Fidalgo of INCIBE-CERT’s Industrial Cybersecurity Team.\n4. MITIGATIONS\nThis product is end-of-life and is no longer supported.\nSMA recommends deactivation of port forwarding as it is not required for monitoring PV systems via the SMA Sunny Portal. If direct access to a system from the Internet is necessary, SMA recommends using an encrypted virtual private network (VPN). On delivery, any saved default passwords should also be replaced with individual secure passwords, and unused ports on the system/router should be closed.\nSMA installers and administrators can answer specific questions about individual configuration of SMA devices. Basic information on this topic can also be found at: https://files.sma.de/dl/7680/CyberSecurity-TI-en-10.pdf\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13529"
  ],
  "techniques": [],
  "advisory": "icsa-19-281-01",
  "title": "SMA Solar Technology AG Sunny WebBox | CISA",
  "source": "ics-advisories",
  "id": "ac9d9c22cc085dd2b4c2a950e15e8452c116f8ea33f56d7f51b7649ce128fc0e"
}