{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.2\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Geutebrück\nEquipment: G-Cam and G-Code\nVulnerabilities: Cross-site Scripting, OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution as root and remote code execution in the browser of the IP camera operator.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nGeutebruck reports that the vulnerabilities affect the following Encoder and E2 Series Camera versions and models:\n\nG-Code: All versions 1.12.0.25 and prior\n\nEEC-2xxx\n\n\nG-Cam: All versions 1.12.0.25 and prior\n\nEBC-21xx\nEFD-22xx\nETHC-22xx\nEWPC-22xx\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nA cross-site scripting vulnerability allows a remote authenticated attacker with access to event configuration to store malicious code on the server, which could later be triggered by a legitimate user resulting in code execution within the user’s browser.\nCVE-2019-10957 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nUsing a specially crafted URL command, a remote authenticated user can execute commands as root.\nCVE-2019-10956 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nUser input is not properly validated, which could allow a remote authenticated attacker with access to network configuration to supply system commands to the server, leading to remote code execution as root.\nCVE-2019-10958 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Energy, Financial Services, Government Facilities, Healthcare and Public Health, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nRomain Luyer and Guillaume Gronnier from CEIS, and Davy Douhine from RandoriSec reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nGeutebruck recommends users upgrade to the latest firmware, Version 1.12.13.2 or later. This can be found at the following link:\nhttps://www.geutebrueck.com/en_EN/login.html (Login Required)\nGeutebruck has also released a security advisory that can be found at the following link:\nhttps://portal.geutebrueck.com/ (Login Required)\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the system is configured using least privilege.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-10958",
    "CVE-2019-10956",
    "CVE-2019-10957"
  ],
  "techniques": [],
  "advisory": "icsa-19-155-03",
  "title": "Geutebrück G-Cam and G-Code | CISA",
  "source": "ics-advisories",
  "id": "3cb9556744e64aa051438b7caf45093a45ba0e1ad34c55bb43ae4850a79088a8"
}