{
  "markdown": " Certec Atvise Server Remote DOS \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryCertec Atvise Server Remote DOS=============================== Last Revised August 22, 2018 Alert Code ICSA\\-12\\-018\\-02Overview-------- Independent researcher Luigi Auriemma has identified a denial of service (DoS) vulnerability in Certec EDV GmbH atvise application. Certec has produced an update that resolves this vulnerability. Mr. Auriemma validated that the update resolves the vulnerability.Affected Products----------------- Atvise versions older than Version 2\\.1 are affected.Impact------ Successful exploitation of these vulnerabilities may allow an attacker to cause a DoS. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- Certec EDV GmbH is an Austrian\\-based company. The affected product, atvise, is web\\-based human\\-machine interface supervisory control and data acquisition (HMI SCADA) systems. According to Certec, atvise is deployed in every field of industrial automation. Certec states that these products are used worldwide.Vulnerability Characterization------------------------------### Vulnerability Overview An attacker could exploit this vulnerability by sending specially crafted packets to Port 4840/TCP.[CVE\\-2011\\-4873](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4873)  has been assigned to this vulnerability.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable.#### Existence of Exploit Public exploits are known to target this vulnerability.#### Difficulty An attacker with a low skill level can create the DoS.Mitigation---------- Certec has developed a new version of atvise that prevents this DoS. Customers can download the new version of [Atvise](http://www.atvise.com)  . Certc and ICS\\-CERT recommend that owners of vulnerable versions of the atvise product download and install the updated version as soon as possible. ICS\\-CERT also encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides [a section for control systems security recommended practices](/ics/recommended-practices)  on the CSSP web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents.![]() This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Certec EDV GmbH-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-018-02)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* * [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)* * [Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-4873"
  ],
  "techniques": [],
  "advisory": "icsa-12-018-02",
  "title": "Certec Atvise Server Remote DOS | CISA",
  "source": "ics-advisories",
  "id": "d0f05911ae2121e453f3a3312197c5c342bd1d967329992049982145b9cbfd7b"
}