{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: MicroSCADA Pro/X SYS600\nVulnerability: NULL Pointer Dereference, Infinite Loop\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause the affected modules in the product to stop working.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi Energy reports this vulnerability affects the following SCADA products used for monitoring and controlling power systems: \n\nSYS600 10.3.1 and earlier\nSYS600 9.x versions\n\nCVE-2020-25692 impacts SYS600 if the Authentication Service is installed; it is not installed by default but needs to be either enabled during the installation process of SYS600 or manually installed later. Authentication Service (previously ABB Authentication Service) is needed only when SYS600 users are authenticated using centralized SDM600 user account management.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    RELIANCE ON UNCONTROLLED COMPONENT CWE-1357\nHitachi Energy is aware of public reports of vulnerabilities in third-party open-source software components (OpenLDAP and OpenSSL) used in MicroSCADA Pro/X SYS600 products, vulnerabilities which include CWE-476: NULL Pointer Dereference and CWE-835: Infinite Loop.\nCVE-2020-25692 and CVE-2022-0778 have been assigned to these vulnerabilities. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy recommends that customers apply the update at the earliest convenience:\n\nFor SYS600 9.4 upgrade to at least SYS600 version 10.4.\nFor SYS600 10.x update to at least SYS600 version 10.4.\n\nHitachi Energy recommends following 1MRK511518 MicroSCADA X Cyber Security Deployment Guidelines.\nFor additional information and support, users should contact Hitachi Energy service organization.\nHitachi Energy recommends the following security practices and firewall configurations to help protect process control networks from attacks originating from outside the network:\n\nPhysically protect process control systems from unauthorized direct access.\nSeparate process control systems from the internet and other networks using firewall system with minimal open ports.\nProcess control systems should not be used for internet surfing, instant messaging, or email.\nPortable computers and removable storage media should be carefully scanned for viruses connecting to a control system\n\nFor more information, see Hitachi Energy advisory 8DBD000107.\nHitachi Energy recommends the following security practices and firewall configurations to help protect process control networks from attacks originating from outside the network: \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has a low attack complexity.\n",
  "cves": [
    "CVE-2020-25692",
    "CVE-2022-0778"
  ],
  "techniques": [],
  "advisory": "icsa-22-272-02",
  "title": "Hitachi Energy MicroSCADA Pro X SYS600 | CISA",
  "source": "ics-advisories",
  "id": "f253e15f33b3bf6f1bfb449d153e544b75c0e5badbd32b9f590aec312a1f2376"
}