{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.8\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-R series\nVulnerability: Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition for the affected products.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the vulnerability affects the following MELSEC iQ-R series CPU module products: \n\nR00/01/02 CPU Firmware versions from 05 to 19\nR04/08/16/32/120(EN) CPU Firmware versions from 35 to 51\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nA denial-of-service vulnerability due to uncontrolled resource consumption exists in MELSEC iQ-R series CPU modules. This vulnerability does not affect products when the “To Use or Not to Use Web Server” parameter of CPU modules is set to “Not Use.” The default setting is “Not Use.”\nCVE-2020-5666 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nXiaofei.Zhang, a researcher from China, reported this vulnerability to Mitsubishi Electric.\n4. MITIGATIONS\nMitsubishi Electric has issued the following firmware versions to address this issue:\n\nR00/01/02CPU firmware Versions 20 or later\nR04/08/16/32/120(EN)CPU firmware Versions 52 or later\n\nMitsubishi Electric also recommends the following practices:\n\nIf the web server function is not needed, change the setting for \"To Use or Not to Use Web Server” to “Not Use.”\nUse a firewall or virtual private network (VPN), etc., to prevent unauthorized access when Internet access is required.\nUse within a trusted LAN and block access from untrusted networks and hosts through firewall.\n\nFor more information about this vulnerability and the associated mitigations, please see the vulnerability information on the Mitsubishi website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-5666"
  ],
  "techniques": [],
  "advisory": "icsa-20-317-01",
  "title": "Mitsubishi Electric MELSEC iQ-R Series | CISA",
  "source": "ics-advisories",
  "id": "3de9b3c081c517b12e43cd55d9c0142bcc984f4ab02a3afe057bdc3da0c76138"
}