{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Reliable Controls\nEquipment: LicenseManager\nVulnerability: Unquoted Search Path or Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to crash the system, view sensitive data, or execute arbitrary commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LicenseManager are affected:\n\nRC-LicenseManager: Versions 3.4 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nAn authenticated user may be able to insert malicious code into the system root path, which may allow execution of code with elevated privileges of the application.\nCVE-2019-18245 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Government Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Canada\n\n3.4 RESEARCHER\nGjoko Krstic of Applied Risk reported this vulnerability to CISA.\n4. MITIGATIONS\nReliable Controls has released RC-LicenseManager Version 3.5, which is bundled for use within the latest RC-Studio software. Reliable Controls recommends users upgrade to RC Studio 3.6.3, which can be obtained at the following link:\nhttps://www.reliablecontrols.com/support/software/releases.php (Login Required)\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\nEvery program and every user of the system should operate using the least set of privileges necessary to complete the job.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-18245"
  ],
  "techniques": [],
  "advisory": "icsa-19-337-01",
  "title": "Reliable Controls LicenseManager | CISA",
  "source": "ics-advisories",
  "id": "11adcf378d1b289e56aef5348a46b6905607db429f52069c6830aecbf180e4e2"
}