{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Mendix\nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-104-07 Siemens Mendix (Update A) that was published June 16, 2022, on the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated remote attacker to read sensitive data.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Mendix, a software platform to build mobile and web applications, are affected:\n-------- Begin Update B Part 1 of 2 ---------\n\nMendix applications using Mendix 7: All versions prior to 7.23.31\nMendix applications using Mendix 8: All versions prior to 8.18.18\nMendix applications using Mendix 9: All versions prior to 9.11\nMendix applications using Mendix 9 (v9.6): All versions prior to 9.6.12\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nApplications built with an affected system publicly expose the internal project structure. This could allow an unauthenticated remote attacker to read confidential information.\nCVE-2022-27241 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has provided the following specific workarounds and mitigations:\n\nMendix Applications using Mendix 7: Update to Version 7.23.31 or later\nMendix Applications using Mendix 8: Update to Version 8.18.18 or later\nMendix Applications using Mendix9: Update to Version 9.11 or later\n\n--------- Begin Update B Part 2 of 2 ---------\n\nMendix Applications using Mendix 9 (v9.6): Update to Version 9.6.12 or later\n\n--------- End Update B Part 2 of 2 ---------\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-414513\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-27241"
  ],
  "techniques": [],
  "advisory": "icsa-22-104-07",
  "title": "Siemens Mendix (Update B) | CISA",
  "source": "ics-advisories",
  "id": "8acc1393c84270a8866d422082fa31467e295e7bc3f68782031bd5fbb0eaf8f1"
}