{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely; low skill level to exploit\nVendor: Siemens\nEquipment: SIPROTEC 5 and DIGSI 5\nVulnerabilities: Improper Input Validation\n\n2    UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-190-05 Siemens SIPROTEC 5 and DIGSI 5 (Update B) that was published December 10, 2019 on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a denial-of-service condition and limited control of file upload, download, and delete functions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following SIPROTEC 5 and DIGSI 5 products:\n\nSIPROTEC 5 (All versions prior to v7.90) with CPU variants CP300 and CP100 and the respective Ethernet communication modules listed below:\n\n6MD85\n6MD86\n6MD89\n7UM85\n7SA87\n7SD87\n7SL87\n7VK87\n7SA82\n7SA86\n7SD82\n7SD86\n7SL82\n7SL86\n7SJ86\n7SK82\n7SK85\n7SJ82\n7SJ85\n7UT82\n7UT85\n7UT86\n7UT87\n7VE85\nAll types not listed above\n\nAll versions\n\n\n\n\n\n--------- Begin Update C Part 1 of 2 ---------\n\nSIPROTEC 5: All versions prior to v8.01\n\n7SS85\n7KE85\n\n\n\n--------- End Update C Part 1 of 2 ---------\n\nSIPROTEC 5 with CPU variants CP200 and the respective Ethernet communication modules\nCVE-2019-10931: \n\nAll versions prior to v7.59\n\n\nCVE-2019-10930: \n\nAll Versions\n\n\nDIGSI 5\n\nAll Versions prior to v7.90\n\n\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nA remote attacker could use specially crafted packets sent to Port 443/TCP to upload, download, or delete files in certain parts of the file system.\nCVE-2019-10930 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.2    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets sent to Port 443/TCP could cause a denial-of-service condition.\nCVE-2019-10931 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nPierre Capillon, Nicolas Looss, and Jean-Baptiste Galet from Agence Nationale de la Sécurité des Systèmes d’Information (ANSSI) reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens recommends users upgrade to V7.90 where available and apply the following specific mitigations:\nSIPROTEC 5 device types 6MD85, 6MD86, 6MD89, 7UM85, 7SA87, 7SD87, 7SL87, 7VK87, 7SA82, 7SA86, 7SD82, 7SD86, 7SL82, 7SL86, 7SJ86, 7SK82, 7SK85, 7SJ82, 7SJ85, 7UT82, 7UT85, 7UT86, 7UT87 and 7VE85 with CPU variants CP300 and CP100 and the respective Ethernet communication modules:\n\nUpdate to firmware Version 7.90. Search for ‘SIPROTEC 5 - DIGSI Device Drivers v7.90’ on the Siemens Industry Online Support site. Firmware Version 7.90 for the communication modules can also be found on each device specific download page. Applying the update causes the device / module to go through a single restart cycle.\n\nDIGSI 5 engineering software:\n\nUpdate to DIGSI 5 v7.90 and activate the client authorization feature.\n\nSIPROTEC 5 with CPU variants CP200 and the respective Ethernet communication modules\n\nCVE-2019-10931: Update to firmware v7.59. Search for ‘SIPROTEC 5 - DIGSI Device Drivers v7.59’ on the Siemens Industry Online Support site. The firmware version v7.59 for the communication modules can also be found on each device specific download page. Applying the update causes the device/module to go through a single restart cycle.\n\n--------- End Update C Part 2 of 2 ---------\nSIPROTEC 5 device types 7SS85 and 7KE85:\n\nUpdate to Version 8.01 or later. Search for ‘SIPROTEC 5 - DIGSI Device Drivers’ on the Siemens Industry Online Support site. Applying the update causes the device/module to go through a single restart cycle.\n\n--------- End Update C Part 2 of 2 ---------\nDIGSI 5 engineering software:\n\nUpdate to DIGSI 5 v7.90 and activate the client authorization feature.\n\nSIPROTEC 5 with CPU variants CP200 and the respective Ethernet communication modules\n\nCVE-2019-10931: Update to firmware v7.59. Search for ‘SIPROTEC 5 - DIGSI Device Drivers v7.59’ on the Siemens Industry Online Support site. The firmware version v7.59 for the communication modules can also be found on each device specific download page. Applying the update causes the device/module to go through a single restart cycle.\n\nAll other SIPROTEC 5 device types with CPU variants CP300, CP200, and CP100 and the respective Ethernet communication modules:\n\nBlock access to Port 443/TCP e.g., with an external firewall.\nActivate role-based access control (RBAC) in the device (supported in SIPROTEC 5 firmware v7.80 and higher).\nActivate the DIGSI 5 connection password in the device (supported in all SIPROTEC 5 firmware versions).\n\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-899560 \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10931",
    "CVE-2019-10930"
  ],
  "techniques": [],
  "advisory": "icsa-19-190-05",
  "title": "Siemens SIPROTEC 5 and DIGSI 5 (Update C) | CISA",
  "source": "ics-advisories",
  "id": "aa3eaa5ee0a227ba642c335f4aca481a06ca37e265885c32a9a5516523cb832f"
}