{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Luxion\nEquipment: KeyShot products\nVulnerabilities: Out-of-bounds Write, Out-of-bounds Read, Insufficient UI Warning of Dangerous Operations, Untrusted Pointer Dereference, Path Traversal\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-035-01 Luxion KeyShot that was published February 4, 2021, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow arbitrary code execution, the storing of arbitrary scripts into automatic startup folders, and the attacking of products without sufficient UI warning.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Luxion software, 3D rendering and animation software, are affected:\n\nKeyShot versions prior to 10.1\nKeyShot Viewer versions prior to 10.1\nKeyShot Network Rendering versions prior to 10.1\nKeyVR versions prior to 10.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to multiple out-of-bounds write issues while processing project files, which may allow an attacker to execute arbitrary code.\nCVE-2021-22647 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read while processing project files, which may allow an attacker to execute arbitrary code.\nCVE-2021-22643 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.3    INSUFFICIENT UI WARNING OF DANGEROUS OPERATIONS CWE-357\nThe affected product is vulnerable to an attack because the .bip documents display a “load” command, which can be pointed to a .dll from a remote network share. As a result, the .dll entry point can be executed without sufficient UI warning.\nCVE-2021-22645 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.4    UNTRUSTED POINTER DEREFERENCE CWE-822\nThe affected product has multiple NULL pointer dereference issues while processing project files, which may allow an attacker to execute arbitrary code.\nCVE-2021-22649 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.5    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nWhen loading a specially crafted file, the application, while processing the extraction of temporary files, suffers from a directory traversal vulnerability, which allows an attacker to store arbitrary scripts into automatic startup folders.\nCVE-2021-22651 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nrgod, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n5. MITIGATIONS\nLuxion has released an update to KeyShot (v10.1) and recommends users update to the latest version.\n--------- Begin Update A Part 1 of 1 --------- \nFor more information on products dependent on the affected KeyShot products, see the following vendor security advisory:\n\nSiemens: SSA-231216\n\n--------- End Update A Part 1 of 1 --------- \nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n \n",
  "cves": [
    "CVE-2021-22645",
    "CVE-2021-22649",
    "CVE-2021-22647",
    "CVE-2021-22643",
    "CVE-2021-22651"
  ],
  "techniques": [],
  "advisory": "icsa-21-035-01",
  "title": "Luxion KeyShot (Update A) | CISA",
  "source": "ics-advisories",
  "id": "92b78cd55d0a57cdecb28a4c94f251bea8f9d038b649b8be93496aa347c2f1c7"
}