{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Advantech\nEquipment: ADAM-3600\nVulnerability: Use of Hard-coded Cryptographic Key\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthorized access to intercept traffic using the hardcoded key. This could allow an attacker to achieve Web Server login and perform further actions.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ADAM-3600, a remote terminal unit, are affected:\n\nADAM-3600: Version 2.6.2 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nThe affected product has a hardcoded private key available inside the project folder, which may allow an attacker to achieve Web Server login and perform further actions.\nCVE-2022-22987 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, United States, Europe\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nAagam Shah (neutrinoguy) reported this vulnerability to CISA.\n4. MITIGATIONS\nAdvantech is aware of the issue and is currently developing a solution. For more information, contact Advantech technical support. \nAdvantech recommends users add their own generated SSL private key.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-22987"
  ],
  "techniques": [],
  "advisory": "icsa-22-032-02",
  "title": "Advantech ADAM-3600 | CISA",
  "source": "ics-advisories",
  "id": "c53b0fd617ed40233ea33001a155a82be7fe5cceec89e9581d867881ba67f474"
}