{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.6\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: FactoryTalk Linx Software\nVulnerabilities: Improper Input Validation, Path Traversal, Unrestricted Upload of File with Dangerous Type\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to cause a denial-of-service condition, obtain remote code execution, and read sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products are affected:\n\nFactoryTalk Linx Versions 6.00, 6.10, and 6.11\n\n--------- Begin Update A Part 1 of 1 ---------\n\nRSLinx Classic v4.11.00 and prior (Versions removed from the scope of this advisory)\n\n--------- End Update A Part 1 of 1 ---------\nThe following products that utilize FactoryTalk Linx Software are affected:\n\nConnected Components Workbench: Version 12 and prior\nControlFLASH: Version 14 and later\nControlFLASH Plus: Version 1 and later\nFactoryTalk Asset Centre: Version 9 and later\nFactoryTalk Linx CommDTM: Version 1 and later\nStudio 5000 Launcher: Version 31 and later\nStudio 5000 Logix Designer software: Version 32 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nAn exposed API call allows users to provide files to be processed without sanitation. This may allow an attacker to specify a filename to execute unauthorized code and modify files or data.\nCVE-2020-11999 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:N).\n3.2.2    IMPROPER INPUT VALIDATION CWE-20\nThe parsing mechanism that processes certain file types does not provide input sanitation. This may allow an attacker to use specially crafted files to traverse the file system and modify or expose sensitive data or execute arbitrary code.\nCVE-2020-12001 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:N).\n3.2.3    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nAn exposed API call allows users to provide files to be processed without sanitation. This may allow an attacker to use specially crafted requests to traverse the file system and expose sensitive data on the local hard drive.\nCVE-2020-12003 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.4    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nA vulnerability exists in the communication function that enables users to upload EDS files by FactoryTalk Linx. This may allow an attacker to upload a file with bad compression, consuming all the available CPU resources, leading to a denial-of-service condition.\nCVE-2020-12005 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov and Amir Preminger (VP Research) of Claroty reported these vulnerabilities to Rockwell Automation and CISA.\n4. MITIGATIONS\nRockwell Automation recommends users apply these patches by following instructions in knowledgebase articles below: \n\nPatch Roll-up for CPR9 SRx (Login Required)\nFactoryTalk Linx/Services patch RAID# 1124820 (Login Required)\nFactoryTalk Linx patch RAID# 1126433 (Login Required)\n\nNetwork-based vulnerability mitigations for embedded products:\n\nBlock all traffic to EtherNet/IP or other CIP protocol-based devices from outside the manufacturing zone by blocking or restricting access to TCP Ports 2222, 7153, and UDP Port 44818 using proper network infrastructure controls, such as firewalls, UTM devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation products, see Knowledgebase Article ID 898270\n\nGeneral mitigations:\n\nLocate control system networks and devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nFor more information, please refer to Rockwell Automation’s security advisory: 54102-Industrial Security Advisory Index.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-11999",
    "CVE-2020-12001",
    "CVE-2020-12003",
    "CVE-2020-12005"
  ],
  "techniques": [],
  "advisory": "icsa-20-163-02",
  "title": "Rockwell Automation FactoryTalk Linx Software (Update A) | CISA",
  "source": "ics-advisories",
  "id": "72208b5897b4b4acc8aa612e8dc15e866ff515d9e2332429e7b6cba6dc7a9389"
}