{
  "markdown": "\nCVSS v3 8.9\nATTENTION: Remotely exploitable.\nVendor: OSIsoft\nEquipment: PI Server 2017\nVulnerabilities: Improper Authentication\nAFFECTED PRODUCTS\nOSIsoft reports that the vulnerabilities affect the following PI Server products:\n\nPI Data Archive versions prior to 2017.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow the attacker to spoof a PI Server or cause undefined behavior within the PI Network Manager.\nMITIGATION\nOSIsoft recommends that users upgrade to PI Data Archive 2017. There is more detail in the “Security Information and Guidance” section of the release notes on the OSIsoft web page (user account required):\nhttps://techsupport.osisoft.com/Downloads/File/bd5c24f2-4937-45e6-aaa5-939d6208f5fc\nOSIsoft recommends users run the PI Data Archive on a secured internal control or corporate network. For a starting point on PI System security best practices, see Knowledge Base Article KB00833 - Seven best practices for securing your PI Server on the OSIsoft web page:\nhttps://techsupport.osisoft.com/Troubleshooting/KB/KB00833\nPlease see Security Bulletin AL00315 on the OSIsoft web page for more information about this issue:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00315\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nPI Data Archive has protocol flaws with the potential to expose change records in the clear and allow a malicious party to spoof a server within a collective.\nCVE-2017-7930 has been assigned to this vulnerability. OSIsoft calculated a CVSS v3 base score of 8.9; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:L).\n\nIMPROPER AUTHENTICATION CWE-287\n\nPI Network Manager using older protocol versions contains a flaw that could allow a malicious user to authenticate with a server and then cause PI Network Manager to behave in an undefined manner.\nCVE-2017-7934 has been assigned to this vulnerability. OSIsoft calculated a CVSS v3 base score of 5.9; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nOSIsoft self-disclosed these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sectors: Multiple Sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2017-7934",
    "CVE-2017-7930"
  ],
  "techniques": [],
  "advisory": "icsa-17-164-02",
  "title": "OSIsoft PI Server 2017 | CISA",
  "source": "ics-advisories",
  "id": "c3e8db99d73f2158391901820c9b2d90f0ed3340e735b53f2aa0984915b080a5"
}