{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: SpiderControl\nEquipment: SCADAWebServer\nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SCADAWebServer are affected:\n\nSCADAWebServer: Versions 2.08 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nSpiderControl SCADA Webserver versions 2.08 and prior are vulnerable to path traversal. An attacker with administrative privileges could overwrite files on the webserver using the HMI's upload file feature. This could create size zero files anywhere on the webserver, potentially overwriting system files and creating a denial-of-service condition.\nCVE-2023-3329 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide (Primarily Europe)\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nYang Liu from ELEX FEIGONG RESEARCH INSTITUTE of Elex CyberSecurity, Inc. reported this vulnerability to CISA.\n4. MITIGATIONS\nSpiderControl recommends users update their systems to the latest version.\nSpiderControl recommends users apply the following mitigations:\n\nIf doing development work on the device, after the development phase is finished, switch off the file upload feature. To do this, go to the file C:\\www\\ZelsWebServ.xml and set the property “file_upload_en” to 0 like so: <file_upload_en>0</file_upload_en> . This will mitigate the vulnerability in all older versions, and should also be done for the current version in order to prevent unwanted access to the Web-servers html file directory.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-3329"
  ],
  "techniques": [],
  "advisory": "icsa-23-173-03",
  "title": "SpiderControl SCADAWebServer | CISA",
  "source": "ics-advisories",
  "id": "47cbc69c7ea3445e36495ac8aa7acfcd891ae10e1660753e6463d41b32c84c0a"
}