{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: GOT\nVulnerability: Improper Authentication\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-112-02 Mitsubishi Electric GOT that was published April 22, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to gain unauthorized access.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the vulnerability affects the VNC function of the following devices: \n--------- Begin Update A Part 1 of 2 ---------\n\nGOT2000 series\n\nGT27 model: VNC server Versions 01.39.010 and prior\nGT25 model: VNC server Versions 01.39.010 and prior\nGT21 model: \n\nGT2107-WTBD: VNC server Versions 01.40.000 and prior\nGT2107-WTSD: VNC server Versions 01.40.000 and prior\n\n\n\n\nGOT SIMPLE series\n\nGS21 model\n\nGS2110-WTBD-N: VNC server Versions 01.40.000 and prior\nGS2107-WTBD-N: VNC server Versions 01.40.000 and prior\n\n\n\n\n\nTo check the version in use, please refer to the user’s manual available from the Mitsubishi Electric FA Global website.\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHENTICATION CWE-287\nA password authentication bypass vulnerability exists in the VNC function of the GOT2000 series and the GOT SIMPLE series due to improper authentication. \nCVE-2021-20590 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nMitsubishi Electric instructs users to restrict access to the product only from trusted networks and hosts until they can update to one of the following fixed versions:\n\nGOT2000 series\n\nGT27 model: VNC server Version 01.40.000 or later\nGT25 model: VNC server Version 01.40.000 or later\nGT21 model: \n\nGT2107-WTBD: VNC server Version 01.41.000 or later\nGT2107-WTSD: VNC server Version 01.41.000 or later\n\n\n\n\nGOT SIMPLE series\n\nGS21 model\n\nGS2110-WTBD-N: VNC server Version 01.41.000 or later\nGS2107-WTBD-N: VNC server Version 01.41.000 or later\n\n\n\n\n\nPlease refer to the Mitsubishi Electric website for details and update procedures.\n--------- End Update A Part 1 of 2 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize a VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has high attack complexity.\n",
  "cves": [
    "CVE-2021-20590"
  ],
  "techniques": [],
  "advisory": "icsa-21-112-02",
  "title": "Mitsubishi Electric GOT (Update A) | CISA",
  "source": "ics-advisories",
  "id": "e6454ff3594652dd32035ffecad4d9b0b7acfc1e5164c1eae0d8c6044e318712"
}