{
  "markdown": "\nCVSS v3 5.3\nATTENTION: Locally exploitable/low skill level to exploit.\nVendor: WECON Technology Co., Ltd. (WECON)\nEquipment: LeviStudio HMI Editor\nVulnerabilities: Buffer Overflows\nAFFECTED PRODUCTS\nThe following versions of LEVI Studio HMI Editor, an HMI programming software product, are affected:\n\nLEVI Studio HMI Editor v1.8.29 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may result in arbitrary code execution.\nMITIGATION\nWECON recommends that users update to the latest version, which can be found at the following location:\nhttp://www.we-con.com.cn/en/download.aspx?id=45\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nSpecially-crafted malicious files may be able to cause stack-based buffer overflow vulnerabilities, which may allow remote code execution.\nCVE-2017-16739 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n\nHEAP-BASED BUFFER OVERFLOW CWE-122\n\nA specially-crafted malicious file may be able to cause a heap-based buffer overflow vulnerability when opened by a user.\nCVE-2017-16737 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\nRESEARCHER\nSergey Zelenyuk of RVRT, HanM0u of CloverSec Labs working with Trend Micro's Zero Day Initiative, and Brian Gorenc of Trend Micro's Zero Day Initiative reported the vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Systems.\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\n",
  "cves": [
    "CVE-2017-16739",
    "CVE-2017-16737"
  ],
  "techniques": [],
  "advisory": "icsa-18-011-01",
  "title": "WECON Technology Co., Ltd. LeviStudio HMI Editor | CISA",
  "source": "ics-advisories",
  "id": "d5818fb378c39b3a695ab40dab7fcd44c4a6bd645d8695d45232d4e11939c553"
}