{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: ICONICS, Mitsubishi Electric\nEquipment: ICONICS GENESIS64, Mitsubishi Electric MC Works64\nVulnerabilities: Out-of-bounds Read, Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may result in remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe vulnerabilities affect the following HMI SCADA products: \n\nGENESIS64 (all versions up to and including 10.97) \nMC Works64 (all version of MC Works64, up to and including Version 4.04E)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nA lack of proper validation of user-supplied data may result in a write past the end of an allocated data structure. User interaction is required to exploit this vulnerability as the target must attempt to import a malicious AutoCAD DWG file into GraphWorX64.\nCVE-2021-27041 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS READ CWE-125\nA lack of proper validation of user-supplied data may allow reading past the end of an allocated data structure. User interaction is required to exploit this vulnerability as the target must visit a malicious page or open a malicious file.\nCVE-2021-27040 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple including Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: ICONICS is headquartered in the United States. Mitsubishi Electric is headquartered in Japan.\n\n3.4 RESEARCHER\nMichael DePlante of Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nICONICS and Mitsubishi Electric are releasing Critical Fix Rollups or patches for these products. GENESIS64 Version 10.97.1 and later will not be vulnerable to this exploit.\nICONICS and Mitsubishi Electric recommend users of these products take the following mitigation steps:\n\nUse a firewall. Place control system networks and devices behind firewalls and isolate them from the business network.\nMinimize network exposure for all control system devices. Control system devices should not directly face the Internet.\nDo not click web links or open unsolicited attachments in email messages.\nWhen importing any AutoCad DWG file, make sure it is known to come from a trusted source.\nInstall the applicable Critical Fix Rollup, when available.\n\nICONICS provides information and useful links related to its security updates at its company website.\nMitsubishi Electric provides information and useful links related to this security update at its company website.\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-27040",
    "CVE-2021-27041"
  ],
  "techniques": [],
  "advisory": "icsa-21-294-01",
  "title": "ICONICS GENESIS64 and Mitsubishi Electric MC Works64 | CISA",
  "source": "ics-advisories",
  "id": "cb0d407778b3001e9a4a08e0b7a1247ae2b2469eaf31a3b7f856a9178f3d3160"
}