{
  "markdown": "\nCVSS v3 7.3\nATTENTION: Remotely exploitable. Low skill level to exploit.\nVendor: FATEK Automation\nEquipment: PLC Ethernet Module\nVulnerability: Stack-based buffer overflow\nAFFECTED PRODUCTS\nThe affected Ether_cfg software configuration tool runs on the following Fatek PLCs:\n\nCBEH versions prior to V3.6 Build 170215,\nCBE versions prior to V3.6 Build 170215,\nCM55E versions prior to V3.6 Build 170215, and\nCM25E versions prior to V3.6 Build 170215.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a remote attacker to crash the affected device or allow remote code execution.\nMITIGATION\nFATEK Automation has created a new version of the “ether_cfg software tool” to mitigate this vulnerability. This file is available to download at:\nhttp://www.fatek.com/en/technical.php?act=software&catId=12\nFor more information about this vulnerability and how to mitigate it, please see the Fatek EtherConfig release note on the Fatek technical support web page:\nhttp://www.fatek.com/en/technical.php?act=software&catId=1\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nThe stack-based buffer overflow vulnerability has been identified, which may allow remote code execution or crash the affected device.\nCVE-2017-6023 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\nRESEARCHER\nAn anonymous researcher working with Trend Micro's Zero Day Initiative identified this vulnerability.\nBACKGROUND\nCritical Infrastructure Sector(s): Commercial Facilities, Critical Manufacturing\nCountries/Areas Deployed: Asia and Europe\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-6023"
  ],
  "techniques": [],
  "advisory": "icsa-17-073-01",
  "title": "FATEK Automation PLC Ethernet Module | CISA",
  "source": "ics-advisories",
  "id": "f606f05a818d33781e8a86ad64151c2ab2af73fdf6a52f21bb2816f25a830f4a"
}