{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: RSLinx Classic\nVulnerabilities: Stack-based Buffer Overflow, Heap-based Buffer Overflow, Resource Exhaustion\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device being accessed or allow arbitrary code execution on the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of RSLinx Classic, a software platform that allows Logix5000 Programmable Automation Controllers to connect to a wide variety of Rockwell Software applications, are affected:\n\nRSLinx Classic Versions 4.00.01 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThis vulnerability may allow a remote threat actor to intentionally send a malformed CIP packet to Port 44818, causing the software application to stop responding and crash. This vulnerability also has the potential to exploit a buffer overflow condition, which may allow the threat actor to remotely execute arbitrary code.\nCVE-2018-14829 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nThis vulnerability may allow a remote, unauthenticated threat actor to intentionally send a malformed CIP packet to Port 44818, causing the RSLinx Classic application to terminate. The user will need to manually restart the software to regain functionality.\nCVE-2018-14821 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    UNCONTROLLED RESOURCE CONSUMPTION ('RESOURCE EXHAUSTION') CWE-400\nA remote, unauthenticated threat actor may intentionally send specially crafted Ethernet/IP packets to Port 44818, causing the software application to stop responding and crash. The user must restart the software to regain functionality.\nCVE-2018-14827 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation, working with Tenable and Younes Dragoni and Alessandro Di Pinto of Nozomi Networks, reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nRockwell Automation has released a new version of the software that can found at Rockwell Automation knowledgebase article KB 1075712 (login is required):\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1075712\nRockwell Automation also reports that users can disable Port 44818 if it is not utilized during system operation. For more details on how to disable the port and for Rockwell Automation’s general security guidelines, please visit knowledgebase article KB 1075747 (login is required):\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1075747\nPlease see Rockwell Automation’s industrial security advisory at the following location on their website for further details (login is required):\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1075747\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-14827",
    "CVE-2018-14829",
    "CVE-2018-14821"
  ],
  "techniques": [],
  "advisory": "icsa-18-263-02",
  "title": "Rockwell Automation RSLinx Classic | CISA",
  "source": "ics-advisories",
  "id": "dea636cb8995bd75bc7bb818ce52e8ccf6437f149a6a4de122d86ff3e7fb6fcc"
}