{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Nucleus Real-Time Operating System (RTOS) FTP Server\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-286-07 Siemens Nucleus RTOS FTP Server that was published October 13, 2022, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to generate a denial-of-service condition on devices running the affected software.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Nucleus RTOS components contain the affected File Transport Protocol (FTP) server:\n\nNucleus NET: All versions\n\n--------- Begin Update A Part 1 of 4 --------- \n\nNucleus ReadyStart V3: All versions\n\n--------- End Update A Part 1 of 4 --------- \n\nNucleus Source Code: Versions including affected FTP server\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\n--------- Begin Update A Part 2 of 4 --------- \nThe FTP server does not properly release memory resources reserved for incomplete connection attempts by FTP clients. This could allow a remote attacker to generate a denial-of-service condition on devices incorporating a vulnerable version of the FTP server.\n--------- End Update A Part 2 of 4 --------- \nCVE-2022-38371 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends updating to the latest version of its software where available:\n\nNucleus NET: No fix available – users should follow general security measures for mitigation.\n\n--------- Begin Update A Part 3 of 4 --------- \n\nNucleus ReadyStart V3: Update to V2017.02.4 and apply the patch \"2017.02.4_patch_CVE-2022-38371\"\n\n--------- End Update A Part 3 of 4 --------- \n\nNucleus Source Code: Contact Siemens (login required) to receive update information\n\n--------- Begin Update A Part 4 of 4 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nConfigure TCP_MAX_KEEPALIVES to a lower value such as 3.\nConfigure TCP_KEEPALIVE_INTERVAL and TCP_KEEPALIVE_DELAY be set to 3 seconds.\nRebuild the application.\n\n--------- End Update A Part 4 of 4 --------- \nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see the associated Siemens Security Advisory in HTML or CSAF formats.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-38371"
  ],
  "techniques": [],
  "advisory": "icsa-22-286-07",
  "title": "Siemens Nucleus RTOS FTP Server (Update A) | CISA",
  "source": "ics-advisories",
  "id": "b8836b8bbf96015d8f431f5edb2906f501fd8e38ad6ba2e1a34b540ec7b78dcd"
}