{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.3\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Delta Electronics\nEquipment: Delta Industrial Automation TPEditor\nVulnerability: Heap-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-137-04 Delta Electronics Delta Industrial Automation TPEditor that was published May 17, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the accessed device, resulting in a buffer overflow condition that may allow remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Delta Industrial Automation TPEditor, a programming software for Delta text panels operating on Windows, are affected:\n\nDelta Industrial Automation TPEditor, Version 1.89 or prior.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1 HEAP-BASED BUFFER OVERFLOW CWE-122\nParsing a malformed program file may cause heap-based buffer overflow vulnerability, which may allow remote code execution.\nCVE-2018-8871 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Commercial Facilities, Communications, Critical Manufacturing, Energy, Healthcare and Public Health\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Taiwan\n\n4.4 RESEARCHER\nA security researcher Robert Hawes/Twitter@VulnMind working with Trend Micro’s Zero Day Initiative (ZDI) reported this vulnerability to NCCIC.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 --------\nDelta Electronics recommends affected users update to the latest version of Delta Industrial Automation TPEditor, Version 1.90, which is available for download at:\nhttp://www.deltaww.com/Products/PluginWebUserControl/downloadCenterCounter.aspx?DID=4333&DocPath=1&hl=en-US.\nUntil users update to the new version of TPEditor, the company suggests affected users should restrict the interaction with the application to trusted files.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n--------- End Update A Part 1 of 1 ----------\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-8871"
  ],
  "techniques": [],
  "advisory": "icsa-18-137-04",
  "title": "Delta Electronics Delta Industrial Automation TPEditor (Update A) | CISA",
  "source": "ics-advisories",
  "id": "4c44ff9eddfbfff11f82acdd837998af4311d80d82ffd78229c43e57d2396192"
}