{
  "markdown": "\nOVERVIEW\nIvan Sanchez from Nullcode Team has identified a buffer overflow security vulnerability in the DTM (Device Type Manager) software for Schneider Electric’s Invensys SRD Control Valve Positioner product line. Schneider Electric has produced a new version that mitigates this vulnerability.\nAFFECTED PRODUCTS\nThe following Schneider Electric products are affected:\n\nDTM Version 3.1.6 and all previous versions used with SRD 960 and SRD 991 Control Valve Positioners.\n\nIMPACT\nAn attacker who exploits this vulnerability may be able to execute arbitrary code.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSchneider Electric’s corporate headquarters is located in Paris, France, and maintains offices in more than 100 countries worldwide.\nThe affected products, SRD 960 and SRD 991 Control Valve Positioners, operate pneumatic valve actuators. According to Schneider Electric, these products are deployed across several sectors including Critical Manufacturing, Energy, Water and Wastewater Systems, and others. Schneider Electric estimates that these products are used globally.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOWCWE-121: Stack-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121.html, web site last accessed February 24, 2015.\n\nThe vulnerability identified includes a stack buffer overflow condition in a DLL file that could possibly result in remote code execution.\nCVE-2014-9206NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-9206, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.2 has been assigned; the CVSS vector string is (AV:L/AC:H/Au:N/C:P/I:P/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:H/Au:N/C:P/I:P/A:C, web site last accessed February 24, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not exploitable remotely and cannot be exploited without user interaction. The exploit is only triggered when a local user runs the vulnerable application and loads the malformed DLL file.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult. Social engineering is required to convince the user to accept the malformed DLL file. Additional user interaction is needed to load the malformed file. This decreases the likelihood of a successful exploit.\nMITIGATION\nSchneider Electric encourages customers using these products to download the latest version, V3.6.3, that mitigates this vulnerability. It can be found at the bottom of the following web site:\nhttp://www.foxboro-eckardt.eu/download/FDT-DTMselector.html\nSchneider Electric’s security notice SEVD-2015-050-01 is available at the following location:\nhttp://download.schneider-electric.com/files?p_File_Id=740491624&p_File_Name=SEVD-2015-050-01.pdf\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed February 24, 2015. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed February 24, 2015. for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2014-9206"
  ],
  "techniques": [],
  "advisory": "icsa-15-055-03",
  "title": "Schneider Electric Invensys Positioner Buffer Overflow Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "0b603a2240ac363e42b353cae7aa0e186457f13984cfd2a9f81951caea78f35a"
}