{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: AutomationDirect\nEquipment: Stride Field I/O\nVulnerability: Cleartext Transmission of Sensitive Information.\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain user credentials.\n3. TECHNICAL DETAILS\n\n\n3.1 AFFECTED PRODUCTS\nAutomationDirect reports this vulnerability affects Stride Field I/O products with the following part numbers:\n\nSIO-MB04RTDS, firmware version prior to v8.3.4.0\nSIO- MB04ADS, firmware version prior to v8.4.3.0\nSIO-MB04THMS, firmware version prior to v8.5.4.0\nSIO-MB08ADS-1, firmware version prior to v8.6.3.0\nSIO-MB08ADS-2, firmware version prior to v8.7.3.0\nSIO-MB08THMS, firmware version prior to v8.8.4.0\nSIO-MB04DAS, firmware version prior to v8.11.3.0\nSIO-MB12CDR, firmware version prior to v8.0.4.0\nSIO-MB16CDD2, firmware version prior to v8.1.4.0\nSIO-MB16ND3, firmware version prior to v8.2.4.00\nSIO-MB12CDR, batch number (B/N) 5714442222\nSIO-MB04ADS, B/N 5714442222\nSIO-MB04THMS, B/N 57141862221\nSIO-MB04DAS, B/N 4714432222\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nAny attempt (good or bad) to log into the devices listed above with a web browser may result in the device responding with its password in the communication packets.\nCVE-2022-2485 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nByron Chaney of Accenture Security reported this vulnerability to CISA.\n4. MITIGATIONS\nAutomationDirect recommends users upgrade the Stride Modbus Field I/O units listed in the affected products section with the firmware associated with the part number. Firmware can be downloaded from the AutomationDirect software downloads page.\nThe modules with a listed B/N number in the affected products section have a firmware update issue and must be returned to AutomationDirect for replacement modules; users can create an RMA on the AutomationDirect website.\nAutomation networks and systems may have built-in password protection schemes, but this is only one step in securing systems. Automation control system networks must incorporate data protection and security measures at least as robust as a typical business computer system. AutomationDirect recommends users of PLCs, HMI products and SCADA systems perform their own network security analysis to determine the proper level of security required for their application.\nAutomationDirect has identified the specific mitigation actions listed below:\n\nSecure physical access.\nIsolate and air gap networks when possible.\n\nFollow the security considerations in the Automation Direct Security Considerations document.\nSee AutomationDirect product advisory number PA-COM-006 for more information. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-2485"
  ],
  "techniques": [],
  "advisory": "icsa-22-202-05",
  "title": "AutomationDirect Stride Field I/O | CISA",
  "source": "ics-advisories",
  "id": "6aa5e118246e2126f4e08bc8b589decf978adbfb6956d525e6e2b3149c8829c9"
}