{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Delta Electronics\nEquipment: DOPSoft\nVulnerabilities: Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-182-03 Delta Electronics DOPSoft (Update A) that was published July 27, 2022, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow arbitrary code execution and disclose information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of DOPSoft, a software supporting the DOP-100 series HMI screens, are affected:\n\nDOPSoft Version 4.0.10.17 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read while processing project files, which may allow an attacker to disclose information.\nCVE-2021-27455 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n4.2.2    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read, which may allow an attacker to execute arbitrary code.\nCVE-2021-27412 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n4.4 RESEARCHER\nNatnael Samson (@NattiSamson), working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update B Part 1 of 1 ---------\nDelta Electronics recommends updating to DOPSoft v4.00.16 or later. \n--------- End Update B Part 1 of 1 ---------\nDelta Electronics will release an updated version of DOPSoft on August 31, 2021, and recommends users install this update on all affected systems.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-27412",
    "CVE-2021-27455"
  ],
  "techniques": [],
  "advisory": "icsa-21-182-03",
  "title": "Delta Electronics DOPSoft (Update B) | CISA",
  "source": "ics-advisories",
  "id": "4d33d88d1197f4bd6a37cecb839bd6a0176ef1510a7d3c561e610dd2dddcd979"
}