{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: MELSEC-Q Series C Controller Module\nVulnerability: Heap-based Buffer Overflow \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition or allow remote code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of MELSEC-Q Series C Controller Module using Wind River VxWorks Version 6.4 are affected:\n\nModule Q12DCCPU-V: First 5 digits of serial number 24031 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe affected product uses a vulnerable version of Wind River VxWorks that could result in a heap-based buffer overflow in the DHCP client\nCVE-2021-29998 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends the following:\n\nUpdate to 24032 (first 5 digits of serial number) or later. Contact a Mitsubishi Electric representative for more information.\nDisable the DHCP function in “Security Settings” of the C language controller settings/monitor tool if the product is in “Extended mode” and the DHCP client function is not required.\nUpdate DHCP server to the latest version.\nUse a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.\nUse within a trusted LAN that is properly divided by routers and firewalls.\n\nFor more information see Mitsubishi Electric’s advisory 2022-001\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-29998"
  ],
  "techniques": [],
  "advisory": "icsa-22-102-02",
  "title": "Mitsubishi Electric MELSEC-Q Series C Controller Module | CISA",
  "source": "ics-advisories",
  "id": "bd0ec8f06b89336f44ac9b21e93749400af3e73ed6f7ac2675262b6d4c4c7c93"
}