{
  "markdown": "\nCVSS v3 8.8\nATTENTION: Remotely exploitable/low skill level to exploit\nVendor: SpiderControl\nEquipment: MicroBrowser\nVulnerability: Uncontrolled Search Path Element\nAFFECTED PRODUCTS\nThe following versions of SpiderControl MicroBrowser, a touch panel operating system, are affected:\n\nMicroBrowser Windows XP, Vista 7, 8 and 10, Versions 1.6.30.144 and prior.\n\nIMPACT\nExploitation of this vulnerability could allow an attacker to execute arbitrary code on the target system.\nMITIGATION\nSpiderControl has provided software update Version 1.6.30.148 for MicroBrowser, which fixes this vulnerability. SpiderControl recommends users update to the new version, which is available at the following location:\nhttp://spidercontrol.net/download/downloadarea/?lang=en\nNCCIC/ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nAn uncontrolled search path element vulnerability has been identified which could be exploited by placing a specially crafted DLL file in the search path. If the malicious DLL is loaded prior to the valid DLL, an attacker could execute arbitrary code on the system.\nCVE-2017-14010 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nKarn Ganeshen reported this vulnerability to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Europe\nCompany Headquarters Location: Switzerland\n",
  "cves": [
    "CVE-2017-14010"
  ],
  "techniques": [],
  "advisory": "icsa-17-292-01",
  "title": "SpiderControl MicroBrowser | CISA",
  "source": "ics-advisories",
  "id": "488cc01cef1681d91e5f42f7f9a54499648bb64186e5c7cf1fc505a878ad624c"
}