{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls, Inc.\nEquipment: VideoEdge\nVulnerability: Improper Handling of Syntactically Invalid Structure=\n\n2. RISK EVALUATION\nRunning a vulnerability scanner against VideoEdge NVRs can cause some functions to stop.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of VideoEdge, a network video recorder, are affected:\n\nVideoEdge: Versions 5.4.1 to 5.7.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER HANDLING OF SYNTACTICALLY INVALID STRUCTURE CWE-228\nThe affected product is susceptible to a vulnerability scan, which may cause a denial-of-service condition.\nCVE-2021-36199 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls recommends users upgrade VideoEdge to Version 5.9 or later. There are also hotfixes for Versions 5.4.1 through 5.7.1.\nUsers may contact American Dynamics technical support for assistance with updates. American Dynamics is a Johnson Controls brand.\nFor additional information, see Johnson Controls Product Security Advisory JCI-PSA-2021-21 v1\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-36199"
  ],
  "techniques": [],
  "advisory": "icsa-22-011-01",
  "title": "Johnson Controls VideoEdge | CISA",
  "source": "ics-advisories",
  "id": "c67e0e603d4afc2c15b79d21c25fd5b431a14504b6fa3a1d8c36e669b50878c6"
}