{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Controlled Electronic Management Systems, Ltd., a subsidiary of Johnson Controls, Inc.\nEquipment: CEM Systems AC2000\nVulnerability: Off-by-one Error\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a local attacker to obtain “super user” access on the underlying Linux operating system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Controlled Electronic Management Systems Ltd. CEM Systems AC2000, an access control system, are affected:\n\nCEM Systems AC2000: All versions prior to Version 10.6\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OFF-BY-ONE ERROR CWE-193\nThe affected product has an off-by-one error vulnerability, which may allow an attacker to achieve “super user” access on the operating system.\nCVE-2021-3156 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls, Inc. reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls recommends users with AC2000 versions prior to 10.6 simply remove sudo. To do this, users may either contact a CEM support team or login to their Linux servers as root and type the following command: rpm -e sudo.\nNote: AC2000 v10.6 includes a fixed version of sudo.\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-20 v1\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-3156"
  ],
  "techniques": [],
  "advisory": "icsa-21-334-04",
  "title": "Johnson Controls CEM Systems AC2000 | CISA",
  "source": "ics-advisories",
  "id": "1c5d877077b3f7dad132ccc7b23c2273bcd919d9232f9a1f8c6b378927152ed7"
}