{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC WinCC and PCS\nVulnerabilities: Exposure of Sensitive Information to an Unauthorized Actor, Insertion of Sensitive Information into Externally-Accessible File or Directory\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-22-041-02 Siemens SIMATIC WinCC and PCS (Update B) that was published May 12, 2022, to the ICS webpage on cisa.gov/ics. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow attackers to retrieve and brute force password hashes and access other systems.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following SIMATIC products: \n\nSIMATIC PCS 7 v9.1: All versions prior to v9.1 SP1\nSIMATIC PCS 7 v8.2: All versions prior to v7.4 SP1 Update 19\nSIMATIC PCS 7 v9.0: All versions prior to v9.0 SP3 UpdateCollection4\nSIMATIC WinCC v7.4: All versions prior to v7.4 SP1 Update 19\nSIMATIC WinCC v7.5: All versions prior to v7.5 Update 6\nSIMATIC WinCC v15 and earlier: All versions prior to v15 SP1 Update 7\nSIMATIC WinCC v16: All versions prior to v16 Update 5\nSIMATIC WinCC v17: All versions prior to v17 Update 2\n\n--------- Begin Update C Part 1 of 2 --------- \n\nSIMATIC WinCC v17: All versions after and including v17 Update 2, but prior to v17 Update 4 are only affected by CVE-2021-40363 \n\n--------- End Update C Part 1 of 2 --------- \n4.2 VULNERABILITY OVERVIEW\n4.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe password hash of a local user account in the remote server could be granted via public API to a user on the affected system. An authenticated attacker could brute force the password hash and use it to login to the server.\nCVE-2021-40360 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.2.2    INSERTION OF SENSITIVE INFORMATION INTO EXTERNALLY-ACCESSIBLE FILE OR DIRECTORY CWE-538\nThe affected component stores the credentials of a local system account in a potentially publicly accessible project file using an outdated cipher algorithm. An attacker may use this to brute force the credentials and take over the system.\nCVE-2021-40363 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens has released updates for several affected products and recommends updating to the latest versions. Siemens is preparing further updates and recommends specific countermeasures for products where updates are not, or not yet available.\n\nSIMATIC PCS 7 v8.2: Install v7.4 SP1 Update 19 or later \nSIMATIC PCS 7 v9.0: Update to v9.0 SP3 UpdateCollection4 or later \nSIMATIC PCS 7 v9.1: Update to v9.1 SP1 or later version \nSIMATIC WinCC v7.4: Update to v7.4 SP1 Update 19 or later \nSIMATIC WinCC v7.5: Update to v7.5 Update 6 or later version \nSIMATIC WinCC v15 and earlier: Update to v15 SP1 Update 7 or later \nSIMATIC WinCC v16: Update to v16 Update 5 or later version \n\n--------- Begin Update C Part 2 of 2 ---------\n\nSIMATIC WinCC v17: Update to v17 Update 4 or later version\n\n--------- End Update C Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nHarden the application’s host to prevent local access by untrusted personnel.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-914168\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2021-40360",
    "CVE-2021-40363"
  ],
  "techniques": [],
  "advisory": "icsa-22-041-02",
  "title": "Siemens SIMATIC WinCC and PCS (Update C) | CISA",
  "source": "ics-advisories",
  "id": "0bfe25bf03f2a820607988cb41031b342affcf8fcf8c806cd85557040cd059e1"
}