{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Phoenix Contact\nEquipment: Automation Worx Software Suite\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could compromise the availability, integrity, or confidentiality of an application programming workstation. Automated systems programmed using one of the affected products are not impacted.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Automation Worx Software Suite are affected:\n\nPC Worx Versions 1.86 and prior \nPC Worx Express Versions 1.86 and prior\nConfig+ Versions 1.86 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nA manipulated PC Worx or Config+ project file could lead to arbitrary code execution due to insufficient input data validation.\nCVE-2019-16675 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Critical Manufacturing, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\n9sg Security Team working with Trend Micro’s Zero Day Initiative reported this vulnerability to CISA. CERT@VDE coordinated this vulnerability with Phoenix Contact.\n4. MITIGATIONS\nPhoenix Contact is in the process of developing an updated version of this product. Prior to receiving the updated version, Phoenix Contact strongly recommends users exchange project files using only secure file exchange services, and that project files should not be exchanged via unencrypted email. Phoenix Contact expects the next version of the Automation Worx Suite to be available prior to the end of 2019, noting the upcoming release of Automation Worx Software Suite will have a more robust validation of arrays regarding dimension and the number of elements allowed during input data conversion. In addition, input data validation will be extended in order to strengthen defenses against manipulated project files. Additional preventative security measures will be enabled for the compiler settings as well. \nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-16675"
  ],
  "techniques": [],
  "advisory": "icsa-19-302-01",
  "title": "PHOENIX CONTACT Automation Worx Software Suite | CISA",
  "source": "ics-advisories",
  "id": "b0895377bcf048d388740361c0e2bca90b4d64cacdc92947db390ebda642978b"
}