{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8 \nATTENTION: Exploitable remotely/low attack complexity\nVendor: Advantech\nEquipment: WebAccess/SCADA\nVulnerability: Untrusted Pointer Dereference\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker gaining remote file system access and achieving remote command execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Advantech WebAccess/SCADA, a browser-based SCADA software package, are affected:\n\nWebAccess/SCADA: All versions prior to 9.1.4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 UNTRUSTED POINTER DEREFERENCE CWE-822\nAll versions prior to 9.1.4 of Advantech WebAccess/SCADA are vulnerable to use of untrusted pointers. The RPC arguments the client sent could contain raw memory pointers for the server to use as-is. This could allow an attacker to gain access to the remote file system and the ability to execute commands and overwrite files.\nCVE-2023-1437 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Chemical, Energy, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nFlorent Saudel reported this vulnerability to CISA.\n4. MITIGATIONS\nAdvantech recommends all affected users update their products to the latest patch. This vulnerability was fixed in Version 9.1.4.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-1437"
  ],
  "techniques": [],
  "advisory": "icsa-23-166-02",
  "title": "Advantech WebAccess/SCADA | CISA",
  "source": "ics-advisories",
  "id": "fd6cd08b9971ec0498c261d8020c17f9b038b3618c1685b58d31b79776e9d8df"
}