{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Siveillance OIS\nVulnerability: OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote unauthenticated attacker to execute code on the affected system with root privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following Siveillance OIS Building Management Systems products: \n\nDesigo CC: All versions with OIS Extension Module\nGMA-Manager: All versions with OIS running on Debian 9 or earlier\nOperation Scheduler: All versions with OIS running on Debian 9 or earlier\nSiveillance Control: All versions with OIS running on Debian 9 or earlier\nSiveillance Control Pro: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OS COMMAND INJECTION CWE-78\nThe affected application incorrectly neutralizes special elements in a specific HTTP GET request, which could lead to command injection. An unauthenticated remote attacker could exploit this vulnerability to execute arbitrary code on the system with root privileges.\nCVE-2021-31891 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Government Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released patches and updates for Siveillance OIS to apply to the products that incorporate the OIS service. Siemens recommends updating the OIS to the latest version v2.5.3 or applying the patch\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nEnsure that the systems where Siveillance OIS is installed are only accessible by trusted personnel\nRestrict access to the affected systems, especially to Port 443/TCP, to trusted IP addresses only\n\nAs a general security measure, Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. Users are advised to follow recommended security practices in order to run the devices in a protected IT environment.\nFor more information, please see Siemens Security Advisory SSA-535380\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-31891"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-18",
  "title": "Siemens Siveillance OIS | CISA",
  "source": "ics-advisories",
  "id": "c4340e3e2a27d2546185aa10c4160e39a5e34e958db4d03dbf2d14c7f6c3130f"
}