{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8 \nATTENTION: Low attack complexity  \nVendor: JTEKT ELECTRONICS CORPORATION \nEquipment: Kostac PLC Programming Software \nVulnerabilities: Out-of-bounds Read, Use After Free \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to disclose information or execute arbitrary code.  \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of JTEKT ELECTRONICS Kostac PLC Programming Software are affected: \n\nJTEKT ELECTRONICS Kostac PLC Programing Software: Versions 1.6.9.0 and earlier \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 OUT-OF-BOUNDS READ CWE-125 \nWhen a specially crafted project file is opened, out-of-bounds read occurs when processing a comment block in stage information because the end of data cannot be verified. \nCVE-2023-22419 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.2 OUT-OF-BOUNDS READ CWE-125 \nWhen a specially crafted project file is opened, out-of-bounds read occurs because buffer size used by the PLC program instructions is insufficient. \nCVE-2023-22421 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.3 USE AFTER FREE CWE-416 \nWhen the maximum number of columns to place the PLC program is out of specification by opening a specially crafted project file, a process accesses memory that has already been freed. \nCVE-2023-22424 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing  \nCOUNTRIES/AREAS DEPLOYED: Worldwide  \nCOMPANY HEADQUARTERS LOCATION: Japan  \n\n3.4 RESEARCHER\nMichael Heinzl reported these vulnerabilities to JPCERT/CC. \n4. MITIGATIONS\nJTEKT ELECTRONICS recommends users to download the following updates: \n\nVersion 1.6.10.0 and above \n\nThis version not only addresses the vulnerability, but also takes measures to prevent crafted project files from being opened. Project files saved with Version 1.6.9.0 or earlier can be re-saved with Version 1.6.10.0 or above to enable this tamper-proof feature. Project files saved with Version 1.6.10.0 or above cannot be opened with Version 1.6.9.0 or earlier. \nFor more information, see JTEKT ELECTRONICS’ Update Notice. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.  \n",
  "cves": [
    "CVE-2023-22421",
    "CVE-2023-22424",
    "CVE-2023-22419"
  ],
  "techniques": [],
  "advisory": "icsa-23-096-03",
  "title": "JTEKT ELECTRONICS Kostac PLC Programming Software | CISA",
  "source": "ics-advisories",
  "id": "5cb75563fadfbb1538eeea34d207f2079e46f3e58426b93a1c6d7f81a6b21793"
}