{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Low skill level to exploit\nVendor: Rockwell Automation\nEquipment: Arena Simulation Software\n\n--------- Begin Update B Part 1 of 2 ---------\n\nVulnerabilities: Use After Free, Information Exposure, Type Confusion, Insufficient UI Warning of Dangerous Operations, Access of Uninitialized Pointer\n\n--------- End Update B Part 1 of 2 ---------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-19-213-05 Rockwell Automation Arena Simulation Software (Update A) that was published September 5, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to cause a current Arena session to fault or enter a denial-of-service (DoS) state, allowing the attacker to run arbitrary code.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Arena Simulation, an event simulation and automation software platform, are affected:\n\nArena Simulation Software for Manufacturing, Cat. 9502-Ax, Versions 16.00.00 and earlier\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE AFTER FREE CWE-416\nA maliciously crafted Arena file opened by an unsuspecting user may result in the application crashing or the execution of arbitrary code.\nCVE-2019-13510 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n\n4.2.2    INFORMATION EXPOSURE CWE-200\nA maliciously crafted Arena file opened by an unsuspecting user may result in the limited exposure of information related to the targeted workstation.\nCVE-2019-13511 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n4.2.3    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nA maliciously crafted Arena file opened by an unsuspecting user may result in the limited exposure of information related to the targeted workstation.\nCVE-2019-13519 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.4    INSUFFICIENT UI WARNING OF DANGEROUS OPERATIONS CWE-357\nA maliciously crafted Arena file opened by an unsuspecting user may result in the limited exposure of information related to the targeted workstation.\nCVE-2019-13521 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- Begin Update B Part 2 of 2 ---------\n4.2.5    ACCESS OF UNINITIALIZED POINTER CWE-824\nA maliciously crafted Arena file opened by an unsuspecting user may result in the use of a pointer that has not been initialized.\nCVE-2019-13527 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- End Update B Part 2 of 2 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nkimiya of 9SG Security Team working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n5. MITIGATIONS\nRockwell Automation has released Version 16.00.01 of Arena Simulation Software to address the reported vulnerabilities.\nRockwell Automation also recommends users:\n\nDo not open untrusted .doe files with Arena Simulation Software.\nEnsure all software is run as a User and not as an Administrator to minimize the impact of malicious code on the infected system.\nUse trusted software, software patches, anti-virus/anti-malware programs, and interact only with trusted websites and attachments\n\nFor more information please see the Rockwell Automation security advisory (login required).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-13510",
    "CVE-2019-13519",
    "CVE-2019-13527",
    "CVE-2019-13521",
    "CVE-2019-13511"
  ],
  "techniques": [],
  "advisory": "icsa-19-213-05",
  "title": "Rockwell Automation Arena Simulation Software (Update B) | CISA",
  "source": "ics-advisories",
  "id": "5b9006280f3c2a5c6473cf559bf7276080bd05123fb913b8c80435cb188a5d66"
}