{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low skill level to exploit\nVendor: Flexera\nEquipment: InstallShield\nVulnerability: Untrusted Search Path\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow execution of a malicious DLL.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Flexera InstallShield are affected:\n\nFlexera InstallShield through 2015 SP1\nFlexera InstallShield is integrated into many products sold by other companies\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNTRUSTED SEARCH PATH CWE-426\nThe affected product is subject to an untrusted search path vulnerability, which may allow an attacker to execute a malicious DLL if placed into the working directory of the setup-launcher executable file through social engineering. \nCVE-2016-2542 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAn anonymous researcher reported this vulnerability to Flexera.\n4. MITIGATIONS\nIt is recommended that users contact the product’s vendor support team for guidance on any mitigations and workarounds regarding Flexera InstallShield issues in relation to that product. \nFor more information see Flexera’s KBR-Article.\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2016-2542"
  ],
  "techniques": [],
  "advisory": "icsa-20-287-03",
  "title": "Flexera InstallShield | CISA",
  "source": "ics-advisories",
  "id": "0090d31cc51ff1c9b78dcee4e48034a6f041cfd0b51436b45b472b0c47bc5a37"
}