{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Mitsubishi Electric\nEquipment: MELSEC-Q Series and MELSEC-L Series CPU Modules\nVulnerability: Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may prevent the FTP client from connecting to the FTP server on MELSEC-Q Series and MELSEC-L Series CPU module.\nOnly FTP server function is affected by this vulnerability.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of MELSEC-Q Series and MELSEC-L Series CPU modules are affected:\n\n[MELSEC-Q Series]\n\nQ03/04/06/13/26UDVCPU: serial number 21081 and prior,\nQ04/06/13/26UDPVCPU: serial number 21081 and prior, and\nQ03UDECPU, Q04/06/10/13/20/26/50/100UDEHCPU: serial number 21081 and prior.\n\n\n[MELSEC-L Series]\n\nL02/06/26CPU, L26CPU-BT: serial number 21101 and prior,\nL02/06/26CPU-P, L26CPU-PBT: serial number 21101 and prior, and\nL02/06/26CPU-CM, L26CPU-BT-CM: serial number 21101 and prior.\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nA remote attacker can cause the FTP service to enter a denial-of-service condition dependent on the timing at which a remote attacker connects to the FTP server on the above CPU modules.\nCVE-2019-13555 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nTri Quach of Amazon’s Customer Fulfillment Technology Security (CFTS) group reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric has produced a new version of the firmware. Additional information about this vulnerability or Mitsubishi Electric's compensating control is available by contacting a local Mitsubishi Electric representative, which can be found at the following location:\nhttps://us.mitsubishielectric.com/fa/en/about-us/distributors\nMitsubishi Electric strongly recommends that users should operate the affected device behind a firewall.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2019-13555"
  ],
  "techniques": [],
  "advisory": "icsa-19-311-01",
  "title": "Mitsubishi Electric MELSEC-Q Series and MELSEC-L Series CPU Modules | CISA",
  "source": "ics-advisories",
  "id": "1d81d607bc9927c80c671be3409f458725fc0ab767435214898f934a8e2aeae1"
}