{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELSOFT GT OPC UA Client\nVulnerabilities: Out-of-bounds Read, Integer Overflow or Wraparound\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to send specially crafted messages, resulting in information disclosure or a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products and version combinations using OPC UA Client Connections are affected:\n\nMELSOFT GT OPC UA Client: Versions 1.00A to 1.02C\nGT SoftGOT2000: Versions 1.215Z to 1.270G\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable due to an out-of-bounds read, which may allow an attacker to send specially crafted messages to disclose information on memory or cause a denial-of-service condition.\nCVE-2021-3712 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:H).\n3.2.2    INTEGER OVERFLOW OR WRAPAROUND CWE-190\nThe affected product is vulnerable due to an integer overflow, which may allow an attacker to cause a denial-of-service condition.\nCVE-2021-23840 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends users update software to the latest versions below. Users will need to contact a Mitsubishi representative to obtain the updates:\n\nMELSOFT GT OPC UA Client: Update to 1.03D or later\nGT SoftGOT2000: Update to 1.275M or later\n\nMitsubishi Electric recommends users take the following mitigations to minimize the risk of exploiting these vulnerabilities:\n\nWhen connecting the products to the Internet, use a virtual private network (VPN, etc.) to prevent spoofing and sniffing.\nUse the products within the LAN and block access from untrusted networks and hosts.\nUpdate the OPC UA server to the latest version.\nInstall antivirus software.\nRestrict physical access to computers and network equipment that use the affected products.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2021-3712",
    "CVE-2021-23840"
  ],
  "techniques": [
    "T2000"
  ],
  "advisory": "icsa-22-130-06",
  "title": "Mitsubishi Electric MELSOFT GT OPC UA | CISA",
  "source": "ics-advisories",
  "id": "9465bede9c18daab5d2444993fe843c5194814b22ad4815017da4933fcad3fd3"
}