{
  "markdown": "\nCVSS v3 8.6\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: SIPROTEC 4 and SIPROTEC Compact\nVulnerabilities: Improper Input Validation, Missing Authorization, Improper Authentication\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-17-187-03E Siemens SIPROTEC 4 and SIPROTEC Compact that was published January 4, 2018, on the NCCIC/ICS-CERT website.\nAFFECTED PRODUCTS\nSiemens reports that the vulnerabilities affect the following SIPROTEC 4 and SIPROTEC Compact protection, control, measurement, and automation devices:\n--------- Begin Update F Part 1 of 2 --------\n\nFirmware variants for EN100 Ethernet modules as options for SIPROTEC 4 and SIPROTEC Compact:\n\nFirmware variant PROFINET IO: All versions prior to V1.04.01,\nFirmware variant Modbus TCP: All versions prior to  V1.11.00,\nFirmware variant DNP3 TCP: All versions prior to V1.03, and\nFirmware variant IEC 104: All versions prior to V1.21\n\n\nEN100 Ethernet module included in SIPROTEC Merging Unit 6MU80: All firmware versions prior to V1.02.02\nSIPROTEC 7SJ686: All versions prior to V4.87\nSIPROTEC 7UT686: All versions prior to V4.02\nSIPROTEC 7SD686: All versions prior V4.05\nSIPROTEC 7SJ66: All versions prior to V4.30\n\nPlease note that not all of the devices above are affected by all of these vulnerabilities. Please see Siemens Security Advisory SSA-323211 for more detailed information.\n--------- End Update F Part 1 of 2 ----------\nIMPACT\nSuccessful exploitation of these vulnerabilities could cause a denial-of-service condition, allow an attacker access to sensitive information, or allow an attacker to perform administrative functions.\nMITIGATION\n--------- Begin Update F Part 2 of 2 --------\nSiemens provides updates for the following affected products and recommends users update to the latest version:\n\nFirmware variants for EN100 Ethernet modules as options for SIPROTEC 4 and SIPROTEC Compact:\n\nFirmware variant PROFINET IO: Update to V1.04.01\nFirmware variant Modbus TCP: Update to V1.11.00\nFirmware variant DNP3 TCP: Update to V1.03\nFirmware variant IEC 104: Update to V1.21\n\n\n\nhttps://support.industry.siemens.com/cs/us/en/view/109745821\n\nEN100 Ethernet module included in SIPROTEC Merging Unit 6MU80: Update to firmware V1.02.02 by contacting the Siemens energy hotline at: support.energy@siemens.com\nSIPROTEC 7SJ66: update to firmware V4.30\n\nhttps://support.industry.siemens.com/cs/gb/en/view/109743555\n\nSIPROTEC 7SJ686: update to firmware V4.87\n\nhttp://www.siemensenergysector.com/ProductRelatedDown.aspx?ProductId=51\n\nSIPROTEC 7UT686: update to firmware V4.02\n\nhttp://www.siemensenergysector.com/ProductRelatedDown.aspx?ProductId=68\n\nSIPROTEC 7SD686: update to firmware V4.05\n\nhttp://www.siemensenergysector.com/ProductRelatedDown.aspx?ProductId=64\n--------- End Update F Part 2 of 2 ----------\nSiemens is preparing updates for the remaining affected products and recommends the following mitigations in the meantime:\n\nApply secure substation concepts and defense-in-depth measures.\n\nPlease see the specific product manual for more information. Manuals can be obtained from the downloads menu at the following Siemens website:\nhttp://www.siemens.com/gridsecurity\n\nRestrict network access to Port 80/TCP and Port 50000/UDP\n\nSiemens recommends users protect network access with appropriate mechanisms such as firewalls, segmentation, and VPNs. Siemens also advises that users configure the operational environment according to Siemens’ Operational Guidelines for Industrial Security:\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-323211 at the following location:\nhttp://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nIn addition, NCCIC recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION CWE-20\n\nSpecially crafted packets sent to Port 50000/UDP could cause a denial of service of the affected device. A manual reboot may be required to recover the service of the device.\nCVE-2015-5374 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nMISSING AUTHORIZATION CWE-862\n\nThe integrated web server (Port 80/TCP) of the affected devices could allow remote attackers to obtain sensitive device information if network access was obtained.\nCVE-2016-4784 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nMISSING AUTHORIZATION CWE-862\n\nThe integrated web server (Port 80/TCP) of the affected devices could allow remote attackers to obtain a limited amount of device memory content if network access was obtained.\nCVE-2016-4785 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nMISSING AUTHORIZATION CWE-862\n\nAttackers with network access to the device’s web interface (Port 80/TCP) could circumvent authentication and perform certain administrative operations.\nCVE-2016-7112 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nIMPROPER INPUT VALIDATION CWE-20\n\nSpecially crafted packets sent to Port 80/TCP could cause the affected device to go into defect mode.\nCVE-2016-7113 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nIMPROPER AUTHENTICATION CWE-287\n\nAttackers with network access to the device’s web interface (Port 80/TCP) could circumvent authentication and perform certain administrative operations. A legitimate user must be logged into the web interface for the attack to be successful.\nCVE-2016-7114 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\nRESEARCHER\nSiemens reported these vulnerabilities to NCCIC when they made firmware available to fix them.\nBACKGROUND\nCritical Infrastructure Sector: Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2016-7114",
    "CVE-2015-5374",
    "CVE-2016-4784",
    "CVE-2016-4785",
    "CVE-2016-7113",
    "CVE-2016-7112"
  ],
  "techniques": [],
  "advisory": "icsa-17-187-03f",
  "title": "Siemens SIPROTEC 4 and SIPROTEC Compact (Update F) | CISA",
  "source": "ics-advisories",
  "id": "29ee7ff6dc4fbb023c617cdb556fe0d1d4a5dec8750084eeb68734bbb0de28aa"
}