{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Dataprobe\nEquipment: iBoot-PDU FW\nVulnerabilities: OS Command Injection, Path Traversal, Exposure of Sensitive Information to an Unauthorized Actor, Improper Access Control, Improper Authorization, Incorrect Authorization, SSRF, Stack-Based Buffer Overflow, Use of Weak Credentials, Plaintext Storage of a Password, Authentication Bypass Using an Alternate Path or Channel\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-263-03 Dataprobe iBoot-PDU that was published September 20, 2022, on the ICS webpage on cisa.gov/ICS. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to unauthenticated remote code execution on the Dataprobe iBoot-PDU device. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Dataprobe iBoot-PDU, a power distribution unit, are affected:\n\nDataprobe iBoot-PDU FW: All Versions prior to 1.42.06162022\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nA specific function does not sanitize the input provided by the user, which may expose the affected an OS command injection vulnerability. \nCVE-2022-3183 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe device’s existing firmware allows unauthenticated users to access an old PHP page vulnerable to directory traversal, which may allow a user to write a file to the webroot directory.\nCVE-2022-3184 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe affected product exposes sensitive data concerning the device.\nCVE-2022-3185 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.4    IMPROPER ACCESS CONTROL CWE-284\nThe affected product allows an attacker to access the device’s main management page from the cloud. This feature enables users to remotely connect devices, however, the current implementation permits users to access other device's information.\nCVE-2022-3186 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.2.5    IMPROPER AUTHORIZATION CWE-285\nCertain PHP pages only validate when a valid connection is established with the database. However, these PHP pages do not verify the validity of a user. Attackers could leverage this lack of verification to read the state of outlets. \nCVE-2022-3187 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.6    INCORRECT AUTHORIZATION CWE-863\nUnauthenticated users could open PHP index pages without authentication and download the history file from the device; the history file includes the latest actions completed by specific users.\nCVE-2022-3188 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.7    SERVER-SIDE REQUEST FORGERY (SSRF) CWE-918\nA specially crafted PHP script could use parameters from a HTTP request to create a URL capable of changing the host parameter. The changed host parameter in the HTTP could point to another host that will send a request to the host or IP specified in the changed host parameter.\nCVE-2022-3189 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n--------- Begin Update A Part 1 of 2 ---------  \n4.2.8    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow, which could lead to a denial-of-service condition or remote code execution.  \nCVE-2022-46658 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). \n4.2.9    USE OF WEAK CREDENTIALS CWE-1391 \nThe affected product exposes multiple sensitive data fields of the affected product. An attacker can use the SNMP command to get a device MAC address and login as the administrator. \nCVE-2022-46738 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:L). \n4.2.10    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288 \nThe iBoot device’s basic discovery protocol assists in initial device configuration. The discovery protocol shows basic information about devices on the network and allows users to perform configuration changes. \nCVE-2022-47320 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N). \n4.2.11 AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288 \nA proprietary protocol for iBoot devices is used for control and keepalive commands. The function compares the username and password and also contains the configuration data for the user specified. If the user does not exist, then it sends a value for username and password, which allows successful authentication for a connection. \nCVE-2022-47311 has been assigned to this vulnerability. A CVSS v3 base score of 8.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:N). \n4.2.12    PLAINTEXT STORAGE OF A PASSWORD CWE-256 \nThe DataProbe cloud usernames and passwords are stored in plain text in a specific file. Any user able to read this specific file from the device could compromise other devices connected to the user's cloud. \nCVE-2022-4945 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N). \n--------- End Update A Part 1 of 2 ---------  \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Multiple\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nUri Katz of Claroty Research reported these vulnerabilities to Dataprobe and CISA.\n5. MITIGATIONS\nDataprobe has released the following version update to mitigate these vulnerabilities:\n--------- Begin Update A Part 2 of 2 ---------  \n\n\niBoot-PDU FW: Version 1.43.03312023 \n\n\nInstructions to upgrade can be found on Dataprobe's website.\n--------- End Update A Part 2 of 2 ---------  \nDataprobe also recommends users to disable the SNMP if it is not in use. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-3186",
    "CVE-2022-46658",
    "CVE-2022-47311",
    "CVE-2022-3188",
    "CVE-2022-46738",
    "CVE-2022-4945",
    "CVE-2022-3185",
    "CVE-2022-3183",
    "CVE-2022-3184",
    "CVE-2022-3187",
    "CVE-2022-3189",
    "CVE-2022-47320"
  ],
  "techniques": [],
  "advisory": "icsa-22-263-03",
  "title": "Dataprobe iBoot-PDU (Update A) | CISA",
  "source": "ics-advisories",
  "id": "609a31fcb74bee4f507b97f9d83c5be02235045943900f953a34314789d07e64"
}