{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Low attack complexity \nVendor: Moxa \nEquipment: UC Series \nVulnerability: Improper Physical Access Control \n\n2. UPDATE INFORMATION \nThis updated advisory is a follow-up to the original advisory titled ICSA-22-333-04 Moxa UC Series that was published November 29, 2022 on the ICS webpage on cisa.gov/ICS. \n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker with physical access to take full control of the device using the console port. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following bootloader versions of Moxa UC Series, industrial internet-of-things (IIoT) gateway devices, are affected: \n\nUC-8580 Series: V1.1 \nUC-8540 Series: V1.0 to V1.2 \nUC-8410A Series: V2.2 \nUC-8200 Series: V1.0 to V2.4 \nUC-8100A-ME-T Series: V1.0 to V1.1 \n\n--------- Begin Update A part 1 of 1 ---------\n\nUC-8100 Series: V1.2\n\n--------- End Update A part 1 of 1 ---------\n\nUC-5100 Series: V1.2 \nUC-3100 Series: V1.2 to V2.0 \nUC-2100 Series: V1.3 to V1.5 \nUC-2100-W Series: V1.3 to V1.5 \n\n4.2 VULNERABILITY OVERVIEW\n4.2.1 IMPROPER PHYSICAL ACCESS CONTROL CWE-1263 \nAn attacker with physical access to the affected Moxa UC Series devices can initiate a restart of the device and gain access to its BIOS. Command line options can then be altered, allowing the attacker to access the terminal. From the terminal, the attacker can modify the device’s authentication files to create a new user and gain full access to the system. \nCVE-2023-1257 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Taiwan \n\n4.4 RESEARCHER\nCasper Bladt of ICSrange.com research team reported this vulnerability to CISA. \n5. MITIGATIONS\nMoxa has developed updates for all of the affected products to address this vulnerability. Moxa encourages users to contact Moxa Technical Support (login required) to obtain the update.\nUsers are encouraged to visit Moxa’s security advisory for more information. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2023-1257"
  ],
  "techniques": [],
  "advisory": "icsa-22-333-04",
  "title": "Moxa UC Series (Update A) | CISA",
  "source": "ics-advisories",
  "id": "dc5bfa4b0ff36c763f2f698158e8e19274d5cd334f5a605777d05e58f8c3c6b3"
}