{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Simcenter STAR-CCM+ Viewer\nVulnerability: Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to a crash, arbitrary code execution, or data extraction.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Simcenter STAR-CCM+ Viewer, a multiphysics computational fluid dynamics (CFD) software, are affected:\n\nSimcenter STAR-CCM+ Viewer: All versions prior to 2021.3.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThe starview+.exe application lacks proper validation of user-supplied data when parsing scene files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-42024 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nJin Huang of ADLab of Venustech reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has recommended the following:\n\nUpdate to 2021.3.1 or later version\nDo not open untrusted scene files from unknown sources\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ Operational Guidelines for Industrial Security, and following the recommendations in the product manuals. Additional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens Security Advisory SSA-161331\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-42024"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-15",
  "title": "Siemens Simcenter STAR-CCM+ Viewer | CISA",
  "source": "ics-advisories",
  "id": "3e35c37b0e44e5fc3560cc46e47beb0177b146f5712131a0ffca135b62280f8a"
}