{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.4\nVendor: Schneider Electric\nEquipment: EcoStruxure Operator Terminal Expert\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow unauthorized command execution by a local user of the Windows engineering workstation, which could result in loss of availability, confidentiality, and integrity of the workstation where EcoStruxure Operator Terminal Expert runtime is installed.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports the vulnerability affects the following EcoStruxure Operator Terminal Expert products: \n\nEcoStruxure Operator Terminal Expert Runtime 3.1 Service Pack 1A and prior installed on:\n\nWindows PC using legacy BIOS\nHarmony iPC (HMIG5U, HMIG5U2) using legacy BIOS\n\n\n\nNOTE: Windows PCs using UEFI are not impacted by this vulnerability.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nAn improper privilege management vulnerability exists that could cause privilege escalation on the workstation when interacting directly with a driver installed by the runtime software of EcoStruxure Operator Terminal Expert. \nCVE-2020-7544 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Energy, Food and Agriculture, Government Facilities, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nLasse Trolle Borup (Danish Cyber Defence) reported this vulnerability to Schneider Electric.\n4. MITIGATIONS\nSchneider Electric has prepared Version 3.1 Service Pack 1B of the EcoStruxure Operator Terminal Expert product with a fix for this vulnerability. This fix is also available through Schneider Electric Software Update (SESU)\nIf users choose not to apply the remediation provided above, they should immediately apply the following mitigations to reduce the risk of exploit:\n\nUse EcoStruxure Operator Terminal Expert runtime software only on a trusted workstation.\nHarden workstation following the best cybersecurity practices (antivirus, updated operating systems, strong password policies, application white listing software, etc.) by following Schneider Electric’s best practices guidelines.\nUse Windows PC with UEFI technology. Users can identify if their PC uses the UEFI technology by using the following system command: msinfo32.exe provided by Microsoft Windows. This command provides the system information. The section BIOS mode displays either “UEFI” or “LEGACY”.\n\nIf the value is UEFI, the PC is not vulnerable, if the value is LEGACY then the PC is vulnerable.\n\n\n\nFor further information please refer to SEVD-2020-315-02.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n \n",
  "cves": [
    "CVE-2020-7544"
  ],
  "techniques": [],
  "advisory": "icsa-20-336-01",
  "title": "Schneider Electric EcoStruxure Operator Terminal Expert runtime (Vijeo XD) | CISA",
  "source": "ics-advisories",
  "id": "d3317a9085cc2b1523493a682ca5100d3e4f3e8b6755d088b6a8749d809e049e"
}