{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: AutomationDirect\nEquipment: C-MORE EA9 HMI\nVulnerabilities: Path Traversal, Stack-Based Buffer Overflow, Plaintext Storage of a Password\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to exploit a remote device and inject malicious code on the panel.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of C-MORE EA9 HMI, a display system used for interfacing with controllers, are affected:\n\nC-MORE EA9 HMI EA9-T6CL: Version 6.77 and prior\nC-MORE EA9 HMI EA9-T7CL: Version 6.77 and prior\nC-MORE EA9 HMI EA0-T7CL-R: Version 6.77 and prior\nC-MORE EA9 HMI EA9-T8CL: Version 6.77 and prior\nC-MORE EA9 HMI EA9-T10CL: Version 6.77 and prior\nC-MORE EA9 HMI EA9-T10WCL: Version 6.77 and prior\nC-MORE EA9 HMI EA9-T12CL: Version 6.77 and prior\nC-MORE EA9 HMI EA9-T15CL: Version 6.77 and prior\nC-MORE EA9 HMI EA9-T15CL-R: Version 6.77 and prior\nC-MORE EA9 HMI EA9-RHMI: Version 6.77 and prior\nC-MORE EA9 HMI EA9-PGMSW: Version 6.77 and prior\n\n3.2 Vulnerability Overview\n3.2.1 Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal') CWE-22\nThere is a function in Automation-Direct C-MORE EA9 HMI that allows an attacker to send a relative path in the URL without proper sanitizing of the content.\nCVE-2024-25136 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H)\nCVE-2024-25136 has been assigned to this vulnerability. A CVSS v4 base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.2.2 Stack-based Buffer Overflow CWE-121\nIn Automation-Direct C-MORE EA9 HMI there is a program that copies a buffer of a size controlled by the user into a limited sized buffer on the stack which leads to a stack overflow. The result of this stack-based buffer overflow will lead to a denial-of-service conditions.\nCVE-2024-25137 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:L)\nCVE-2024-25137 has been assigned to this vulnerability. A CVSS v4 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:L/SC:N/SI:N/SA:N).\n3.2.3 Plaintext Storage of a Password CWE-256\nIn Automation-Direct C-MORE EA9 HMI credentials used by the platform are stored as plain text on the device.\nCVE-2024-25138 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N)\nCVE-2024-25138 has been assigned to this vulnerability. A CVSS v4 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nTomer Goldschmidt of Claroty Research - Team82 reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAutomationDirect recommends that users update C-MORE EA9 HMI to V6.78.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nMarch 26, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-25138",
    "CVE-2024-25136",
    "CVE-2024-25137"
  ],
  "techniques": [],
  "advisory": "icsa-24-086-01",
  "title": "Automation-Direct C-MORE EA9 HMI | CISA",
  "source": "ics-advisories",
  "id": "ebea79658515fceff9da0216a989689c4b94be81cf8dd720f8e65015e740a811"
}