{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: Rockwell Automation\nEquipment: Allen-Bradley Stratix Industrial Managed Ethernet Switch\nVulnerabilities: Improper Input Validation, Resource Management Errors, 7PK – Errors, Improper Restriction of Operations within the Bounds of a Memory Buffer, Use of Externally-Controlled Format String.\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in loss of availability, confidentiality, and/or integrity caused by memory exhaustion, module restart, information corruption, and/or information exposure.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Allen-Bradley Stratix Industrial Managed Ethernet Switch use a vulnerable version of Cisco IOS or IOS XE:\n\nAllen-Bradley Stratix 8300 Industrial Managed Ethernet Switches, versions 15.2(4a)EA5 and earlier.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   IMPROPER INPUT VALIDATION CWE-20\nA vulnerability in the Smart Install feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated remote attacker to trigger a reload of an affected device, resulting in a denial of service (DoS) condition, or to execute arbitrary code on an affected device.\nThe vulnerability is due to improper validation of packet data. An attacker could exploit this vulnerability by sending a crafted Smart Install message to an affected device on TCP port 4786. A successful exploit could allow the attacker to cause a buffer overflow on the affected device.\nCVE-2018-0171 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2   RESOURCE MANAGEMENT ERRORS CWE-399\nA vulnerability in the Smart Install feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated remote attacker to trigger a reload of an affected device, resulting in a DoS condition.\nThe vulnerability is due to improper validation of packet data. An attacker could exploit this vulnerability by sending a crafted packet to an affected device on TCP port 4786.\nCVE-2018-0156 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.3   7PK – ERRORS CWE-388\nA vulnerability in the Bidirectional Forwarding Detection (BFD) offload implementation could allow an unauthenticated remote attacker to cause a crash of the iosd process, causing a DoS condition.\nThe vulnerability is due to insufficient error handling when the BFD header in a BFD packet is incomplete. An attacker could exploit this vulnerability by sending a crafted BFD message to or across an affected switch. A successful exploit could allow the attacker to trigger a reload of the system.\nCVE-2018-0155 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.4   IMPROPER INPUT VALIDATION CWE-20\nA vulnerability in the DHCP option 82 encapsulation functionality of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated remote attacker to cause an affected device to reload, resulting in a DoS condition.\nThe vulnerability exists because the affected software performs incomplete input validation of option 82 information that it receives in DHCP Version 4 (DHCPv4) packets from DHCP relay agents. An attacker could exploit this vulnerability by sending a crafted DHCPv4 packet to an affected device. A successful exploit could allow the attacker to cause the affected device to reload, resulting in a DoS condition.\nCVE-2018-0174 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.5   IMPROPER INPUT VALIDATION CWE-20\nA vulnerability in the DHCP option 82 encapsulation functionality of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated remote attacker to cause an affected device to reload, resulting in a DoS condition.\nThe vulnerability exists because the affected software performs incomplete input validation of option 82 information that it receives in DHCP Version 4 (DHCPv4) packets from DHCP relay agents. An attacker could exploit this vulnerability by sending a crafted DHCPv4 packet to an affected device. A successful exploit could allow the attacker to cause a heap overflow condition on the affected device, which will cause the device to reload and result in a DoS condition.\nCVE-2018-0172 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.6   IMPROPER INPUT VALIDATION CWE-20\nA vulnerability in the Cisco IOS Software and Cisco IOS XE Software function that restores encapsulated option 82 information in DHCP Version 4 (DHCPv4) packets could allow an unauthenticated remote attacker to cause an affected device to reload, resulting in a DoS condition.\nThe vulnerability exists because the affected software performs incomplete input validation of encapsulated option 82 information that it receives in DHCPOFFER messages from DHCPv4 servers. An attacker could exploit this vulnerability by sending a crafted DHCPv4 packet to an affected device, which the device would then forward to a DHCPv4 server. When the affected software processes the option 82 information that is encapsulated in the response from the server, an error could occur. A successful exploit could allow the attacker to cause the affected device to reload, resulting in a DoS condition.\nCVE-2018-0173 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.7   IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nA buffer overflow vulnerability in the LLDP subsystem of Cisco IOS Software, Cisco IOS XE Software, and Cisco IOS XR Software could allow an adjacent, unauthenticated attacker to cause a DoS condition or execute arbitrary code with elevated privileges.\nCVE-2018-0167 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.8   USE OF EXTERNALLY-CONTROLLED FORMAT STRING CWE-134\nA format string vulnerability in the LLDP subsystem of Cisco IOS Software and Cisco IOS XE Software could allow an adjacent, unauthenticated attacker to cause a DoS condition or execute arbitrary code with elevated privileges.\nCVE-2018-0175 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Wisconsin, USA\n\n3.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to NCCIC from the semi-annual Cisco IOS and IOS XE Software Security Advisory Bundled Publication.\n4. MITIGATIONS\nRockwell Automation has released the following knowledge base article 1073315:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1073315/ (login required)\nCisco has released new Snort Rules at https://www.cisco.com/web/software/286271056/117258/sf-rules-2018-03-29-new.html to help address the following vulnerabilities:\n\nCVE-2018-0171 - Snort Rule 46096 and 46097\nCVE-2018-0156 - Snort Rule 41725\nCVE-2018-0174 - Snort Rule 46120\nCVE-2018-0172 - Snort Rule 46104\nCVE-2018-0173 - Snort Rule 46119\n\nCisco adds the following notes for the Smart Install vulnerabilities (CVE-2018-0171 and CVE-2018-0156):\n\nSmart Install is turned off by express setup; however, upgraded switches but not re-setup may have it enabled.\nDisable the Smart Install feature with the no vstack configuration command if it is not needed or once setup is complete.\nUsers who do use the feature—and need to leave it enabled—can use ACLs to block incoming traffic on TCP port 4786.\n\nCVE-2018-0155: Administrators who do not use the BFD feature in their environments can disable the BFD feature by using the feature bfd disable command in global configuration mode to prevent exploitation of this vulnerability. Administrators who do use the BFD feature can implement Control Plane Policing (CoPP) to allow processing of BFD packets from known BFD peers only and drop all other BFD traffic to limit exposure.\nCVE-2018-0167 and CVE-2018-0175 have no specific mitigations in place. See the following Cisco advisory for more details:\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-lldp\nRockwell Automation also recommends that users implement the following general security guidelines:\n\nHelp minimize network exposure for all control system devices and/or systems, and confirm that they are not accessible from the Internet.\nLocate control system networks and devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2018-0172",
    "CVE-2018-0167",
    "CVE-2018-0173",
    "CVE-2018-0174",
    "CVE-2018-0155",
    "CVE-2018-0171",
    "CVE-2018-0156",
    "CVE-2018-0175"
  ],
  "techniques": [],
  "advisory": "icsa-18-107-05",
  "title": "Rockwell Automation Stratix Industrial Managed Ethernet Switch | CISA",
  "source": "ics-advisories",
  "id": "341e11aef224a036fb32367bf760d639d429d083a5220ed1f8c6be442dff2fec"
}