{
  "markdown": "\nCVSS v3 5.3\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Saia Burgess Controls\nEquipment: PCD Controllers\nVulnerability: Information Exposure\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on August 22, 2017, and is being released to the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nSaia Burgess Controls reports that the vulnerability affects the following PCD Controllers:\n\nPCD firmware versions prior to 1.28.16 or 1.24.69\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to obtain information in memory.\nMITIGATION\nSaia Burgess Controls strongly recommends that users update to the latest versions of firmware, Version 1.28.16 or 1.24.69.\nThe security upgrade section of the Saia Burgess Controls web page links to the latest versions and offers security tips and upgrade information:\nhttps://www.sbc-support.com/en/product-category/communication-protocols/pcd-on-internet/upgrade-it-security/\nPlease see the latest update information for this product at the following web site:\nhttps://www.sbc-support.com/en/product-index/\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nINFORMATION EXPOSURE CWE-200\n\nIn certain circumstances, the device pads Ethernet frames with memory contents.\nCVE-2017-9628 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\nRESEARCHER\nDavide Fauri of Eindhoven University of Technology discovered and reported this vulnerability to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sector: Chemical and Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Switzerland\n",
  "cves": [
    "CVE-2017-9628"
  ],
  "techniques": [],
  "advisory": "icsa-17-234-05",
  "title": "Saia Burgess Controls PCD Controllers | CISA",
  "source": "ics-advisories",
  "id": "7fb86fcc157314bd9cc8d414548a5cb74342bd251b09e829ad5aefb3e3607154"
}