{
  "markdown": "\nCVSS v3 9.8\nAFFECTED PRODUCTS\nThe following versions of SoftCMS Live Viewer, a video surveillance software designed for industrial automation systems, are affected:\n\nSoftCMS Live Viewer, Version 1.6 and prior versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an unauthenticated user to access SoftCMS Live Viewer without knowing the user’s password.\nMITIGATION\nMoxa has provided software update Version 1.7 for SoftCMS Live Viewer which fixes this vulnerability. Moxa recommends users update to the new version, which is available at the following location:\nhttps://www.moxa.com/support/download.aspx?type=support&id=11362\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\n\nAn improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability has been identified. Attackers can exploit this vulnerability to access SoftCMS without knowing the user’s password.\nCVE-2017-12729 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nSecurity researcher Ziqiang Gu from Huawei WeiRan Labs identified this vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Transportation Systems.\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-12729"
  ],
  "techniques": [],
  "advisory": "icsa-17-243-05",
  "title": "Moxa SoftCMS Live Viewer | CISA",
  "source": "ics-advisories",
  "id": "ca3e9e4cf6aea941b61f3194875ba3dff024fd08e0d8f9357140ed82e14190e7"
}