{
  "markdown": " ICONICS GENESIS32/BizViz Security Configurator Authentication Bypass Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryICONICS GENESIS32/BizViz Security Configurator Authentication Bypass Vulnerability================================================================================== Last Revised August 28, 2013 Alert Code ICSA\\-12\\-212\\-01Overview-------- Dr. Wesley McGrew of Mississippi State University has identified an authentication bypass vulnerability leading to privilege escalation in the ICONICS GENESIS32 and BizViz applications, specifically in the Security Configurator component. This vulnerability allows an attacker to bypass normal authentication methods, granting full administrative control over the system. Exploits that target this vulnerability are known to be publicly available. ICONICS has produced a hot fix that mitigates this vulnerability.Affected Products----------------- Iconics reports that the zero\\-day vulnerability affects the following versions of Genesis32:* Genesis32 V9\\.22 and previous.* BizViz V9\\.22 and previousImpact------ Successful exploit of this vulnerability could grant an attacker administrator privileges in the Security Configurator. This could allow the attacker to change settings in the system, including changing the rights/privileges of other users. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- ICONICS is a US\\-based company that maintains offices in several countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia. The affected products, GENESIS32 and BizViz, are Web\\-deployable human\\-machine interface (HMI) supervisory controlled and data acquisition (SCADA) systems. According to ICONICS, GENESIS32 is used primarily in the United States and Europe, with a small percentage in Asia. This product is deployed across several industries including manufacturing, building automation, oil and gas, water and wastewater, electric utilities, and others.Vulnerability Characterization------------------------------### Vulnerability Overview**Authentication Bypass**  CWE\\-261: Weak Cryptography for Passwords, http://cwe.mitre.org/data/, Web site last accessed July 30, 2012 An attacker posing as a locked\\-out ICONICS GENESIS32 or BizViz user can generate an authentication code without contacting ICONICS technical support. The attacker can then login to the Security Configurator with administrative privileges and change system settings and privileges for other users. CVE\\-2012\\-3018NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2012\\-3018, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 6\\.0 has been assigned; the CVSS vector string is [(AV:L/AC:H/Au:S/C:C/I:C/A:C)](http://nvd.nist.gov/cvss.cfm?version=2&vector=(AV:N/AC:H/Au:N/C:C/I:C/A:C))  .### Vulnerability Details#### Exploitability An attacker needs local access to exploit this vulnerability.#### Existence of Exploit Exploits that target this vulnerability are publicly available.#### Difficulty An attacker with moderate skill level and knowledge of the encryption algorithm used to secure the challenge response could obtain administrator privileges in the system.Mitigation---------- ICONICS is releasing a patch for the GENESIS32 and BizViz security files for Versions 8\\.05, 9\\.01, 9\\.13, and 9\\.22 that disable the backdoor security login. In the future, this feature will be re\\-implemented with a more secure encryption algorithm. ICONICS provides information and links related to its security updates for this and other patches, at its website at <http://www.iconics.com/certs> . ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP Web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/ics/content/recommended-practices) . Additional mitigation guidance and recommended practices are publicly available in the ICS\\-CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B—Cyber Intrusion Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* ICONICS-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-212-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2012-3018"
  ],
  "techniques": [],
  "advisory": "icsa-12-212-01",
  "title": "ICONICS GENESIS32/BizViz Security Configurator Authentication Bypass Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "c350857658fbdc1d8743893ca20aa34133d0e8d19ee4d5f6dc0120222cd259e9"
}