{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: Low skill level to exploit\nVendor: Rockwell Automation\nEquipment: FactoryTalk Services Platform\nVulnerability: Improper Restriction of XML External Entity Reference\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to a denial-of-service condition and to the arbitrary reading of any local file via system level services.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of FactoryTalk Services Platform are affected:\n\nVersions 6.11.00 and earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nA local, authenticated attacker could use an XML External Entity (XXE) attack to exploit weakly configured XML files to access local or remote content. A successful exploit could potentially cause a denial-of-service condition and allow the attacker to arbitrarily read any local file via system-level services.\nCVE-2020-14478 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nApplied Risk reported this vulnerability to Rockwell.\n4. MITIGATIONS\nAffected users are encouraged to use Rockwell Automation Knowledgebase article 25612 to determine if FactoryTalk Services Platform is installed.\nFor more information please see Rockwell Automation Knowledgebase article 1092746\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-14478"
  ],
  "techniques": [],
  "advisory": "icsa-20-177-02",
  "title": "Rockwell Automation FactoryTalk Services Platform XXE | CISA",
  "source": "ics-advisories",
  "id": "05f9ce6c893cbb8d78825ac59501a2bfd238e1da862ab91d5141156b407aefce"
}