{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Equinox\nEquipment: Control Expert\nVulnerability: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Control Expert, am HMI/SCADA management platform, are affected:\n\nControl Expert, all current and older versions could be affected.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND (SQL INJECTION) CWE-89\nThe affected product is vulnerable to an SQL injection attack, which may allow an attacker to remotely execute arbitrary code.\nCVE-2019-18234 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Argentina, Uruguay\nCOMPANY HEADQUARTERS LOCATION: Argentina\n\n3.4 RESEARCHER\nJuan Pablo Lopez Yacubian reported this vulnerability to CISA.\n4. MITIGATIONS\nEquinox has not responded to requests to provide mitigating details regarding this vulnerability. CISA will update this vulnerability with any information provided by the vendor.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nWhere possible, obtain security updates from vendor and apply available patches.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nImplement firewall rules to block or restrict Internet and intranet access for database systems.\nHarden internal systems against the potential threat posed by a compromised system on the local network. (Do not rely on firewalls to prevent access to insecure systems; secure them).\nImplement firewall rules to block known malicious IP addresses.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nRun only the minimum required applications and services necessary to perform their intended function. Where possible, disable all unnecessary applications and services.\nDisable potentially harmful SQL stored procedure calls.\nDo not disclose internal database structure, table names, or account names.\nSanitize or validate input by ensuring data is properly typed and does not contain escaped code. Consider using type-safe stored procedures/prepared statements.\nDelete/disable unnecessary accounts (including default accounts).\nDelete/disable unnecessary stored procedures/prepared statements.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-18234"
  ],
  "techniques": [],
  "advisory": "icsa-19-353-02",
  "title": "Equinox Control Expert | CISA",
  "source": "ics-advisories",
  "id": "69e8d83b5f8ac9811651f5179f9b0419d61c29efb9175c09903579eac2a0ce47"
}