{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Omron \nEquipment: SYSMAC CS/CJ Series \nVulnerability: Missing Authentication for Critical Function \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access sensitive information in the file system and memory. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Omron CS/CJ series, programmable logic controllers, are affected: \n\nSYSMAC CJ2H-CPU6[]-EIP: all versions \nSYSMAC CJ2H-CPU6[]: all versions \nSYSMAC CJ2M-CPU[][]: all versions \nSYSMAC CJ1G-CPU[][]P: all versions \nSYSMAC CS1H-CPU[][]H: all versions \nSYSMAC CS1G-CPU[][]H: all versions \nSYSMAC CS1D-CPU[][]HA: all versions \nSYSMAC CS1D-CPU[][]H: all versions \nSYSMAC CS1D-CPU[][]SA: all versions \nSYSMAC CS1D-CPU[][]S: all versions \nSYSMAC CS1D-CPU[][]P: all versions \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306 \nOmron CS/CJ series programmable logic controllers are missing authentication for the file system. This could allow an attacker to access the file system (via memory card or EM file memory) and obtain all available sensitive information.  \nCVE-2022-45794 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan \n\n3.4 RESEARCHER\nReid Wightman of Dragos reported this vulnerability to CISA. \n4. MITIGATIONS\nOMRON recommends users take the following mitigation measures to minimize the risk of exploitation of these vulnerabilities. \n\nEnable the FINS write protection function. \nMinimize connection of control systems and equipment to open networks preventing untrusted devices from accessing them. \nImplement firewalls: \nShut down unused communications ports \nLimit communications hosts \nLimit access to FINS port (9600)  \nIsolate control systems and equipment from the IT network. \nUse a virtual private network (VPN) for remote access to control systems and equipment. \nUse strong passwords and change them frequently. \nInstall physical controls, only permitting authorized personnel access to control systems and equipment. \nUse malware scanning tools to ensure safety of any USB drives or other portable devices before connecting them to control systems and devices. \nEnforce multifactor authentication on all devices with remote access to control systems and equipment when possible. \nProtect hosts with access to the control system against malware and Ensure installation and maintenance of up-to-date, antivirus software on hosts with access to control systems. \nComplete validation processing, such as backup and range checks, to cope with unintentional modification of input/output data to control systems and devices. \nComplete periodical data backup and maintenance to prepare for data loss. \n\nFor more information, see Omron’s Advisory. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.  \n",
  "cves": [
    "CVE-2022-45794"
  ],
  "techniques": [],
  "advisory": "icsa-23-108-01",
  "title": "Omron CS/CJ Series | CISA",
  "source": "ics-advisories",
  "id": "ad819704dea736b6481e93e86b54d1137772dd239e5b97d24ddbd2c327ee68c0"
}