{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC HMI\nVulnerabilities: Improper Restriction of Excessive Authentication Attempts, Authentication Bypass by Primary Weakness\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-252-06 Siemens SIMATIC HMI Products that was published September 8, 2020, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to discover user passwords and obtain access to the Sm@rt Server via a brute-force attack.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 2 ---------\nThe following versions of Siemens SIMATIC HMI Products are affected:\n\nSIMATIC HMI Basic Panels, 2nd Generation (incl. SIPLUS variants): All versions prior to v16 are affected by CVE-2020-15786\nSIMATIC HMI Comfort Panels (incl. SIPLUS variants): All versions up to and including v16 are affected by CVE-2020-15786\nSIMATIC HMI Mobile Panels: All versions up to and including v16 are affected by CVE-2020-15786\nSIMATIC HMI United Comfort Panels: All versions up to and including v16\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\nAffected devices insufficiently block excessive authentication attempts. This could allow a remote attacker to discover user passwords and obtain access to the Sm@rt Server via a brute-force attack.\nCVE-2020-15786 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:L).\n4.2.2    AUTHENTICATION BYPASS BY PRIMARY WEAKNESS CWE-305\nAffected devices insufficiently validate authentication attempts as the information given can be truncated to match only a set number of characters versus the whole provided string. This could allow a remote attacker to discover user passwords and obtain access to the Sm@rt Server via a brute-force attack.\nCVE-2020-15787 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nJoseph Gardiner from Bristol Cyber Security Group, University of Bristol, reported these vulnerabilities to Siemens.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nSiemens has released updates for the affected products and recommends users update to the latest versions.\n\nSIMATIC HMI Basic Panels 2nd Generation: Update to v16 Update 3\nSIMATIC HMI Comfort Panels: Update to v16 Update 3\nSIMATIC HMI Mobile Panels: Update to v16 Update 3\nSIMATIC HMI Unified Comfort Panels: Update to v16 Update 3\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nApply defense-in-depth strategies.\nFor Unified Comfort Panels using SmartClient: The password truncation (CVE-2020-15787) cannot be resolved due to RFC 6143 and is limited to 8 characters. Complex passwords are recommended.\n\n--------- End Update A Part 2 of 2 ---------\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-542525\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-15787",
    "CVE-2020-15786"
  ],
  "techniques": [],
  "advisory": "icsa-20-252-06",
  "title": "Siemens SIMATIC HMI Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "00cceff79e4e6f5a00f9d99a219e8404f564dbb78c66805473fa7e1c8cfea588"
}