{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n​CVSS v3 7.5\n​ATTENTION: Exploitable via adjacent network/Low attack complexity\n​Vendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls Inc.\n​Equipment: iSTAR\n​Vulnerability: Improper Authentication\n\n2. RISK EVALUATION\n​Successful exploitation of this vulnerability could allow an unauthenticated user to login to iSTAR devices with administrator rights.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n​Johnson Controls reports this vulnerability affects the following versions of Sensormatic Electronics iSTAR products: \n\n​iSTAR Ultra and iSTAR Ultra LT: Firmware after version 6.8.6 and prior to 6.9.2 CU01\n​iSTAR Ultra G2 and iSTAR Edge G2: Firmware versions prior to 6.9.2 CU01\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 ​IMPROPER AUTHENTICATION CWE-287\n​In Sensormatic Electronics iSTAR devices, an unauthenticated user could login with administrator rights.\n​CVE-2023-3127 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:L/I:H/A:L).\n3.3 BACKGROUND\n\n​CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\n​COUNTRIES/AREAS DEPLOYED: Worldwide\n​COMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\n​Johnson Controls, Inc reported this vulnerability to CISA.\n4. MITIGATIONS\n​Johnson Controls recommends that users upgrade Sensormatic Electronics iSTAR Ultra, iSTAR Ultra LT, iSTAR Ultra G2, and iSTAR Edge G2 firmware to version 6.9.2 CUO1.\n\n​Upgrade iSTAR Ultra, iSTAR Ultra LT, iSTAR Ultra G2, and iSTAR Edge G2 firmware to version 6.9.2 CU01.\n​For more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2023-05.\n\n​CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should: \n\n​Minimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\n​Locate control system networks and remote devices behind firewalls and isolate them from business networks.\n​When remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\n​CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n​CISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n​Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n​Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n​No known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2023-3127"
  ],
  "techniques": [],
  "advisory": "icsa-23-192-02",
  "title": "​Sensormatic Electronics iSTAR | CISA",
  "source": "ics-advisories",
  "id": "da14bf779428980b086ac0235603e50cdb8b5275593df7eb01ac357c4fef77d0"
}