{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.5\nATTENTION: Exploitable remotely\nVendor: Rockwell Automation\nEquipment: FactoryTalk Services Platform\nVulnerability: Protection Mechanism Failure\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow remote, authenticated users to bypass FactoryTalk Security policies that are based on a computer name.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports this vulnerability affects the following versions of FactoryTalk Security, part of FactoryTalk Service Platform:\n\nFactoryTalk Services Platform v6.11 and earlier, if FactoryTalk Security is enabled and deployed\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PROTECTION MECHANISM FAILURE CWE-693\nFactoryTalk Services Platform contains a vulnerability that may allow a remote, authenticated attacker to bypass FactoryTalk Security policies based on the computer name. If successfully exploited, this may allow an attacker to have the same privileges as if they were logged on to the client machine.\nCVE-2021-32960 has been assigned to this vulnerability. A CVSS v3 base score of 8.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Critical Manufacturing, Energy, Government Facilities, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation encourages those using the affected software to update to FactoryTalk Services Platform v6.20 or later to address the associated risk.\nUsers who are unable to update are directed towards risk mitigation strategies provided below and are encouraged, when possible, to combine these tactics with the general security guidelines to employ multiple strategies simultaneously.\n\nWhen possible, do not utilize remote desktop connections.\nUse Microsoft Event Logger or similar event logging application to monitor atypical remote desktop connections and disconnections. Information on Setting up Windows Event Logs is available at Knowledgebase Article QA5965\n\nRockwell Automation recommends the following general security guidelines:\n\nRun all software as User, not as an Administrator, to minimize the impact of malicious code on the infected system.\nEnsure the least-privilege user principle is followed, and user/service account access to shared resources (such as a database) is only granted with a minimum number of rights as needed.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nPlease see the Rockwell Automation publication regarding this issue for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-32960"
  ],
  "techniques": [],
  "advisory": "icsa-21-161-01",
  "title": "Rockwell Automation FactoryTalk Services Platform | CISA",
  "source": "ics-advisories",
  "id": "5f3c575adb60f4f9be16aa6f0f66e6999a3ed9ae245964ba97fdf4c9df5d38ce"
}