{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.7\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Avtec\nEquipment: Outpost 0810, Outpost Uploader Utility\nVulnerability: Storage of File with Sensitive Data Under Web Root, Use of Hard-coded Cryptographic Key\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain administrative privileges on the affected devices.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Avtec products are affected:\n\nOutpost 0810: Versions prior to v5.0.0\nOutpost Uploader Utility: Versions prior to v5.0.0\n\n3.2 Vulnerability Overview\n3.2.1 STORAGE OF FILE WITH SENSITIVE DATA UNDER WEB ROOT CWE-219\nAvtec Outpost stores sensitive information in an insecure location without proper access controls in place.\nCVE-2024-39776 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-39776. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.2.2 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nAvtec Outpost uses a default cryptographic key that can be used to decrypt sensitive information\nCVE-2024-42418 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for  CVE-2024-42418. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications Sector\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJonathan Fournier of Field Effect reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAvtec recommends users update to Outpost v5.0 to resolve.\n\nWhen upgrading to Outpost Version 5.0.0 or later, reset the list of users to the default. More information and instructions can be found on Avtec's Outpost Uploader Utility User Guide for more information.\nRestrict access to port 80 or disable web interface if possible.\n\nAdditionally, Avtec recommends checking devices for Scout firmware versions prior to 5.8.1, which was commonly coupled with Outpost firmware. If so, the devices may also need to be updated to the latest firmware. For more information, please visit Scout Release Notes.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nAugust 22, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-39776",
    "CVE-2024-42418"
  ],
  "techniques": [],
  "advisory": "icsa-24-235-04",
  "title": "Avtec Outpost 0810 | CISA",
  "source": "ics-advisories",
  "id": "dd8a673b7e05abe1de06ea2259d6a21b9b75299f6dcc9361b9c93e8d153c47b8"
}