{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Wibu-Systems AG\nEquipment: CodeMeter\nVulnerabilities: Buffer Access with Incorrect Length Value, Inadequate Encryption Strength, Origin Validation Error, Improper Input Validation, Improper Verification of Cryptographic Signature, Improper Resource Shutdown or Release\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-203-01 Wibu-Systems CodeMeter (Update E) that was published February 11, 2021, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to alter and forge a license file, cause a denial-of-service condition, potentially attain remote code execution, read heap data, and prevent normal operation of third-party software dependent on the CodeMeter.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of CodeMeter Runtime, a license manager, are affected: \n\nAll versions prior to 7.10a are affected by CVE-2020-14509 and CVE-2020-14519\nAll versions prior to 7.10a are affected by CVE-2020-14517\nAll versions prior to 7.10 are affected by CVE-2020-16233\nAll versions prior to 6.81 are affected by CVE-2020-14513 \nAll versions prior to 6.90 are affected by CVE-2020-14515 when using CmActLicense update files with CmActLicense Firm Code\n\nThis license manager is used in products by many different vendors. As new instances are discovered/reported, they will be added to this list of affected products.\n4.2 VULNERABILITY OVERVIEW\n4.2.1    BUFFER ACCESS WITH INCORRECT LENGTH VALUE CWE-805\nMultiple memory corruption vulnerabilities exist where the packet parser mechanism does not verify length fields. An attacker could send specially crafted packets to exploit these vulnerabilities.\nCVE-2020-14509 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.2    INADEQUATE ENCRYPTION STRENGTH CWE-326\nProtocol encryption can be easily broken and the server accepts external connections, which may allow an attacker to remotely communicate with the CodeMeter API.\nCVE-2020-14517 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n4.2.3    ORIGIN VALIDATION ERROR CWE-346\nThis vulnerability allows an attacker to use the internal WebSockets API via a specifically crafted Java Script payload, which may allow alteration or creation of license files when combined with CVE-2020-14515.\nCVE-2020-14519 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:H).\n4.2.4    IMPROPER INPUT VALIDATION CWE-20\nCodeMeter and the software using it may crash while processing a specifically crafted license file due to unverified length fields.\nCVE-2020-14513 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.5    IMPROPER VERIFICATION OF CRYPTOGRAPHIC SIGNATURE CWE-347\nThere is an issue in the license-file signature checking mechanism, which allows attackers to build arbitrary license files, including forging a valid license file as if it were a valid license file of an existing vendor. Only CmActLicense update files with CmActLicense Firm Code are affected.\nCVE-2020-14515 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:C/C:N/I:H/A:H).\n4.2.6    IMPROPER RESOURCE SHUTDOWN OR RELEASE CWE-404\nAn attacker could send a specially crafted packet that could have the server send back packets containing data from the heap.\nCVE-2020-16233 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSharon Brizinov and Tal Keren of Claroty reported these vulnerabilities to CISA.\n5. MITIGATIONS\nWibu-Systems recommends the following:\n\nUpdate to the latest version of the CodeMeter Runtime.\nRun CodeMeter only as client.\nUtilize the new REST API instead of the internal WebSockets API.\nDisable the WebSockets API.\nApply AxProtector.\n\nFor more information please see Wibu-Systems’ security advisories:\n\nDeutsch: https://www.wibu.com/de/support/security-advisories.html\nEnglish: https://www.wibu.com/en/support/security-advisories.html\n\nFor more information on products dependent on the affected CodeMeter see the following vendor security advisories:\n\nABB: CodeMeter Vulnerabilities\nBosch: BOSCH-SA-231483\nCODESYS: Security Advisory 2020-06\nCOPA-DATA: CD_SVA_2020_1\nDräger: PSA-20-266-01\nEaton: ETN-SB-2020-1011\nPepperl+Fuchs: VDE-2020-034\nPhoenix Contact: VDE-2020-030\nPILZ: VDE-2020-033\nRockwell: Knowledgebase Article ID 1127863 (Login Required)\nSchneider Electric: SEVD-2020-287-02\n\n--------- Begin Update F Part 1 of 1 ---------\n\nSiemens: SSA-455843 and SSA-455844\n\n--------- End Update F Part 1 of 1 ---------\n\nTRUMPF: VDE-2020-039\nWAGO: VDE-2020-032\nWEIDMUELLER: VDE-2020-041\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-14509",
    "CVE-2020-14519",
    "CVE-2020-14513",
    "CVE-2020-14515",
    "CVE-2020-16233",
    "CVE-2020-14517"
  ],
  "techniques": [],
  "advisory": "icsa-20-203-01",
  "title": "Wibu-Systems CodeMeter (Update F) | CISA",
  "source": "ics-advisories",
  "id": "d68ecbb5a77251d352b4b4dedd9ec9ceea328727df156988957f65a990ee7ac0"
}