{
  "markdown": "\nOverview\nThis advisory is a follow-up to the alert update, ICS-ALERT-11-336-01A 3S CoDeSys Vulnerabilities, which was released on the ICS-CERT Web page on December 02, 2011.\nSecurity researcher Celil Unuver (SignalSec LLC) and independent researcher Luigi Auriemma have identified vulnerabilities in the 3S Smart Software Solutions CoDeSys product, summarized in the following table. Mr. Auriemma publicly disclosed the five vulnerabilities along with proof-of-concept (PoC) exploit code, including the vulnerability previously coordinated with ICS-CERT by Celil Unuver, without coordination with 3S Smart Software Solutions, ICS-CERT, or any other coordinating entity known to ICS-CERT.\nICS-CERT has coordinated these vulnerabilities with 3S Smart Software Solutions, and they have produced new versions for both CoDeSys V3 and V2.3 that mitigate these vulnerabilities. Mr. Auriemma has confirmed that the new versions fully resolve the reported vulnerabilities.\n\n\n\nResearcher\nVulnerability\nCoordinated/Unanticipated\nCVE\n\n\n\n\nLuigi Auriemma\nInteger Overflow\nUnanticipated\nCVE-2011-5008\n\n\nLuigi AuriemmaCelil Unuver\nStack Overflow\nUnanticipatedCoordinated\nCVE-2011-5007\n\n\nLuigi Auriemma\nContent-Length NULL Pointer\nUnanticipated\nCVE-2011-5009\n\n\nLuigi Auriemma\nContent-Length NULL Pointer\nUnanticipated\nCVE-2011-5009\n\n\nLuigi Auriemma\nInvalid HTTP Request NULL Pointer\nUnanticipated\nCVE-2011-5009\n\n\nLuigi Auriemma\nFolders Creation\nUnanticipated\nNone\n\n\n\nAffected Products\nThe following 3S Smart Software Solutions CoDeSys versions are affected:\n\nVersion 2.3\nVersion 3.4.\n\nImpact\nSuccessful exploitation of these vulnerabilities may allow an attacker to cause a denial of service (DoS) or to execute arbitrary code.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nCoDeSys is produced by 3S Smart Software Solutions GmgH based in Germany. According to the 3S Smart Software Solutions website.\nCoDeSys is used across several sectors of the automation industry by manufacturers of industrial controllers or intelligent automation devices and by end users in different industries including system integrators who offer automation solutions using CoDeSys.\nVulnerability Characterization\nVulnerability Overview\nInteger Overflow\nAn attacker could exploit this vulnerability by sending specially crafted packets to Port 1217/TCP.\nCVE-2011-5008 has been assigned to this vulnerability.\nStack Overflow\nAn attacker could exploit this vulnerability by sending an overly long URL to Port 8080/TCP.\nCVE-2011-5007 has been assigned to this vulnerability.\nContent-Length Null Pointer\nAn attacker could exploit this vulnerability by sending a specially crafted Content-Length header to Port 8080/TCP.\nCVE-2011-5009 has been assigned to this vulnerability.\nInvalid HTTP Request Null Pointer\nAn attacker could exploit this vulnerability by sending a request with an unknown HTTP method to Port 8080/TCP.\nCVE-2011-5009 has been assigned to this vulnerability.\nFolders Creation\nAn attacker could exploit this vulnerability by sending a web request containing a nonexistent directory to Port 8080/TCP. Exploitation of this vulnerability results in the creation of arbitrary directories.\nVulnerability Details\nExploitability\nThese vulnerabilities are remotely exploitable.\nExistence of Exploit\nPublic exploits are known to target this vulnerability.\nDifficulty\nAn attacker with a low skill level can create the DoS, whereas it would require a more skilled attacker to execute arbitrary code.\nMitigation\n3S Smart Software Solutions has developed a new version of CoDeSys that resolves these vulnerabilities (V3.5 and V2.3.9.32). Customers can download the new versions for CoDeSys from the 3S Smart Software Solutions customer download website.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.  ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n\n",
  "cves": [
    "CVE-2011-5009",
    "CVE-2011-5008",
    "CVE-2011-5007"
  ],
  "techniques": [],
  "advisory": "icsa-12-006-01",
  "title": "3S CoDeSys Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "d25970872806abed19e77a55cf4366eb1185f0397fd4b78a910448c816f6960f"
}