{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable on adjacent network/high attack complexity\nVendor: Emerson\nEquipment: DeltaV Distributed Control System\nVulnerabilities: Missing Authentication for Critical Function, Use of Hard-coded Credentials, Insufficient Verification of Data Authenticity, Use of a Broken or Risky Cryptographic Algorithm\n\nCISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities can result in a denial-of-service condition, manipulation of runtime communications, or compromise of a controller.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DeltaV Distributed Control System, a software management platform, are affected:\n\nDeltaV M-series: All versions\nDeltaV S-series: All versions\nDeltaV P-series: All versions\nDeltaV SIS: All versions\nDeltaV CIOC/EIOC/WIOC IO cards: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nSeveral protocols, including Firmware upgrade, Plug-and-Play, Hawk services, Management, SIS communications, and multi-cast have no authentication. This could allow an attacker who has reverse-engineered communications to invoke desired functionality or cause a denial-of-service condition.\nCVE-2022-29957 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.2.2    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product is vulnerable by using hard-coded credentials in the FTP service, which is disabled by default.\nCVE-2022-29962 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:L/UI:R/S:U/C:L/I:L/A:L).\n3.2.3    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product is vulnerable to hard-coded credential use within the read-only Telnet service.\nCVE-2022-29963 has been assigned to this vulnerability. A CVSS v3 base score of 1.8 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:H/UI:R/S:U/C:L/I:N/A:N).\n3.2.4    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product is vulnerable to hard-coded credential use within the SSH service, which is disabled by default.\nCVE-2022-29964 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:L/UI:R/S:U/C:L/I:L/A:L).\n3.2.5    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nFirmware images are not signed and rely on insecure checksums for regular integrity checks. This could allow an attacker to push malicious firmware images, execute code, or cause a denial-of-service condition.\nCVE-2022-30260 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:H/UI:R/S:U/C:H/I:H/A:H).\n3.2.6    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nAccess to privileged operations in the maintenance interface is controlled by a challenge-response authentication that uses a deterministic insecure algorithm. \nCVE-2022-29965 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forescout Technologies reported these vulnerabilities to CISA.\n4. MITIGATIONS\nEmerson has provided the following mitigations or workarounds:\nEmerson has corrected CVE-2022-29965 in all currently supported versions of DeltaV. For additional mitigations and preventative measures, please see the Emerson Guardian Support Portal (login required).\nEmerson has mitigated CVE-2022-29962, CVE-2022-29963, and CVE-2022-29964 in all currently supported versions of DeltaV. Please see the Emerson Guardian Support Portal (login required) for more information.\nEmerson corrected the Firmware image verification vulnerability in Version 14.3 and mitigated it in all other versions. Please see the Emerson Guardian Support Portal (login required) for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a high attack complexity.\n",
  "cves": [
    "CVE-2022-29962",
    "CVE-2022-29964",
    "CVE-2022-29965",
    "CVE-2022-29963",
    "CVE-2022-30260",
    "CVE-2022-29960",
    "CVE-2022-29957"
  ],
  "techniques": [],
  "advisory": "icsa-22-181-03",
  "title": "Emerson DeltaV Distributed Control System | CISA",
  "source": "ics-advisories",
  "id": "6cb01b7c6f50819e904515e4df1923534de48fc061b4c43767ce3154446bfb55"
}