{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.0\nVendor: Schneider Electric\nEquipment: Interactive Graphical SCADA System (IGSS)\nVulnerability: Out-of-Bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to achieve arbitrary code execution or crash the software.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of IGSS are affected:\n\nIGSS Version 14 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds vulnerability exists and could be exploited by the application processing a specially crafted project file. Exploitation could cause a software crash when data in the mdb database is manipulated or allow code execution.\nCVE-2019-6827 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nmdm and rgod of 9SG Security Team working with Trend Micro Zero Day Initiative reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSchneider Electric recommends upgrading to Version 13.0.0.19140 or 14.0.0.19120, which can be downloaded here:\nhttp://igss.schneider-electric.com/products/igss/download/licensed-versions.aspx\nThe following workarounds and mitigations can be applied by users to reduce the risk:\n\nDo not allow untrusted access to the configuration database (mdb) and update IGSS to the latest version of IGSS, either Version 13 or Version 14.\nA restart of the software is required, but a reboot of the system is not required.\n\nSchneider Electric General Security Recommendations:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nPhysical controls should be in place so that no unauthorized person would have access to the ICS and safety controllers, peripheral equipment, or the ICS and safety networks.\nAll controllers should reside in locked cabinets and never be left in “Program” mode.\nAll programming software should be kept in locked cabinets and should never be connected to any network other than the network intended for the devices.\nAll methods of mobile data exchange with the isolated network, such as CDs, USB drives, etc., should be scanned before use in the terminals or any node connected to these networks.\nLaptops that have connected to any other network besides the intended network should never be allowed to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and/or systems and ensure that they are not accessible from the Internet.\nWhen remote access is required, use secure methods such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nFor more information, please see Schneider Electric advisory: SEVD-2019-190-02\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-6827"
  ],
  "techniques": [],
  "advisory": "icsa-19-192-06",
  "title": "Schneider Electric Interactive Graphical SCADA System | CISA",
  "source": "ics-advisories",
  "id": "2d782599c7377494db2696d3359c4fa1167929876e3102bbc88062b18d8a9c8d"
}