{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-R Series\nVulnerability: Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may prevent legitimate clients from connecting to an affected product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following MELSEC iQ-R series CPU modules are affected:\n\nR00/01/02CPU: All versions\nR04/08/16/32/120(EN)CPU: All versions\nR08/16/32/120SFCPU: All versions\nR08/16/32/120PCPU: All versions\nR08/16/32/120PSFCPU: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nDue to improper session management, an attacker may prevent legitimate clients from connecting to an affected product by not properly closing a connection. If multiple MELSOFT transmission ports (TCP/IP) are open, the other ports are not affected. Sequence control is not affected by this vulnerability.\nCVE-2021-20591 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nYounes Dragoni of Nozomi Networks reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends the following mitigations:\n\nUse a firewall, a virtual private network (VPN), etc., to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\nUse the IP filter function to restrict the connectable IP addresses. See MELSEC iQ-R Ethernet User’s Manual (Application) 1.13 Security “IP filter” for more information.\nUse the MELSOFT transmission port (UDP/IP).\nIf Port 5007 of the MELSOFT transmission port (TCP/IP) is not used, set b2 to \"1\" in advance. See MELSEC iQ-R Ethernet User’s Manual (Application) Appendix 3, Buffer Memory for more information.\n\nIf this vulnerability is exploited, legitimate users can recover by first disabling the port with the forced connection invalidation function and then re-enabling the port. For an example see MELSEC iQ-R Ethernet User’s Manual (Application) Appendix 3, Buffer Memory.\nPlease refer to the Mitsubishi Electric advisory for further details. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-20591"
  ],
  "techniques": [],
  "advisory": "icsa-21-147-05",
  "title": "Mitsubishi Electric MELSEC iQ-R Series | CISA",
  "source": "ics-advisories",
  "id": "3a15524a3c555430c03d07d75cbeab747afb90ee876dd07597112f6b1252ae33"
}