{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Xylem, Inc.\nEquipment: Aanderaa GeoView\nVulnerability: SQL Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to manipulate the database server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Aanderaa GeoView, a web-based data display, are affected:\n\nAADI GeoView Webservice: All versions prior to v2.1.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe affected product is vulnerable to SQL injection, which could allow an unauthenticated attacker to invoke queries to manipulate the Aanderaa GeoView database server.\nCVE-2021-41063 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nXylem reported this vulnerability to CISA.\n4. MITIGATIONS\nSoftware as a Service (SaaS) / cloud users:\n\nXylem has remediated this vulnerability. No action is required.\n\nOn-premises users:\n\nXylem recommends on-premises users upgrade to AADI GeoView Webservice Version 2.1.3\n\nFor additional details, please see Xylem Product Security Advisory XSA-2021-003\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-41063"
  ],
  "techniques": [],
  "advisory": "icsa-21-334-01",
  "title": "Xylem Aanderaa GeoView | CISA",
  "source": "ics-advisories",
  "id": "38402ef0ffa532560f571111eae1418642f663e519ef7f3413da002c0fed0b3c"
}