{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 3.3\n\nATTENTION: Low skill level to exploit\nVendor: Pilz GmbH & Co. KG (Pilz)\nEquipment: PNOZmulti Configurator\nVulnerability: Clear-text Storage of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow sensitive data to be read from the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of PNOZmulti Configurator, a safety circuit configuration tool, are affected:\n\nPNOZmulti Configurator all versions prior to 10.9\n\nThe vulnerability within the PNOZmulti Configurator directly impacts the PMI m107 diag HMI device.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nAn authenticated attacker with local access to the system containing the PNOZmulti Configurator software can view sensitive credential data in clear-text. This sensitive data is applicable to only the PMI m107 diag HMI device. An attacker with access to this sensitive data and physical access to the PMI m107 diag can modify data on the HMI device.\nCVE-2018-19009 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nGjoko Krstikj of Applied Risk reported this vulnerability to NCCIC.\n4. MITIGATIONS\nPilz has discontinued the PMI m107 diag HMI device and the function concerned was removed in PNOZmulti Configurator Version 10.9.\nPilz recommends the following mitigations depending on use of the PMI m107 diag HMI device:\nUsers that do not use the PMI m107 diag:\n\nInstall Version 10.9 of the PNOZmulti Configurator software and delete the content of the directory C:\\Program-Data\\Pilz\\PNOZmulti Configurator v<version>\\AppData\\pmimicroconfig. (Replace <version> with the used version.)\n\nhttps://www.pilz.com/download/restricted/PNOZmulti_Configurator_10_9_0_3000683A41.zip (Login Required)\nUsers that still use the PMI m107 diag:\n\nContinue to use the old PNOZmulti Configurator software version and secure the PC and the file system against unauthorized access.\n\nFor more information, the Pilz security advisory can be viewed at the following link:\nhttps://www.pilz.com/en-GB/support/downloads#currentPage=1&SEARCH=Security%20Advisory&pilz_group_type=download&SORT=dmodified (Login Required)\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-19009"
  ],
  "techniques": [],
  "advisory": "icsa-19-010-03",
  "title": "Pilz PNOZmulti Configurator | CISA",
  "source": "ics-advisories",
  "id": "f07c0fb4902a5e8f3e3d4f2c753bf0388b1d57ea9514b5fb7ae61887eb8685a9"
}