{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.8\nATTENTION: Exploitable remotely\nVendor: Johnson Controls, Inc.\nEquipment: Illustra Essentials Gen 4\nVulnerability: Storing Passwords in a Recoverable Format\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated user to recover credentials for other Linux users.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports that the following versions of Illustra Essential Gen 4, an IP camera, are affected:\n\nIllustra Essentials Gen 4: versions up to Illustra.Ess4.01.02.10.5982\n\n3.2 Vulnerability Overview\n3.2.1 Storing Passwords in a Recoverable Format CWE-257\nUnder certain circumstances the Linux users credentials may be recovered by an authenticated user.\nCVE-2024-32756 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Commercial Facilities, Government Facilities, Transportation Systems, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nSam Hanson of Dragos reported this vulnerability to Johnson Controls.\n4. MITIGATIONS\nJohnson Controls recommends that users upgrade cameras to Illustra.Ess4.01.02.13.6953. For more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2024-07 v1.\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\nCISA provides a section for control systems security recommended practices on the ICS web page on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nFurther ICS security notices and product security guidance are located at Johnson Controls' product security website\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nJune 27, 2024: Initial Publication\nJuly 2, 2024: Update A - Change in mitigation schedule\n\n",
  "cves": [
    "CVE-2024-32756"
  ],
  "techniques": [],
  "advisory": "icsa-24-179-05",
  "title": "Johnson Controls Illustra Essentials Gen 4 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "724af1e26fbf834956bce1369dcb2a7a23a2bd510bdc9d6fbcedae90367e7040"
}