{
  "markdown": "\nCVSS v3 8.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Wecon Technologies\nEquipment: LEVI Studio HMI Editor\nVulnerabilities: Heap-Based Buffer Overflow, Stack-Based Buffer Overflow\nAFFECTED PRODUCTS\nThe following versions of LEVI Studio HMI Editor, a HMI programming software, are affected:\n\nLEVI Studio HMI Editor, all versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could cause the device to become unresponsive; a buffer overflow condition may allow remote code execution.\nMITIGATION\nWecon Technologies recommends that affected users upgrade to Version 1.8.1 of the software which can be downloaded from:\nhttp://www.we-con.com.cn/en/download/softwares/levi-series-hmi/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nHEAP-BASED BUFFER OVERFLOW CWE-122\n\nThis vulnerability causes a buffer overflow when a maliciously crafted project file is run by the system.\nCVE-2017-6037 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nThis vulnerability causes a buffer overflow, which could result in denial of service when a malicious project file is run on the system.\nCVE-2017-6035 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nAndrea (rgod) Micalizzi, working with iDefense Labs, reported these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector(s): Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Fuzhou, Fujian, China\n",
  "cves": [
    "CVE-2017-6037",
    "CVE-2017-6035"
  ],
  "techniques": [],
  "advisory": "icsa-17-103-01",
  "title": "Wecon Technologies LEVI Studio HMI Editor | CISA",
  "source": "ics-advisories",
  "id": "5a93f52a3fda484041f9a1a35d7c53d255687eb0eea388e94e453864acb3a9ca"
}