{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-R Series Safety CPU and SIL2 Process CPU\nVulnerability: Incorrect Privilege Assignment\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a non-administrator user to disclose the credentials (user ID and password) of a user with a lower access level than themselves.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports that the following MELSEC iQ-R Series products are affected:\n\nMELSEC iQ-R Series Safety CPU R08SFCPU: all versions\nMELSEC iQ-R Series Safety CPU R16SFCPU: all versions\nMELSEC iQ-R Series Safety CPU R32SFCPU: all versions\nMELSEC iQ-R Series Safety CPU R120SFCPU: all versions\nMELSEC iQ-R Series SIL2 Process CPU R08PSFCPU: all versions\nMELSEC iQ-R Series SIL2 Process CPU R16PSFCPU: all versions\nMELSEC iQ-R Series SIL2 Process CPU R32PSFCPU: all versions\nMELSEC iQ-R Series SIL2 Process CPU R120PSFCPU: all versions\n\n3.2 Vulnerability Overview\n3.2.1 INCORRECT PRIVILEGE ASSIGNMENT CWE-266\nInformation disclosure vulnerability due to incorrect privilege assignment exists in MELSEC iQ-R Series Safety CPU and SIL2 Process CPU modules. After a remote attacker logs into the CPU module as a non-administrator user, the attacker may disclose the credentials (user ID and password) of a user with a lower access level than the attacker by sending a specially crafted packet.\nCVE-2023-6815 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2023-6815. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nReid Wightman of Dragos Inc. reported this vulnerability to Mitsubishi Electric.\n4. MITIGATIONS\nWhen the affected products are used in the following combinations, an attack can be prevented by enabling \"communicating with only the enhanced version of vulnerability management of GX Works3\" when writing user information to the CPU module:\n\nMELSEC iQ-R Series Safety CPU versions 27 or later used with GX Works3 versions 1.087R or later.\nMELSEC iQ-R Series SIL2 Process CPU version 12 or later used with GX Works3 versions 1.105K or later.\n\nMitsubishi Electric recommends that users of MELSEC iQ-R Series Safety CPU (version 26 and prior) or MELSEC iQ-R Series SIL2 Process CPU (version 11 and prior) take the following mitigation measures to minimize the risk of exploiting this vulnerability because updating the product to the enhanced version of vulnerability management is not available:\n\nUse a firewall or virtual private network (VPN), etc., to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\nUse IP filter function to block access from untrusted hosts. For details on the IP filter function, please refer to the following manual for each product. \"1.13 Security\" - \"IP filter\" in the MELSEC iQ-R Ethernet User's Manual(Application).\nRestrict physical access to the affected product as well as to the personal computers and the network devices that can communicate with it.\nInstall antivirus software on your personal computer that can access the affected product.\n\nFor specific update instructions and additional details, see Mitsubishi Electric advisory 2023-021..\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nFebruary 13, 2024: Initial Publication\nMay 16, 2024: Update A - Additional workarounds for MELSEC iQ-R Series SIL2 Process CPU.\n\n",
  "cves": [
    "CVE-2023-6815"
  ],
  "techniques": [],
  "advisory": "icsa-24-044-01",
  "title": "Mitsubishi Electric MELSEC iQ-R Series Safety CPU and SIL2 Process CPU (Update A) | CISA",
  "source": "ics-advisories",
  "id": "e14a9d010fbe5890991315fa9c0cb339bdcfae91ea80de614ef45adedde83a3c"
}