{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Siemens  \nEquipment: Brownfield Connectivity—Gateway \nVulnerabilities: Improper Restriction of Operations within the Bounds of a Memory Buffer, Improper Input Validation, Uncontrolled Resource Consumption, Exposure of Resource to Wrong Sphere, Allocation of Resources without Limits or Throttling, Improper Certificate Validation \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to a denial-of-service condition. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following Brownfield Connectivity—Gateway products: \n\nBrownfield Connectivity—Gateway: all versions prior to V1.10 \nBrownfield Connectivity—Gateway: V1.10.1 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119 \nImportedSymbols in debug/macho (for Open or OpenFat) in Go before 1.16.10 and 1.17.x before 1.17.3 accesses a memory location after the end of a buffer, aka an out-of-bounds slice situation. \nCVE-2021-41771 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.2 IMPROPER INPUT VALIDATION CWE-20 \nGo before 1.16.10 and 1.17.x before 1.17.3 allows an archive/zip Reader.Open panic via a crafted ZIP archive containing an invalid name or an empty filename field. \nCVE-2021-41772 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.3 UNCONTROLLED RESOURCE CONSUMPTION CWE-400 \nnet/http in Go before 1.16.12 and 1.17.x before 1.17.5 allows uncontrolled memory consumption in the header canonicalization cache via HTTP/2 requests. \nCVE-2021-44716 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.4 UNCONTROLLED RESOURCE CONSUMPTION CWE-400 \nregexp.Compile in Go before 1.16.15 and 1.17.x before 1.17.8 allows stack exhaustion via a deeply nested expression. \nCVE-2022-24921 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.5 EXPOSURE OF RESOURCE TO WRONG SPHERE CWE-668 \nGo before 1.16.12 and 1.17.x before 1.17.5 on UNIX allows write operations to an unintended file or unintended network connection due to erroneous closing of file descriptor 0 after file-descriptor exhaustion. \nCVE-2021-44717 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N). \n3.2.6 ALLOCATION OF RESOURCES WITHOUT LIMITS OR THROTTLING CWE-770 \nencoding/pem in Go before 1.17.9 and 1.18.x before 1.18.1 has a Decode stack overflow via a large amount of PEM data. \nCVE-2022-24675 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.7 IMPROPER CERTIFICATE VALIDATION CWE-295 \nCertificate.Verify in crypto/x509 in Go 1.18.x before 1.18.1 could be caused to panic on macOS when presented with certain malformed certificates. This could allow a remote TLS server to cause a TLS client to panic. \nCVE-2022-27536 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.8 IMPROPER INPUT VALIDATION CWE-20 \nThe generic P-256 feature in crypto/elliptic in Go before 1.17.9 and 1.18.x before 1.18.1 could allow a panic via long scalar input. \nCVE-2022-28327 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA. \n4. MITIGATIONS\nSiemens released an update for Brownfield Connectivity—Gateway and recommends updating to V1.11 or later version. Contact Siemens support to obtain the update. \nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security, and following the recommendations in the product manuals. See additional information on industrial security on the Siemens website.  \nFor further inquiries on security vulnerabilities in Siemens products and solutions, users should contact Siemens ProductCERT.  \nFor more information, see the associated Siemens security advisory SSA-744259 in HTML and CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users to protect themselves from social engineering attacks. \nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have low attack complexity.\n",
  "cves": [
    "CVE-2022-24921",
    "CVE-2022-24675",
    "CVE-2022-28327",
    "CVE-2021-44716",
    "CVE-2021-41771",
    "CVE-2021-41772",
    "CVE-2021-44717",
    "CVE-2022-27536"
  ],
  "techniques": [],
  "advisory": "icsa-23-047-04",
  "title": "Siemens Brownfield Connectivity Gateway | CISA",
  "source": "ics-advisories",
  "id": "879d9dae6c3814a7239e5db44f4953ea8d6c4c935d2cf250eb6d2a7a682ad4df"
}