{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: JT2GO, Teamcenter Visualization\nVulnerabilities: Infinite Loop, Null Pointer Dereference, Integer Overflow to Buffer Overflow, Double Free, Access of Uninitialized Pointer\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to trick a user to open a malicious file (crafted as CGM, TIFF or TG4) with any of the affected products, which could lead the application to crash or to arbitrary code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nJT2GO: All versions prior to v13.3.0.3\nTeamcenter Visualization v13.3: All versions prior to v13.3.0.3\nTeamcenter Visualization v14.0: All versions prior to v14.0.0.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    LOOP WITH UNREACHABLE EXIT CONDITION (‘INFINITE LOOP’) CWE-835\nThe Tiff_Loader.dll is vulnerable to infinite loop condition while parsing specially crafted TIFF files. An attacker could leverage this vulnerability to crash the application and cause a denial-of-service condition.\nCVE-2022-29028 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L).\n3.2.2    NULL POINTER DEREFERENCE CWE-476\nThe CGM_NIST_Loader.dll contains a null pointer dereference vulnerability while parsing specially crafted CGM files. An attacker could leverage this vulnerability to crash the application and cause a denial-of-service condition.\nCVE-2022-29029 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L).\n3.2.3    INTEGER OVERFLOW TO BUFFER OVERFLOW CWE-680\nThe Mono_Loader.dll library is vulnerable to integer overflow condition while parsing specially crafted TG4 files. An attacker could leverage this vulnerability to crash the application and cause a denial-of-service condition.\nCVE-2022-29030 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L).\n3.2.4    NULL POINTER DEREFERENCE CWE-476\nThe affected product is vulnerable to a stack-based buffer overflow, which may allow an attacker to remotely execute arbitrary code.\nCVE-2022-29031 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L).\n3.2.5    DOUBLE FREE CWE-415\nThe CGM_NIST_Loader.dll library contains a double free vulnerability while parsing specially crafted CGM files. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2022-29032 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.6    ACCESS OF UNINITIALIZED POINTER CWE-824\nThe CGM_NIST_Loader.dll library is vulnerable to uninitialized pointer free while parsing specially crafted CGM files. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2022-29033 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nJin Huang, of ADLab of Venustech, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends updating its software to the latest version:\n\nJT2GO: Update to v13.3.0.3\nTeamcenter Visualization v13.3: Update to v13.3.0.3\nTeamcenter Visualization v14.0: Update to v14.0.0.1\n\nSiemens has identified the following workarounds and mitigations users can apply to reduce the risk:\n\nAvoid opening untrusted files from unknown sources in affected products.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-553086\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2022-29030",
    "CVE-2022-29028",
    "CVE-2022-29032",
    "CVE-2022-29029",
    "CVE-2022-29031",
    "CVE-2022-29033"
  ],
  "techniques": [],
  "advisory": "icsa-22-132-09",
  "title": "Siemens JT2GO and Teamcenter Visualization | CISA",
  "source": "ics-advisories",
  "id": "f7fdb73bc9049cbd25099466b3dab11fd882b9245f94599a6b9f731d1161b54e"
}