{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC S7-PLCSIM v5.4\nVulnerabilities: Infinite Loop, NULL Pointer Dereference, Divide by Zero\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker with local access to craft special project files that may lead to denial-of-service attacks.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATICS S7-PLCSIM v5.4: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    LOOP WITH UNREACHABLE EXIT CONDITION ('INFINITE LOOP') CWE-835\nAn attacker with local access to the system could cause a denial-of-service condition in the application when it is used to open a specially crafted file. As a result, the application could enter an infinite loop, become unresponsive, and must be restarted to restore the service.\nCVE-2021-25673 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    NULL POINTER DEREFERENCE CWE-476\nAn attacker with local access to the system could cause a denial-of-service condition in the application when it is used to open a specially crafted file. As a result, a NULL pointer deference condition could cause the application to terminate unexpectedly and must be restarted to restore the service.\nCVE-2021-25674 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    DIVIDE BY ZERO CWE-369\nAn attacker with local access to the system could cause a denial-f-service condition in the application when it is used to open a specially crafted file. As a result, a divide by zero operation could occur and cause the application to terminate unexpectedly and must be restarted to restore the service.\nCVE-2021-25675 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nRestrict access to project files on the engineering station to trusted users.\nOnly use project files from trusted sources.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-256092\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-25675",
    "CVE-2021-25674",
    "CVE-2021-25673"
  ],
  "techniques": [],
  "advisory": "icsa-21-068-01",
  "title": "Siemens SIMATIC S7-PLCSIM | CISA",
  "source": "ics-advisories",
  "id": "79dc3f602d6da964b04968efe2b36950c9d49c5c65389f6681f1542b2921a1a1"
}