{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: RUGGEDCOM ROX\n\n--------- Begin Update A Part 1 of 2 ---------\n\nVulnerabilities: Improper Privilege Management, Execution with Unnecessary Privileges, Improper Handling of Insufficient Permissions or Privileges\n\n--------- End Update A Part 1 of 2 ---------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-259-01 Siemens RUGGEDCOM ROX that was published September 16, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain root access to the affected devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of RUGGEDCOM ROX are affected:\n\nRUGGEDCOM ROX MX5000: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1400: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1500: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1501: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1510: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1511: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1512: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1524: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1536: All versions prior to v2.14.1\nRUGGEDCOM ROX RX5000: All versions prior to v2.14.1 \n\n4.2 VULNERABILITY OVERVIEW\n--------- Begin Update A Part 2 of 2 ---------\n4.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThe command line interface of affected devices insufficiently restricts file read and write operations for low privileged users. This could allow an authenticated remote attacker to escalate privileges and gain root access to the device.\nCVE-2021-37173 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n--------- End Update A Part 2 of 2 ---------\n4.2.2    EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250\nThe affected devices have a privilege escalation vulnerability that could allow an attacker to gain root user access.\nCVE-2021-37174 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    IMPROPER HANDLING OF INSUFFICIENT PERMISSIONS OR PRIVILEGES CWE-280\nThe affected devices do not properly handle permissions to traverse the file system. If exploited, an attacker could gain access to an overview of the overview of the complete file system on the affected devices.\nCVE-2021-37175 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nMichael Messner from Siemens Energy reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens has released an update and recommends users update to v2.14.1 or later version.\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nApply the principle of least privileges for accounts configured on the affected devices.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-150692\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-37174",
    "CVE-2021-37173",
    "CVE-2021-37175"
  ],
  "techniques": [],
  "advisory": "icsa-21-259-01",
  "title": "Siemens RUGGEDCOM ROX (Update A) | CISA",
  "source": "ics-advisories",
  "id": "f911e2a3b39a1ade070b44e0a3a6d7eff3d000b4abac2375843779edcb52cac0"
}