{
  "markdown": " 7\\-Technologies IGSS Buffer Overflow \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS Advisory7\\-Technologies IGSS Buffer Overflow==================================== Last Revised April 30, 2013 Alert Code ICSA\\-11\\-355\\-01Overview-------- Security researcher Celil Unuver (SignalSEC LLCSignalSEC LLC, www.signalsec.com, website last accessed December 21, 2011\\.) has identified a buffer overflow vulnerability in the 7\\-Technologies (7T) Interactive Graphical SCADA System (IGSS) product. Successful exploitation of this vulnerability could result in a denial of service (DoS) or the execution of arbitrary code. ICS\\-CERT has coordinated this vulnerability report with 7T and they have produced a patch that resolves this vulnerability. The researcher has confirmed that the patch fully resolves the reported vulnerability.Affected Products----------------- The following 7T Interactive Graphical SCADA System versions are affected:* Versions 9\\.0\\.0\\.11355 and prior.Impact------ Successful exploitation of this vulnerability may allow an attacker to cause a DoS or to execute arbitrary code. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- 7T, based in Denmark, creates monitoring and control systems that are primarily used in the United States, Europe, and South Asia. According to the [7T website](http://www.7t.dk/)  ,  IGSS has been deployed in over 28,000 industrial plants in 50 countries worldwide. 7T Interactive Graphical SCADA System software is used to control and monitor programmable logic controllers in industrial processes across multiple sectors including energy, manufacturing, oil and gas, and water.Vulnerability Characterization------------------------------### Vulnerability Overview An attacker could exploit this buffer overflow vulnerability by sending specially crafted packets to either Port 12399/TCP or Port 12397/TCP. CVE\\-2011\\-4537http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2011\\-4537\\. NIST uses this advisory to create the CVE website report. This website will be active sometime after publication of this advisory. has been assigned to this vulnerability.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable.#### Existence of Exploit No known public exploits specifically target this vulnerability.#### Difficulty An attacker with a low skill level can create the DoS whereas it would require a more skilled attacker to execute arbitrary code.Mitigation---------- 7T has developed a patch to address this vulnerability and has provided the following options to customers for updating their systems:1. In the IGSSMaster application, select the menu item “Information and Support” and click “Update IGSS Software.” This will automatically download and install the updated module. This is the preferred method for updating the IGSS installation when the host computer has Internet access.2. Access the update either by using the direct link or the instructions below: Direct link: [http://www.7t.dk/igss/igssupdates/v90/progupdatesv90\\.zip](http://www.7t.dk/igss/igssupdates/v90/progupdatesv90.zip)  . Instructions: Browse to the 7T IGSS website (www.igss.com). From the “Download” menu select the “Licensed Versions” option. From this page, select the Version 9 “Program updates (General)” to download a ZIP file containing all current updates for IGSS Version 9\\. Once the ZIP file (progupdatesv90\\.zip) has downloaded, manually unpack the ZIP file, and copy the entire contents to the \\\\IGSS\\\\ directory within the IGSS installation folder on the end user’s computer. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks:1. Do not click web links or open unsolicited attachments in e\\-mail messages.2. Refer to [*Recognizing and Avoiding Email Scams*](/reading_room/emailscams_0905.pdf) for more information on avoiding e\\-mail scams.3. Refer to [*Avoiding Social Engineering and Phishing Attacks*](/cas/tips/ST04-014.html) for more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* 7\\-Technologies-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-355-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-4537"
  ],
  "techniques": [],
  "advisory": "icsa-11-355-01",
  "title": "7-Technologies IGSS Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "63fe609f8c2907d476d39524e0755c0843e1313cb729fe2eaf745625cafa55eb"
}