{
  "markdown": "\nOverview\nICS-CERT has received a report from independent security researcher Jeremy Brown that a remote heap corruption vulnerability exists in IGSS (Interactive Graphical SCADA System) Version 8 from 7-Technologies (7T). 7T has verified the vulnerability and has developed a patch.\nAffected Products\nThis vulnerability affects only IGSS Versions 8 and 9. Users can contact 7T for additional information.\nImpact\nAccording to 7T, this vulnerability is more likely to be exploited for a denial of service (DoS); however, arbitrary code execution may be possible.\nBackground\n7T is based in Denmark and creates monitoring and control systems that are primarily used in Europe and South Asia in the wastewater, water supply, and marine industries. IGSS is an HMI (Human-Machine Interface) application used to control and monitor PLCs (Programmable Logic Controllers) in industrial processes.\nAccording to the IGSS website, IGSS has been installed in over 28,000 industrial plants in 50 countries worldwide. It is deployed in multiple sectors including energy, manufacturing, oil and gas, and water.\nVulnerability Characterization\nVulnerability Overview\nAn attacker can exploit the vulnerability by sending a specially crafted packet to the server. The exploit can crash the server (DoS) or possibly allow the attacker to execute arbitrary code.\nVulnerability Details\nExploitability\nThis vulnerability is exploitable from a remote machine by sending a specially crafted packet to the targeted server’s listening port (20222/TCP).\nExistence of Exploit\nNo publicly available exploits are known to exist for this vulnerability.\nDifficulty\nConsistent exploit code is unlikely. An attacker would require at least an intermediate skill level to exploit this vulnerability.\nMitigation\n7T has created a patch for this vulnerability. ICS-CERT recommends that users of IGSS take the following mitigation steps:\nDownload and install the latest patch, available at the 7T website.\nAlternately, current users can use the “update” feature from within the application.\nUsers should minimize network exposure for all control system devices. Critical devices should not directly face the Internet. Control system networks and remote devices should be located behind firewalls and be isolated from the business network. If remote access is required, ICS-CERT recommends the use of secure methods, such as Virtual Private Networks (VPNs).\nOrganizations should follow their established internal procedures if any suspected malicious activity is observed and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations that proper impact analysis and risk assessment should be performedprior to taking defensive measures.\nThe Control System Security Program also provides a recommended practices section for control systems on the US-CERT website. Several recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-018-02",
  "title": "7-Technologies IGSS 8 ODBC Server Remote Heap Corruption | CISA",
  "source": "ics-advisories",
  "id": "4915941bff195209b04849e44c9a72e97f5417f0e0c4051819163e0285609959"
}