{
  "markdown": "\nCVSS v3 5.3\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Ecava\nEquipment: IntegraXor\nVulnerabilities: SQL Injection\nAFFECTED PRODUCTS\nThe following version of IntegraXor, a web SCADA/HMI solution, is affected:\n\nEcava IntegraXor v 6.1.1030.1 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to disclose sensitive information from the database or generate an error in the database log.\nMITIGATION\nEcava recommends that users of affected IntegraXor versions update to version 6.1.1215.0 or newer, a download for which can be found at the following location:\nhttps://www.integraxor.com/download-scada/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\n\nThe SQL Injection vulnerability has been identified, which attacker can leverage to disclose sensitive information from the database.\nCVE-2017-16733 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nIMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\n\nThe SQL Injection vulnerability has been identified, which generates an error in the database log.\nCVE-2017-16735 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\nRESEARCHER\nSteven Seeley of Source Incite, and Michael DePlante and Brad Taylor working with Zero Day Initiative, reported the vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: United Kingdom, United States, Australia, Poland, Canada, Estonia\nCompany Headquarters Location: Malaysia\n",
  "cves": [
    "CVE-2017-16733",
    "CVE-2017-16735"
  ],
  "techniques": [],
  "advisory": "icsa-17-353-03",
  "title": "Ecava IntegraXor | CISA",
  "source": "ics-advisories",
  "id": "97b8042c4e9b34b574979cc7e6e627318d6ae6a7090dc6c23e92bbb432165cff"
}