{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.3\nATTENTION: Low attack complexity\nVendor: Rockwell Automation\nEquipment: ControlLogix, GuardLogix, CompactLogix\nVulnerability: Always-Incorrect Control Flow Implementation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could compromise the availability of the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports that the following controllers are affected:\n\nControlLogix 5580: V34.011\nGuardLogix 5580: V34.011\n1756-EN4: V4.001\nCompactLogix 5380: V34.011\nCompact GuardLogix 5380: V34.011\nCompactLogix 5480: V34.011\n\n3.2 Vulnerability Overview\n3.2.1 Always-Incorrect Control Flow Implementation CWE-670\nRockwell Automation was made aware of a vulnerability that causes all affected controllers on the same network to result in a major nonrecoverable fault (MNRF/Assert). This vulnerability could be exploited by sending abnormal packets to the mDNS port. If exploited, the availability of the device would be compromised.\nCVE-2024-5659 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-5659. A base score of 8.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation offers users the following solutions:\n\nControlLogix 5580: corrected in V34.014, V35.013, V36.011 and later\nGuardLogix 5580: corrected in V34.014, V35.013, V36.011 and later\n1756-EN4: corrected in V6.001 and later\nCompactLogix 5380: corrected in V34.014, V35.013, V36.011 and later\nCompact GuardLogix 5380: corrected in V34.014, V35.013, V36.011 and later\nCompactLogix 5480: corrected in V34.014, V35.013, V36.011 and later\n\nRockwell Automation encourages users of the affected software, who are not able to upgrade to one of the corrected versions, to apply the risk mitigations where possible.\n\nUsers who do not use Automatic Policy Deployment (APD) should block mDNS port, 5353 to help prevent communication.\nEnable CIP Security. CIP Security with Rockwell Automation Products Application Technique\nSecurity Best Practices\n\nFor more information, see Rockwell Automation's security advisory\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJune 11, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-5659"
  ],
  "techniques": [],
  "advisory": "icsa-24-163-01",
  "title": "Rockwell Automation ControlLogix, GuardLogix, and CompactLogix | CISA",
  "source": "ics-advisories",
  "id": "b9b61ccc48ec1b2a5b0b6de04efcd172d665348e874e1028f0d2537a60f1fc1d"
}