{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: General Electric Renewable Energy\nEquipment: MDS iNET/iNET II/SD/TD220/TD220MAX Radios\nVulnerabilities: Improper Input Validation, Hidden Functionality, Inadequate Encryption Strength, Uncontrolled Resource Consumption, Plaintext Storage of a Password, Download of Code Without Integrity Check\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to control the configuration of the radio, join the network without proper authorization, or keep valid users from using the system correctly.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nGeneral Electric reports these vulnerabilities affect the following radios: \n\niNET/iNET II series radio firmware versions prior to rev. 8.3.0 \nSD series radio firmware versions prior to rev. 6.4.7 \nTD220X series radio firmware versions prior to rev. 2.0.16 \nTD220MAX series radio firmware versions prior to rev. 1.2.6\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nThis previously disclosed vulnerability in the GoAhead Webserver may allow remote code execution in iNET/iNET II, TD220X, and TD220MAX series radios.\nCVE-2017-17562 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    HIDDEN FUNCTIONALITY CWE-912\niNET/iNET II series radios allow unauthenticated local and network access to the device configuration shell.\nCVE-2022-24119 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    INADEQUATE ENCRYPTION STRENGTH CWE-326\nThis vulnerability identifies a weakness in the wireless security software and chipset implementations in iNET/iNET II series radios.\nCVE-2022-24116 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nA feature can allow the use of an authentication code to cause iNET/iNET II, SD, TD220X, and TD220MAX series radios  to reset back to the factory default configuration and reboot.\nCVE-2022-24118 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.2.5    PLAINTEXT STORAGE OF A PASSWORD CWE-256\niNET and iNET II series radios store credentials in plaintext on the system flash memory.\nCVE-2022-24120 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.6    DOWNLOAD OF CODE WITHOUT INTEGRITY CHECK CWE-494\nThere is no cryptographic signature to verify authenticity of firmware.\nCVE-2022-24117 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Critical Manufacturing, Energy, Healthcare and Public Health, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nReid Wightman of Dragos reported these vulnerabilities to GE.\n4. MITIGATIONS\nGE has created the following firmware versions to address the reported issues:\n\niNET/iNET II series radio firmware rev.8.3.0 \nSD series radio firmware rev. 6.4.7 \nTD220X series radio firmware rev. 2.0.16 \nTD220MAX series radio firmware rev. 1.2.6\n\nGE also recommends the use of other protections inside the radio such as MAC address allow-listing, IEEE 802.1x authentication, or encrypt traffic at the application level with protocols such as HTTPS or SSH.\nGE provides additional mitigations and information about these vulnerabilities in GE publication number: GES-2021-18 TD220 - GES-2021-17 iNET - GES-2021-16\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-24118",
    "CVE-2017-17562",
    "CVE-2022-24120",
    "CVE-2022-24117",
    "CVE-2022-24119",
    "CVE-2022-24116"
  ],
  "techniques": [],
  "advisory": "icsa-22-090-06",
  "title": "General Electric Renewable Energy MDS Radios | CISA",
  "source": "ics-advisories",
  "id": "bb11255261354381d116a3feae50138d220f09dd13c48d60f881bd19bed69cd5"
}