{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Nortek\nEquipment: Linear eMerge 50P/5000P\nVulnerabilities: Path Traversal, Command Injection, Unrestricted Upload of File with Dangerous Type, Cross-site Request Forgery, Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to gain full system access.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Linear eMerge products are affected:\n\nLinear eMerge 50P/5000P Versions 4.6.07 (revision 79330) and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PATH TRAVERSAL CWE-35\nThe software uses external input to construct a pathname that should be within a restricted directory, but does not properly neutralize sequences such as “../” that can resolve to a location that is outside of that directory. This allows attackers to traverse the file system to access files or directories that are outside of the restricted directory.\nCVE-2019-7267 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nThe application constructs an OS command using externally influenced input from an upstream component, but incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component. This could allow attackers to execute dangerous commands directly on the operating system.\nCVE-2019-7269 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nThe vulnerability exists due to the absence of file extension validation when uploading files through the firmware upgrade upload script. A remote, unauthenticated attacker can upload files with arbitrary extensions into a directory within the application’s web root and execute them with privileges of the web server.\nCVE-2019-7268 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.4    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nThe affected application allows users to perform certain actions via HTTP requests without performing any validity checks to verify the requests. This can be exploited to perform certain actions with administrative privileges if a logged-in user visits a malicious website.\nCVE-2019-7270 has been assigned to this vulnerability. A CVSS v3 base score of 5.0 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:L).\n3.2.5    IMPROPER AUTHENTICATION CWE-287\nThe vulnerability exists due to insufficient validation of input data in authentication mechanism. A remote attacker can send a specially crafted HTTP request abusing the Cookie header value traversing to an arbitrary session file that bypasses authentication checks and gains unauthorized access to the application.\nCVE-2019-7266 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Italy\n\n\n\n3.4 RESEARCHER\nGjoko of Applied Risk reported these vulnerabilities to CISA.\n4. MITIGATIONS\nNortek has released v32-09a. For more information please contact Nortek customer support.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-7266",
    "CVE-2019-7270",
    "CVE-2019-7267",
    "CVE-2019-7268",
    "CVE-2019-7269"
  ],
  "techniques": [],
  "advisory": "icsa-20-184-01",
  "title": "Nortek Linear eMerge 50P/5000P | CISA",
  "source": "ics-advisories",
  "id": "2ad388aa5f823e59156c8c44f681b213b34e12bccba765abcbf18a115ea8fc79"
}