{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Industrial PCs and CNC devices\nVulnerabilities: Improper Input Validation, Improper Authentication, Improper Isolation of Shared Resources on System-on-a-Chip, Improper Privilege Management\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-132-05 Siemens Industrial PCs and CNC devices that was published May 12, 2022, on the ICS webpage on cisa.gov/ICS\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an authenticated user to enable escalation of privilege via local access.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following Industrial PCs and CNC devices:\n\nSIMATIC Drive Controller family: All versions prior to v05.00.01.00\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions prior to v0209_0105\nSIMATIC Field PG M5: All BIOS versions prior to v22.01.08\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMATIC Field PG M6: All versions prior to v26.01.08\n\n--------- End Update A Part 1 of 2 ---------\n\nSIMATIC IPC127E: All versions\nSIMATIC IPC427E (incl. SIPLUS variants): All BIOS versions prior to v21.01.15\nSIMATIC IPC477E: All BIOS versions prior to v21.01.15\nSIMATIC IPC477E Pro: All BIOS versions prior to v21.01.15\nSIMATIC IPC527G: All BIOS versions prior to v1.4.0\nSIMATIC IPC527G: All BIOS versions prior to v1.4.0\nSIMATIC IPC547G: All versions prior to R1.30.0\nSIMATIC IPC627E: All BIOS versions prior to v25.02.08\nSIMATIC IPC647E: All BIOS versions prior to v25.02.08\nSIMATIC IPC677E: All BIOS versions prior to v25.02.08\nSIMATIC IPC847E: All BIOS versions prior to v25.02.08\nSIMATIC ITP1000: All BIOS versions prior to v23.01.08\nSINUMERIK 828D HW PU.4: All versions prior to v08.00.00.00\nSINUMERIK MC MCU 1720: All versions prior to v05.00.00.00\nSINUMERIK ONE / SINUMERIK 840D sl Handheld Terminal HT 10: All versions\nSINUMERIK ONE NCU 1740: All versions prior to v04.00.00.00\nSINUMERIK ONE PPU 1740: All versions prior to v06.00.00.00\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nImproper input validation in BIOS firmware for some Intel processors may allow an authenticated user to potentially enable escalation of privilege via local access.\nCVE-2020-0590 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    IMPROPER AUTHENTICATION CWE-287\nInsufficient access control in the Linux kernel driver for some Intel processors may allow an authenticated user to potentially enable information disclosure via local access.\nCVE-2020-8694 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.2.3    IMPROPER ISOLATION OF SHARED RESOURCES ON SYSTEM-ON-A-CHIP CWE-1189\nImproper isolation of shared resources in some Intel processors may allow an authenticated user to potentially enable information disclosure via local access.\nCVE-2020-8698 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.2.4    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nInsufficient control flow management in subsystem for Intel(R) CSME versions before 11.8.80, 11.12.80, 11.22.80, 12.0.70, 13.0.40, 13.30.10, 14.0.45 and 14.5.25, Intel(R) TXE versions before 3.1.80 and 4.0.30 may allow an unauthenticated user to potentially enable escalation of privilege via physical access.\nCVE-2020-8745 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemen reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens has released updates for several affected products and is currently working on BIOS updates that include chipset microcode updates for further products.\n\nSIMATIC Drive Controller family: Update BIOS to v05.00.01.00. The update can be obtained from a Siemens account manager\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2: Update BIOS to v0209_0105 or later versions\nSIMATIC Field PG M5: Update BIOS to v22.01.08\n\n--------- Begin Update A Part 2 of 2 ---------\n\nSIMATIC Field PG M6: Update BIOS to v26.01.08 or later version\n\n--------- End Update A Part 2 of 2 ---------\n\nSIMATIC IPC127E: Update BIOS to v27.01.05\nSIMATIC IPC427E (incl. SIPLUS variants): Update BIOS to v21.01.15\nSIMATIC IPC477E: Update BIOS to v21.01.15\nSIMATIC IPC477E Pro: Update BIOS to v21.01.15\nSIMATIC IPC527G: Update BIOS to v1.4.0\nSIMATIC IPC547G: Update BIOS to R1.30.0\nSIMATIC IPC627E: Update BIOS to v25.02.08\nSIMATIC IPC647E: Update BIOS to v25.02.08\nSIMATIC IPC677E: Update BIOS to v25.02.08\nSIMATIC IPC847E: Update BIOS to v25.02.08\nSIMATIC ITP1000: Update BIOS to v23.01.08\nSINUMERIK 828D HW PU.4: Update BIOS to v08.00.00.00. SINUMERIK software can be obtained from a Siemens account manager\nSINUMERIK MC MCU 1720: Update BIOS to v05.00.00.00. SINUMERIK software can be obtained from a Siemens account manager\nSINUMERIK ONE NCU 1740: Update BIOS to v04.00.00.00. SINUMERIK software can be obtained from a Siemens account manager\nSINUMERIK ONE PPU 1740: Update BIOS to v06.00.00.00. SINUMERIK software can be obtained from a Siemens account manager\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nSiemens recommends limiting the possibilities to run untrusted code.\nSiemens recommends applying the defense-in-depth concept to reduce the probability for untrusted code to run on the system.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-678983\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-8694",
    "CVE-2020-0590",
    "CVE-2020-8745",
    "CVE-2020-8698"
  ],
  "techniques": [],
  "advisory": "icsa-22-132-05",
  "title": "Siemens Industrial PCs and CNC devices (Update A) | CISA",
  "source": "ics-advisories",
  "id": "eabd19d24a033d37fdf7b0c219747e88f65278935d59d4fb7c6afb42558d4df4"
}