{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: RSLinx Classic\nVulnerability: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to execute arbitrary code on the target device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of RSLinx Classic, PLC communications software, are affected:\n\nRSLinx Classic Versions 4.10.00 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nAn input validation issue in a .dll file of RSLinx Classic where the data in a Forward Open service request is passed to a fixed size buffer, allowing an attacker to exploit a stack-based buffer overflow condition.\nCVE-2019-6553 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation (working with Tenable) reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation has released patches to address earlier versions of RSLinx Classic including v3.60, v3.70, v3.80, v3.81, v3.90, v4.00.01, v4.10. These patches can be found at Knowledgebase Article ID: 1084828\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1084828\nRockwell Automation has also stated that users may disable Port 44818 in RSLinx Classic if it is not utilized during system operation. To disable Port 44818, go to Options in RSLinx Classic. Then in the General tab of the Options pop-up, uncheck the option “Accept UDP Messages on Ethernet Port”.\nPort 44818 is needed only when a user wants to utilize unsolicited messages. To check if you are using unsolicited messages, go to the “DDE/OPC” dropdown in RSLinx Classic. Select Topic Configuration and then go to the Data Collection tab in the Topic Configuration pop-up. If the “Unsolicited Messages” checkbox is marked, then Port 44818 is being used in the application.\nNOTE: In RSLinx Classic 4.10 or later, “Accept UDP Messages on Ethernet Port” checkbox is unchecked by default.\nFor more information please see the Rockwell Automation security advisory found at:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1085038\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-6553"
  ],
  "techniques": [],
  "advisory": "icsa-19-064-01",
  "title": "Rockwell Automation RSLinx Classic | CISA",
  "source": "ics-advisories",
  "id": "1533f1689a6715776d62d34ac4939a777ca7d50ff87e1de8ad20f450ff93b3dc"
}