{
  "markdown": "\nOverview\nIndependent security researchers Billy Rios and Terry McCorkle have identified cross-site scripting (XSS) and write access violation vulnerabilities in the Invensys Wonderware HMI reports product.ICS-CERT has coordinated these two vulnerabilities with Invensys, which has produced a new product version that resolves these reported vulnerabilities. The researchers have confirmed that the new version resolves these vulnerabilities.\nAffected Products\nAccording to Invensys, the following versions are affected:• Wonderware HMI Reports 3.42.835.0304 and prior.\nImpact\nSuccessful attacks could result in data leakage, denial of service, or remote code execution.Impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their environment, architecture, and product implementation.\nBackground\nWonderware is a brand offering of the Operations Management Division of Invensys. Invensys Operations Management is a provider of automation and information technologies and systems.\nAccording to Invensys, Wonderware HMI Reports is deployed across several industries including manufacturing, building automation, oil and gas, water and wastewater, healthcare, and electric utilities. Invensys states that these products are used worldwide.\nMitigation\nInvensys recommends users install the Security Update using specific instructions provided in each ReadMe file for each product and component being installed. In general, users should download the update, the associated upgrade instructions, and the license file update. After installation, users must migrate the report definitions into the new Quick Reports 2012 format, as explained in the upgrade instructions. Users must also request a permanent license file from the distributor.\nCustomers can access the update at the following website: https://wdn.wonderware.com/sites/WDN/Pages/Downloads/Software.aspx\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.In addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-12-039-01",
  "title": "Invensys Wonderware HMI Reports XSS and Write Access Violation Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "35ce45d76c4975be9d27cb3b304b303b8f988f58c4299dc9122fa8be7be97974"
}