{
  "markdown": "\nOVERVIEW\nThis advisory was originally posted to the US-CERT secure Portal library on September 22, 2015, and is being released to the NCCIC/ICS-CERT web site.\nMattijs van Ommeren of Applied Risk has identified several vulnerabilities in the Janitza UMG power quality measuring products. Janitza has produced new firmware and new documentation to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nJanitza reports that the vulnerabilities affect the following products:\n\nUMG 508,\nUMG 509,\nUMG 511,\nUMG 604, and\nUMG 605.\n\nIMPACT\nAn unauthenticated attacker can take full control of the device by leveraging the built-in script language. An attacker can adjust system parameters; manipulate measurement values and change the function of the device; and compromise availability, integrity, and confidentiality of the device and dependent systems.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nJanitza is a company based in Germany that sells its products through worldwide partners.\nThe UMG line of devices is energy and power quality measurement products. According to Janitza, UMG products are deployed in the Energy sector. Janitza estimates that these products are used primarily in Europe, the Americas, and Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nWEAK PASSWORD PROTECTIONCWE-521: Weak Password Requirements, http://cwe.mitre.org/data/definitions/521.html, web site last accessed September 22, 2015.\n\nBy default the UMG device’s web interface is unprotected. A password can be configured but is limited to a short PIN. No controls are in place to prevent PIN guessing, like locking after several invalid attempts.\nCVE-2015-3972NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3972, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed September 22, 2015.\n\nWEAK SESSION TOKEN GENERATIONCWE-330: Use of Insufficiently Random Values, http://cwe.mitre.org/data/definitions/330.html, web site last accessed September 22, 2015.\n\nSession tokens are derived from the 4-digit user PIN in combination with a server-generated challenge. An attacker may be able to crack the user PIN using a sample of session tokens.\nCVE-2015-3973NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3973, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N, web site last accessed September 22, 2015.\n\nHARD-CODED PASSWORDCWE-259: Use of Hard-coded Password, http://cwe.mitre.org/data/definitions/259.html, web site last accessed September 22, 2015.\n\nThe device exposes an FTP interface that is protected by an undocumented default password. Once logged in, an attacker is able to upload and download arbitrary files.\nCVE-2015-3968NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3968, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed September 22, 2015.\n\nPRIVILEGE ESCALATIONCWE-215: Information Exposure Through Debug Information, http://cwe.mitre.org/data/definitions/215.html, web site last accessed September 22, 2015.\n\nThere is a remote debug interface on TCP Port 1239. This allows an unauthenticated remote attacker to read and write files and execute JASIC program code.\nCVE-2015-3971NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3971, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N, web site last accessed September 22, 2015.\n\nPERSISTENT CROSS SITE SCRIPTINGCWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting'), http://cwe.mitre.org/data/definitions/79.html, web site last accessed September 22, 2015.\n\nThe device does not properly filter user input. Several unauthenticated parts of the web interface are vulnerable to reflected cross-site-scripting (XSS). Some parameters are vulnerable to stored XSS after login.\nCVE-2015-3970NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3970, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed September 22, 2015.\n\nCROSS-SITE REQUEST FORGERY CWE-352: Cross-Site Request Forgery (CSRF), http://cwe.mitre.org/data/definitions/352.html, web site last accessed September 22, 2015.\n\nThe device’s web interface does not provide protection against web requests originating from other sources than the current user’s authenticated browser session. Therefore, it is possible for an attacker to execute actions on behalf of an authenticated user while connected to an attacker controlled web site during an active session.\nCVE-2015-3967NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3967, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed September 22, 2015.\n\nINFORMATION DISCLOSURECWE-200: Information Exposure, http://cwe.mitre.org/data/definitions/200.html, web site last accessed September 22, 2015.\n\nA service running on Port 1234/UDP and Port 1235/UDP exposes netstat-like information, leaking current network connection information.\nCVE-2015-3969NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-3969, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.3 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N, web site last accessed September 22, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nExploits that target these vulnerabilities are publicly available.\nDIFFICULTY\nAn attacker with low to moderate skills would be able to exploit these vulnerabilities.\nMITIGATION\nJanitza has created new firmware to address these vulnerabilities. Users can download the new firmware at the following location:\nhttp://www.janitza.com/experimental-downloads.html\nUsers may also download a manual telling how to secure a TCP/IP connection for UMG 604, UMG 605, UMG 508, UMG 509, UMG 511 and UMG 512 at the following location:\nhttp://www.janitza.com/download-manuals-current-devices.html\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nBlock outside access to Ports 1239/TCP, 1234/UDP, and 1235/UDP at the firewall. Use an intrusion detection system (IDS) or an intrusion prevention system (IPS) to monitor access to those ports.\nShield the device from any publicly accessible networks by implementing proper network segregation and by filtering the exposed network services using a network firewall.\nManage devices from a well secured management PC only, and users should not visit untrusted web sites.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2015-3968",
    "CVE-2015-3970",
    "CVE-2015-3969",
    "CVE-2015-3967",
    "CVE-2015-3973",
    "CVE-2015-3972",
    "CVE-2015-3971"
  ],
  "techniques": [],
  "advisory": "icsa-15-265-03",
  "title": "Janitza UMG Power Quality Measuring Products Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "8d062d2a1741ad41960d8cdc47d545068444fcaecbc8931bf56fa21e8e0eec23"
}