{
  "markdown": " Tibbo AggreGate Platform Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryTibbo AggreGate Platform Vulnerabilities======================================== Last Revised August 27, 2018 Alert Code ICSA\\-15\\-323\\-01OVERVIEW-------- NCCIC/ICS\\-CERT received a report from HP’s Zero Day Initiative (ZDI) concerning two vulnerabilities in Tibbo’s AggreGate SCADA/HMI package, which is part of the AggreGate Platform. These vulnerabilities were reported to ZDI by security researcher Andrea Micalizzi (rgod). Tibbo has produced a new version to mitigate these vulnerabilities. One of the vulnerabilities could be exploited remotely.AFFECTED PRODUCTS----------------- The following AggreGate Platform versions are affected:* AggreGate Platform Version 5\\.21\\.02 and prior versions.IMPACT------ Successful exploitation of the identified vulnerabilities may allow an attacker to execute arbitrary code and commands. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.BACKGROUND---------- Tibbo is a Taiwan\\-based company. Tibbo’s partner network includes distributors, manufacturers, and integrators from more than 50 countries. The affected product, AggreGate Platform, is an Internet of Things integration platform that employs network technologies to control, configure, monitor and service different electronic devices. According to Tibbo, the AggreGate Platform is deployed across several sectors including Commercial Facilities, Communications, Critical Manufacturing, Energy, Healthcare and Public Health, Transportation Systems, Water and Wastewater Systems, and others. Tibbo estimates that these products are used worldwide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPECWE\\-434: Unrestricted Upload of File with Dangerous Type, http://cwe.mitre.org/data/definitions/434\\.html, web site last accessed November 19, 2015\\. Through a servlet, it is possible to upload arbitrary Java code that allows application properties to be imported through uploaded files that could allow arbitrary code and command execution. CVE\\-2015\\-7912NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-7912, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9\\.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3\\.0\\#CVSS:3\\.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed November 19, 2015\\.### UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPECWE\\-434: Unrestricted Upload of File with Dangerous Type, http://cwe.mitre.org/data/definitions/434\\.html, web site last accessed November 19, 2015\\. Administrative service can be contacted by local users to publish arbitrary classes. By writing a Java file inside the application main root, it is possible to run arbitrary code and commands. CVE\\-2015\\-7913NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-7913, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8\\.4 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3\\.0\\#CVSS:3\\.0/AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed November 19, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY One of the vulnerabilities could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target these vulnerabilities.#### DIFFICULTY An attacker with a low skill would be able to exploit these vulnerabilities.MITIGATION---------- Tibbo has released a new version of the AggreGate Platform, Version 5\\.30\\.06, to mitigate the identified vulnerabilities. Tibbo’s new version is available at the following URL:<http://aggregate.tibbo.com/downloads.html> . ICS\\-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Tibbo-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-323-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2015-7912",
    "CVE-2015-7913"
  ],
  "techniques": [],
  "advisory": "icsa-15-323-01",
  "title": "Tibbo AggreGate Platform Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "90f0007eca922fa148b9aea274e19a3bd54d8c71c527284d724325bc1b1173ad"
}