{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC, TIM\nVulnerability: Incorrect Authorization\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability allows an unauthenticated attacker to read PLC variables from affected devices without proper authentication under certain circumstances.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:    \n\nSIMATIC Drive Controller family: All versions prior to v2.9.2\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions prior to v21.9\nSIMATIC S7 PLCSIM Advanced: All versions higher than v2 and prior to v4\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): Version 4.4\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions higher than v2.5 and prior to v2.9.2\nSIMATIC S7-1500 Software Controller: All versions higher than v2.5\nTIM 1531 IRC (incl. SIPLUS NET variants): Version 2.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT AUTHORIZATION CWE-863\nThe affected products are vulnerable to an incorrect authorization check, allowing an attacker to extract information about access protected PLC program variables when simultaneously reading multiple attributes.\nCVE-2020-28397 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends users update to the latest software version:\n\nSIMATIC Drive Controller family: Update to v2.9.2 or later\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): Update to v21.9 or later\nSIMATIC S7 PLCSIM Advanced: Update to v4 or later\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): Update to v4.4.1 or later\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): Update to v2.9.2 or later\n•    SIMATIC S7-1500 Software Controller: Update to v21.9 or later version \nTIM 1531 IRC (incl. SIPLUS NET variants): Update to v2.2 or later\n\nSiemens has not identified any additional specific mitigations or workarounds for this vulnerability. Please follow the general security recommendations below.\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens operational guidelines for industrial security and follow the recommendations in the product manual.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-865327\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-28397"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-23",
  "title": "Siemens SIMATIC and TIM | CISA",
  "source": "ics-advisories",
  "id": "c831a9a262b05de2f60fff2653700988c17087cae44a5367f8a20516e0ff779b"
}