{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Schneider Electric\nEquipment: Conext ComBox\nVulnerability: Resource Exhaustion\nAFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following Conext ComBox solar battery monitor:\n\nConext ComBox, model 865-1058: all firmware versions prior to V3.03 BN 830\n\nIMPACT\nSuccessful exploitation of this vulnerability could cause the device to self-reboot, constituting a denial of service.\nMITIGATION\nSchneider Electric has released a new version of firmware (V3.03 BN 830) to address this vulnerability. It is available to be downloaded from the following location:\nhttp://solar.schneider-electric.com/product/conext-combox/\nUsers can learn more about this vulnerability and the associated firmware fix by reading Schneider Electric’s security notification SEVD-2017-052-01 on their web site at the following location:\nhttp://www.schneider-electric.com/ww/en/download/document/SEVD-2017-052-01\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is remotely exploitable. Low skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nRESOURCE EXHAUSTION CWE-400\n\nA series of rapid requests to the device may cause it to reboot.\nCVE-2017-6019 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nArik Kublanov and Mark Liapustin of Nation-E Ltd reported this vulnerability.\nBACKGROUND\nCritical Infrastructure Sector: Energy\nAreas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n \n",
  "cves": [
    "CVE-2017-6019"
  ],
  "techniques": [],
  "advisory": "icsa-17-061-02",
  "title": "Schneider Electric Conext ComBox | CISA",
  "source": "ics-advisories",
  "id": "8b5dab553803478b86c035c8a8f4dfe5cdbc659d38f6d0fb6dc4a95ba6243720"
}