{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: TEL-STER Sp. z o. o.\nEquipment: TelWin SCADA WebInterface\nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker to read files on the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nTEL-STER reports this vulnerability affects the following versions of TelWin SCADA WebInterface:\n\nTelWin SCADA WebInterface: versions 3.2 to 6.1\nTelWin SCADA WebInterface: versions 7.0 to 7.1\nTelWin SCADA WebInterface: versions 8.0 and 9.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 PATH TRAVERSAL CWE-35\nExternal input could be used on TEL-STER TelWin SCADA WebInterface to construct paths to files and directories without properly neutralizing special elements within the pathname, which could allow an unauthenticated attacker to read files on the system.\nCVE-2023-0956 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple sectors\nCOUNTRIES/AREAS DEPLOYED: Poland\nCOMPANY HEADQUARTERS LOCATION: Poland\n\n3.4 RESEARCHER\nMarcin Dudek of CERT.PL reported this vulnerability to TEL-STER.\n4. MITIGATIONS\nTEL-STER recommends that users update WebInterface module to one of the following versions: 6.2, 7.2, 8.1, 9.1, or 10.0. Please note that the WebInterface is part of the TelWin SCADA software and is usually updated with the software. TEL-STER only currently supports and updates TelWin SCADA 7.8 (WebInteraface 6.x) upwards TEL-STER does not have any updates planned for versions using older vulnerable WebInterface (lower than 6.0), and users are recommended to update TelWin SCADA to one of the supported versions. For more information, please contact TEL-STER.\nMore information about this issue and the associated mitigation can be found at TEL-STER advisory or CERT.PL advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has low attack complexity.\n",
  "cves": [
    "CVE-2023-0956"
  ],
  "techniques": [],
  "advisory": "icsa-23-215-03",
  "title": "TEL-STER TelWin SCADA WebInterface | CISA",
  "source": "ics-advisories",
  "id": "3b7c39444023d439ab229f3b78096e86848c55aca9702b3a80991282aad1362e"
}