{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.7\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: UMC Stack\nVulnerabilities: Unquoted Search Path or Element, Uncontrolled Resource Consumption, Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-196-05 Siemens UMC Stack (Update G) that was published April 13, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to cause a partial denial-of-service condition on the UMC component of the affected devices under certain circumstances. This could also allow an attacker to locally escalate privileges from a user with administrative privileges to execute code with SYSTEM level privileges.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that some of the vulnerabilities affect the following UMC components. For a complete list of which specific vulnerabilities affect each of these products, please see Siemens security advisory SSA-841348:\n\nOpcenter Execution Discrete: All versions prior to v3.2\nOpcenter Execution Foundation: All versions prior to v3.2\nOpcenter Execution Process: All versions prior to v3.2\nOpcenter Intelligence: All versions prior to v3.3\nOpcenter RD&L: v8.0\n\n--------- Begin Update H Part 1 of 2 ---------\n\nSIMATIC IT LMS: All versions prior to v2.6. Only affected by CVE-2020-7587, CVE-2020-7588\n\n--------- End Update H Part 1 of 2 ---------\n\nSIMATIC IT Production Suite: All versions prior to v8.0. Only affected by CVE-2020-7587 and CVE-2020-7588\nSIMATIC Notifier Server for Windows: All versions\nSIMATIC PCS neo: All versions prior to v3.0 SP1\nSIMATIC STEP 7 (TIA Portal) v15: All versions prior to v15.1 update 5\nSIMATIC STEP 7 (TIA Portal) v16: All versions prior to v16 Update 2\nSIMOCODE ES v16: All versions prior to v16 Update 1\nSIMOCODE ES v15.1: Update to v15 update 4 or later\nSoft Starter ES v15.1: Update to v15 update 3 or later\nSoft Starter ES v16: All versions prior to v16 Update 1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nA component within the affected application calls a helper binary with SYSTEM privileges during startup while the call path is not quoted.\nCVE-2020-7581 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nSending multiple specially crafted packets to the affected service could cause a partial remote denial-of-service condition, which would cause the service to restart itself. \nCVE-2020-7587 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:L).\n4.2.3    IMPROPER INPUT VALIDATION CWE-20\nSending a specially crafted packet to the affected service could cause a partial remote denial-of-service condition, which would cause the service to restart itself. \nCVE-2020-7588 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nVictor Fidalgo of INCIBE and Reid Wightman of Dragos reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens recommends users upgrade affected products if upgrade are available for those products:\n\nOpcenter Execution Discrete, Foundation, and Process: Update to v3.2 or later\nOpcenter Quality: Update to v11.3 or later\nOpcenter RD&L: Update to v8.1 or later\nSIMATIC PCS neo: Update to v3.0 SP1. To obtain this update contact local support.\nSIMATIC STEP 7 (TIA Portal) v15: Update to v15.1 update 5 or later\nSIMATIC STEP 7 (TIA Portal) v16: Update to v16 Update 2 or later\nSIMOCODE ES v16: Update to v16 update 1 or later\nSIMOCODE ES v15.1 and prior: Update to v15 update 1 or later\nSoft Starter ES v15.1 and prior: Update to v15 update 1 or later\nSoft Starter ES v16: Update to v16 Update 1 or later\nSIMATIC IT Production Suite: Update to v8.0 or later\nOpcenter Intelligence: Update to v3.3 or later\n\n--------- Begin Update H Part 2 of 2 ---------\n\nSIMATIC IT LMS: Update to v2.6 or later\n\n--------- End Update H Part 2 of 2 ---------\nFor products that do not have an update, Siemens has identified the following specific workarounds and mitigations customers can apply to reduce the risk:\n\nRun the software on systems within trusted networks\nFor CVE-2020-7581, ensure there is no executable at the following locations:\n\nC:\\Program.exe\nC:\\Program Files\\Common.exe\nC:\\Program Files\\Common Files\\Siemens\\Automation\\Simatic.exe\n\n\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security and following the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on these vulnerabilities and associated software updates, please see Siemens security advisory SSA-841348\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-7581",
    "CVE-2020-7587",
    "CVE-2020-7588"
  ],
  "techniques": [],
  "advisory": "icsa-20-196-05",
  "title": "Siemens UMC Stack (Update H) | CISA",
  "source": "ics-advisories",
  "id": "d7b6dea7f960fe052432fc3454a68a5748bc003a5fc7a4d19db39550af7bd55f"
}