{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Bently Nevada\nEquipment: 3701/4X series and 60M100 (3701/60) Condition Monitoring System\nVulnerabilities: Use of Hard-coded Credentials, Missing Authentication for Critical Function\n\nCISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow file manipulation, remote code execution, or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Bently Nevada 3700 machinery monitors are affected:\n\nBently Nevada 3701/40: All versions prior to 4.1\nBently Nevada 3701/44: All versions prior to 4.1\nBently Nevada 3701/46: All versions prior to 4.1\nBently Nevada 60M100 (3701/60): All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product has credentials for the maintenance interface hardcoded in the firmware. The maintenance interface allows for debug and process execution capabilities, which could allow remote code execution or cause a denial-of-service condition.\nCVE-2022-29953 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.2.2    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product uses protocols to provide configuration management and historical data related functionality without any authentication features, which may allow an attacker to read or write files on the controllers or cause a denial-of-service condition.\nCVE-2022-29952 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forescout Technologies reported these vulnerabilities to CISA.\n4. MITIGATIONS\nBently Nevada recommend users upgrade 3701/4x series to Version 4.1.1712.0601 or higher, which has the diagnostics port disabled and the hardcoded credentials removed from the firmware image.\nBently Nevada 60M100 Ethernet Port B, which is for diagnostics where Port 4001/TCP is enabled, should not be connected during normal operation. The 3701/60 is approaching end-of-life status and users are encouraged to upgrade to 60M100.\nFor support information, users should contact the Bently Nevada technical support team by email, phone (+1 775-215-1818), or website at Bently Nevada Support (login required).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities\n",
  "cves": [
    "CVE-2022-29953",
    "CVE-2022-29952"
  ],
  "techniques": [],
  "advisory": "icsa-22-188-02",
  "title": "Bently Nevada ADAPT 3701/4X Series and 60M100 | CISA",
  "source": "ics-advisories",
  "id": "b4bbe7090020fb1ff3306929193304e7c9d7a6251b357c775f95ae9776ed4516"
}