{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Public exploit available/exploitable remotely/low attack complexity \nVendor: Delta Electronics \nEquipment: DVW-W02W2-E2 \nVulnerabilities: OS Command Injection \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a threat actor with low privileges to gain root access to the device, which could then allow them to send malicious commands to managed devices. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DVW-W02W2-E2, an industrial ethernet router, are affected: \n\nDVW-W02W2-E2: Version 2.42 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 \nThe web server of the affected device is vulnerable to authenticated command injection via POST parameters. A threat actor could gain full access to the underlying operating system (OS) of the device. If the device is acting as a key device in an industrial network, or controls various critical equipment via serial ports, the threat actor could cause extensive damage in the corresponding network. \nCVE-2022-42139 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Taiwan \n\n3.4 RESEARCHER\nCISA discovered a public Proof of Concept (PoC) as authored by T. Weber of CyberDanube Security Research, who reported it to Delta Electronics. \n4. MITIGATIONS\nDelta Electronics patched this vulnerability in Version 2.5.2 and recommends all users update affected device firmware to that version or later. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-42139"
  ],
  "techniques": [],
  "advisory": "icsa-23-033-04",
  "title": "Delta Electronics DVW-W02W2-E2 | CISA",
  "source": "ics-advisories",
  "id": "923346b5e37cce74077bbd45c4742fbbe3b8e590a6920857ed99d80f6485256c"
}