{
  "markdown": "\nOverview\nICS-CERT originally released Advisory ICSA-11-307-01P on the US-CERT secure Portal on November 03, 2011. This web page release was delayed to allow users time to download and install the update.\nResearcher Kuang-Chun Hung of Security Research and Service Institute--Information and Communication Security Technology Center (ICST) has identified four vulnerabilities in the Schneider Electric Vijeo Historian product line. These vulnerabilities include a denial of service (DoS), buffer overflow, a cross-site scripting (XSS), and a directory traversal.\nICS-CERT has coordinated this report with Schneider Electric and ICST. Schneider has produced a fix that resolves these vulnerabilities. ICST has tested this fix and validated that it fully resolves these vulnerabilities.\nAffected Products\nAccording to Schneider Electric the following products are affected:\n\nVijeo Historian V4.30 and earlier\nCitectHistorian V4.30 and earlier\nCitectSCADA Reports V4.10 and earlier.\n\nImpact\nSuccessful exploitation of these vulnerabilities could result in DoS, data leakage, or remote code execution.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nSchneider Electric is a manufacturer and integrator of energy management equipment and software. According to Schneider Electric, its products are used worldwide. The Vijeo Historian, CitectHistorian, and CitectSCADA report products are data historian products. According to Schneider Electric, these products are used in energy, industry, and building automation.\nVulnerability Characterization\nVulnerability Overview\nDenial of Service\nA buffer overflow vulnerability exists in the third-party TeeChart ActiveX control that could allow a remote attacker using social engineering to cause a DoS.\nCVE-2011-4033 has been assigned to this vulnerability in the National Vulnerability Database (NVD).\nBuffer Overflow\nA buffer overflow vulnerability exists in the third-party TeeChart ActiveX control that could allow a remote attacker using social engineering to cause a denial of service and/or execute arbitrary code.\nCVE-2011-4034 has been assigned to this vulnerability in the NVD.\nCross-Site Scripting\nA XSS vulnerability exists that could allow remote attackers using social engineering to inject arbitrary web script or HTML via an HTTP request.\nCVE-2011-4035 has been assigned to this vulnerability in the NVD.\nDirectory Traversal\nA directory traversal vulnerability exists in the web portal allowing remote attackers to read arbitrary filesin an HTTP request.\nCVE-2011-4036 has been assigned to this vulnerability in the NVD.\nVulnerability Details\nExploitability\nThree of these four vulnerabilities are remotely exploitable if used with social engineering. The directory traversal vulnerability can be exploited without social engineering.\nExistence of Exploit\nNo publicly available exploits specifically targeting these vulnerabilities are known to exist.\nDifficulty\nAn attacker with a low to moderate skill level could potentially exploit these vulnerabilities.\nMitigation\nSchneider Electric has created a patch and has issued a customer notification describing the vulnerabilities.http://www.scada.schneider-electric.com/sites/scada/en/login/historian-vulnerability.page, website last accessed November 28, 2011. Schneider Electric recommends that all customers using the above mentioned software packages download and apply the patch located at http://www.citect.com/index.php?option=com_content&view=article&id=1656&Itemid=1695.\nIn addition to applying the patch developed by Schneider Electric, ICS-CERT encourages asset owners to take additional defensive measures against this and other cybersecurity threats by:\n\nMinimizing network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocating control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, using secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nThe Control Systems Security Program (CSSP) also provides a recommended practices section for control systems on the CSSP web page. Several recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2011-4035",
    "CVE-2011-4036",
    "CVE-2011-4034",
    "CVE-2011-4033"
  ],
  "techniques": [],
  "advisory": "icsa-11-307-01",
  "title": "Schneider Electric Vijeo Historian Web Server Multiple Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "eeb0da3b0b4c891ca0914cf81a814108de3874c96ee733c30b09be3d718e10c4"
}