{
  "markdown": "\nOVERVIEW\nResearcher Wei Gao, formerly of IXIA, has identified a buffer overflow vulnerability in the Schneider Electric OPC Factory Server (OFS) application. Schneider Electric has produced a patch that mitigates this vulnerability. Wei Gao has tested the patch to validate that it resolves the vulnerability.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following versions of OFS:\n\nTLXCDSUOFS33 – V3.5 and previous,\nTLXCDSTOFS33 – V3.5 and previous,\nTLXCDLUOFS33 – V3.5 and previous,\nTLXCDLTOFS33 – V3.5 and previous, and\nTLXCDLFOFS33 – V3.5 and previous.\n\nIMPACT\nA successful exploitation will cause the server to reboot resulting in a denial of service.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSchneider Electric corporate headquarters is located in Paris, France, and maintains offices in more than 100 countries worldwide.\nThese products are industrial active energy management control products, deployed across several sectors including the Energy, Water and Wastewater Systems, Commercial Facilities, Government Facilities, Food and Agriculture, and Transportation Systems. Schneider Electric estimates that these products are used primarily in the United States and North America.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nBUFFER OVERFLOWCWE-122: Heap-based Buffer Overflow, http://cwe.mitre.org/data/definitions/122.html, web site last accessed April 03, 2014.\n\nIncorrect parsing in the OPC Automation 2.0 Server Object (ActiveX) can result in a buffer overflow error. The vulnerability is caused by parsing long arguments in functions.\nCVE-2014-0789NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-0789, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:N/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:N/C:N/I:N/A:P, web site last accessed April 03, 2014.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nExploits that target this vulnerability are publicly available.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit this vulnerability.\nMITIGATION\nSchneider Electric has developed a patch to resolve this issue. In order to patch the installation in the field, install OFS V3.5SP1, available on Schneider Electric’s web site at the following URL:\nhttp://www.schneider-electric.com/download/WW/EN/results/0/0/8336568-OPC-Factory-Server/0/?showAsIframe=true\nOFS V3.5SP1 includes a patched version of the OLE2T macro from Microsoft to resolve the issue.\nFor more information regarding this issue, please see the security announcements affecting the OPC Factory Server on Schneider Electric’s web site at the following URL:\nhttp://www2.schneider-electric.com/sites/corporate/en/support/cybersecurity/cybersecurity.page\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2014-0789"
  ],
  "techniques": [],
  "advisory": "icsa-14-093-01",
  "title": "Schneider Electric OPC Factory Server Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "003576b45f554edc51fdd8a0d53779785fd439fb568078a44732b493825a25fb"
}