{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Low skill level to exploit\nVendor: Rockwell Automation\nEquipment: RSLinx Classic and FactoryTalk Linx Gateway\nVulnerability: Unquoted Search Path or Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authorized, but non-privileged local user to execute arbitrary code and allow a threat actor to escalate user privileges on the affected workstation.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of RSLinx Classic, a software platform that allows Logix5000 Programmable Automation Controllers to connect to a wide variety of Rockwell Software applications, and FactoryTalk Linx Gateway, software that provides an Open Platform Communications (OPC) Unified Architecture (UA) server interface to allow the delivery of information from Rockwell Software applications to Allen-Bradley controllers, are affected:\n\nRSLinx Classic Versions 3.90.01 and prior, and\nFactoryTalk Linx Gateway Versions 3.90.00 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nAn unquoted search path or element may allow an authorized, but non-privileged local user to execute arbitrary code and allow a threat actor to escalate user privileges on the affected workstation. \nCVE-2018-10619 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Wisconsin, USA\n\n3.4 RESEARCHER\nGjoko Krstic of Zero Science Lab reported this vulnerability to Rockwell Automation, and Rockwell Automation reported it to the NCCIC.\n4. MITIGATIONS\nRockwell Automation recommends all users update to the following RSLinx Classic and FactoryTalk Linx Gateway versions:\n\nRSLinx Classic Versions 3.90.01 and prior, update to v4.00.01 or later available at:\n\nhttps://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?crumb=112\n\nFactoryTalk Linx Gateway Versions 3.90.00 and prior, update to FactoryTalk Linx Gateway v6.00.00 or later available at:\n\nhttps://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?crumb=112\nRockwell also recommends the following mitigating procedures to those who are unable to upgrade to the latest version:\n\nVisit Knowledge Base Article ID 939382, which describes how to identify whether or not the service path contains spaces (i.e., is vulnerable); how to manually address this vulnerability through a registry edit; and describes the process of implementing these edits.\n\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/939382 (login required).\n\nRun all software as a user, not as an administrator, to minimize the impact of malicious code on the infected system.\nUse Microsoft AppLocker or other similar whitelisting application to help mitigate risk. Information on using AppLocker with Rockwell Automation products is available at:\n\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/546989 (login required).\n\nEnsure the least-privilege user principle is followed, and user/service account access to shared resources (such as a database) is only granted with a minimum amount of rights as needed.\n\nFor more information, please see Rockwell Automation’s knowledgebase advisory number 1073800 on this issue at the following location:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1073800 (login required)\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-10619"
  ],
  "techniques": [],
  "advisory": "icsa-18-158-01",
  "title": "Rockwell Automation RSLinx Classic and FactoryTalk Linx Gateway | CISA",
  "source": "ics-advisories",
  "id": "150a77db073bc7cc2cc46b962a4870def9281781ec8d0973a6fbeee474bfe0ea"
}