{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: RUGGEDCOM ROS\nVulnerabilities: Improper Restriction of Operations within the Bounds of a Memory Buffer, Resource Management Errors\n\n2    UPDATE\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-344-03 Siemens RUGGEDCOM ROS that was published December 10, 2019, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a denial-of-service condition or arbitrary code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 2 ---------\nThe following versions of RUGGEDCOM ROS, an ethernet switch, are affected:\n\nRUGGEDCOM ROS RMC8388: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RSG900C: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RSG900R: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RSG907R: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RSG908C: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RSG909R: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RSG910C: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RSG920P: Versions 2016.05RS09 and later (only affected by CVE-2019-13103)\nRUGGEDCOM ROS RSG920P: All versions with U-Boot prior to V2016.05RS09\nRUGGEDCOM ROS RSG2488: Versions 2016.05RS09 and later (only affected by CVE-2019-13103)\nRUGGEDCOM ROS RSG2488: All versions with U-Boot prior to V2016.05RS09\nRUGGEDCOM ROS RSL910: All versions with U-Boot prior to V2016.05RS09 (only affected by CVE-2018-18440)\nRUGGEDCOM ROS RST2228: Versions 2016.05RS09 and later (only affected by CVE-2019-13103)\nRUGGEDCOM ROS RST2228: All versions with U-Boot prior to V2016.05RS09\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1 IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe embedded boot loader has a locally exploitable buffer overflow via a crafted kernel image because the filesystem loading is mishandled.\nCVE-2018-18440 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.2 RESOURCE MANAGEMENT ERRORS CWE-399\nThe embedded boot loader has a physically exploitable vulnerability. A crafted self-referential DOS partition table will cause the bootloader to infinitely recurse, causing the stack to grow infinitely and eventually crash.\nCVE-2019-13103 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Healthcare and Public Health, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nCVE-2018-18440: Disable boot interface access during boot up via the ‘bootoption.txt’ file parameter ‘Security = yes’.\nCVE-2019-13103: Disable access to the removable media via ‘bootoption.txt’ file parameter ‘Disableautoaccessremovable = yes’. Note that this vulnerability only applies to RUGGEDCOM ROS, if the device boots from removable media.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity\n--------- Begin Update A Part 2 of 2 ---------\nFor more information see Siemens Security Advisory SSA-618620 in HTML or CSAF.\n--------- Begin Update A Part 2 of 2 ---------\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens security advisory SSA-618620 at the following location:\nhttp://www.siemens.com/cert/advisories\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nRestrict access to devices following a least privilege principle.\nImplement physical security controls to mitigate unauthorized physical access. \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-18440",
    "CVE-2019-13103"
  ],
  "techniques": [],
  "advisory": "icsa-19-344-03",
  "title": "Siemens RUGGEDCOM ROS (Update A) | CISA",
  "source": "ics-advisories",
  "id": "20ed8f9a261e70a9b1a727865196a1133b5327ab601876bc9000e5f316fdfc3c"
}