{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/high attack complexity \nVendor: Siemens  \nEquipment: Polarion ALM \nVulnerability: Improper Restriction of XML External Entity Reference \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to potentially disclose confidential data. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens Polarion ALM products are affected: \n\nPolarion ALM: all versions prior to V2304.0 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611 \nThe application contains an XML external entity injection (XXE) vulnerability. This could allow an attacker to view files on the application server filesystem. \nCVE-2023-28828 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nCale Anderson reported this vulnerability to Siemens. \n4. MITIGATIONS\nSiemens has released an update for Polarion ALM and recommends updating to the latest version (V2304.0), as well as updating specific configurations to mitigate against the vulnerability. The configuration changes to mitigate this vulnerability will be default in Polarion V2304 and later versions. \nSiemens recommends setting configurations as listed in SSA-632164 to mitigate against external entity injection in OpenSAML 4.x parser. This will be included by default in  Polarion V2304 and later versions. \nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals. Additional information on industrial security by Siemens can be found at the Siemens Industrial Security web page. \nFor further inquiries on security vulnerabilities in Siemens products and solutions, users should contact the Siemens ProductCERT. \nFor more information, see the associated Siemens security advisory SSA-632164 in HTML and CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has a high attack complexity. \n",
  "cves": [
    "CVE-2023-28828"
  ],
  "techniques": [],
  "advisory": "icsa-23-103-12",
  "title": "Siemens Polarion ALM | CISA",
  "source": "ics-advisories",
  "id": "018707ce09f9e4d2cd57e63819b3531e5bc622f96437f9a469d5ea9cebba7968"
}