{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Martem\nEquipment: TELEM-GW6/GWM\n\n--------- Begin Update B Part 1 of 5 --------\n\nVulnerabilities: Missing Authentication for Critical Function, Incorrect Default Permissions, Resource Exhaustion, Cross-Site Scripting\n\n--------- End Update B Part 1 of 5 --------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-142-01 Martem TELEM-GW6/GWM that was published May 22, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\n--------- Begin Update B Part 2 of 5 --------\nSuccessful exploitation of these vulnerabilities could allow execution of unauthorized industrial process control commands, full control over RTU, denial of service, or client-side code execution.\n--------- End Update B Part 2 of 5 --------\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update B Part 3 of 5 --------\nThe following TELEM products with insecure configurations are affected:\n\nGW6 versions prior to 2.0.87-4018403-k4, and\nGWM versions prior to 2.0.87-4018403-k4.\n\nNot all versions are affected by all vulnerabilities.\n--------- End Update B Part 3 of 5 --------\n4.2 VULNERABILITY OVERVIEW\n4.2.1 MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe RTU does not perform authentication of IEC-104 control commands, which may allow a rogue node a remote control of the industrial process.\nCVE-2018-10603 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:L).\n--------- Begin Update B Part 4 of 5 --------\n4.2.2    INCORRECT DEFAULT PERMISSIONS CWE-276\nUsing default credentials to connect to the RTU, unprivileged user may modify/upload a new system configuration or take the full control over the RTU.\nCVE-2018-10605 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n--------- End Update B Part 4 of 5 --------\n4.2.2 UNCONTROLLED RESOURCE CONSUMPTION ('RESOURCE EXHAUSTION') CWE-400\nCreating new connections to one or more IOAs, without closing them properly, may cause a denial of service within the industrial process control channel.\nCVE-2018-10607 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n4.2.3 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nImproper sanitization of data over a Websocket may allow cross-site scripting and client-side code execution with target user privileges.\nCVE-2018-10609 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:N/I:H/A:N).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Energy\nCountries/Areas Deployed: Estonia, Latvia, Lithuania, and Finland\nCompany Headquarters Location: Estonia\n\n4.4 RESEARCHER\nBernhards Blumbergs and Arturs Danilevics of CERT.LV, Latvia, reported these vulnerabilities to NCCIC.\n5. MITIGATIONS\nMartem has provided updated information within the “Security Considerations” section of their Configuration Manual which can be accessed at following link:\nhttp://phobos.martem.ee/shr/dsum/Telem-GWS_usermanual.pdf\nMartem recommends the following mitigations for CVE-2018-10603 and CVE-2018-10607:\nIn most cases, these vulnerabilities can be resolved by proper configuration:\n\nUsing \"other side IP\" field in RTU configuration for every TCP/IP channel. This will minimize the risk of allowing unauthorized access and control over the communication channels (i.e., only trusted partners are allowed);\nUsing secure VPN channels;\nProper packet filtering by enabling firewall in RTU configuration. Note that the \"interface\" field of every communication channel must be properly set in RTU configuration when firewall is enabled.\n\nSee Martem Security Advisory SA1805182 and SA1805184:\nhttp://martem.eu/csa/Martem_CSA_Telem_1805182.pdf\nhttp://martem.eu/csa/Martem_CSA_Telem_1805184.pdf\n--------- Begin Update B Part 5 of 5 --------\nMartem recommends the following mitigations for CVE-2018-10605:\n\nUpgrade to new firmware release 2.0.87-4018403- k4 or newer\nChange default passwords to reasonably strong ones.\nImplement firewall rules to limit unsanctioned SSH access for IPv4 and IPv6.\nUse SSH public key authorization. \nEnsure GWS.exe is up to date. \n\nSee Martem Security Advisory SA1805183:\nhttps://martem.eu/csa/Martem_CSA_Telem_1805183.pdf\nMartem recommends the following mitigations for CVE-2018-10609:\n\nUpgrade to firmware 2.0.72-cb42e64-k4 or newer. Contact Martem for more information.\n\n--------- End Update B Part 5 of 5 --------\n\nWebServer should be turned on according to need of the configurator. If the WebServer is not needed anymore, then it should be removed from the configuration.\nWebServer access should be protected by strong password to avoid unauthorized access. Other side IP should be defined in configuration. Use firewall to avoid untrusted connections and to restrict the number of parallel connections to the WebServer.\n\nSee Martem Security Advisory SA1805181:\nhttp://martem.eu/csa/Martem_CSA_Telem_1805181.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-10603",
    "CVE-2018-10605",
    "CVE-2018-10607",
    "CVE-2018-10609"
  ],
  "techniques": [],
  "advisory": "icsa-18-142-01",
  "title": "Martem TELEM-GW6/GWM (Update B) | CISA",
  "source": "ics-advisories",
  "id": "a2b246d9b46480e1ed01a53cf509144fda540efb14dda8c2ee2196291fa1ac62"
}