{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: PanelView 800\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to disclose sensitive information, modify data, or cause a denial-of-service.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Rockwell Automation PanelView 800, a graphics terminal, are affected:\n\nPanelView 800 2711R-T10T: V3.011\nPanelView 800 2711R-T7T: V3.011\nPanelView 800 2711R-T4T: V3.011\n\n3.2 Vulnerability Overview\n3.2.1 Improper Input Validation CWE-20\nAn input/output validation vulnerability exists in a third-party component that the PanelView™ 800 utilizes. Libpng, which is PNG's reference library, version 1.6.32 and earlier does not properly check the length of chunks against the user limit. Libpng versions prior to 1.6.32 are susceptible to a vulnerability which, when successfully exploited, could potentially lead to a disclosure of sensitive information, addition or modification of data, or a denial-of-service condition.\nCVE-2017-12652 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater, Telecommunications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to CISA.\n4. MITIGATIONS\nCustomers using the affected software are encouraged to apply risk mitigations, if possible. Additionally,\nRockwell Automation encourages customers to implement their suggested security best practices to minimize the risk of\nvulnerability.\n\nUpdating to v6.011 or later will mitigate the issue.\nSecurity Best Practices\n\nFor more information, see Rockwell Automation's Security Advisory\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nSeptember 28, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2017-12652"
  ],
  "techniques": [],
  "advisory": "icsa-23-271-01",
  "title": "Rockwell Automation PanelView 800 | CISA",
  "source": "ics-advisories",
  "id": "79a3ec1bb967a08e4f7db69cb49d9f1c055fcba20fee30a29e84576c0a43b1f4"
}