{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.0\nATTENTION: Low skill level to exploit\nVendor: GE Digital\nEquipment: CIMPLICITY\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an adversary to modify the systemwide CIMPLICITY configuration, leading to the arbitrary execution of code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nGE Digital CIMPLICITY v10.0 and prior are affected by this vulnerability.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nA local privilege escalation vulnerability has been identified in the GE Digital CIMPLICITY HMI/SCADA product. If exploited, this vulnerability could allow an adversary to modify the system, leading to the arbitrary execution of code. This vulnerability is only exploitable if an attacker has access to an authenticated session.\nCVE-2020-6992 has been assigned to this vulnerability. A CVSS v3 base score of 6.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov of Claroty reported this vulnerability to GE Digital.\n4. MITIGATIONS\nGE Digital CIMPLICITY v11.0, released January 2020, contains mitigation for this local privilege escalation vulnerability. GE Digital recommends all users upgrade to GE CIMPLICITY v11.0 or newer. Other recommendations may mitigate issues, but only installing the most current version will fully address the issue. To obtain the latest version of this product, please contact a GE Digital representative.\nGE Digital provides guidance for users to secure systems, and advises that users running CIMPLICITY adhere to the Secure Deployment Guide found on GE Digital’s customer center (requires logon).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nExercise principles of least privilege.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-6992"
  ],
  "techniques": [],
  "advisory": "icsa-20-098-02",
  "title": "GE Digital CIMPLICITY | CISA",
  "source": "ics-advisories",
  "id": "8f12f8c63746fe86f0ea52222f647ddd1237ad7eba64addd259401cfa94d210e"
}