{
  "markdown": " Cogent DataHub Code Injection Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryCogent DataHub Code Injection Vulnerability=========================================== Last Revised September 06, 2018 Alert Code ICSA\\-14\\-198\\-01OVERVIEW-------- NCCIC/ICS\\-CERT has become aware of a code injection vulnerability affecting the Cogent DataHub application produced by Cogent Real\\-Time Systems, Inc. (hereafter referred to as Cogent). Security researcher John Leitch reported this vulnerability to the Zero Day Initiative (ZDI), who then reported it directly to Cogent. Successful exploitation of this vulnerability could allow remote execution of arbitrary code. This vulnerability could be exploited remotely. Exploits that target this vulnerability are known to be publicly available.AFFECTED PRODUCTS----------------- The following Cogent DataHub versions are affected:* Cogent DataHub V7\\.3\\.4 and earlier.IMPACT------ Successful exploitation of this vulnerability could allow an attacker with write access to the target file system to execute arbitrary code on vulnerable installations of Cogent DataHub. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Cogent is a Canadian\\-based company that produces middleware applications that are used to interface with control systems. Cogent’s products are deployed across several sectors including Chemical, Commercial Facilities, Critical Manufacturing, Energy, Financial Services, and others. These products are used worldwide, primarily in the United States and Great Britain.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### CODE INJECTIO **NCWE\\-94: Improper Control of Generation of Code (“Code Injection”), http://cwe.mitre.org/data/definitions/94\\.html, web site last accessed July 17, 2014\\.** If the attacker can create a Gamma script file on the local file system, then they can use an injection attack via an ASP page to execute that script file. This is not a remote attack, because the attacker must first be able to write to the file system. However once written, the file can be executed from a remote call. The specific flaw exists within the code that authenticates permission requests from web pages. The attacker can create a specially formatted user name and password that result in a script injection. CVE\\-2014\\-3789NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-3789, web site last accessed July 17, 2014\\. has been assigned to this vulnerability. ZDI has calculated a CVSS v2 base score of 7\\.5; the CVSS vector string is (AV:N/AC:L/Au:N/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:P/I:P/A:P, web site last accessed July 17, 2014\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability could be exploited remotely.#### EXISTENCE OF EXPLOIT Exploits that target this vulnerability are known to be publicly available.#### DIFFICULTY An attacker with a low skill would be able to exploit this vulnerability.MITIGATION---------- Cogent has fixed this vulnerability in Version 7\\.3\\.5 of DataHub. This is a free upgrade for any customer running V7\\.x. Cogent advises that customers running versions prior to V7\\.3\\.5 do one of the following:* Upgrade to Cogent DataHub Version 7\\.3\\.5 available at: <http://www.cogentdatahub.com/Download_Software.html> , or* Disable the web server component in their Cogent DataHub installation, or* Configure their network security to block access to the Cogent DataHub web server from untrusted locations. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Cogent Real\\-Time Systems Inc-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-14-198-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2014-3789"
  ],
  "techniques": [],
  "advisory": "icsa-14-198-01",
  "title": "Cogent DataHub Code Injection Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "f18482585583d895575dcb06bbdba93cba3ee68049df337847f6dab2df4f3ea1"
}