{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: XHQ Operations Intelligence\nVulnerabilities: Exposure of Sensitive Information to an Unauthorized Actor, Cross-site Scripting, Basic XSS, SQL Injection, Relative Path Traversal, Cross-site Request Forgery\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to read sensitive information, modify web content, and perform cross-site scripting and cross-site request forgery on unsuspecting users.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of XHQ Operations Intelligence are affected:\n\nXHQ: All versions prior to 6.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe application’s web server could expose non-sensitive information about the server’s architecture. This could allow an attacker to adapt further attacks to the version in place.\nCVE-2019-19283 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.2    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION (‘CROSS-SITE SCRIPTING’) CWE-79\nThe web interface could allow cross-site scripting (XSS) attacks if an attacker is able to modify content of particular webpages, causing the application to behave in unexpected ways for legitimate users.\nCVE-2019-19284 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:N).\n3.2.3    IMPROPER NEUTRALIZATION OF SCRIPT-RELATED HTML TAGS IN A WEB PAGE (BASIC XSS) CWE-80\nThe web interface could allow injections that could lead to XSS attacks if unsuspecting users are tricked into accessing a malicious link.\nCVE-2019-19285 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:N).\n3.2.4    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe web interface could allow SQL injection attacks if an attacker is able to modify content of particular webpages.\nCVE-2019-19286 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.2.5    RELATIVE PATH TRAVERSAL CWE-23\nThe web interface could allow attackers to traverse through the file system of the server based by sending specially crafted packets over the network without authentication.\nCVE-2019-19287 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.2.6    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION (‘CROSS-SITE SCRIPTING’) CWE-79\nThe web interface could allow XSS attacks if unsuspecting users are tricked into accessing a malicious link.\nCVE-2019-19288 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:L/A:N)\n3.2.7    CROSS-SITE REQUEST FORGERY CWE-352\nThe web interface could allow a cross-site request forgery attack if an unsuspecting user is tricked into accessing a malicious link.\nCVE-2019-19289 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N)\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends updating the XHQ Operations Intelligence product line to the newest version:\n\nUpdate to v6.1:\n\nContact a service organization for further information on how to obtain the new version of XHQ. To identify a service organization, contact a Siemens hotline center.\n\n\nFollow XHQ’s documentation on how to implement a secure configuration for the Internet Information Services (IIS).\n\nSiemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information refer to SSA-712690\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-19289",
    "CVE-2019-19287",
    "CVE-2019-19283",
    "CVE-2019-19288",
    "CVE-2019-19285",
    "CVE-2019-19284",
    "CVE-2019-19286"
  ],
  "techniques": [],
  "advisory": "icsa-20-343-06",
  "title": "Siemens XHQ Operations Intelligence | CISA",
  "source": "ics-advisories",
  "id": "93d3f98aab44d97eac9d2dd475af328e0f150890a808e8310128083af4865b46"
}