{
  "markdown": "\nOverview\nThis Updated Advisory is a follow-up to the original Advisory titled “ICSA-12-088-01 – Rockwell Automation FactoryTalk RNADiagReceiver DOS Vulnerabilities” that was published March 28, 2012 on the ICS-CERT web page.\nThis advisory is a follow-up to ICS-CERT Alert “ICS-ALERT-12-017-01—ROCKWELL AUTOMATION FACTORYTALK RNADIAGRECEIVER” that was published January 17, 2012, on the ICS-CERT web page.\nIndependent researcher Luigi Auriemma identified two vulnerabilities that may result in a denial-of-service (DoS) condition in the Rockwell Automation FactoryTalk (FT) application. These vulnerabilities were reported, along with proof-of-concept code, without coordination with ICS-CERT, the vendor, or other coordinating entity. The two vulnerabilities include an unexpected return value and a read access violation.\nICS-CERT has coordinated these vulnerabilities with Rockwell Automation who developed a patch that resolves these vulnerabilities.\nAffected Products\nAccording to Rockwell Automation's Security Taskforce, the following Allen-Bradley products are affected by these vulnerabilities:\n\nRSLogix 5000 (versions 17, 18, 19, 20)\nFactory Talk (CPR9 up to and including CPR9 SR5)\n\nFT Directory\nFT Alarms & Events\nFT View SE\nFT Diagnostics\nFT Live Data\nFT Server Health.\n\n\n\nImpact\nSuccessful exploitation of this vulnerability may result in a DoS condition.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nRockwell Automation provides industrial automation control and information products worldwide, across a wide range of industries.\nThe FactoryTalk Services Platform is a collection of production and performance management systems.\nVulnerability Characterization\nVulnerability Overview\nUnexpected Return ValueCWE, has been assigned to this vulnerability. http://cwe.mitre.org/data/definitions/389.html, CWE-389: Error Conditions, Return Values, Status Codes. This website last accessed March 27, 2012.\n--------- Begin Update A Part 1 of 2 --------\nAn unexpected return value can be generated by a specially crafted packet that can cause the Rockwell Automation FactoryTalk RNADiagReceiver service listening on Port 4445/UDP to stop processing packets. This vulnerability may lead to a DoS condition.\nCVE-2012-0221 has been assigned to this vulnerability.\n--------- End Update A Part 1 of 2 ----------\nRead Access ViolationCWE, http://cwe.mitre.org/data/definitions/125.html, CWE-125: Out-of-bounds Read. This website last accessed March 27, 2012.\n--------- Begin Update A Part 2 of 2 --------\nA read access violation vulnerability exists in Rockwell Automation’s FactoryTalk platform. A specially crafted packet can be sent to the RNADiagReceiver service listening on Port 4445/UDP resulting in a possible DoS condition.\nCVE-2012-0222 has been assigned to this vulnerability.\n--------- End Update A Part 2 of 2 ----------\nVulnerability Details\nExploitability\nThese vulnerabilities are remotely exploitable.\nExistence of Exploit\nPublic exploits are known that target these vulnerabilities.\nDifficulty\nAn attacker with a low skill level may be able to exploit these vulnerabilities.\nMitigation\nRockwell has developed a security update to address these vulnerabilities. To download and install the update please refer to Rockwell’s Advisory.\nFor more information on security with Rockwell Automation products, please refer to Rockwell’s Security Advisory Index.\nIn addition to applying the above patch, Rockwell Automation recommends customers configure firewalls to block the following TCP ports to prevent traversal of RNA messages into and out of the ICS system:\n\n1330\n1331\n1332\n4241\n4242\n4445\n4446\n6543\n9111\n60093\n49281.\n\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n\n",
  "cves": [
    "CVE-2012-0222",
    "CVE-2012-0221"
  ],
  "techniques": [],
  "advisory": "icsa-12-088-01a",
  "title": "Rockwell Automation FactoryTalk RNADiagReceiver (UPDATE A) | CISA",
  "source": "ics-advisories",
  "id": "8123ce65981b2d8849c6fa5a187a54cd40b8c0c5b2aeae2074eb64cd2f27bd49"
}