{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC Human Machine Interface (HMI) Panels\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a permanent denial-of-service condition by sending specially crafted TCP packets. This condition would then require a device reboot.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC HMIs are affected:\n\nSIMATIC HMI Comfort Panels (incl. SIPLUS variants): All versions prior to V17 Update 4\nSIMATIC HMI KTP400 Basic (6AV2123-2DB03-0AX0): All versions prior to V17 Update 5\nSIMATIC HMI KTP700 Basic (6AV2123-2GB03-0AX0): All versions prior to V17 Update 5\nSIMATIC HMI KTP900 Basic (6AV2123-2JB03-0AX0): All versions prior to V17 Update 5\nSIMATIC HMI KTP1200 Basic (6AV2123-2MB03-0AX0): All versions prior to V17 Update 5\nSIMATIC HMI KTP Mobile Panels: All versions prior to V17 Update 4\nSIPLUS HMI KTP400 BASIC (6AG1123-2DB03-2AX0): All versions prior to V17 Update 5\nSIPLUS HMI KTP700 BASIC (6AG1123-2GB03-2AX0): All versions prior to V17 Update 5\nSIPLUS HMI KTP900 BASIC (6AG1123-2JB03-2AX0): All versions prior to V17 Update 5\nSIPLUS HMI KTP1200 BASIC (6AG1123-2MB03-2AX0): All versions prior to V17 Update 5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nAffected devices do not properly validate input sent to certain services over TCP. This could allow an unauthenticated remote attacker to cause a permanent denial-of-service condition by sending specially crafted TCP packets. This condition would then require a device reboot.\nCVE-2022-40227 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends users to update to the latest versions:\n\nSIMATIC HMI Comfort Panels (incl. SIPLUS variants): Update to V17 Update 4 or later\nSIMATIC HMI KTP400 Basic (6AV2123-2DB03-0AX0): Update to V17 Update 5 or later\nSIMATIC HMI KTP700 Basic (6AV2123-2GB03-0AX0): Update to V17 Update 5 or later\nSIMATIC HMI KTP900 Basic (6AV2123-2JB03-0AX0): Update to V17 Update 5 or later\nSIMATIC HMI KTP1200 Basic (6AV2123-2MB03-0AX0): Update to V17 Update 5 or later\nSIMATIC HMI KTP Mobile Panels: Update to V17 Update 4 or later\nSIPLUS HMI KTP400 BASIC (6AG1123-2DB03-2AX0): Update to V17 Update 5 or later\nSIPLUS HMI KTP700 BASIC (6AG1123-2GB03-2AX0): Update to V17 Update 5 or later\nSIPLUS HMI KTP900 BASIC (6AG1123-2JB03-2AX0): Update to V17 Update 5 or later\nSIPLUS HMI KTP1200 BASIC (6AG1123-2MB03-2AX0): Update to V17 Update 5 or later\n\nSiemens has identified the following specific workarounds and mitigations users can implement to reduce exploitation risk:\n\nRestrict access to ports 5001/TCP and 5002/TCP to trusted IP addresses.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage \nFor more information, see Siemens Security Advisory SSA-384224 in HTML or CSAF formats.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-40227"
  ],
  "techniques": [],
  "advisory": "icsa-22-286-14",
  "title": "Siemens SIMATIC HMI Panels | CISA",
  "source": "ics-advisories",
  "id": "29c8c0ae24656eabe971e45e1c6a23a5e65655e80714ad8ad3f2e8bff9312aae"
}