{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 2.7\nATTENTION: low attack complexity\nVendor: WAGO\nEquipment: PFC200 Series\nVulnerability: Externally Controlled Reference to a Resource in Another Sphere\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker with administrative privileges to access sensitive files in an unintended, undocumented way.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nWAGO reports the following products are affected:\n\nCompact Controller CC100: Versions later than FW19, up to and including FW26\nEdge Controller: Versions later than FW18, up to and including FW26\nPFC100: Versions later than FW16, up to and including FW26\nPFC200: Versions later than FW16, up to and including FW26\nTouch Panel 600 Advanced Line: Versions later than FW16, up to and including FW26\nTouch Panel 600 Marine Line: Versions later than FW16, up to and including FW26\nTouch Panel 600 Standard Line: Versions later than FW16, up to and including FW26\n\n3.2 Vulnerability Overview\n3.2.1 Externally Controlled Reference to a Resource in Another Sphere CWE-610\nOn affected Wago products a remote attacker with administrative privileges can access files which they already have access to through an undocumented local file inclusion. This access is logged in a different log file than expected.\nCVE-2023-4089 has been assigned to this vulnerability. A CVSS v3.1 base score of 2.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, and Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nFloris Hendriks of Radboud University reported this vulnerability to CISA.\n4. MITIGATIONS\nAs general security measures strongly WAGO recommends:\n\nUse general security best practices to protect systems from local and network attacks.\nDo not allow direct access to the device from untrusted networks.\nUpdate to the latest firmware (FW27) according to the table in VDE-2023-046.\n\nCERT@VDE has published advisory VDE-2023-046 for this vulnerability.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nNovember 21, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-4089"
  ],
  "techniques": [],
  "advisory": "icsa-23-325-01",
  "title": "WAGO PFC200 Series | CISA",
  "source": "ics-advisories",
  "id": "eafd82f491ab4ae2b678faeb41188f9821381f6b3912ba391ac75b51f33dd910"
}