{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Public exploits available/exploitable remotely/low attack complexity \nVendor: Delta Electronics \nEquipment: DX-2100-L1-CN \nVulnerabilities: OS Command Injection, Cross-site Scripting \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker with low privileges to gain root access or allow an unauthenticated attacker to perform remote code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DX-2100-L1-CN, an industrial ethernet router, are affected: \n\nDX-2100-L1-CN: Version 1.5.0.10 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 \nThe web configuration service of the affected device contains an authenticated command injection vulnerability. It can be used to execute system commands on the operating system (OS) from the device in the context of the user \"root.\" If the attacker has credentials for the web service, then the device could be fully compromised.\nCVE-2022-42140 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). \n3.2.2 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79 \nThe affected device contains a stored cross-site scripting vulnerability in the \"net diagnosis\" function in the web configuration service. This can be exploited in the context of a victim's session. An attacker could deliver a large variety of payloads that could lead to possibilities, such as remote code execution. \nCVE-2023-0432 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Taiwan \n\n3.4 RESEARCHER\nCISA discovered a public Proof of Concept (PoC) as authored by T. Weber of CyberDanube Security Research, who reported it to Delta Electronics. \n4. MITIGATIONS\nDelta Electronics patched this vulnerability in Version 1.5.0.12 and recommends all users update device firmware to that version or later. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-42140",
    "CVE-2023-0432"
  ],
  "techniques": [],
  "advisory": "icsa-23-033-05",
  "title": "Delta Electronics DX-2100-L1-CN | CISA",
  "source": "ics-advisories",
  "id": "d3cb5249cb2a28a45dc0c2465c4c43d13e9f14c5f6b8b6c5896b8c4d4be58158"
}