{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6 \nATTENTION: Exploitable remotely/low attack complexity\nVendor: Enphase\nEquipment: Enphase Installer Toolkit\nVulnerability: Use of Hard-coded Credentials\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-23-171-02 Enphase Installer Toolkit Android App that was published June 22, 2023, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow sensitive information to be obtained by an attacker using hard-coded credentials.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following version of Enphase Installer Toolkit, a software application, is affected: \n\nInstaller Toolkit: 3.27.0\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1 USE OF HARD-CODED CREDENTIALS CWE-798\nEnphase Installer Toolkit versions 3.27.0 and prior have hard coded credentials embedded in binary code in the Android application. An attacker can exploit this and gain access to sensitive information.\nCVE-2023-32274 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nOBSWCY3F reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 ---------\nEnphase has released a security update that addresses this vulnerability in the Enphase Installer Toolkit Android App.\nFor more information, see Enphase Energy’s Security Advisory.\n--------- End Update A Part 1 of 1 --------- \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-32274"
  ],
  "techniques": [],
  "advisory": "icsa-23-171-02",
  "title": "Enphase Installer Toolkit Android App (Update A) | CISA",
  "source": "ics-advisories",
  "id": "d62489bd27116bd188a3421b81e359f67340e2d8a9bd2579d924cc4ef14e39eb"
}