{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Rockwell Automation \nEquipment: Modbus TCP Server Add-On Instruction (AOI) \nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized user to read the connected device’s Modbus TCP Server AOI information. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Rockwell Automation Modbus TCP Server AOI, are affected: \n\nModbus TCP Server AOI: Versions 2.00 and 2.03 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200 \nVersions of Rockwell Automation Modbus TCP Server AOI prior to 2.04.00 are vulnerable to an unauthorized user sending a malformed message that could cause the controller to respond with a copy of the most recent response to the last valid request. If exploited, an unauthorized user could read the connected device’s Modbus TCP Server AOI information. \nCVE-2023-0027 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nResearchers at Veermata Jijabai Technological Institute reported this vulnerability to Rockwell Automation. \n4. MITIGATIONS\nRockwell Automation users of these affected products are encouraged to evaluate the following mitigations and apply them appropriately. \nThis issue has been mitigated in the following AOI versions: 2.04.00 and later. \nRockwell Automation’s general security guidelines can be found in the Recommended Security Guidelines. \nFor more information, see Rockwell Automation’s security advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2023-0027"
  ],
  "techniques": [],
  "advisory": "icsa-23-075-07",
  "title": "Rockwell Automation Modbus TCP AOI Server | CISA",
  "source": "ics-advisories",
  "id": "9e2dc5fe54323520b26bcf8abd7e3959ffd31f40d072b85b3ecbbf4817b5858d"
}