{
  "markdown": "\nCVSS v3 6.0\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on June 1, 2017, and is being released to the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following i.MX Devices, used on logic boards, are affected:\nDevices affected by the Stack Buffer Overflow vulnerability:\n\ni.MX 50,\ni.MX 53,\ni.MX 6ULL,\ni.MX 6UltraLite,\ni.MX 6SoloLite,\ni.MX 6Solo,\ni.MX 6DualLite,\ni.MX 6SoloX,\ni.MX 6Dual,\ni.MX 6Quad,\ni.MX 6DualPlus,\ni.MX 6QuadPlus,\nVybrid VF3xx,\nVybrid VF5xx, and\nVybrid VF6xx\n\nDevices Affected by the Improper Certificate Validation Vulnerability:\n\ni.MX 28\ni.MX 50,\ni.MX 53,\ni.MX 7Solo\ni.MX 7Dual\nVybrid VF3xx,\nVybrid VF5xx,\nVybrid VF6xx,\ni.MX 6ULL,\ni.MX 6UltraLite,\ni.MX 6SoloLite,\ni.MX 6Solo,\ni.MX 6DualLite,\ni.MX 6SoloX,\ni.MX 6Dual,\ni.MX 6Quad,\ni.MX 6DualPlus, and\ni.MX 6QuadPlus\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to cause a denial of service on the device due to a buffer overflow condition. When the device is placed in security-enabled mode it is possible for an attacker to exploit memory or a certificate to load an unauthorized image on the device affecting secure boot. Vulnerabilities are only exploitable when the device is placed in security enabled mode.\nMITIGATION\nBecause this is a hardware vulnerability, there are no software workarounds available.\nFor i.MX 6UltraLite and i.MX 6ULL devices, users are encouraged to program an eFUSE to disable the Serial Download Protocol (SDP) port to mitigate the vulnerabilities.\nNXP reports a mitigation is to prevent physical access to the respective USB OTG or UART ports used by SDP in the final customer production board design.\nNXP has confirmed that the vulnerabilities have been mitigated in new versions of silicon revisions with an updated ROM module.\nFor more information NXP has released an Errata and Engineering Bulletin that can be obtained from NXP support teams. It is also available at:\nhttps://community.nxp.com/docs/DOC-334996.\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nPrevent physical access to logic boards if system design allows.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nThese vulnerabilities are not remotely exploitable. Moderate skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nWhen the device is configured in security enabled configuration. SDP could be used to download a small section of code to an unprotected region of memory.\nCVE-2017-7936 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:L).\n\nIMPROPER CERTIFICATE VALIDATION CWE-295\n\nWhen the device is configured in security enabled configuration, under certain conditions it is possible to bypass the signature verification by using a specially crafted certificate leading to the execution of an unsigned image.\nCVE-2017-7932 has been assigned to this vulnerability. A CVSS v3 base score of 6.0 has been assigned; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:H).\nRESEARCHER\nQuarkslab identified the vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector(s): Transportation Systems, Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Eindhoven, Netherlands\n",
  "cves": [
    "CVE-2017-7932",
    "CVE-2017-7936"
  ],
  "techniques": [],
  "advisory": "icsa-17-152-02",
  "title": "NXP i.MX Product Family | CISA",
  "source": "ics-advisories",
  "id": "c9b211633fe964778b1cd2915e78fae9c532150772fd99f846eafc17b9f26125"
}