{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.5\n\nATTENTION: Low skill level to exploit\nVendor: AVEVA\nEquipment: Vijeo Citect and CitectSCADA\nVulnerability: Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a locally authenticated user to obtain Citect user credentials.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Vijeo Citect and CitectSCADA, a Supervisory Control and Data Acquisition (SCADA) software, are affected:\n\nVijeo Citect 7.30 and 7.40\nCitectSCADA 7.30 and 7.40\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nA vulnerability has been identified that may allow an authenticated local user access to Citect user credentials.\nCVE-2019-10981 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nVAPT Team, C3i Center, and IIT Kanpur reported this vulnerability to AVEVA.\n4. MITIGATIONS\nAVEVA recommends all affected users download and upgrade to CitectSCADA 2018 as soon as possible. Available at (login required):\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=51141\nAVEVA’s Security Advisory can be viewed at:\nhttps://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityAdvisory_LFSec136.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure that least privilege is implemented throughout the system.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-10981"
  ],
  "techniques": [],
  "advisory": "icsa-19-150-01",
  "title": "AVEVA Vijeo Citect and CitectSCADA | CISA",
  "source": "ics-advisories",
  "id": "3fc75e305afab2423c62a756252d7af756277f5aa68df3367aac93663370649a"
}