{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMATIC S7-400\nVulnerability: Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. UPDATE\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-104-12 Siemens SIMATIC S7-400 that was published April 14, 2022, to the ICS webpage on www.cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to create a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens S7-400 products are affected:\n\nSIMATIC S7-400 HV6 CPU family (incl. SIPLUS variants): All versions prior to v6.0.10\nSIMATIC S7-400 PN/DP V7 CPU family (incl. SIPLUS variants): All versions\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMATIC S7-410 V8 CPU family (incl. SIPLUS variants): All versions prior to v8.2.3\n\n--------- End Update A Part 1 of 2 ---------\n\nSIMATIC S7-410 V10 CPU family (incl. SIPLUS variants): All versions prior to v10.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nAffected devices improperly handle specially crafted packets sent to Port 102/TCP. This could allow an attacker to create a Denial-of-Service condition. A restart is needed to restore normal operations.\nCVE-2021-40368 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends updating their software to the most current version where available:\n\nSIMATIC S7-400 HV6 CPU family (incl. SIPLUS variants): Update to v6.0.10 or later\nSIMATIC S7-400 PN/DP V7 CPU family (incl. SIPLUS variants): No current fix is available\n\n--------- Begin Update A Part 2 of 2 ---------\n\nSIMATIC S7-410 V8 CPU family (incl. SIPLUS variants): Update to v8.2.3 or later\n\n--------- End Update A Part 2 of 2 ---------\n\nSIMATIC S7-410 V10 CPU family (incl. SIPLUS variants): Update to v10.1 or later\n\n\nTo obtain SIMATIC S7-410 v10.1 contact Siemens support\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nLimit access to Port 102/TCP to trusted users and systems only\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for industrial security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-557541\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-40368"
  ],
  "techniques": [],
  "advisory": "icsa-22-104-12",
  "title": "Siemens SIMATIC S7-400 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "4dc61eb0e6931915c4c0b303eaa28285f37a381a441baaa7d8795455c779162e"
}