{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: Pangea Communications\nEquipment: Internet FAX Analog Telephone Adapter (ATA)\nVulnerability: Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the device to reboot and create a continual denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Pangea Internet FAX ATA, an Analog Telephone Adapter, are affected:\n\nInternet FAX ATA Version 3.1.8 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nUsing a specially crafted URL, an attacker can bypass user authentication to cause the device to reboot, which may be used to cause a continual denial-of-service condition.\nCVE-2019-6551 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communication, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAnkit Anubhav of NewSky Security reported this vulnerability to NCCIC.\n4. MITIGATIONS\nPangea Communications has contacted users of the affected product and have deployed a patch to resolve the issue. For more information, contact Pangea Communications support using the following link:\nhttps://www.pangea-comm.com/contact-us/\nNCCIC recommends users take defensive measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2019-6551"
  ],
  "techniques": [],
  "advisory": "icsa-19-045-01",
  "title": "Pangea Communications Internet FAX ATA | CISA",
  "source": "ics-advisories",
  "id": "4ceb941d57a69f5f6eb3c466ceb245e9f045c83a5de731c49f2440792fe054d9"
}