{
  "markdown": "\nOverview\nICS-CERT originally released Advisory ICSA-12-265-01P on the US-CERT Portal on September 21, 2012. This web page release was delayed to provide the vendor time to contact customers concerning this information.\nResearcher Kuang-Chun Hung of the Security Research and Service Institute-Information and Communication Security Technology Center (ICST) has identified a buffer-overflow vulnerability in the Emerson DeltaV application.\nThis vulnerability can be exploited by a remote attacker; however, no publicly available exploits are currently known to exist. Emerson has produced a hotfix that mitigates this vulnerability. ICST has tested this hotfix and confirms that it fully resolves the vulnerability.\nAffected Products\nThe following supported Emerson products are affected:\n\nDeltaV V9.3.1, V10.3.1, V11.3, and V11.3.1\n\nImpact\nThis vulnerability, if exploited, could allow denial of service. Impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nEmerson is a global manufacturing and technology company offering multiple products and services in the industrial, commercial, and consumer markets through its network power, process management, industrial automation, climate technologies, and tools and storage businesses.\nVulnerability Characterization\nVulnerability Overview\nBuffer OverflowCWE-120: Buffer Copy without Checking Size of Input, http://cwe.mitre.org/data/definitions/120.html, Web site last accessed September 27, 2012.\nThe DeltaV service allows a string to be copied without bounds checking. By sending a large string to a specific port, an attacker could cause a crash.\nCVE-2012-3035 has been assigned to this vulnerability. A CVSS v2 base score of 5.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C: N/I:N/A:P).\nVulnerability Details\nExploitability\nThis vulnerability could be exploited remotely.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a low skill would be able to exploit this vulnerability.\nMitigation\nEmerson has created a hotfix that resolves this vulnerability.\nEmerson has distributed a notification in KBA NK-1200-0170 to customers who own a DeltaV Control System; the notification provides details of the vulnerability, recommended mitigations, and instructions on obtaining and installing the hotfix. Customers using DeltaV V9.3.1 and V10.3 are recommended to update to V10.3.1 as there is no hotfix for those versions.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\n\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.d ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01A—Cyber Intrusion Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2012-3035"
  ],
  "techniques": [],
  "advisory": "icsa-12-265-01",
  "title": "Emerson DeltaV Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "ef67eb01b2aa89e9ebdfdc4dff46d7e4f4c2d2aeeb58d7a642c2a3aad4105517"
}