{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: eSOMS\nVulnerabilities: Generation of Error Message Containing Sensitive Information, Exposure of Sensitive System Information to an Unauthorized Control Sphere\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to disclose sensitive information related to eSOMS application configuration.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Hitachi Energy products are affected:\n\neSOMS: v6.3.13 and prior\n\n3.2 Vulnerability Overview\n3.2.1 GENERATION OF ERROR MESSAGE CONTAINING SENSITIVE INFORMATION CWE-209\nThe response messages received from the eSOMS report generation using certain parameter queries with full file path can be abused for enumerating the local file system structure.\nCVE-2023-5514 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.2 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED CONTROL SPHERE CWE-497\nThe responses for web queries with certain parameters disclose internal path of resources. This information can be used to learn internal structure of the application and to further plot attacks against web servers and deployed web applications.\nCVE-2023-5515 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.3 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED CONTROL SPHERE CWE-497\nPoorly constructed webap requests and URI components with special characters trigger unhandled errors and exceptions, disclosing information about the underlying technology and other sensitive information details. The website unintentionally reveals sensitive information including technical details like version info, endpoints, backend server, Internal IP. etc., which could expose additional attack surface containing other vulnerabilities.\nCVE-2023-5516 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy recommends updating eSOMS to a fixed version when available.\nFor more information on this issue, see the Hitachi Energy eSOMS Security Advisory 8DBD000175.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nNovember 9, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-5514",
    "CVE-2023-5515",
    "CVE-2023-5516"
  ],
  "techniques": [],
  "advisory": "icsa-23-313-02",
  "title": "Hitachi Energy eSOMS | CISA",
  "source": "ics-advisories",
  "id": "b9b0ab7cdd5cb9d561d24b565c33e6b82522ffafa1e07301f601365493df9a19"
}