{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Delta Electronics\nEquipment: CNCSoft-B DOPSoft\nVulnerabilities: Stack-based Buffer Overflow, Heap-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to exploit a buffer overflow condition and remotely execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CNCSoft-B DOPSoft, a human machine interface (HMI), and component of CNCSoft-B 1.0.0.4, are affected are affected:\n\nCNCSoft-B DOPSoft: versions prior to v4.0.0.82\n\n3.2 Vulnerability Overview\n3.2.1 STACK-BASED BUFFER OVERFLOW CWE-121\nDelta Electronics' DOPSoft versions prior to v4.0.0.82, a component of CNCSoft-B 1.0.0.4, are vulnerable to stack-based buffer overflow, which could allow an attacker to execute arbitrary code.\nCVE-2023-25177 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2 HEAP-BASED BUFFER OVERFLOW CWE-122\nDelta Electronics' DOPSoft versions prior to v4.0.0.82, a component of CNCSoft-B 1.0.0.4, are vulnerable to heap-based buffer overflow, which could allow an attacker to execute arbitrary code.\nCVE-2023-24014 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3 STACK-BASED BUFFER OVERFLOW CWE-121\nDelta Electronics' CNCSoft-B version 1.0.0.4 DOPSoft versions 4.0.0.82 and prior are vulnerable to stack-based buffer overflow, which could allow an attacker to execute arbitrary code.\nCVE-2023-4685 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nNatnael Samson (@NattiSamson), working with Trend Micro's Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nDelta Electronics has released and recommends users to download the following mitigations:\n\nUpdate to CNCSoft-B (v1.0.0.4) (Issue Date: 2023-08-17) or later.\n\nCISA recommends users take defensive measures to minimize the exploitation risk of these vulnerabilities, such as:\n\nMinimizing network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocating control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, using more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n5. PUBLICATION HISTORY\n\nJune 06, 2023: Initial Publication\nSeptember 07, 2023: Changes to affected products and mitigations\n\n",
  "cves": [
    "CVE-2023-4685",
    "CVE-2023-25177",
    "CVE-2023-24014"
  ],
  "techniques": [],
  "advisory": "icsa-23-157-01",
  "title": "Delta Electronics CNCSoft-B DOPSoft (Update) | CISA",
  "source": "ics-advisories",
  "id": "ee9d4c4ee2c73b93e8afb16c70c6ee84b311a86ed43e31dbed8b0e985724869e"
}