{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: WECON Technology Co., Ltd\nEquipment: LeviStudioU\n\n--------- Begin Update A Part 1 of 3 ---------\n\nVulnerabilities: Stack-based Buffer Overflow, Heap-based Buffer Overflow, Out-of-Bounds Write, Improper Restriction of XML External Entity Reference\n\n--------- End Update A Part 1 of 3 ---------\n2 . UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-212-03 WECON LeviStudioU that was published July 31, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute remote code.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nAccording to Zero Day Initiative (ZDI) the following product and versions are affected: \n\nLeviStudioU, Versions 1.8.29 and 1.8.44\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nMultiple stack-based buffer overflow vulnerabilities can be exploited when the application processes specially crafted project files.\nCVE-2018-10602 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nMultiple heap-based buffer overflow vulnerabilities can be exploited when the application processes specially crafted project files.\nCVE-2018-10606 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- Begin Update A Part 2 of 3 --------\n4.2.3    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds vulnerability can be exploited when the application processes specially crafted project files.\nCVE-2018-10610 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.4    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE ('XXE') CWE-611\nAn XXE vulnerability can be exploited when the application processes specially crafted project XML files.\nCVE-2018-10614 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n--------- End Update A Part 2 of 3 --------    \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: China\n\n4.4 RESEARCHER\n--------- Begin Update A Part 3 of 3 --------\nThe NSFOCUS security team and Ghirmay Desta, working with Trend Micro’s Zero Day Initiative, and Mat Powell and Jose Luis Zayas Banderas of Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\n--------- End Update A Part 3 of 3 --------\n5. MITIGATIONS\nUpdating to the latest version of LeviStudioU may address some of the vulnerabilities. \nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-10614",
    "CVE-2018-10610",
    "CVE-2018-10606",
    "CVE-2018-10602"
  ],
  "techniques": [],
  "advisory": "icsa-18-212-03",
  "title": "WECON LeviStudioU (Update A) | CISA",
  "source": "ics-advisories",
  "id": "eaf027e7a7dec70ea5c7b2d962335e54faa4311b72498eeefb0b49abc1287448"
}