{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: dnsmasq by Simon Kelley\nEquipment: dnsmasq\nVulnerabilities: Heap-based Buffer Overflow, Insufficient Verification of Data Authenticity, Use of a Broken or Risky Cryptographic Algorithm\n\nCISA is aware of a public report, known as “DNSpooq” that details vulnerabilities found in dnsmasq, a prevalent lightweight DNS and DHCP server developed and maintained by Simon Kelley. CISA is issuing this advisory to provide early notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-019-01 dnsmasq by Simon Kelley that was published January 19th, 2021, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in cache poisoning, remote code execution, and a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of dnsmasq DNS and DHCP server are affected:\n\nVersion 2.8.2 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap-based buffer overflow was discovered in dnsmasq in the way it sorts RRSets before validating them with DNSSEC data. An attacker on the network could forge DNS replies to be accepted as valid to cause an overflow with arbitrary data in a heap-allocated memory, resulting in code execution.\nCVE-2020-25681 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nA buffer overflow vulnerability was discovered in the way dnsmasq extracts names from DNS packets before validating them with DNSSEC data. An attacker on the network could create valid DNS replies to cause an overflow with arbitrary data in a heap-allocated memory, resulting in code execution.\nCVE-2020-25682 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap-based buffer overflow was discovered in dnsmasq when DNSSEC is enabled and before it validates the received DNS entries. A remote attacker could create valid DNS replies to cause an overflow in a heap-allocated memory and cause a crash in dnsmasq, resulting in a denial-of-service condition. \nCVE-2020-25683 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.4    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nA vulnerability exists when getting a reply from a forwarded query, where dnsmasq checks in forward.c:reply_query() if the reply destination address/port is used by the pending forwarded queries. This could allow an attacker to perform a DNS cache poisoning attack. \nCVE-2020-25684 has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:L/A:N).\n4.2.5    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nDue to a weak hash, an off-path attacker can find several different domains with the same hash, substantially reducing the number of attempts to forge a reply for acceptance by dnsmasq. This could allow an attacker to perform a DNS cache poisoning attack. \nCVE-2020-25685 has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:L/A:N).\n4.2.6    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nA flaw was found when receiving a query, where dnsmasq does not check for an existing pending request for the same name and forwards a new request. This could allow an off-path attacker on the network to substantially reduce the number of attempts to forge a reply and have it accepted by dnsmasq. \nCVE-2020-25686 has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:L/A:N).\n4.2.7    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap-based buffer overflow was discovered in dnsmasq when DNSSEC is enabled and before it validates the received DNS entries. A remote attacker could create valid DNS replies and cause an overflow in heap-allocated memory, resulting in a denial-of-service condition. \nCVE-2020-25687 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n4.4 RESEARCHER\nMoshe Kol and Shlomi Oberman of JSOF reported these vulnerabilities to CISA.\n5. MITIGATIONS\nThe maintainers of dnsmasq recommend users update to the latest version (2.83 or later)\nThe researcher has recommended the following mitigations and workarounds:\n\nImplement Layer 2 security features such as DHCP snooping and IP source guard. \nConfigure dnsmasq not to listen to WAN interfaces if unnecessary. \nReduce the maximum queries allowed to be forwarded with the option --dns-forward-max=<queries>. The default is 150, but it could be lowered.\nTemporarily disable DNSSEC validation option until you patch.\nUse DNS-over-HTTPS or DNS-over-TLS to connect to upstream server.\n\n--------- Begin Update A Part 1 of 1 ---------\nAdditional vendors affected by the reported vulnerabilities have also released security advisories related to their affected products. Those advisories are as follows:\n\nSiemens\n\n--------- End Update A Part 1 of 1 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-25683",
    "CVE-2020-25682",
    "CVE-2020-25685",
    "CVE-2020-25687",
    "CVE-2020-25681",
    "CVE-2020-25684",
    "CVE-2020-25686"
  ],
  "techniques": [],
  "advisory": "icsa-21-019-01",
  "title": "dnsmasq by Simon Kelley (Update A) | CISA",
  "source": "ics-advisories",
  "id": "4273c56f40300c6ed6d5c52ef22629b15cd7999ad1630a4c10a0d50dece366ed"
}