{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: RTU500 series\nVulnerabilities: Observable Discrepancy, Buffer Over-read, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to eavesdrop on traffic, retrieve information from memory, or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the RTU500 series, a remote terminal unit, are affected:\n\nRTU500 series CMU Firmware: Version 11.*\nRTU500 series CMU Firmware: Version 12.0.*\nRTU500 series CMU Firmware: Version 12.2.*\nRTU500 series CMU Firmware: Version 12.4.*\nRTU500 series CMU Firmware: Version 12.6.*\nRTU500 series CMU Firmware: Version 12.7.*\nRTU500 series CMU Firmware: Version 13.0.*\nRTU500 series CMU Firmware: Version 13.1.*\nRTU500 series CMU Firmware: Version 13.2.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OBSERVABLE DISCREPANCY CWE-203\nThe Raccoon attack exploits a flaw in the TLS specification, which can lead to an attacker computing pre-master secret in connections that have used a Diffie-Hellman- based cipher suite. An attacker can then eavesdrop on all encrypted communications sent over the exploited TLS connection.\nCVE-2020-1968 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.2    BUFFER OVER-READ CWE-126\nThere is a global buffer over-read vulnerability in xmlEncodeEntitiesInternal in the affected libxml2/entities.c.\nCVE-2020-24977 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:L).\n3.2.3    OUT-OF-BOUNDS READ CWE-125\nA vulnerability exists in the xml entity encoding functionality of the affected libxml2. An attacker can use a specially crafted file to trigger an out-of-bounds read.\nCVE-2021-3517 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy recommends users take the following actions at the earliest convenience:\n\nRTU500 series CMU Firmware Version 11.*: This product version is end-of-life (EOL). Upgrade to a non-affected support version. See below for the current mitigation strategy.\nRTU500 series CMU Firmware Version 12.0.1 – 12.0.13: Update to RTU500 series CMU Firmware Version 12.0.14 (to be released by end-of-February 2022). See below for the current mitigation strategy.\nRTU500 series CMU Firmware Version 12.2.1 – 12.2.10: Update to RTU500 series CMU Firmware as of Version 12.2.11\nRTU500 series CMU Firmware Version 12.4.1 – 12.4.10: Update to RTU500 CMU Firmware as of Version 12.4.11 (to be released by end-of-January 2022). See below for the current mitigation strategy.\nRTU500 series CMU Firmware Version 12.6.1 – 12.6.6: Update to RTU500 series CMU firmware as of Version 12.6.7. See below for the current mitigation strategy.\nRTU500 series CMU Firmware Version 12.7.1: Update to RTU500 series CMU Firmware as of Version 12.7.2\nRTU500 series CMU Firmware Version 13.0.1 – 13.0.2: Upgrade to the latest RTU500 series CMU Firmware as of Version 13.2.3. See below for the current mitigation strategy.\nRTU500 series CMU Firmware Version 13.1.1 – 13.1.2: Upgrade to the latest RTU500 series CMU Firmware as of Version 13.2.3. See below for the current mitigation strategy.\nRTU500 series CMU Firmware Version 13.2.1: Upgrade to the latest RTU500 series CMU Firmware as of Version 13.2.3. See below for the current mitigation strategy.\n\nHitachi Energy recommends the following security practices and firewall configurations to help protect process control networks from attacks that originate from outside the network:\n\nPhysically protect process control systems from direct access by unauthorized personnel.\nDo not directly connect to the Internet.\nSeparate from other networks by means of a firewall system that has a minimal number of ports exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving e-mails.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nPlease see Hitachi Energy advisory 8DBD000064 for additional mitigation and update information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-24977",
    "CVE-2020-1968",
    "CVE-2021-3517"
  ],
  "techniques": [],
  "advisory": "icsa-21-336-08",
  "title": "Hitachi Energy RTU500 series | CISA",
  "source": "ics-advisories",
  "id": "a78679c38493bf73b30a0f928a7552fc18b013cb61ac79d6f34edc47621cf167"
}