{
  "markdown": "\nCVSS v3 8.6\nATTENTION: Remotely exploitable/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: PanelView Plus 6 700-1500\nVulnerability: Missing Authorization\nAFFECTED PRODUCTS\nThe following versions of PanelView Plus 6 700-1500, graphic terminals and logic module products, are affected:\n\n6.00.04,\n6.00.05,\n6.00.42,\n6.00-20140306,\n6.10.20121012,\n6.10-20140122,\n7.00-20121012,\n7.00-20130108,\n7.00-20130325,\n7.00-20130619,\n7.00-20140128,\n7.00-20140310,\n7.00-20140429,\n7.00-20140621,\n7.00-20140729,\n7.00-20141022,\n8.00-20140730, and\n8.00-20141023\n\nAdditionally, Rockwell Automation reports that graphic terminals running OS 2.31 or greater are not affected by this vulnerability.\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to remotely access the device to potentially retrieve data or disrupt the availability of the device.\nMITIGATION\nRockwell Automation has released a security advisory found at the following link. A login is required to view the advisory.\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1047345/page/1\nRockwell Automation reports that affected users should update to any of the following available firmware revisions that address the vulnerability:\n\nV7.00: Apply V7.00-20150209\nV8.00: Apply V8.00-20160418\nV8.10: Apply V8.10-20151026 or later\nV8.20: Apply V8.20-20160308 or later\nV9.00: Apply V9.00-20170328 or later\n\nDownloads for the firmware revisions can be found at:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?Keyword=2711P&crumb=112\nNCCIC/ICS-CERT and Rockwell Automation recommend that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nBlock all traffic to EtherNet/IP devices or other CIP protocol-based devices from outside the manufacturing zone by blocking or restricting access to Port 2222/UDP and Port 44818/TCP using proper network infrastructure controls, such as firewalls, Unified Threat Management (UTM) devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation Products, see Knowledgebase Article ID 898270 found at https://rockwellautomation.custhelp.com/app/answers/detail/a_id/898270. A login is required to view the article.\nHelp minimize network exposure for all control system devices and/or systems, and confirm that they are not accessible from the Internet.\nLocate control system networks and devices behind firewalls, and isolate them from the rest of the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices where they are used.\nWhen downloading updates, make sure the site or source of the update can be trusted.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nMISSING AUTHORIZATION CWE-862\n\nThere is no authorization check when connecting to the device, allowing an attacker remote access.\nCVE-2017-7914 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H).\nRESEARCHER\nRockwell Automation self-reported this vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Food and Agriculture, Transportation Systems, and Water and Wastewater Systems.\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2017-7914"
  ],
  "techniques": [],
  "advisory": "icsa-17-157-01",
  "title": "Rockwell Automation PanelView Plus 6 700-1500 | CISA",
  "source": "ics-advisories",
  "id": "34eead859abb7588929ff9fa986bd610a0fa050cae12bb2ba93dfa12e3d01c87"
}