{
  "markdown": "\nCVSS v3 7.5\n\nATTENTION: Remotely exploitable\nVendor: Hanwha Techwin\nEquipment: Smart Security Manager\nVulnerabilities: Remote Code Execution\n\nAFFECTED PRODUCTS\nThe following Smart Security Manager, a software management platform, versions are affected:\n\nSmart Security Manager Versions 1.5 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to create an arbitrary file on the server with attacker controlled data as well as an attacker gaining root shell access. These conditions could allow remote code execution.\nMITIGATION\nHanwha Techwin has released a patch for v1.4 and v1.5. Customers using v1.4 and v1.5 need to upgrade using Patch_SSMv1.5_or_1.4_for_Cert_Vulnerability.\nCustomers using v1.3 and prior need to upgrade using patch SSM-TS v1.60.0.\nPatches and updates can be found at this location:\nhttp://www.hanwha-security.com/prod/info.do?menuCd=MN000185&catg1=MC000087&catg2=MC000089&catg3=&mdlCd=MC000825\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nPATH TRAVERSAL CWE-22\n\nMultiple Path Traversal vulnerabilities have been identified. The flaws exist within the ActiveMQ Broker service that is installed as part of the product. By issuing specific HTTP requests, if a user visits a malicious page, an attacker can gain access to arbitrary files on the server. Smart Security Manager Versions 1.4 and prior to 1.31 are affected by these vulnerabilities. These vulnerabilities can allow for remote code execution.\nCVE-2017-5168 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nCROSS-SITE REQUEST FORGERY CWE-352\n\nMultiple Cross Site Request Forgery vulnerabilities have been identified. The flaws exist within the Redis and Apache Felix Gogo servers that are installed as part of this product. By issuing specific HTTP Post requests, an attacker can gain system level access to a remote shell session. Smart Security Manager Versions 1.5 and prior are affected by these vulnerabilities. These vulnerabilities can allow for remote code execution.\nCVE-2017-5169 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nSteven Seeley of Source Incite discovered these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: Deployed worldwide\nCompany Headquarters Location: South Korea\n",
  "cves": [
    "CVE-2017-5168",
    "CVE-2017-5169"
  ],
  "techniques": [],
  "advisory": "icsa-17-040-01",
  "title": "Hanwha Techwin Smart Security Manager | CISA",
  "source": "ics-advisories",
  "id": "f553011ad1ca15b740183b8fd4c11ee99fa955ea11b325e0aa4769c08a983705"
}