{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: RUGGEDCOM, SCALANCE, SIMATIC, SINEMA\nVulnerabilities: Uncontrolled Resource Consumption, Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-105-05 Siemens IE/PB-Link, RUGGEDCOM, SCALANCE, SIMATIC, SINEMA (Update A) that was published May 12, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote attackers to affect the availability of the devices under certain conditions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nRUGGEDCOM RM1224: All versions prior to 6.1\nRUGGEDCOM ROX II: All versions prior to 2.13.3 (only affected by CVE-2018-5391)\nSCALANCE M-800 family: All versions prior to 6.1\nSCALANCE S615: All versions prior to 6.1\nSCALANCE SC-600: All versions prior to 2.0\nSCALANCE W1700 IEEE 802.11ac: All versions prior to 2.0\nSCALANCE W700 IEEE 802.11a/b/g/n: All versions prior to 6.4\nSIMATIC CP 1242-7: All versions prior to 3.2\nSIMATIC CP 1243-1 (incl. SIPLUS NET variants): All versions prior to 3.2\nSIMATIC CP 1243-7 LTE EU: All versions prior to 3.2\nSIMATIC CP 2243-7 LTE US: All versions prior to 3.2\nSIMATIC CP 1243-8 IRC: All versions prior to 3.2\nSIMATIC CP 1542SP-1: All versions prior to 2.1\nSIMATIC CP 1542SP-1 IRC (incl. SIPLUS NET variants): All versions prior to 2.1\nSIMATIC CP 1543-1 (incl. SIPLUS NET variants): All versions prior to 2.2\nSIMATIC CP 1543SP-1 (incl. SIPLUS NET variants): All versions prior to 2.1\n\n--------- Begin Update B Part 1 of 2 ---------\n\nSIMATIC RF185C: All versions prior to v1.3\nSIMATIC RF186C: All versions prior to v1.3\nSIMATIC RF186CI: All versions prior to v1.3\nSIMATIC RF188C: All versions prior to v1.3\nSIMATIC RF188CI: All versions prior to v1.3\n\n--------- End Update B Part 1 of 2 ---------\n\nSINEMA Remote Connect Server: All versions newer than 1.1 and prior to 2.0.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION (‘RESOURCE EXHAUSTION’) CWE-400\nCertain Linux kernel versions can be forced to make resource intensive calls for every incoming packet, which can lead to a denial-of-service condition.\nCVE-2018-5390 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    IMPROPER INPUT VALIDATION CWE-20\nCertain Linux kernels are vulnerable to a denial-of-service attack with low rates of specially modified packets targeting IP fragment re-assembly. An attacker may cause a denial-of-service condition by sending specially crafted IP fragments.\nCVE-2018-5391 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported to CISA that these publicly known vulnerabilities also affect these products.\n5. MITIGATIONS\nSiemens recommends applying updates, where available:\n\nRUGGEDCOM RM 1224: Update to v6.1\nRUGGEDCOM ROX II: Update to v2.13.3\nSCALANCE M-800 family: Update to v6.1\nSCALANCE S615: Update to v6.1\nSCALANCE SC-600: Update to v2.0 or later version\nSCALANCE W1700 IEEE 802.11 ac: Update to v2.0\nSCALANCE W700 IEEE 802.11a/b/g/n: Update to v6.4\nSIMATIC CP 1242-7 and 1243-1 (incl. SIPLUS NET variants): Update to v3.2\nSIMATIC CP 1243-7 LTE EU & US: Update to v3.2\nSIMATIC CP 1243-8 IRC: Update to v3.2\nSIMATIC CP 1542SP-1 and 1542SP-1 IRC (incl. SIPLUS NET variants): Update to v2.1\nSIMATIC 1543SP-1 IRC (incl. SIPLUS NET variants): Update to v2.1\nSIMATIC CP 1543-1 (incl. SIPLUS NET variants): Update to v2.2\nSIMATIC CP 1543SP-1 (incl. SIPLUS NET variants): Update to v2.1\nSINEMA Remote Connect Server: Update to v2.1\n\n--------- Begin Update B Part 2 of 2 ---------\n\nSIMATIC RF 18xC/CI: Update to v1.3 or later\n\n--------- End Update B Part 2 of 2 ---------\nSiemens has not identified any specific mitigations or workarounds and recommends following their general security recommendations. As a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-377115\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-5390",
    "CVE-2018-5391"
  ],
  "techniques": [],
  "advisory": "icsa-20-105-05",
  "title": "Siemens RUGGEDCOM, SCALANCE, SIMATIC, SINEMA (Update B) | CISA",
  "source": "ics-advisories",
  "id": "11da727a0da654f783a04a1da652f09976f3688783a8d87fc68c990d74abda1a"
}