{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.6\nATTENTION: Exploitable remotely/low attack complexity \nVendor: CODESYS, GmbH \nEquipment: CODESYS Development System \nVulnerability: Insufficient Verification of Data Authenticity. \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute a-man-in-the-middle (MITM) attack to execute arbitrary code. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nCODESYS reports this vulnerability affects the following versions of CODESYS Development System: \n\nCODESYS Development System: versions from 3.5.11.0 and prior to 3.5.19.20 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345 \nIn CODESYS Development System versions from 3.5.11.0 and before 3.5.19.20 a missing integrity check might allow an unauthenticated remote attacker to manipulate the content of notifications received via HTTP by the CODESYS notification server. \nCVE-2023-3663 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nSina Kheirkhah of Summoning Team working with Trend Micro Zero Day Initiative reported this vulnerability. CERT@VDE coordinated the vulnerability. \n4. MITIGATIONS\nCODESYS recommends users update the CODESYS Development System to version 3.5.19.20. \nThe CODESYS Development System can be downloaded and installed directly with the CODESYS Installer or be downloaded from the CODESYS Store. \nAlternatively, users may find further information on obtaining the software update in the CODESYS Update area. \nFor more information, please see the advisory CERT@VDE published for CODESYS at: \nhttps://cert.vde.com/en-us/advisories/vde-2023-022 \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should: \n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet. \nLocate control system networks and remote devices behind firewalls and isolate them from business networks. \nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices. \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. \nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. \nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. \nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. \n",
  "cves": [
    "CVE-2023-3663"
  ],
  "techniques": [],
  "advisory": "icsa-23-236-05",
  "title": "CODESYS Development System | CISA",
  "source": "ics-advisories",
  "id": "81f086f79809166a68b5aa3f90a667868735daf57681a42bedff2dc5db4a4828"
}