{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.3\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Hitachi Energy  \nEquipment: UNEM  \nVulnerabilities: Inadequate Encryption Strength, Use of Hard-coded Cryptographic Key, Cleartext Transmission of Sensitive Information. \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthorized user to obtain sensitive information and gain access to the network elements managed by the UNEM and could cause availability issue on affected UNEM products. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi Energy reports these vulnerabilities affect the following UNEM products:  \n\nUNEM R16A \nUNEM R15B \nUNEM R15A \nUNEM R14B \nUNEM R14A \nUNEM R11B \nUNEM R11A \nUNEM R10C \nUNEM R9C \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INADEQUATE ENCRYPTION STRENGTH CWE-326 \nAffected Hitachi Energy UNEM products use the DES cypher to encrypt user credentials used to access the network elements. DES is no longer considered secure because it uses a short 56-bit key, which could allow the cypher to be decrypted in a short time. \nCVE-2021-40341 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N). \n3.2.2 INADEQUATE ENCRYPTION STRENGTH CWE-326 \nAffected Hitachi Energy UNEM products use a DES implementation with a default key for encryption. An attacker that exploits this vulnerability could obtain sensitive information and gain access to the network elements managed by the UNEM. \nCVE-2021-40342 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N). \n3.2.3 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321 \nAffected Hitachi Energy UNEM products contain public and private keys used to sign and protect custom parameter set (CPS) files from modification. An attacker exploiting this vulnerability could change the CPS file and sign it, so that it is trusted as the legitimate CPS file. \nCVE-2022-3927 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:H). \n3.2.4 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321 \nIn the message queue of affected Hitachi Energy UNEM products contains a hard-coded credential. An attacker that exploits this vulnerability could access data inside the internal message queue. \nCVE-2022-3928 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N). \n3.2.5 CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319 \nCommunication between the client (UNEM User Interface) and the server application (UNEM Core) partially uses common object request broker architecture (CORBA) over TCP/IP. This protocol is not encrypted and could allow an unauthorized user to trace internal messages. \nCVE-2022-3929 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA. \n4. MITIGATIONS\nHitachi Energy remediated these vulnerabilities in UNEM R16A and recommends users upgrade to this version.  \nFor CVE-2021-40341, CVE-2021-40342, UNEM R16A has partial remediation. The full remediation will be complete in an upcoming UNEM release. \nHitachi Energy recommends the following mitigation actions (refer to the mitigation factors/workarounds in Hitachi Energy’s advisory for details): \n\nSecure the NMS CLIENT/SERVER communication. \nAvoid embedded FOXCST with RADIUS authentication. \nSecurely handle exported files. \n\nHitachi Energy recommends the following security practices and firewall configurations to help protect a process control network from attacks originating from outside the network: \n\nPhysically protect process control systems from unauthorized direct access. \nDo not directly connect control systems networks to the internet. \nSeparate process control systems from other networks using a firewall system with a minimal number of open ports. \nProcess control systems should not be used for internet surfing, instant messaging, or receiving emails. \nPortable computers and removable storage media should be carefully scanned for viruses connecting to a control system. \nEnsure that only authorized personnel have access to the system configuration files. \n\nFor more information, see Hitachi Energy advisory 8DBD000084. \nAdditional hardening guidelines for protecting the host operating system are published by “The Center for Internet Security (CIS).” \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have a low attack complexity. \n",
  "cves": [
    "CVE-2022-3927",
    "CVE-2022-3928",
    "CVE-2022-3929",
    "CVE-2021-40342",
    "CVE-2021-40341"
  ],
  "techniques": [],
  "advisory": "icsa-23-005-01",
  "title": "Hitachi Energy UNEM | CISA",
  "source": "ics-advisories",
  "id": "d848d64e2ad4bf98a1c3c76cd05442f581c81ab99b9b6c4ef2301f07338ee32b"
}