{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: Modicon M580, Modicon M340, Modicon Quantum, and Modicon Premium\nVulnerability: Improper Check for Unusual or Exceptional Conditions\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-016-01 Schneider Electric Modicon Controllers that was published January 16, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Modicon controllers, a PLC, are affected:\nFor CVE-2019-6857, the following Modicon controllers are affected:\n\nModicon M580, all versions prior to v2.80\nModicon M340, all versions prior to v3.01\nModicon Premium, all versions prior to v3.20\nModicon Quantum, all versions prior to v3.60\n\nFor CVE-2019-6856 and CVE-2018-7794, the following Modicon controllers are affected:\n\nModicon M580, all versions prior to v2.80\nModicon M340, all versions prior to v3.01\nModicon Premium, all versions prior to v3.20\nModicon Quantum, all versions prior to v3.52\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER CHECK FOR UNUSUAL OR EXCEPTIONAL CONDITIONS CWE-754\nThis vulnerability could cause a denial-of-service condition in the controller when reading specific memory blocks using Modbus TCP. \nCVE-2019-6857 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    IMPROPER CHECK FOR UNUSUAL OR EXCEPTIONAL CONDITIONS CWE-754\nThis vulnerability could cause a denial-of-service condition when writing specific physical memory blocks using Modbus TCP. \nCVE-2019-6856 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.3    IMPROPER CHECK FOR UNUSUAL OR EXCEPTIONAL CONDITIONS CWE-754\nThis vulnerability could cause a denial-of-service condition when reading data with invalid index using Modbus TCP. \n--------- Begin Update A Part 1 of 1 ---------\nCVE-2018-7794 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n--------- End Update A Part 1 of 1 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, and Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n4.4 RESEARCHER\nYounes Dragoni of Nozomi Networks reported this vulnerability to CISA.\n5. MITIGATIONS\nSchneider Electric has developed the following mitigations:\nSpecific Modicon M580 firmware v3.10 is available at: \n\nBMEP584040\nBMEH584040 and C\nBMEP586040 and C\nBMEH586040 and C\nBMEP581020 and H\nBMEP582020 and H\nBMEP582040 and H\nBMEP583020\nBMEP583040\nBMEP584020\nBMEP585040 and C\nBMEH582040 and C\nBMEP584040S\nBMEH584040S\nBMEH586040S\nBMEP582040S\n\nModicon M340 firmware v3.20 is available at:\n\nBMXP3420302 and CL and H\nBMXP342020 and H\nBMXP342000\nBMXP341000 and H\nBMXP3420102 and CL\nBMXP3420302\n\nModicon Premium v3.20 firmware is available by contacting Schneider Electric customer support.\nModicon Quantum firmware v3.60 is available at:\n\n140CPU65150 [C] and 140CPU65160 [C]\n140CPU65260 [C]\n140CPU67261 [C]\n140CPU67060 [C]\n140CPU67160 [C]\n140CPU67260 [C]\n140CPU65860 [C]\n140CPU67861 [C]\n140CPU65160S\n\nPlease contact Schneider Electric customer support to get the Quantum v3.60 firmware\n\n\n140CPU67160S\n\nPlease contact Schneider Electric customer support to get the Quantum v3.60 firmware\n\n\n\nSchneider Electric strongly recommends following industry cybersecurity best practices such as:\n\nLocate control and safety system networks and remote devices behind firewalls, and isolate them from the business network.\nPhysical controls should be in place so that no unauthorized person would have access to the ICS and safety controllers, peripheral equipment, or the ICS and safety networks.\nAll controllers should reside in locked cabinets and never be left in the “Program” mode.\nAll programming software should be kept in locked cabinets and should never be connected to any network other than the network for which the devices are intended.\nAll methods of mobile data exchange with the isolated network, such as CDs, USB drives, etc., should be scanned before use in the terminals or any node connected to these networks.\nLaptops that have connected to any other network besides the intended network should never be allowed to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nFor more information on this vulnerability and the associated upgrade, please see Schneider Electric’s SEVD-2019-344-01\nFor more details and assistance on how to protect during installation, please contact a Schneider Electric representative and/or Schneider Electric Industrial Cybersecurity Services. These organizations are aware of this situation and can support you through the process.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-7794",
    "CVE-2019-6857",
    "CVE-2019-6856"
  ],
  "techniques": [],
  "advisory": "icsa-20-016-01",
  "title": "Schneider Electric Modicon Controllers (Update A) | CISA",
  "source": "ics-advisories",
  "id": "a3ce53d5e92283be4d8623df01d11b042f338769b204770ebeede95824ac67c9"
}