{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.4\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Siemens \nEquipment: SIMATIC WinCC OA Ultralight Client \nVulnerability: Argument Injection  \n\n2. RISK EVALUATION\n Successful exploitation of this vulnerability could allow an authenticated remote attacker to inject arbitrary parameters when starting the Ultralight Client via the web interface.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SIMATIC WinCC OA, a human machine interface (HMI), are affected: \n\nSIMATIC WinCC OA V3.15: All versions \nSIMATIC WinCC OA V3.16: All versions prior to V3.16 P035 \nSIMATIC WinCC OA V3.17: All versions prior to V3.17 P024 \nSIMATIC WinCC OA V3.18: All versions prior to V3.18 P014 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER NEUTRALIZATION OF ARGUMENT DELIMITERS IN A COMMAND ('ARGUMENT INJECTION') CWE-88\nThe affected component allows injection of custom arguments into the Ultralight Client backend application under certain circumstances. This could allow an authenticated remote attacker to inject arbitrary parameters when starting the client via the web interface (e.g., open attacker chosen panels with the attacker’s credentials or start a Ctrl script). \nCVE-2022-44731 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA. \n4. MITIGATIONS\nSiemens released updates for several affected products and recommends updating to the latest versions. Siemens is preparing further updates and recommends specific countermeasures for products where updates are not, or not yet, available. \n\nSIMATIC WinCC OA V3.16: Update to V3.16 P035 or later version\nSIMATIC WinCC OA V3.17: Update to V3.17 P024 or later version\nSIMATIC WinCC OA V3.18: Update to V3.18 P014 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: \n\nConfigure user permissions and access management according to the WinCC OA Security Guideline.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and to follow the recommendations in the product manuals. \nFor more information, see Siemens security advisory SSA-547714 in HTML or CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-44731"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-06",
  "title": "Siemens SIMATIC WinCC OA Ultralight Client | CISA",
  "source": "ics-advisories",
  "id": "e672cd7e7b4aaab4f1e3de6ba40d06a0e76c0a7c26c1658c1313fa1ee1b1be37"
}