{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v7.5\n\nATTENTION: Exploitable remotely/Low skill level to exploit\nVendor: Yokogawa\nEquipment: Vnet/IP Open Communication Driver\nVulnerability: Resource Management Error \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause Vnet/IP network communications to controlled devices to become unavailable.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following equipment and versions utilizing the Vnet/IP Open Communication Driver are affected:\n\nCENTUM CS 3000 (R3.05.00 - R3.09.50),\nCENTUM CS 3000 Entry Class (R3.05.00 - R3.09.50),\nCENTUM VP (R4.01.00 - R6.03.10),\nCENTUM VP Entry Class (R4.01.00 - R6.03.10),\nExaopc (R3.10.00 - R3.75.00),\nPRM (R2.06.00 - R3.31.00),\nProSafe-RS (R1.02.00 - R4.02.00),\nFAST/TOOLS (R9.02.00 - R10.02.00), and\nB/M9000 VP (R6.03.01 - R8.01.90).\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    RESOURCE MANAGEMENT ERRORS CWE-399\nThe Vnet/IP Open Communication Driver has a vulnerability that could allow an attacker to stop the communications functionality of the Vnet/IP Open Communication Driver, resulting in a denial of service.\nCVE-2018-16196 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nJPCERT in coordination with Yokogawa reported this this vulnerability to NCCIC.\n4. MITIGATIONS\nYokogawa recommends users of affected devices and versions update to the latest available release.\nDetails about the products, affected revisions, and suggested mitigations are available in the Yokogawa Security Advisory Report YSAR-18-0008: denial of service (DoS) vulnerability in Vnet/IP Open Communication Driver. \nPlease see Yokogawa Security Advisory Report YSAR-18-0008 at the following location for more information:\nhttps://web-material3.yokogawa.com/YSAR-18-0008-E.pdf\nFor questions related to this report and details regarding how to update to the newest revision, please visit the Yokogawa security website (registration required):\nhttps://contact.yokogawa.com/cs/gw?c-id=000498\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-16196"
  ],
  "techniques": [],
  "advisory": "icsa-19-003-02",
  "title": "Yokogawa Vnet/IP Open Communication Driver | CISA",
  "source": "ics-advisories",
  "id": "8a35c9fe444b61c33c8097c9c5ffeb9fdf606a6d690e4fc063bc9d8798794a2b"
}