{
  "markdown": " InduSoft ISSymbol ActiveX Control Buffer Overflow \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryInduSoft ISSymbol ActiveX Control Buffer Overflow================================================= Last Revised October 28, 2013 Alert Code ICSA\\-12\\-249\\-03Overview-------- ICS\\-CERT received a report from Indusoft and the [Zero Day Initiative (ZDI)](http://www.zerodayinitiative.com/)  concerning a heap\\-based buffer overflow vulnerability affecting the InduSoft ISSymbol ActiveX control. This vulnerability was reported to ZDI by security researcher Alexander Gavrun. Successful exploitation of this vulnerability could allow remote execution of arbitrary code.Affected Products----------------- The following products and versions are affected:* InduSoft ISSymbol ActiveX Control (Build 301\\.1009\\.2904\\.0\\),* InduSoft Thin Client Version 7\\.0, and* InduSoft Web Studio Version 7\\.0B2Impact------ Successful exploitation of the reported vulnerability could allow an attacker to perform arbitrary code execution. These actions can result in adverse application conditions and ultimately impact the production environment on which the supervisory control and data acquisition (SCADA) system is used. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.Background---------- InduSoft Web Studio is a collection of automation tools to develop human\\-machine interfaces, SCADA systems, and embedded instrumentation systems. InduSoft products are often integrated as third\\-party components in other vendors’ products.Vulnerability Characterization------------------------------### Vulnerability Overview#### Heap\\-Based Buffer OverflowCWE, http://cwe.mitre.org/data/definitions/122\\.html, CWE\\-122: Heap\\-based Buffer Overflow, Web site last accessed September 05, 2012\\. Boundary errors on processing the “InternationalOrder” and “InternationalSeparator” properties can be exploited causing a heap\\-based buffer overflow via an overly long string assigned to the properties. CVE\\-2011\\-0340NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2011\\-0340 , Web site last accessed September 05, 2012\\. has been assigned to this vulnerability. According to ZDI, a CVSS v2 base score of 7\\.5 has been assigned; the CVSS vector string is [(AV:N/AC:L/Au:N/C:P/I:P/A:P).](http://nvd.nist.gov/cvss.cfm?calculator&version=2&vector=%28AV:N/AC:L/Au:N/C:P/I:P/A:P%29) ### Vulnerability Details#### Exploitability This vulnerability could be exploited remotely.#### Existence of Exploit No known public exploits specifically target this vulnerability.#### Difficulty This vulnerability requires moderate skills to exploit.Mitigation---------- ICS\\-CERT recommends that customers of InduSoft Web Studio software take the following mitigation steps.* Apply hotfix 70\\.1\\.02\\.12\\. The InduSoft security patch and details are available at: <http://www.indusoft.com/hotfixes/hotfixes.php> .* NOTE: Users will be required to email InduSoft support to acquire the hotfix. The link on the InduSoft Web site will automatically draft an email to Support with a request. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP Web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/ics/content/recommended-practices) . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS\\-CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B—Cyber Intrusion Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* InduSoft-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-249-03)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-0340"
  ],
  "techniques": [],
  "advisory": "icsa-12-249-03",
  "title": "InduSoft ISSymbol ActiveX Control Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "a00cf001336108d202dc5862c41c2777a557f47bd31c6f46d667d43b37523b80"
}