{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: Schneider Electric\nEquipment: SCADAPack Workbench\nVulnerability: Improper Restriction of XML External Entity Reference\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result from exfiltration of data from local files to a remote system controlled by an attacker.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SCADAPack Workbench software are affected:\n\nSCADAPack Workbench Versions 6.6.8a and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nAn improper restriction of XML external entity reference vulnerability exists that could result in information disclosure when opening a malicious solution file provided by an attacker with SCADAPack Workbench. This could be exploited to pass data from local files to a remote system controlled by an attacker.\nCVE-2022-0221 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nkimiya, working with Trend Micro’s Zero Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nSchneider Electric is establishing a remediation plan for all future versions of SCADAPack Workbench that will include a fix for this vulnerability. \nUntil an update is released, users should immediately apply the following mitigations to reduce the risk of exploit:\n\nRun SCADAPack Workbench as a User, not as an Administrator, to minimize the impact of malicious code on the infected system.\nDo not open untrusted files with SCADAPack Workbench.\nProvide training and awareness programs to educate users on the warning signs of a phishing or social engineering attack.\nEmploy data loss prevention tools to help mitigate risk.\nRestrict communication from workstations running SCADAPack Workbench to external systems.\nEnsure the least-privilege user principle is followed, and user/service account access to shared resources (such as a database) is only granted with a minimum number of rights as needed.\n\nFor more information see Schneider Electric’s security notification SEVD-2022-087-01\nFor more information refer to the Schneider Electric Recommended Cybersecurity Best Practices document.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-0221"
  ],
  "techniques": [],
  "advisory": "icsa-22-090-01",
  "title": "Schneider Electric SCADAPack Workbench | CISA",
  "source": "ics-advisories",
  "id": "7fc04f8a1e3c7598ed27ca3e553779e56228fabf523fbfbd47e26cbd06379bb8"
}