{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 4.9\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC PCS 7\nVulnerabilities: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-306-01 Siemens SIMATIC PCS 7 that was published November 2, 2017, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote authenticated attacker to crash services on the devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC PCS 7, a distributed control system, are affected:\n--------- Begin Update 1 Part 1 of 2 --------\n\nv8.1 all versions prior to v8.1 SP1 with WinCC v7.3 Upd 13, and\nv8.2 all versions prior to v8.2 SP1\n\n--------- End Update 1 Part 1 of 2 ----------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nAn authenticated remote attacker who is a member of the administrators group to crash services by sending specially-crafted messages to the DCOM interface. \n \nCVE-2017-6867 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSergey Temnikov and Vladimir Dashchenko of Kaspersky Labs reported the vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has released the following updates:\n\nV8.1: Update to V8.1 SP1 with WinCC V7.3 Upd 13 which can be obtained from:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746452\n--------- Begin Update A Part 2 of 2 --------\n\nv8.2:  Update to v8.2 SP1.  Contact local Siemens support for download and instructions.\n\n--------- End Update A Part 2 of 2 ----------\nSiemens recommends that affected users apply the following mitigations:\n\nApply cell protection concept,\nUse VPN for protecting network communication between cells, and\nApply Defense-in-Depth.\n\nSiemens also strongly recommends that users protect network access to the SIMATIC PCS 7 with appropriate mechanisms by configuring the environment according to operation guidelines that can be found at:\nhttps://support.industry.siemens.com/cs/ww/en/view/60119725\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-523365 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2017-6867"
  ],
  "techniques": [],
  "advisory": "icsa-17-306-01",
  "title": "Siemens SIMATIC PCS 7 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c9aea749aaf4ac29228c24577f8ad631280b5d8a029b3be915c05252b90d27a9"
}