{
  "markdown": " GE Intelligent Platforms Proficy Plant Applications Buffer Overflow \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryGE Intelligent Platforms Proficy Plant Applications Buffer Overflow=================================================================== Last Revised April 20, 2013 Alert Code ICSA\\-11\\-243\\-01Overview-------- ICS CERT originally released Advisory ICSA\\-11\\-243\\-01P on the US\\-CERT secure Portal on August 31, 2011\\. This web page release was delayed to allow users time to download and install the update. ICS\\-CERT has received a report from GE concerning a stack\\-based buffer overflow vulnerability in the GE Intelligent Platform Proficy Plant Applications software suite. ICS\\-CERT has coordinated with GE Intelligent Platforms to validate this vulnerability, and GE has created a patch to address the issue. ICS\\-CERT has validated that the patch fully resolves this issue.Affected Products----------------- This vulnerability affects Proficy Plant Applications (Version 5\\.0 and prior).Impact------ This vulnerability could cause multiple Proficy services to crash and potentially allow an attacker to take control of a system running the affected software. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- According to GE, Proficy Plant Applications suite is an Operations Management software product that is deployed across multiple industries worldwide.Vulnerability Characterization------------------------------### Vulnerability Overview GE reported that a stack\\-based buffer overflow vulnerability exists because of the way that Proficy Plant Applications components process incoming TCP/IP message traffic. This vulnerability affects the following services:* Proficy Server Manager (PRProficyMgr.exe) that listens on Port 12293/TCP by default* Proficy Server Gateway (PRGateway.exe) that listens on Port 12294/TCP by default* Proficy Remote Data Service (PRRDS.exe) that listens on Port 12299/TCP by default* Proficy Server License Manager (PRLicenseMgr.exe) that listens on Port 12401/TCP by default[CVE\\-2011\\-1919](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-1919)  has been assigned to this vulnerability.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable.#### Existence of Exploit No publicly available exploits are known to specifically target this vulnerability.#### Difficulty Exploiting this vulnerability requires a moderate skill set.Mitigation---------- GE Intelligent Platforms has released security advisories and free product updates Software Improvement Modules (SIMs) to address recently reported security vulnerabilities in Proficy software. GE Intelligent Platforms urges all customers to follow the recommendations in the security advisories, which can be found at http://support.ge\\-ip.com/support/index?page\\=kbchannel\\&id\\=S:KB14493\\. A valid GE SSO ID and Customer Service Number are required to access the advisories and updates. ICS\\-CERT and GE recommend that Proficy Plant Applications users update their systems with the latest product updates, listed below:* [Proficy Plant Applications 5\\.0 SIM 43](http://support.ge-ip.com/support/index?page=dwchannel&id=DN3682)* [Proficy Plant Applications 4\\.4\\.1 SIM v10](http://support.ge-ip.com/support/index?page=dwchannel&id=DN3695) Note: According to GE, Proficy SIMs are cumulative. All future SIMs will include these updates. In addition to installing the available updates, ICS\\-CERT recommends that customers using the affected products consider taking the following proactive measures to decrease the likelihood of successful exploitation of this vulnerability.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls with properly configured rules—particularly Ports 12401/TCP, 12293/TCP, 12294/TCP, and 12299/TCP—and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) provides a recommended practices section for control systems security on the CSSP web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* GE-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-243-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-1919"
  ],
  "techniques": [],
  "advisory": "icsa-11-243-01",
  "title": "GE Intelligent Platforms Proficy Plant Applications Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "2cd2b550f93e45c0d6cac9bd6343ccc133b3ff50c3f1169d964d3bc32970d09d"
}