{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: Geutebrück\nEquipment: IP Cameras\nVulnerabilities: Improper Authentication, SQL Injection, Cross-Site Request Forgery, Improper Access Control, Server-Side Request Forgery, Cross-site Scripting\nAFFECTED PRODUCTS\nGeutebrück reports that the vulnerabilities affect the following IP cameras:\n\nG-Cam/EFD-2250 (part n° 5.02024) firmware version 1.12.0.4, and\nTopline TopFD-2125 (part n° 5.02820)  firmware version 3.15.1\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could lead to proxy network scans, access to a database, adding an unauthorized user to the system, full configuration download including passwords, and remote code execution.\nMITIGATION\nGeutebrück recommends G-Cam/EFD-2250 users download and update to the newest firmware version, 1.12.0.19, by registering for a new WebClub account, or by logging into an existing account at the following location:\nhttps://www.geutebrueck.com//en_EN/login.html\nTopline users can visit the previous link for workaround advice and contact information regarding the vulnerabilities associated with the device.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nUnauthentication vulnerabilities have been identified, which may allow remote code execution.\nCVE-2018-7532 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nIMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\n\nAn SQL injection vulnerability has been identified, which may allow an attacker to alter stored data.\nCVE-2018-7528 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n\nCROSS-SITE REQUEST FORGERY (CSRF) CWE-352\n\nA cross-site request forgery vulnerability has been identified, which may allow an unauthorized user to be added to the system.\nCVE-2018-7524 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nIMPROPER ACCESS CONTROL CWE-284\n\nAn improper access control vulnerability has been identified, which could allow a full configuration download, including passwords.\nCVE-2018-7520 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nSERVER-SIDE REQUEST FORGERY (SSRF) CWE-918\n\nA server-side request forgery vulnerability has been identified, which could lead to proxied network scans.\nCVE-2018-7516 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:L).\n\nIMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\n\nA cross-site scripting vulnerability has been identified, which may allow remote code execution.\nCVE-2018-7512 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nRESEARCHER\nDavy Douhine of RandoriSec and Nicolas Mattiocco of Greenlock reported these vulnerabilities to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Energy, Healthcare, Financial Services and Public Health\nCountries/Areas Deployed: Europe, United States, Australia\nCompany Headquarters Location: Windhagen, Germany\n",
  "cves": [
    "CVE-2018-7516",
    "CVE-2018-7532",
    "CVE-2018-7528",
    "CVE-2018-7512",
    "CVE-2018-7524",
    "CVE-2018-7520"
  ],
  "techniques": [],
  "advisory": "icsa-18-079-01",
  "title": "Geutebruck IP Cameras | CISA",
  "source": "ics-advisories",
  "id": "303e589fa5187f48353bb8771931012ddf48463e50b644f9d87ba05503f7cafe"
}