{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.2\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC WinCC and PCS 7\nVulnerability: Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker unauthenticated access to protected files.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects WinCC Graphics Designer used with the following DCS and SCADA products: \n\nSIMATIC PCS 7: All versions\nSIMATIC WinCC: All versions prior to 7.5 SP2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nAn attacker could bypass the password protection of protected files due to an insecure password verification process, which may allow access to protected content without authentication.\nCVE-2020-10048 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nEnrique Murias Fernandez from Tecdesoft Automation reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has released an update for SIMATIC WinCC and recommends updating to the latest version.\n\nSIMATIC WinCC: Update to v7.5 SP2 or later\nSIMATIC PCS 7: WinCC Graphics Designer is not officially supported and not used by PCS 7. Siemens recommends not using this feature and to apply the measures described in SIMATIC PCS 7 Compendium Part F.\n\nSiemens also has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nTailor user privileges to each user’s specific needs (need-to-know principle).\nLimit access to the affected products by implementing strict access control mechanisms.\n\nSiemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor additional information refer to SSA-944678\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-10048"
  ],
  "techniques": [],
  "advisory": "icsa-21-040-09",
  "title": "SIMATIC WinCC Graphics Designer | CISA",
  "source": "ics-advisories",
  "id": "1207e1431bdd52fbe61ae79c41c63b72e3a4cce5799fd74976a32a9c6f48abba"
}