{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.3\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: NX\nVulnerabilities: Out-of-bounds Read, Access of Uninitialized Pointer\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to access violation and arbitrary code execution on the target host system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following NX design software products:\n\nNX 1980 Series: All versions prior to v1984\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing JT files. An attacker could leverage this vulnerability to leak information in the context of the current process.\nCVE-2021-41533 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.2    ACCESS OF UNINITIALIZED POINTER CWE-824\nThe affected application is vulnerable to an out-of-bounds read past the end of an allocated buffer when parsing JT files. An attacker could leverage this vulnerability to leak information in the context of the current process.\nCVE-2021-41534 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nxina1i, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to Siemens and CISA.\n4. MITIGATIONS\nSiemens has released an update for the NX 1980 Series and recommends users update to v1984 or later.\nSiemens recommends users avoid opening untrusted files from unknown sources.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and following the recommendations in the product manuals.\nFor more information about this issue, please see Siemens’ security advisory SSA-740908\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-41533",
    "CVE-2021-41534"
  ],
  "techniques": [],
  "advisory": "icsa-21-315-12",
  "title": "Siemens NX JT Translator | CISA",
  "source": "ics-advisories",
  "id": "f8707a09f7e36dba37bfbac2b46ce61e561c3364e3adddca8b3ac4279918d7a2"
}