{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: MELSEC-Q/L Series and iQ-R Series\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition and/or enable remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of MELSEC-Q Ethernet Interface Module, MELSEC-L Ethernet Interface Module, and MELSEC iQ-R MES Interface Module are affected:\n\nMELSEC-Q Series QJ71E71-100: First five digits of serial number 24061 and prior\nMELSEC-L Series LJ71E71-100: First five digits of serial number 24061 and prior\nMELSEC iQ-R Series RD81MES96N: firmware Version 08 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe affected product is vulnerable to an improper input validation in various web functions, which could allow an attacker to perform remote code execution or cause a denial-of-service condition.\nCVE-2022-25163 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric has fixed this vulnerability in the following products:\n\nMELSEC-Q Series QJ71E71-100: First five digits of serial number 24062 and later\nMELSEC-L Series LJ71E71-100: First five digits of serial number 24062 and later\nMELSEC iQ-R Series RD81MES96N: firmware Version 09 and later\n\nFor more information on how to patch individual systems, please contact Mitsubishi Electric support.\nIf updating to a fixed version is not possible, Mitsubishi Electric recommends users take the following mitigations to minimize risk:\n\nUse a firewall, virtual private network (VPN), web application firewall (WAF), etc. to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-25163"
  ],
  "techniques": [],
  "advisory": "icsa-22-165-03",
  "title": "Mitsubishi Electric MELSEC-Q/L and MELSEC iQ-R | CISA",
  "source": "ics-advisories",
  "id": "f025728f45edb8c04de0daf32c349de075cb105e84f1dd03383ef52ca764f658"
}