{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: MACH System Software\nVulnerabilities: Path Traversal, Exposure of Resource to Wrong Sphere\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to read/write arbitrary files without the proper authorization.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Hitachi Energy products are affected:\n\nMACH SSW: Version 5.0 to 7.17.0.0\nMACH SSW: Version 7.10.0.0 to 7.18.0.0\n\n3.2 Vulnerability Overview\n3.2.1 PATH TRAVERSAL CWE-29\nThe McFeeder server (distributed as part of SSW package), is susceptible to an arbitrary file write vulnerability on the MAIN computer system. This vulnerability stems from the use of an outdated version of a third-party library, which is used to extract archives up-loaded to McFeeder server. An authenticated malicious client can exploit this vulnerability by uploading a crafted ZIP archive via the network to McFeeder's service endpoint.\nCVE-2023-2621 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N).\n3.2.2 INCORRECT PRIVILEGE ASSESSMENT CWE-266\nAuthenticated clients can read arbitrary files on the MAIN Computer system using the remote procedure call (RPC) of the InspectSetup service endpoint. The low privilege client is then allowed to read arbitrary files that they do not have authorization to read.\nCVE-2023-2622 has been assigned to this vulnerability. A CVSS v3.1 base score of 2.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy recommends the following general mitigation workarounds:\nProject recommended security practices and firewall configurations will help protect a process control network from attacks that originate from outside of the network. Such practices include that process control systems have no direct connections to the Internet; are physically protected from direct access by unauthorized personnel and are separated from other networks by means of a firewall system that has a required number of ports opened, security logs enabled, and others that have to be evaluated case by case. Process control systems should not be used for internet surfing, instant messaging, or receiving emails. Portable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\nDue to complexity of individual implementation of project, contact local account team for further information on possible upgrades.\nFor more information, please visit Hitachi Energy's advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nNovember 16, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-2621",
    "CVE-2023-2622"
  ],
  "techniques": [],
  "advisory": "icsa-23-320-02",
  "title": "Hitachi Energy MACH System Software | CISA",
  "source": "ics-advisories",
  "id": "077cde51d01eebfa82131fe6f7dd721d1364ec6933b3edd0730378d761a03cbc"
}