{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.9\nATTENTION: Exploitable remotely\nVendor: Hitachi Energy\nEquipment: MACH SCM\nVulnerabilities: Improper Control of Generation of Code, Improper Neutralization of Directives in Dynamically Evaluated Code\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in an execution of arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of MACH SCM, are affected:\n\nMACH SCM: Versions 4.0 to 4.5.x\nMACH SCM: Versions 4.6 to 4.38\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER CONTROL OF GENERATION OF CODE CWE-94\nSCM Software is a client and server application. An Authenticated System manager client can execute LINQ query in the SCM server, for customized filtering. An Authenticated malicious client can send a specially crafted code to skip the validation and execute arbitrary code (RCE) on the SCM Server remotely. Malicious clients can execute any command by using this RCE vulnerability.\nCVE-2024-0400 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-0400. A base score of 8.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:H/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:L).\n3.2.2 IMPROPER NEUTRILIZATION OF DIRECTIVES IN DYNAMICALLY EVALUATED CODE CWE-95\nAuthenticated List control client can execute the LINQ query in SCM Server to present event as list for operator. An authenticated malicious client can send special LINQ query to execute arbitrary code remotely (RCE) on the SCM Server that an attacker otherwise does not have authorization to do.\nCVE-2024-2097 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H ).\nA CVSS v4 score has also been calculated for CVE-2024-2097. A base score of 8.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:H/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:H/SA:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy has released the following mitigation for CVE-2024-2097:\n\nMACH SCM: Versions 4.6 to 4.38: Upgrade to MACH SCM Version 4.38.1\n\nUntil the updates are made available, Hitachi Energy recommends the following general mitigation factors/workarounds for the products with MACH SCM Versions 4.0 to 4.5.x to address the vulnerability CVE-2024-0400:\nRecommended security practices and firewall configurations can help protect a process control network from attacks originating from outside the network including:\n\nPhysically protect process control systems from direct access by unauthorized personnel.\nDo not allow process control systems direct connections to the Internet.\nSeparate process control systems from other networks by means of a firewall system that has a minimal number of ports exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving emails.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nFor more information, see Hitachi Energy's Security Advisories:\n\nRCE Vulnerabilities in Hitachi Energy's MACH SCM Product\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities have a high attack complexity.\n5. PUBLICATION HISTORY\n\nApril 25, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-0400",
    "CVE-2024-2097"
  ],
  "techniques": [],
  "advisory": "icsa-24-116-02",
  "title": "Hitachi Energy MACH SCM | CISA",
  "source": "ics-advisories",
  "id": "8d23f6b949cf34e5f49553411afbc4a49297413d49ae7a4bd8a774656af90634"
}