{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity/public exploits are available\nVendor: Hitachi Energy\nEquipment: Lumada Asset Performance Management (APM) Edge\nVulnerabilities: Out-of-Bounds Write and Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow users to escalate privileges from a user account to root.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of APM are affected: \n\nLumada APM Edge Version 1.0\nLumada APM Edge Version 2.0\nLumada APM Edge Version 3.0\nLumada APM Edge Version 4.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to a privilege escalation attack, which could allow an attacker to escalate a user account to root. \nCVE-2021-4034 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER AUTHENTICATION CWE-287\nThe affected product is vulnerable to a privilege escalation attack, which could allow an attacker to bypass the namespace isolation unexpectedly.\nCVE-2022-0492 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nWhen applicable, Hitachi Energy recommends users update to Lumada APM Edge v6.3 at the earliest convenience. \nHitachi Energy recommends the following security practices and firewall configurations to help protect a network from attacks originating outside the network:\n\nPhysically protect process control systems from unauthorized direct access.\nEnsure process control systems have no direct connections to the internet.\nUse firewall systems to separate process control systems from other networks.\nEnsure the firewall system only has necessary ports exposed.\n\nAPM should only be used to access the internet for authorized information. Portable computers and removable storage media should be carefully scanned for viruses before connecting to a control system.\nFor more information, see Hitachi Energy advisory 8DBD000115.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nThis vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-0492",
    "CVE-2021-4034"
  ],
  "techniques": [],
  "advisory": "icsa-22-270-02",
  "title": "Hitachi Energy APM Edge | CISA",
  "source": "ics-advisories",
  "id": "b838db4bd1c11108ac8d6b34219cd7d869253fe5eba5701cf212462f6fe21a42"
}