{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Delta Electronics\nEquipment: DOPSoft\nVulnerabilities: Out-of-bounds Write, Untrusted Pointer Dereference\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow arbitrary code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DOPSoft, a software that supports the DOP-100 series HMI screens, are affected:\n\nDOPSoft Version 4.0.8.21 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to an out-of-bounds write while processing project files, which may allow an attacker to execute arbitrary code.\nCVE-2020-27275 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    UNTRUSTED POINTER DEREFERENCE CWE-822\nThe affected product has a null pointer dereference issue while processing project files, which may allow an attacker to execute arbitrary code.\nCVE-2020-27277 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nKimiya, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nDelta Electronics has released an updated version DOPSoft, and recommends users install this update on all affected systems. Delta Electronics recommends the following mitigations:\n\nUpdate to the latest version of DOPSoft v4.00.10.17 or higher.\nUse DOPSoft v4.00.10.17 to open old project files (*.dpa) then save as new files. Following that, use the new saved project files and discard the old ones.\nRestrict interaction of the application with trusted files.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-27275",
    "CVE-2020-27277"
  ],
  "techniques": [],
  "advisory": "icsa-21-005-05",
  "title": "Delta Electronics DOPSoft | CISA",
  "source": "ics-advisories",
  "id": "b0888362b91d3a0f73b7e864126634e67065e1475d4c0357ecc3ecf0beecd1e0"
}