{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/Low skill level to exploit\nVendor: Rockwell Automation\nEquipment: FactoryTalk Linx\nVulnerabilities: Improper Input Validation, Heap-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a denial-of-service condition, remote code execution, or leak information that could be used to bypass address space layout randomization (ASLR).\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of FactoryTalk Linx are affected:\n\nFactoryTalk Linx: Version 6.11 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nA flaw exists in the Ingress/Egress checks routine of FactoryTalk Linx. This vulnerability could allow a remote, unauthenticated attacker to specifically craft a malicious packet resulting in a denial-of-service condition on the device.\nCVE-2020-27253 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap overflow vulnerability exists within FactoryTalk Linx. This vulnerability could allow a remote, unauthenticated attacker to send malicious port ranges, which could result in remote code execution. \nCVE-2020-27251 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap overflow vulnerability exists within FactoryTalk Linx. This vulnerability could allow a remote, unauthenticated attacker to send malicious set attribute requests, which could result in the leaking of sensitive information. This information disclosure could lead to the bypass of address space layout randomization (ASLR). \nCVE-2020-27255 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov of Claroty reported these vulnerabilities to Rockwell Automation PSIRT.\n4. MITIGATIONS\nRockwell Automation recommends users of the affected FactoryTalk Linx update to an available software revision that addresses the associated risk. \n\nFactoryTalk Linx v6.10/6.11 (see Patch Answer ID 1126433). Additionally, the user could move to v6.20, which is available on PCDC (login required).\n\nRockwell Automation recommends users who are unable to update the following mitigations or workarounds to further reduce risk. Users are encouraged, when possible, to combine these with general security guidelines to employ multiple strategies simultaneously:\n\nRun all software as “user” (not as “administrator”) to minimize the impact of malicious code on the infected system. \nUse of Microsoft AppLocker or other similar whitelisting application can help mitigate risk. Information on using AppLocker with Rockwell Automation products is available at Knowledgebase Article ID 546989 (login required).\nConfirm that the least-privilege user principle is followed, and user/service account access to shared resources (such as a database) is only granted with a minimum amount of rights as needed. \nUse trusted software, software patches, antivirus/antimalware programs, and interact only with trusted websites and attachments.\nMinimize network exposure for all control system devices and/or systems and confirm that they are not accessible from the Internet. For further information about the risks of unprotected Internet-accessible control systems, please see Knowledgebase Article ID 494865 (login required).\nLocate control system networks and devices behind firewalls and isolate them from the business network. \nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. \n\nFor more information refer to Rockwell’s Industrial Security Advisory ID 1128684 (login required).\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-27255",
    "CVE-2020-27253",
    "CVE-2020-27251"
  ],
  "techniques": [],
  "advisory": "icsa-20-329-01",
  "title": "Rockwell Automation FactoryTalk Linx | CISA",
  "source": "ics-advisories",
  "id": "68b82728d99071f8d9ca1ee2a206b7469445b10dbe1c6be56e3979c8fbff8aec"
}