{
  "markdown": "\nCVSS v3 10.0\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Sierra Wireless\nEquipment: AirLink Raven XE and XT\nVulnerabilities: Improper Authorization, Cross-Site Request Forgery, Insufficiently Protected Credentials\nREPOSTED INFORMATION\nThis advisory is a follow-up to the alert titled ICS-ALERT-16-182-01 Sierra Wireless AirLink Raven XE and XT Gateway Vulnerabilities that was published June 30, 2016, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following Sierra Wireless gateways are affected:\n\nAirLink Raven XE, all versions prior to 4.0.14, and\nAirLink Raven XT, all versions prior to 4.0.11.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow a remote attacker to perform unauthorized sensitive functions compromising the confidentiality, integrity, and availability of the affected system.\nMITIGATION\nSierra Wireless has released new firmware versions to address the forced browsing and cross-site request forgery vulnerabilities. Sierra Wireless reports that the insufficiently protected credentials vulnerability will not be addressed.\nSierra Wireless’s Raven XE firmware Version 4.0.14, is available at the following location:\nhttps://source.sierrawireless.com/resources/airlink/software_downloads/nucaleos/raven-xe-firmware-list/\nSierra Wireless’s Raven XT firmware Version 4.0.11, is available at the following location:\nhttps://source.sierrawireless.com/resources/airlink/software_downloads/nucaleos/raven-xt-firmware-list/\nSierra Wireless has released a Technical Bulletin, which is available at the following location:\nhttps://source.sierrawireless.com/resources/airlink/software_reference_docs/raven-ics-alert-16-182-01/\nFor additional information about these vulnerabilities or the recommendations provided, please contact Sierra Wireless’ security team at:\nsecurity@sierrawireless.com\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHORIZATION CWE-285\n\nSeveral files and directories can be accessed without authentication, which may allow a remote attacker to perform sensitive functions including arbitrary file upload, file download, and device reboot.\nCVE-2017-6044 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n\nCROSS-SITE REQUEST FORGERY (CSRF) CWE-352\n\nAffected devices do not verify if a request was intentionally sent by the logged-in user, which may allow an attacker to trick a client into making an unintentional request to the web server that will be treated as an authentic request.\nCVE-2017-6042 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n\nINSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\n\nSensitive information is insufficiently protected during transmission and vulnerable to sniffing, which could lead to information disclosure.\nCVE-2017-6046 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\nRESEARCHER\nIndependent researcher Karn Ganeshen identified and publicly released vulnerabilities in the Sierra Wireless AirLink Raven XE and XT Gateways prior to coordinating with ICS-CERT; however, the researcher did initially coordinate the identified vulnerabilities with the vendor.\nBACKGROUND\nCritical Infrastructure Sector(s): Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: British Columbia, Canada\n",
  "cves": [
    "CVE-2017-6044",
    "CVE-2017-6042",
    "CVE-2017-6046"
  ],
  "techniques": [],
  "advisory": "icsa-17-115-02",
  "title": "Sierra Wireless AirLink Raven XE and XT | CISA",
  "source": "ics-advisories",
  "id": "2377f9cefc466b964d15a67da38a0b4359b849be3881074c5e8a03f34a201363"
}