{
  "markdown": "\nOVERVIEW\nResearcher rgod working with Zero Day Initiative (ZDI) has identified an information disclosure, a directory traversal, and a privilege escalation vulnerability in Advantech’s SUSIAccess Server. Advantech has produced new software to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following SUSIAccess Server versions are affected:\n\nSUISAccess Server Version 3.0 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may result in file manipulation or arbitrary code execution.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nAdvantech is a Taiwan-based company with distribution offices in 21 countries worldwide.\nThe affected product, SUSIAccess Server, is a platform as a service (PaaS) for cloud and Internet of Things (IoT) devices. According to Advantech, SUSIAccess Server is deployed across several sectors including Commercial Facilities, Critical Manufacturing, Energy, and Government Facilities. Advantech estimates that this product is used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nINFORMATION EXPOSURECWE-200:Information Exposure, https://cwe.mitre.org/data/definitions/200.html, web site last accessed December 01, 2016.\n\nAn attacker could traverse the file system and extract files that can result in information disclosure.\nCVE-2016-9349NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9349, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N, web site last accessed December 01, 2016.\n\nPATH TRAVERSALCWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal'), https://cwe.mitre.org/data/definitions/22.html, web site last accessed December 01, 2016.\n\nThe directory traversal/file upload error allows an attacker to upload and unpack a zip file.\nCVE-2016-9351NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9351, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:L/UI:R/S:C/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:H/PR:L/UI:R/S:C/C:H/I:H/A:H, web site last accessed December 01, 2016.\n\nPERMISSIONS, PRIVILEGES, AND ACCESS CONTROLSCWE-264: Permissions, Privileges, and Access Controls, https://cwe.mitre.org/data/definitions/264.html, web site last accessed December 01, 2016.\n\nThe admin password is stored in the system and is encrypted with a static key hard-coded in the program. Attackers could reverse the admin account password for use.\nCVE-2016-9353NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9353, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H, web site last accessed December 01, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nAdvantech no longer supports “SUSIAccess.” They have developed “WISE-PaaS/RMM” to replace it. To coordinate the purchase of the new software, users should contact Advantech at:\nhttp://www.advantech.com/contact/inquiryrequestform?subject=price%2band%2bquotation\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-9349",
    "CVE-2016-9353",
    "CVE-2016-9351"
  ],
  "techniques": [],
  "advisory": "icsa-16-336-04",
  "title": "Advantech SUSIAccess Server Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "b1db45835e6e223f0c58e70a6337ac049b3688970afbd890b97d8a03168f6ce1"
}