{
  "markdown": "\nOverview\nThis advisory provides mitigation details for a vulnerability that impacts the Siemens Automation License Manager (ALM).\nSiemens ProductCERT has identified an uncontrolled resource consumption vulnerabilitySSA-783261, https://cert-portal.siemens.com/productcert/pdf/ssa-783261.pdf, Web site last accessed October 13, 2021. in the Siemens ALM, which is used for license management by various Siemens software products. Siemens has produced a software update that fully resolves this vulnerability. Exploitation of this vulnerability would allow loss of availability of the system.\nAffected Products\nAll Siemens software products that include ALM version between 4.0 and 5.2 are affected. The following Siemens product families are affected:\n\nSIMATIC (e.g., STEP 7)\nSIMATIC HMI (e.g., WinCC, WinCC flexible)\nSIMATIC PCS 7\nSIMOTION (e.g., Scout)\nSIMATIC NET\nSINAMICS (e.g., Starter)\nSIMOCODE.\n\nImpact\nAttackers could exploit the vulnerability to cause memory leakage within the software. This exploit could eventually lead to a crash of the application. The DoS of the ALM could lead to a DoS of associated devices that use the ALM to verify active licenses.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nSiemens is a multinational company headquartered in Munich, Germany. Siemens develops products mainly in the energy, transportation, and healthcare sectors.\nALM centrally manages licenses for various Siemens software products. The products contact ALM either locally or remotely to verify their license using a proprietary protocol. To enable this license verification, ALM listens on Port 4410/TCP by default. These products are deployed across several sectors including energy, healthcare, and others worldwide.\nVulnerability Characterization\nVulnerability Overview\nUncontrolled Resource ConsumptionCWE, http://cwe.mitre.org/data/definitions/400.html, CWE-400: Uncontrolled Resource Consumption (“Resource Exhaustion”), Web site last accessed December 14, 2012.\nAn attacker can send maliciously crafted packets to Port 4410/TCP, which will cause a memory leakage and uncontrolled resource consumption, leading to a DoS.\nCVE-2012-4691 has been assigned to this vulnerability. A CVSS v2 base score of 7.8 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:N/A:C).\nVulnerability Details\nExploitability\nThis vulnerability could be exploited remotely.\nExistence of Exploit\nNo known public exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a low skill would be able to exploit this vulnerability.\nMitigation\nSiemens has provided an update that resolves this vulnerability. The update can be applied to all versions of ALM starting with version 4.0. Siemens recommends that asset owners and operators can contact Siemens customer support to acquire the update.\nSiemens recommends blocking traffic to Port 4410/TCP from external and remote connections.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the US-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01A—Cyber Intrusion Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2012-4691"
  ],
  "techniques": [],
  "advisory": "icsa-12-349-01",
  "title": "Siemens Automation License Manager Uncontrolled Resource Consumption | CISA",
  "source": "ics-advisories",
  "id": "cb6085db30d4eba7d7a3829aa205ae0c53b74901377700a7ad499de1e28508ce"
}