{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Emerson\nEquipment: WirelessHART Gateway\nVulnerabilities: Missing Authentication for Critical Function, Improper Input Validation, Improper Limitation of a Pathname to a Restricted Directory, Write-what-where Condition, Improper Neutralization of Special Elements used in an OS Command, Exposure of Sensitive Information to an Unauthorized Actor \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities by an authenticated user can allow root level arbitrary write permission, which can lead to remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Emerson WirelessHART Gateway network communication devices are affected:\n\nWirelessHART 1410 Gateway: All versions prior to v4.7.94\nWirelessHART 1410D Gateway: All versions prior to v4.7.94\nWirelessHART 1420 Gateway: All versions prior to v4.7.94\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product is vulnerable to a missing permission validation on system backup restore, which could lead to account take over and unapproved settings change.\nCVE-2021-42539 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER INPUT VALIDATION CWE-20\nThe affected product is vulnerable to improper input validation in the restore file. This enables an attacker to provide malicious config files to replace any file on disk.\nCVE-2021-38485 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY CWE-22\nThe affected product is vulnerable to directory traversal due to mishandling of provided backup folder structure.\nCVE-2021-42542 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    WRITE-WHAT-WHERE CONDITION CWE-123\nThe affected product is vulnerable to a unsanitized extract folder for system configuration. A low-privileged user can leverage this logic to overwrite the settings and other key functionality.\nCVE-2021-42540 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.5    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND CWE-78\nThe affected product is vulnerable to a parameter injection via passphrase, which enables the attacker to supply uncontrolled input.\nCVE-2021-42538 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.6    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe affected product is vulnerable to a disclosure of peer username and password by allowing all users access to read global variables.\nCVE-2021-42536 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAmir Preminger of Claroty reported these vulnerabilities to CISA.\n4. MITIGATIONS\nEmerson recommends upgrading to v4.7.105 to address these vulnerabilities.\nUsers can visit the Emerson Gate Firmware site for and download instructions.\nIf affected users do not yet have a free Guardian account, please see the updated Emerson Gateway Firmware download process by following the link above and viewing the download guide.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-42539",
    "CVE-2021-42540",
    "CVE-2021-42542",
    "CVE-2021-38485",
    "CVE-2021-42538",
    "CVE-2021-42536"
  ],
  "techniques": [],
  "advisory": "icsa-21-278-02",
  "title": "Emerson WirelessHART Gateway | CISA",
  "source": "ics-advisories",
  "id": "aae7f88e61e617d256359215d2755b0ecdf2549e2a1e941af3d19fc0c64dabe0"
}