{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v7.0\n\nVendor: ABB\nEquipment: CP400 Panel Builder TextEditor 2.0\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to execute arbitrary code, and cause a denial-of-service condition within the Text Editor application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the CP400PB, a Control Panel Software Suite, are affected:\n\nCP400PB, Panel Builder for CP405 and CP408, Versions 2.0.7.05 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe application contains a vulnerability in the file parser of the Text Editor wherein the application doesn’t properly prevent the insertion of specially crafted files.\nCVE-2018-19008 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nIvan Sanchez of NullCode reported this vulnerability to NCCIC.\n4. MITIGATIONS\nABB recommends users of affected Versions 2.0.7.05 and prior update to the latest Version 2.1.7.21, which can be requested at the following location:\nhttps://new.abb.com/products/ABB1SAP500400R0001\nFor additional information, see the ABB advisory ABBVU-IACT-3BSE091042 at the following location:\nSECURITY - CP400 Panel Builder TextEditor 2.0, Improper input validation vulnerability ABBVU-IACT-3BSE091042\nABB also recommends the following security practices and firewall configurations to protect process control networks from attacks that originate from outside the network:\n\nConduct or reinforce cybersecurity awareness training for users.\nFollow general cybersecurity best practice recommendations for industrial control systems.\nBe aware that it is possible to infect Panel Builder files with malware.\nBe careful with files that are received unexpectedly and/or from unexpected sources.\nCarefully inspect any files transferred between computers, scan them with up-to-date antivirus software, so that only legitimate files are transferred.\nManage user accounts following the principle of least privilege.\n\nMore information on recommended practices can be found in ABB’s Security for Industrial Automation and Control Systems paper - 3BSE032547.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-19008"
  ],
  "techniques": [],
  "advisory": "icsa-19-017-02",
  "title": "ABB CP400 Panel Builder TextEditor 2.0 | CISA",
  "source": "ics-advisories",
  "id": "1806a94f8fa46d83a738d25139328069eaa0139af8cdfd928ccdf485386304b9"
}