{
  "markdown": "\nOVERVIEW\nKarsten Sohr, Bernhard Berger, and Kai Hillmann from the TZI-Bremen, Kim Schlyter, Seyton Bradford, and Richard Warren from FortConsult, and Stefan Schuhmann have identified vulnerabilities in the Siemens SPCanywhere mobile application. Siemens has produced a new mobile application called SPC Connect that mitigates this vulnerability.\nSome of these vulnerabilities could be exploited remotely; others require local access.\nAFFECTED PRODUCTS\nThe following SPCanywhere versions are affected:\n\nSPCanywhere Android Application: All versions, and\nSPCanywhere iOS Application: All versions.\n\nIMPACT\nAn attacker exploiting these vulnerabilities may be able to capture or modify privileged information, inject code, or bypass access control.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSiemens is a multinational company headquartered in Munich, Germany.\nThe affected product, SPCanywhere is a mobile application that allows users to access Siemens SPC intrusion alarm systems remotely via mobile phone. It allows users to view and control several sites, enable or disable SPC intrusion alarm systems, open doors, control outputs, and check the status of the installation. According to Siemens, SPCanywhere is deployed primarily in building automation. Siemens estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nMISSING ENCRYPTION OF SENSITIVE DATACWE-311: Missing Encryption of Sensitive Data, http://cwe.mitre.org/data/definitions/311.html, web site last accessed March 05, 2015.\n\nThe affected mobile application performs unencrypted system ID to IP address lookups. This could allow attackers to obtain the IP address of an intrusion alarm system and to redirect users if the attacker has a privileged network position. This vulnerability affects the Android and iOS version of SPCanywhere.\nCVE-2015-1595NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-1595, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 4.3 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:P/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:P/I:N/A:N, web site last accessed March 05, 2015.\n\nMISSING ENCRYPTION OF SENSITIVE DATACWE-311: Missing Encryption of Sensitive Data, http://cwe.mitre.org/data/definitions/311.html, web site last accessed March 05, 2015.\n\nImproper SSL certificate validation could allow an attacker to capture or modify data in sessions protected with SSL/TLS if the attacker has a privileged network position. This vulnerability affects the Android and iOS version of SPCanywhere.\nCVE-2015-1596NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-1596, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 5.8 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:P/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:P/I:P/A:N, web site last accessed March 05, 2015.\n\nIMPROPER CROSS-BOUNDARY REMOVAL OF SENSITIVE DATACWE-212: Improper Cross-boundary Removal of Sensitive Data, http://cwe.mitre.org/data/definitions/212.html, web site last accessed March 05, 2015.\n\nUnencrypted code loading could allow attackers to inject code and to perform actions on the mobile device based on the applications privileges. An attacker requires a privileged network position to exploit this vulnerability. This vulnerability affects the Android version of SPCanywhere.\nCVE-2015-1597NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-1597, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:N/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:P/I:P/A:P, web site last accessed March 05, 2015.\n\nSTORING PASSWORDS IN A RECOVERABLE FORMATCWE-257: Storing Passwords in a Recoverable Format, http://cwe.mitre.org/data/definitions/257.html, web site last accessed March 05, 2015.\n\nThe existing storage mechanism for the application specific password could allow attackers with physical access to the mobile device to extract the password. This vulnerability affects the Android version of SPCanywhere.\nCVE-2015-1598NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-1598, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 4.6 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:N/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:N/C:P/I:P/A:P, web site last accessed March 05, 2015.\n\nAUTHENTICATION BYPASS USING AN ALTERNATE PATHCWE-288: Authentication Bypass Using an Alternate Path or Channel, http://cwe.mitre.org/data/definitions/288.html, web site last accessed March 05, 2015.\n\nThe existing file system architecture could allow attackers to bypass the access control of SPCanywhere if an attacker has physical access. This vulnerability affects the iOS version of SPCanywhere.\nCVE-2015-1599NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-1599, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 2.1 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:N/C:N/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:N/C:N/I:P/A:N, web site last accessed March 05, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nSome of these vulnerabilities could be exploited remotely, others require local access.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit some of these vulnerabilities, others require more skill.\nMITIGATION\nSiemens has released a new solution which includes a new portal, the new firmware update for controller devices, and a new mobile application SPC Connect for Android and iOS. The new solution fixes all of the vulnerabilities listed above.  Siemens strongly recommends that all users migrate to the new solution.\nFor a smooth transition, SPCanywhere will continue to be available in the mobile application stores for a few more months. It will then be removed from the Apple App Store and Google Play Store.\nThe new app SPC Connect for Android can be obtained via Google’s Play Store:\nhttps://play.google.com/store/apps/details?id=com.siemens.spcconnect\nThe new app SPC Connect for iOS can be obtained via Apple’s App Store:\nhttps://itunes.apple.com/app/id948318844\nFurther information on the new solution SPC Connect can be found here:\nhttp://www.spcconnect.com\nRegistered users can obtain the new controller firmware version from:\nhttps://is.spiap.com/products/intrusion/spc/centrales.html\nFor more information on these vulnerabilities and detailed instructions, please see Siemens Security Advisory SSA-185226 at the following location:\nhttp://www.siemens.com/cert/advisories\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed March 05, 2015. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed March 05, 2015. for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2015-1598",
    "CVE-2015-1599",
    "CVE-2015-1596",
    "CVE-2015-1597",
    "CVE-2015-1595"
  ],
  "techniques": [],
  "advisory": "icsa-15-064-05",
  "title": "Siemens SPCanywhere App Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "41b70ebf1b3f7c6ed7bb60c48d67a11bb73d6392404ff8be69f86196ef7fd758"
}