{
  "markdown": "\nOVERVIEW\nThis advisory provides mitigation details for a vulnerability affecting the Alstom Grid MiCOM S1 Agile and S1 Studio Software.\nNote: Alstom Grid MiCOM S1 Studio Software is its own software suite. A user could have MiCOM S1 Studio Software from a different vendor. This advisory only addresses the Alstom software product.\nAlstom has identified an improper authorization vulnerability in the Alstom Grid MiCOM S1 Agile Software. Alstom has produced an update that mitigates this vulnerability. Alstom has tested the update to validate that it resolves the vulnerability.\nAFFECTED PRODUCTS\nThe following Alstom Grid products are affected:\n\nMiCOM S1 Agile Software, all versions up to and including v1.0.2, and\nLegacy MiCOM S1 Studio Software, all versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker with read/modify user permissions for the MiCOM S1 file system to affect the availability of the application. Unauthorized attackers can then access the MiCOM S1 executable files. This vulnerability can affect products deployed in the energy, dams, healthcare and public health, water, chemical, and commercial facilities.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS‑CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nAlstom Grid is a global company that maintains offices in several countries around the world, including the US, UK, Canada, Italy, India, Brazil, France, Russia, Saudi Arabia, United Arab Emirates and Singapore.\nThe affected products, Alstom Grid MiCOM S1 Agile and Studio Software, allows users to configure Alstom Grid’s range of protective relays. According to Alstom, MiCOM S1 Software is deployed across the energy sector.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER ACCESS CONTROLCWE-284: Improper Access Control,  http://cwe.mitre.org/data/definitions/284.html, Web site last accessed July 03, 2013.\n\nThe MiCOM S1 Software does not limit user access to its installed executables to only authenticated administrative users. A malicious user with any level of access to the local system could replace executables within the MiCOM S1 Program Files directory with malicious files. When the MiCOM S1 application is run, the malicious executable would be run instead. Successful exploitation of this vulnerability could cause loss of availability, integrity, and confidentiality with the local system and a disruption in communications with other connected devices.\nIn addition, a Windows Service running under LocalSystem is located within this directory as well. Replacing the associated executable, in this case, would allow lower privileged users to escalate their privileges to an administrator level on the system.\nCVE-2013-2786NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2013-2786, NIST uses this advisory to create the CVE Web site report. This Web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 6.0 has been assigned; the CVSS vector string is (AV:L/AC:H/Au:S/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:H/Au:S/C:C/I:C/A:C, Web site last accessed July 03, 2013.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not exploitable remotely and cannot be exploited without access to the local system by an authorized user.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a high skill would be able to exploit this vulnerability.\nMITIGATION\nAlstom has released MiCOM S1 Agile version v1.0.3 that mitigates the vulnerability by controlling which users can access MiCOM S1 Agile files and services.\nThe update can be obtained through the Alstom Grid Contact Centre at: contact.centre@alstom.com or by phone at: +44 1785 25 0070.\nICS CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n• Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.• Locate control system networks and remote devices behind firewalls, and isolate them from the business network.• When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.  ICS CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS CERT Technical Information Paper, ICS-TIP-12-146-01B—Targeted Cyber Intrusion Detection and Mitigation Strategies,  that is available for download from the ICS-CERT Web page (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2013-2786"
  ],
  "techniques": [],
  "advisory": "icsa-13-184-01",
  "title": "Alstom Grid S1 Agile Improper Authorization | CISA",
  "source": "ics-advisories",
  "id": "b0d947dff55848d17d41a7531ca3eff7da653232f6f4690d1b3c50232d6ca469"
}