{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.8\n\nATTENTION: Low skill level to exploit\nVendor: AVEVA\nEquipment: Wonderware System Platform\nVulnerability: Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nThis vulnerability could allow unauthorized access to the credentials for the ArchestrA Network User Account.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Wonderware System Platform, a unifying supervisory platform, are affected:\n\nWonderware System Platform 2017 Update 2 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nWonderware System Platform uses an ArchestrA network user account for authentication of system processes and inter-node communications. A user with low privileges could make use of an API to obtain the credentials for this account.\nCVE-2019-6525 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nVladimir Dashchenko from Kaspersky Lab reported this vulnerability to AVEVA.\n4. MITIGATIONS\nAVEVA recommends users using Wonderware System Platform 2017 Update 2 and prior should upgrade to System Platform 2017 Update 3 as soon as possible. This update can be downloaded from the following location (login required):\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=52332\nAVEVA has published Security Bulletin LFSEC00000135. It can be found at the following location:\nhttps://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityBulletin_LFSec135.pdf\nAVEVA recommends that users secure industrial control systems according to NIST SP 800-82 Rev. 2:\nhttps://csrc.nist.gov/publications/detail/sp/800-82/rev-2/final\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-6525"
  ],
  "techniques": [],
  "advisory": "icsa-19-029-03",
  "title": "AVEVA Wonderware System Platform | CISA",
  "source": "ics-advisories",
  "id": "494f21536e6c7d36d642e500d6a4800b9e9801ee7c66c727676d3f9c36c3893f"
}