{
  "markdown": "\n​​As of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). \n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Parasolid and Teamcenter Visualization\nVulnerabilities: NULL Pointer Dereference, Out-of-bounds Read, Out-of-bounds Write, Allocation of Resources without Limits or Throttling\n\n2. RISK EVALUATION\nAn attacker could successfully exploit these vulnerabilities by tricking a user into opening a malicious file, allowing the attacker to cause a denial of service or perform remote code execution in the context of the current process.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports that the following products are affected:\n\nParasolid V34.1: versions prior to V34.1.258\nParasolid V35.0: versions prior to V35.0.254\nParasolid V35.1: versions prior to V35.1.171\nParasolid V35.1: versions prior to V35.1.197\nParasolid V35.1: versions prior to V35.1.184\nTeamcenter Visualization V14.1: all versions\nTeamcenter Visualization V14.2: versions prior to V14.2.0.6\nTeamcenter Visualization V14.3: all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 NULL POINTER DEREFERENCE CWE-476\nThe affected applications contain null pointer dereference while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38524 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L).\n3.2.2 OUT-OF-BOUNDS READ CWE-125\nThe affected applications contain an out-of-bounds read past the end of an allocated structure while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38525 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3 OUT-OF-BOUNDS READ CWE-125\nThe affected applications contain an out-of-bounds read past the end of an allocated structure while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38526 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4 OUT-OF-BOUNDS READ CWE-125\nThe affected applications contain an out-of-bounds read past the end of an allocated structure while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38527 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.5 OUT-OF-BOUNDS READ CWE-125\nThe affected applications contain an out-of-bounds read past the end of an allocated structure while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38529 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.6 OUT-OF-BOUNDS READ CWE-125\nThe affected applications contain an out-of-bounds read past the end of an allocated structure while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38530 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.7 OUT-OF-BOUNDS READ CWE-125\nThe affected applications contain an out-of-bounds read past the end of an allocated structure while parsing specially crafted X_T files. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38531 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.8 OUT-OF-BOUNDS WRITE CWE-787\nThe affected application contains an out-of-bounds write past the end of an allocated buffer while parsing a specially crafted X_T file. This could allow an attacker to execute code in the context of the current process.\nCVE-2023-38528 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.9 ALLOCATION OF RESOURCES WITHOUT LIMITS OR THROTTLING CWE-770\nThe affected application contains a stack exhaustion vulnerability while parsing a specially crafted X_T file. This could allow an attacker to cause denial of service condition.\nCVE-2023-38532 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens released updates for several affected products and recommends updating to the latest versions. Siemens is preparing further updates for Teamcenter Visualization V14.1 and V14.3; fixes are planned for the next patch release:\n\nParasolid V34.1: Update to V34.1.258 or later version.\nParasolid V35.0: Update to V35.0.254 or later version.\nParasolid V35.1: Update to V35.1.171 or later version.\nParasolid V35.1: Update to V35.1.197 or later version.\nParasolid V35.1: Update to V35.1.184 or later version.\nTeamcenter Visualization V14.2: Update to V14.2.0.6 or later version.\n\nSiemens identified the following specific workaround/mitigation users can apply to reduce risk: \n\n\nDo not open untrusted X_T files in Parasolid or Teamcenter Visualization.\n\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens' operational guidelines for industrial security and following recommendations in the product manuals. Additional information on Siemens industrial security can be found on the Siemens industrial security webpage.\nFor further inquiries on security vulnerabilities in Siemens products and solutions, please contact the Siemens ProductCERT.\nFor more information, see the associated Siemens security advisory SSA-407785 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. These vulnerabilities have low attack complexity.\n",
  "cves": [
    "CVE-2023-38525",
    "CVE-2023-38527",
    "CVE-2023-38528",
    "CVE-2023-38529",
    "CVE-2023-38526",
    "CVE-2023-38532",
    "CVE-2023-38524",
    "CVE-2023-38531",
    "CVE-2023-38530"
  ],
  "techniques": [],
  "advisory": "icsa-23-222-06",
  "title": "Siemens Parasolid and Teamcenter Visualization | CISA",
  "source": "ics-advisories",
  "id": "e1a3fdd450b9646dc418e14b563cab7d8ca8b7095e4b7018b4b1f04585d2f980"
}