{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.7\nATTENTION: Low attack complexity\nVendor: Lantronix\nEquipment: XPort\nVulnerability: Weak Encoding for Password\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain credentials.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of XPort, a device server configuration manager, are affected:\n\nXPort Device Server Configuration Manager: Version 2.0.0.13\n\n3.2 Vulnerability Overview\n3.2.1 Weak Encoding for Password CWE-261\nLantronix XPort sends weakly encoded credentials within web request headers.\nCVE-2023-7237 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Healthcare, Transportation\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nAarón Flecha Menéndez of S21Sec reported this vulnerability to CISA.\n4. MITIGATIONS\nLantronix states that XPort is an old legacy product and is not designed for strong encryption or TLS/SSL encryption. Users who require stronger encryption are encouraged to upgrade to xPort Edge.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJanuary 23, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-7237"
  ],
  "techniques": [],
  "advisory": "icsa-24-023-05",
  "title": "Lantronix XPort | CISA",
  "source": "ics-advisories",
  "id": "4d9ea606f4221a5cc8328fcaa7e4c18ca127336867684e4d49d01f30c664bd02"
}