{
  "markdown": "\nOverview\nICS-CERT is aware of a public report of multiple vulnerabilities in Cogent’s DataHub application. These vulnerabilities include cross-site scripting and an HTTP header injection vulnerability, also known as a carriage return line feed. According to the report, Cogent Real-Times Systems Inc. has produced a patch that resolves these vulnerabilities.\nKuang-Chun Hung of Security Research and Service Institute - Information and Communication Security Technology Center (ICST), Taiwan R.O.C. reported these vulnerabilities to JPCERT/CC.\nAffected Products\nAccording to the report, the following products are affected:\n\nCogent DataHub Version 7.1.2 and earlier\nOPC DataHub Version 6.4.20 and earlier\nCascade DataHub Version 6.4.20 and earlier.\n\nImpact\nSuccessful exploitation of these vulnerabilities could result in one or more of the following:\n\nAn arbitrary script being executed on the user's web browser\nForged information may be displayed on the user's web browser\nAn HTTP response splitting attack may be conducted.\n\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nCogent Real-Time Systems Inc. is a Canadian-based company that produces middleware applications that are used to interface with control systems.\nAccording to Cogent, DataHub is deployed across several sectors including manufacturing, building automation, chemical, banking and finance, electric utilities, and others. Cogent estimates these products are used primarily in the United States and Great Britain.\nVulnerability Characterization\nVulnerability Overview\nCross-Site Scripting\nA cross-site scripting vulnerability exists in the Cogent DataHub application because it lacks server-side validation of query string parameter values. Attacks that exploit these vulnerabilities require that a user visit a specially crafted URL, which injects client-side scripts into the server’s HTTP response to the client.\nCVE-2012-0309 has been assigned to this vulnerability. A CVSS V2 base score of 4.3 has also been assigned.\nHTTP Header Injection Vulnerability\nAn HTTP header injection vulnerability (also known as carriage return line feed) exists in the Cogent DataHub application as the product does not validate or incorrectly validates input that can affect the control flow or data flow of a program.\nCVE-2012-0310 has been assigned to this vulnerability. A CVSS V2 base score of 4.3 has also been assigned.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable but may social engineering.\nExistence of Exploit\nNo known exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a low to moderate skill level could exploit these vulnerabilities.\nMitigation\nAccording to the report, Cogent Real-Time Systems In. has produced a patch for these vulnerabilities that can be obtained by accessing the Cogent website located here: http://www.cogentdatahub.com/Contact_Form.html and filling out the required information.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on social engineering attacks.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on avoiding e-mail scams.\n\n",
  "cves": [
    "CVE-2012-0310",
    "CVE-2012-0309"
  ],
  "techniques": [],
  "advisory": "icsa-12-016-01",
  "title": "Cogent DataHub XSS and CRLF | CISA",
  "source": "ics-advisories",
  "id": "e81e321b9c5d76654473f1130a65650ea37b7445ee9911414f2f21b9ae285132"
}