{
  "markdown": "\nOverview\nICS-CERT has become aware of multiple denial-of-service (DoS) vulnerabilities in the 7-Technologies  (7T) Interactive Graphical SCADA System (IGSS) supervisory control and data acquisition (SCADA) human-machine interface (HMI) application. All vulnerabilities are remotely exploitable.\n7T has developed patches that resolve the reported vulnerabilities in the affected versions.\n--------- Begin Update A Part 1 of 3 ----------\nICS-CERT and independent researcher Joel Langill have validated the patches.\n--------- End Update A Part 1 of 3 ----------\nAffected Products\n--------- Begin Update A Part 2 of 3 ----------\nThe vulnerabilities do not affect 7T IGSS SCADA HMI Version 6.The vulnerabilities affect 7T IGSS SCADA HMI Version 7 prior to Revision 10033.The vulnerabilities affect 7T IGSS SCADA HMI Version 8 prior to Revision 11102.The vulnerabilities affect 7T IGSS SCADA HMI Version 9 prior to Revision 11143.\n--------- End Update A Part 2 of 3 ----------\nImpact\nSuccessful exploitation of the reported vulnerabilities can allow an attacker to perform a remote DoS attack against the 7T data server. This action can result in adverse application conditions and ultimately impact the production environment on which the SCADA system is used.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on the environment, architecture, and product implementation.\nBackground\n7T, based in Denmark, creates monitoring and control systems that are primarily used in the United States, Europe, and South Asia. According to the 7T website, IGSS has been deployed in over 28,000 industrial plants in 50 countries worldwide.\n7T IGSS HMI is used to control and monitor programmable logic controllers in industrial processes across multiple sectors including manufacturing, energy (oil and gas), and water.\nVulnerability Characterization\nDenial of Service Vulnerability Overview\nThe DoS vulnerability occurs in the IGSSdataServer service on Port 12401/TCP and in the dc.exe serviceon Port 12397/TCP.\nStack-Based Buffer Overflow Vulnerability Details\nExploitability\nThe DoS vulnerabilities reported can be remotely exploited by sending specially crafted packets to the vulnerable IGSSdataServer service or to the dc.exe service.\nExistence of Exploit\nExploit code is publicly available for these vulnerabilities.\nDifficulty\nThese vulnerabilities require moderate skills to exploit.\nMitigation\nICS-CERT recommends that customers of 7T IGSS software take the following mitigation steps:\n--------- Begin Update A Part 3 of 3 ----------\nDownload and run the “IGSS Update” to install the corresponding version patch on the system:\n\nVersion 7\nVersion 8\nVersion 9 \n\n--------- End Update A Part 3 of 3 ----------\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to takingdefensive measures.\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP page of the US-CERT website. Several recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-132-01a",
  "title": "7-Technologies IGSS Denial of Service (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0a28be1db4e8137564775aff21f449e8723c62c4cb0c26fa3d383b2db7411f41"
}