{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Exploitable from adjacent network\nVendor: Axis Communications\nEquipment: AXIS A1001\nVulnerability: Heap-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AXIS A1001, a network door controller, are affected:\n\nAXIS A1001: 1.65.4 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap-based buffer overflow vulnerability exists in the AXIS 1001 versions 1.65.4 and prior. When communicating over the Open Supervised Device Protocol (OSDP), the pacsiod process that handles the OSDP communication allows for writing outside of the allocated buffer. By appending invalid data to an OSDP message, it is possible to write data beyond the heap allocated buffer. The data written outside the buffer could allow an attacker to execute arbitrary code.\nCVE-2023-21406 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Sweden\n\n3.4 RESEARCHER\nAriel Harush and Roy Hodir of OTORIO reported this vulnerability to AXIS Communications.\n4. MITIGATIONS\nAxis has released a patched version for affected devices that fixes the vulnerability.\nAxis recommends users to update the device software. The latest Axis device software can be found here.\nFor further assistance and questions, please contact AXIS Technical Support.\nFor more information on this vulnerability, please visit the Axis vulnerability management portal.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2023-21406"
  ],
  "techniques": [],
  "advisory": "icsa-23-206-01",
  "title": "AXIS A1001 | CISA",
  "source": "ics-advisories",
  "id": "19e3ea9d58fdeb301c247b17e3138391a76341133f8b411baf934de5366d92c7"
}