{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.3\nATTENTION: Low attack complexity\nVendor: Xylem, Inc.\nEquipment: AquaView\nVulnerability: Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated local attacker to create users, delete users, disable user groups, and update the system and its security levels.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AquaView, a SCADA system, are affected:\n\nAquaView: Versions 1.60, 7.x, 8.x\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product is vulnerable to the use of hard-coded credentials, which could allow an authenticated local attacker to obtain control of the system or reuse credentials to further penetrate the system.\nCVE-2021-42833 has been assigned to this vulnerability. A CVSS v3 base score of 9.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nXylem, Inc., reported this vulnerability to CISA.\n4. MITIGATIONS\nXylem recommends AquaView users implement new security settings. For additional details, please see Xylem Product Security Advisory XSA-2021-006\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-42833"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-01",
  "title": "Xylem AquaView | CISA",
  "source": "ics-advisories",
  "id": "18971b0855ef3ecceccf351d4bbe2c2ed9bf1ba936503bcdd0cef4bff2f564f7"
}