{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable from an adjacent network/low attack complexity\nVendor: JTEKT Corporation\nEquipment: TOYOPUC PLC\nVulnerability: Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could crash the device being accessed.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the PLC are affected:\n\nPC10G-CPU\n2PORT-EFR\nPlus CPU\nPlus EX\nPlus EX2\nPlus EFR\nPlus EFR2\nPlus 2P-EFR\nPC10P-DP\nPC10P-DP-IO\nPlus BUS-EX\nNano 10GX\nNano 2ET\nPC10PE\nPC10PE-16/16P\nPC10E\nFL/ET-T-V2H\nPC10B\nPC10B-P\nNano CPU\nPC10P\nPC10GE\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nWhen the affected products receive an invalid frame, the outside area of a receive buffer for FL-net are overwritten. As a result, the PLC CPU detects a system error, and the affected products stop.\nCVE-2021-27477 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nChris Yang of TXOne Networks, working with Trend Micro’s Zero Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nJTEKT has updated to the following PLC firmware versions to address the vulnerability:\n\nPC10G-CPU: Versions 3.91 or later\n2PORT-EFR: Versions 1.50 or later\nPC10P-DP: Versions 1.50 or later\nPC10P-DP-IO: Versions 1.50 or later\nNano 10GX: Versions 3.00 or later\nNano 2ET: Versions 2.40 or later\nPC10PE: Versions 1.02 or later\nPC10PE-16/16P: Versions 1.02 or later\nPC10E: Versions 1.12 or later\nFL/ET-T-V2H: Versions F2.8 E1.5 or later\nPC10B: Versions 1.11 or later\nPC10B-P: Versions 1.11 or later\nNano CPU: Versions 2.08 or later\nPC10P: Versions 1.05 or later\nPC10GE: Versions 1.04 or later\n\nPLUS SERIES\n\nPlus CPU: Versions 3.11 or later\nPlus EX: Versions 3.11 or later\nPlus EX2: Versions 3.11 or later\nPlus EFR: Versions 3.11 or later\nPlus EFR2: Versions 3.11 or later\nPlus 2P-EFR: Versions 3.11 or later\nPlus BUS-EX: Version 2.13 or later\n\nThere is no need to update Plus series expansion boards. If you use a Plus series expansion board, update Plus CPU or Plus BUS-EX to which the expansion board is connected.\nFor firmware updates, visit the JTEKT website.\nAs a general security measure, JTEKT Corporation recommends users only build networks with trusted FL-net products.\nRequests for additional information can be sent to JTEKT Corporation via website form.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27477",
    "CVE-2021-327477"
  ],
  "techniques": [],
  "advisory": "icsa-21-180-04",
  "title": "JTEKT TOYOPUC PLC | CISA",
  "source": "ics-advisories",
  "id": "dd8378af69f1ef4e869dea77b3e5e7d707bdc516196b0e120f3260ba2d9797e0"
}