{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low skill level to exploit\nVendor: ABB\nEquipment: System 800xA\nVulnerabilities: Incorrect Default Permissions\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to escalate privileges, cause system functions to stop, and corrupt user applications.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products of System 800xA are affected:\n\nOPC Server for AC 800M: Versions 6.0 and prior\nControl Builder M Professional: Versions 6.1 and prior\nMMS Server for AC 800M: Versions 6.1 and prior\nBase Software for SoftControl: Versions 6.1 and prior\nABB System 800xA Base: Versions 6.1 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT DEFAULT PERMISSIONS CWE-276\nWeak access control lists for system folders could allow low privileged users to modify system and application files.\nCVE-2020-8472 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    INCORRECT DEFAULT PERMISSIONS CWE-276\nAn attacker who successfully exploits the weak file permissions in one of the ABB System 800xA functions could corrupt applications by escalating privileges, executing arbitrary code, and affecting various engineering functions.\nCVE-2020-8473 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nWilliam Knowles of Applied Risk reported these vulnerabilities to ABB.\n4. MITIGATIONS\nABB recommends changing any user account passwords suspected to be known by an unauthorized person. Interactive logon (both local and remote) is recommended to be disabled for the service account.\nThe vulnerabilities in the OPC Server for AC 800M was corrected in System 800xA 6.1\nIn the Control Builder M Professional, MMS Server for AC 800M and Base Software for SoftControl and ABB System 800xA Base, the vulnerabilities will be corrected in future releases of System 800xA. These vulnerabilities are planned to be corrected in the next release on the 6.0.3 LTS track following 6.0.3.3\nPlease note these vulnerabilities can only be exploited by authenticated users, so users are recommended to ensure only authorized persons have access to user accounts in System 800xA.\nFor more information please refer to ABB’s Cybersecurity Advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nFollow the principle of least privilege.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-8473",
    "CVE-2020-8472"
  ],
  "techniques": [],
  "advisory": "icsa-20-154-01",
  "title": "ABB System 800xA | CISA",
  "source": "ics-advisories",
  "id": "ad2d70f9a868f949e90f82452963e6ef90e27305e0b0c36d007bcdd2bd722ea1"
}