{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Schneider Electric\nEquipment: SpaceLogic C-Bus Toolkit\nVulnerabilities: Improper Privilege Management, Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to perform remote code execution, which could result in tampering of the SpaceLogic C-Bus home automation system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Schneider Electric products are affected:\n\nSpaceLogic C-Bus Toolkit: Versions 1.16.3 and prior\n\n3.2 Vulnerability Overview\n3.2.1 Improper Privilege Management CWE-269\nSchneider Electric's SpaceLogic C-Bus Toolkit product is vulnerable due to improper privilege management, which could cause remote code execution when the transfer command is used over the network.\nCVE-2023-5402 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2 Path Traversal CWE-22\nSchneider Electric's SpaceLogic C-Bus Toolkit product contains a path traversal vulnerability, which could cause tampering of files on the personal computer running C-Bus when using the File Command.\nCVE-2023-5399 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nAn anonymous researcher working with Trend Micro's Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSchneider Electric has provided a fix to these vulnerabilities and recommends updating the software to v1.16.4. After installation, it is recommended to reboot the system and verify the version number reflects the new version.\nIf users choose not to apply the remediation provided, they should immediately apply the following mitigation to reduce the risk of exploit:\n\nBlock TCP Port 20023 to SpaceLogic C-Bus Toolkit by using the rules in the PC firewall.\n\nBy doing this, the vulnerable commands could not then be used to compromise the PC by an external entity as the connection and ultimately the command will not be accepted by SpaceLogic C-Bus Toolkit.\nFor more information, refer to Schneider Electric's Security Bulletin SEVD-2023-283-1\nSchneider Electric strongly recommends the following industry cybersecurity best practices.\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls so no unauthorized personnel can access your industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in the \"Program\" mode.\nNever connect programming software to any network other than the network intended for that device.\nScan all methods of mobile data exchange with the isolated network such as CDs, USB drives, etc., before use in the terminals or any node connected to these networks.\nNever allow mobile devices that have connected to any other network besides the intended network to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and systems and ensure that they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs). Recognize that VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand that VPNs are only as secure as the connected devices.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nNovember 2, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-5402",
    "CVE-2023-5399"
  ],
  "techniques": [],
  "advisory": "icsa-23-306-06",
  "title": "Schneider Electric SpaceLogic C-Bus Toolkit | CISA",
  "source": "ics-advisories",
  "id": "81aecc520e0766854b2a1e50b36a75435cc84a450bf033b1d37b32595f8e9b0a"
}