{
  "markdown": "\nCVSS v3 7.1\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Advantech\nEquipment: WebAccess\nVulnerability: Absolute Path Traversal\nAFFECTED PRODUCTS\nThe following WebAccess versions are affected:\n\nWebAccess Version 8.1 and prior.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow the attacker to traverse the file system and gain access to files or directories, which could result in the device becoming unavailable.\nMITIGATION\nAdvantech has produced WebAccess Version 8.2_20170330 to mitigate this vulnerability. The new version can be downloaded at:\nhttp://www.advantech.com/industrial-automation/webaccess/download\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nABSOLUTE PATH TRAVERSAL CWE-36\n\nThe absolute path traversal vulnerability has been identified, which may allow an attacker to traverse the file system to access restricted files or directories.\nCVE-2017-7929 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:H).\nRESEARCHER\nZhou Yu working with Trend Micro’s Zero Day Initiative discovered the vulnerability. Zhou Yu has tested the new software and validated that it mitigates the vulnerability.\nBACKGROUND\nCritical Infrastructure Sector(s): Critical Manufacturing\nCountries/Areas Deployed: Taiwan, United States, Europe\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-7929"
  ],
  "techniques": [],
  "advisory": "icsa-17-124-03",
  "title": "Advantech WebAccess | CISA",
  "source": "ics-advisories",
  "id": "4c97ba51a9a9dcf72197b953f9b44957bd6edb9f4f2acb16cd2bdb815f746b31"
}