{
  "markdown": " Inductive Automation Ignition Information Disclosure Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryInductive Automation Ignition Information Disclosure Vulnerability================================================================== Last Revised April 22, 2013 Alert Code ICSA\\-11\\-231\\-01Overview-------- ICS\\-CERT has received a report from Rubén Santamarta concerning a vulnerability in Inductive Automation’s Ignition software. Ignition is an updated version of FactoryPMI (Plant Management Interface), offered by Inductive Automation. This vulnerability allows unauthorized users to download files containing important information about the system and project. ICS\\-CERT has worked with Inductive Automation and Rubén Santamarta to confirm this vulnerability, and Inductive Automation has issued a patch to address it. ICS\\-CERT has validated that this patch fully resolves this vulnerability.Affected Products----------------- Inductive Automation Ignition versions prior to Version 7\\.2\\.8\\.178 are affected.Impact------ Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.Background---------- Ignition is an updated version of FactoryPMI, offered by Inductive Automation. Ignition is a full featured human\\-machine interface/SCADA product used in a variety of industrial applications that is produced by Inductive Automation. According to Inductive Automation, Ignition has known deployments in North and South America, Europe, Australia, and across Asia.Vulnerability Characterization------------------------------### Vulnerability Overview According to the researcher’s report, the vulnerability is exploitable by connecting a specific Uniform Resource Locator (URL) address. The successful connection to this URL results in a prompt to download files containing important details about system and project information, including authorized usernames and password hashes.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable.#### Existence of Exploit No known exploits specifically target this vulnerability.#### Difficulty Exploiting this vulnerability requires a low skill set.Mitigation---------- Inductive Automation has produced Version 7\\.2\\.8 of the affected software available on the [Inductive Automation Downloads website](http://www.inductiveautomation.com/downloads)  . Customers who are unfamiliar with the Inductive Automation upgrade routine should contact the vendor for assistance. According to its website, Inductive Automation Support can be reached at (916\\) 456\\-1045 or [support@inductiveautomation.com](mailto:support@inductiveautomation.com)  . ICS\\-CERT encourages asset owners to minimize network exposure for all control system devices. Critical devices should not directly face the Internet. Locate control system networks and remote devices behind firewalls and isolate them from the business network. When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. The Control Systems Security Program (CSSP) provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Inductive Automation-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-231-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-231-01",
  "title": "Inductive Automation Ignition Information Disclosure Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "9425437bc4ac6aa00204265ef5838645f14ace080923b3734a094bc3f421e4a4"
}