{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: AVEVA Software, LLC. (AVEVA)\nEquipment: InduSoft Web Studio and InTouch Edge HMI (formerly InTouch Machine Edition)\nVulnerabilities: Stack-based Buffer Overflow, Empty Password in Configuration File\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthenticated user to remotely execute code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAVEVA reports that these vulnerabilities affect the following products:\n\nInduSoft Web Studio versions prior to 8.1 SP2, and\nInTouch Edge HMI (formerly InTouch Machine Edition) versions prior to 2017 SP2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nA remote attacker could send a carefully crafted packet to exploit a stack-based buffer overflow vulnerability during tag, alarm, or event related actions such as read and write, with potential for code to be executed. If InduSoft Web Studio remote communication security was not enabled, or a password was left blank, a remote user could send a carefully crafted packet to invoke an arbitrary process, with potential for code to be executed. The code would be executed under the privileges of the InduSoft Web Studio or InTouch Edge HMI runtime and could lead to a compromise of the InduSoft Web Studio or InTouch Edge HMI server machine.\nCVE-2018-17916 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    EMPTY PASSWORD IN CONFIGURATION FILE CWE-258\nThis vulnerability could allow an unauthenticated user to remotely execute code with the same privileges as that of the InduSoft Web Studio or InTouch Edge HMI (formerly InTouch Machine Edition) runtime.\nCVE-2018-17914 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nTenable reported these vulnerabilities to AVEVA.\n4. MITIGATIONS\nAVEVA recommends that users upgrade to InduSoft Web Studio v8.1 SP2 and InTouch Edge HMI (formerly InTouch Machine Edition) 2017 SP2 as soon as possible. Software updates can be downloaded from the Global Customer Support “Software Download” area or from the links below:\n\nInduSoft Web Studio prior to v8.1 SP2:\n\nhttp://download.indusoft.com/81.2.0/IWS81.2.0.zip\n\nInTouch Edge HMI (formerly InTouch Machine Edition) prior to 2017 SP2 (login required):\n\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=5223\nAVEVA recommends that users update existing projects to enable the security features of InduSoft Web Studio and InTouch Edge HMI:\n\nEnable the new encrypted channel for communication and disable the unencrypted channel.\nSet a strong Master Project password.\nSet a strong password for the built-in account. By default, the built-in account is named Guest.\nSet strong passwords for all other non-built-in accounts.\n\nAVEVA has published Security Bulletin LFSEC00000130 on their website at the following location:\nhttps://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityBulletin_LFSec130.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-17914",
    "CVE-2018-17916"
  ],
  "techniques": [],
  "advisory": "icsa-18-305-01",
  "title": "AVEVA InduSoft Web Studio and InTouch Edge HMI (formerly InTouch Machine Edition) | CISA",
  "source": "ics-advisories",
  "id": "a85373afd85cb22f90afa19c0f71476b5b32ebe39de6233180cc9f6ef02eae97"
}