{
  "markdown": "\nOVERVIEW\nErwin Paternotte of Applied RiskApplied Risk Security Advisory AR2015001, Multiple Vulnerabilities in Moxa industrial manages switches, http://applied-risk.com/application/files/3414/4060/7148/Advisory_Moxa_Multiple_Vulnerabilities.pdf, web site last accessed September 3, 2015. has identified vulnerabilities in the Moxa EDS-405A/EDS-408A series managed Ethernet switches. Moxa has produced a firmware update to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nThe following Moxa switches are affected:\n\nMoxa EDS-405A/EDS-408A series managed Ethernet switches firmware Version V3.4 build 14031419 and prior.\n\nIMPACT\nAn authenticated remote attacker could compromise the availability, integrity, and confidentiality of a Moxa industrial managed switch, including connected industrial assets.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nMoxa is a Taiwan-based company that maintains offices in several countries around the world, including the US, UK, India, Germany, France, China, Russia, and Brazil.\nThe EDS-405A/408A series are entry Level 5 and 8-port managed Ethernet switches designed especially for industrial applications. The switches support a variety of useful management functions, such as Turbo Ring, Turbo Chain, ring coupling, port-based VLAN, QoS, RMON, bandwidth management, port mirroring, and warning by email or relay. According to Moxa, these switches are deployed across several sectors, including Chemical, Commercial Facilities, Critical Manufacturing, Emergency Services, Energy, Food and Agriculture, Government Facilities, Water and Wastewater Systems, and others. Moxa estimates that these products are used globally but concentrated in the US, Europe, Chile, Argentina, Peru, Columbia, and Taiwan, with 50 to 60 percent of all sales in the US.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\nIMPROPER PRIVILEGE MANAGEMENTCWE-269: Improper Privilege Management, http://cwe.mitre.org/data/definitions/269.html, web site last accessed September 3, 2015.\nA privilege escalation vulnerability has been found in the administrative web interface of the Moxa industrial Ethernet switches. A user level account has by default read only access to the web interface. The check that prevents a user level account from modifying settings in the administrative web interface could be easily circumvented, resulting in elevated access privileges.\nCVE-2015-6464NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-6464, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Applied Risk has calculated a CVSSv2 base score of 8.5 for this vulnerability; the CVSS vector string is (AV:N/AC:L/Au:S/C:N/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:S/C:N/I:C/A:C, web site last accessed September 3, 2015.\nRESOURCE EXHAUSTIONCWE-400: Uncontrolled Resource Consumption ('Resource Exhaustion'), http://cwe.mitre.org/data/definitions/400.html, web site last accessed September 3, 2015.\nThe embedded GoAhead web server running on the Moxa Ethernet switches is vulnerable to a denial-of-service attack. A crafted URL sent by an authenticated user causes a reboot of the device.\nCVE-2015-6465NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-6465, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Applied Risk has calculated a CVSSv2 base score of 6.8 for this vulnerability; the CVSS vector string is (AV:N/AC:L/Au:S/C:N/I:N/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:L/Au:S/C:N/I:N/A:C, web site last accessed September 3, 2015.\nCROSS-SITE SCRIPTINGCWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting'), http://cwe.mitre.org/data/definitions/79.html, web site last accessed September 3, 2015.\nA Cross-Site Scripting (XSS) vulnerability has been found in the administrative web interface of the Moxa industrial Ethernet switches. An input field of the administrative web interface lacks input validation, which could be abused to inject JavaScript code.\nCVE-2015-6466NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-6466, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Applied Risk has calculated a CVSSv2 base score of 4.3 for this vulnerability; the CVSS vector string is (AV:N/AC:M/Au:N/C:N/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:N/C:N/I:P/A:N, web site last accessed September 3, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nMoxa addressed the reported vulnerabilities by releasing a firmware update for the affected devices. The firmware updates are available at the following location on their web site:\nhttp://www.moxa.com/support/download.aspx?type=support&id=328\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2015-6464",
    "CVE-2015-6466",
    "CVE-2015-6465"
  ],
  "techniques": [],
  "advisory": "icsa-15-246-03",
  "title": "Moxa Industrial Managed Switch Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "b14f2d7f4246ca87cf98773481885ea15f5433707ca9986c91ca50db5ae13456"
}