{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 4.8\n\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: Siveillance VMS Video Mobile App\nVulnerability: Improper Certificate Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker in a privileged network position to read data from and write data to the encrypted communication channel between the app and a server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following Siveillance VMS Video Mobile Apps:\n\nSiveillance VMS Video for Android, all versions prior to V12.1a (2018 R1), and\n\n\nSiveillance VMS Video for iOS: all versions prior to V12.1a (2018 R1)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   IMPROPER CERTIFICATE VALIDATION CWE-295\nImproper certificate validation could allow an attacker in a privileged network position to read data from and write data to the encrypted communication channel between the app and a server.\nThe vulnerability could be exploited by an attacker in a privileged network position, which allows interception of the communication channel between the affected app and a server (such as man-in-the-middle). However, an attacker must be able to generate a certificate that results for the validation algorithm in a checksum identical to a trusted certificate.\nCVE-2018-4849 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Commercial facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n\n3.4 RESEARCHER\nKarsten Sohr from TZI Bremen reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has provided the following updates and recommends that all users update to the newest version:\n\nSiveillance VMS Video for Android: Update to V12.1a (2018 R1)\n\nhttps://play.google.com/store/apps/details?id=com.siemens.siveillancevms\n\nSiveillance VMS Video for iOS: Update to V12.1a (2018 R1)\n\nhttps://itunes.apple.com/us/app/siveillance-vmsvideo/id1045047239\nAs a general security measure Siemens strongly recommends users protect network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices in order to run the devices in a protected IT environment.\nFor more information on this vulnerability and associated mitigation practices, please see the Siemens security advisory SSA-468514 on their website:\nhttps://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-4849"
  ],
  "techniques": [],
  "advisory": "icsa-18-128-03",
  "title": "Siemens Siveillance VMS Video Mobile App | CISA",
  "source": "ics-advisories",
  "id": "c099711042cd36f5b7c6aab6b84217eaefafcbbe4d87651c77a778fee3261c19"
}