{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: GE Digital\nEquipment: APM Classic\nVulnerabilities: Authorization Bypass Through User-controlled Key, Use of a One-Way Hash Without a Salt\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow access to sensitive information.\n3. TECHNICAL DETAILS\n\n\n3.1 AFFECTED PRODUCTS\nThe following versions of GE Digital APM Classic, a tool to analyze and process data, are affected:\n\nAPM Classic, Versions 4.4 and prior\n\n3.2 VULNERABILITY OVERVIEW\n \n3.2.1    AUTHORIZATION BYPASS THROUGH USER-CONTROLLED KEY CWE-639\nAn insecure direct object reference (IDOR) vulnerability allows user account data to be downloaded in JavaScript object notation (JSON) format by users who should not have access to such functionality. An attacker can download sensitive data related to user accounts without having the proper privileges.\nCVE-2020-16240 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    USE OF A ONE-WAY HASH WITHOUT A SALT CWE-759\nSalt is not used for hash calculation of passwords, making it possible to decrypt passwords. This design flaw, along with the IDOR vulnerability, puts the entire platform at high risk because an authenticated user can retrieve all user account data and then retrieve the actual passwords.\nCVE-2020-16244 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nGuido Marilli of Accenture Security reported these vulnerabilities to GE Digital.\n4. MITIGATIONS\nGE Digital APM Classic 4.5 contains mitigations for these vulnerabilities. GE Digital recommends all users upgrade to GE Digital APM Classic 4.5 or newer. Other recommendations may mitigate issues, but only installing the most current version will fully address the issue. To obtain the latest version of this product, please contact a GE Digital representative.\nThe GE user advisory can be accessed on the GE Digital Support Customer Center website (login required).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-16240",
    "CVE-2020-16244"
  ],
  "techniques": [],
  "advisory": "icsa-20-266-01",
  "title": "GE Digital APM Classic | CISA",
  "source": "ics-advisories",
  "id": "89bd2db5b5db1071d5f43b803e36498a75d43bef57b1f1c6bb3e629104ec49d3"
}