{
  "markdown": "\nCVSS v3 7.6\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Cambium Networks\nEquipment: ePMP\nVulnerabilities: Improper Access Control, Improper Privilege Management\nAFFECTED PRODUCTS\nCambium reports that the vulnerabilities affect the following ePMP Network Access Control products:\n\nePMP All Models.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow an attacker to access device configuration as well as make unauthorized changes to the product’s configuration.\nMITIGATION\nCambium recommends that users with the affected products should update to firmware version 3.4-RC7 or newer. This update can be found by logging in at the following location:\nhttps://support.cambiumnetworks.com/login\nCambium also recommends that users edit default SNMP configuration. Affected models come set with the default values of “public” and “private” for RO (read only) and RW (read write) community strings. Cambium recommends changing this to a random string consisting of eight or more characters in length, including both upper and lower case letters and numbers for variability.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nExploits that target these vulnerabilities are publicly available.\nVULNERABILITY OVERVIEW\n\nIMPROPER ACCESS CONTROL CWE-284\n\nAfter a valid user has used SNMP configuration export, an attacker is able to remotely trigger device configuration backups using specific MIBs. These backups lack proper access control and may allow access to sensitive information and possibly allow for configuration changes.\nCVE-2017-7918 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:L).\n\nIMPROPER PRIVILEGE MANAGEMENT CWE-269\n\nThe privileges for SNMP community strings are not properly restricted, which may allow an attacker to gain access to sensitive information and possibly allow for configuration changes.\nCVE-2017-7922 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L).\nRESEARCHER\nKarn Ganeshen identified these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Rolling Meadows, Illinois\n",
  "cves": [
    "CVE-2017-7922",
    "CVE-2017-7918"
  ],
  "techniques": [],
  "advisory": "icsa-17-166-01",
  "title": "Cambium Networks ePMP | CISA",
  "source": "ics-advisories",
  "id": "a4a58eb0971cee447d6c534a16cab448dd89050126856c0a292bacbca1da1b6a"
}