{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: JT2Go and Teamcenter Visualization\nVulnerabilities: Out-of-bounds Read, Improper Restriction of Operations within the Bounds of a Memory Buffer, Stack-based Buffer overflow, Out-of-Bounds Write, Type Confusion, Untrusted Pointer Dereference, Incorrect Type Conversion or Cast\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled Siemens JT2Go and Teamcenter Visualization that was published February 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to arbitrary code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products are affected:\n\nJT2Go: All versions prior to v13.1.0.1\nTeamcenter Visualization: All versions prior to v13.1.0.1\n\n4.2 VULNERABILITY OVERVIEW\n--------- Begin Update A Part 1 of 1 ---------\nCVE-2020-26998, CVE-2020-26999, CVE-2020-27001, CVE-2020-27002, and CVE-2020-26991 were moved to SSA-695540 and ICSA-21-147-04\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nAffected applications lack proper validation of user-supplied data when parsing PAR files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-26989 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE (‘TYPE CONFUSION') CWE-843\nAffected applications lack proper validation of user-supplied data when parsing ASM files. A crafted ASM file can trigger a type of confusion condition. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-26990 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.3    OUT-OF-BOUNDS WRITE CWE-787\nAffected applications lack proper validation of user-supplied data when parsing PAR files. This can result in an out-of-bounds write past the memory location that is a read-only image address. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-28383 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.4    OUT-OF-BOUNDS WRITE CWE-787\nAn out-of-bounds write vulnerability exists in the file-reading procedure in Open Design Alliance Drawings SDK before 2021.6.  This could allow an attacker to cause a crash, potentially enabling a denial-of-service attack (crash, exit, or restart) or code execution.\nCVE-2021-31784 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- End Update A Part 1 of 1 ---------\n4.2.5    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nAffected applications lack proper validation of user-supplied data when parsing BMP files. This can result in a memory-corruption condition. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-27000 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.6    UNTRUSTED POINTER DEREFERENCE CWE-822\nAffected applications lack proper validation of user-supplied data when parsing TIFF files. This could lead to pointer dereferences of a value obtained from untrusted source. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-27003 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.7    OUT-OF-BOUNDS READ CWE-125\nAffected applications lack proper validation of user-supplied data when parsing CGM files. This could result in a memory access past the end of an allocated buffer. An attacker could leverage this vulnerability to access data in the context of the current process.\nCVE-2020-27004 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.8    OUT-OF-BOUNDS WRITE CWE-787\nAffected applications lack proper validation of user-supplied data when parsing TGA files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-27005 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.9    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nAffected applications lack proper validation of user-supplied data when parsing PCT files. This could result in a memory-corruption condition. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-27006 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.10    OUT-OF-BOUNDS READ CWE-125\nAffected applications lack proper validation of user-supplied data when parsing HPG files. This could result in a memory access past the end of an allocated buffer. An attacker could leverage this vulnerability to access data in the context of the current process.\nCVE-2020-27007 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.11    OUT-OF-BOUNDS READ CWE-125\nAffected applications lack proper validation of user-supplied data when parsing PLT files. This could result in a memory access past the end of an allocated buffer. An attacker could leverage this vulnerability to access data in the context of the current process.\nCVE-2020-27008 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.12    OUT-OF-BOUNDS READ CWE-125\nAffected applications lack proper validation of user-supplied data when parsing RAS files. This could result in a memory access past the end of an allocated buffer. An attacker could leverage this vulnerability to access data in the context of the current process.\nCVE-2020-28394 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.13    STACK-BASED BUFFER OVERFLOW CWE-121\nAffected applications lack proper validation of user-supplied data when parsing PAR files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-26989 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.14    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE (‘TYPE CONFUSION') CWE-843\nAffected applications lack proper validation of user-supplied data when parsing ASM files. A crafted ASM file can trigger a type-confusion condition. An attacker can leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-26990 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.15    STACK-BASED BUFFER OVERFLOW CWE-121\nAn issue was discovered in Open Design Alliance Drawings SDK before v2021.11. A stack-based buffer overflow vulnerability exists when the recover operation is run with malformed DXF and DWG files.\nCVE-2021-25178 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.16    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nAn issue was discovered in Open Design Alliance Drawings SDK before v2021.11. A type-confusion issue exists when rendering malformed DXF and DWG files.\nCVE-2021-25177 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.17    UNTRUSTED POINTER DEREFERENCE CWE-822\nAn issue was discovered in Open Design Alliance Drawings SDK before v2021.11. A NULL pointer dereference exists when rendering malformed DXF and DWG files. This could allow attackers to cause a crash, potentially enabling a denial-of-service attack (crash, exit, or restart).\nCVE-2021-25176 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.18    INCORRECT TYPE CONVERSION OR CAST CWE-704\nAn issue was discovered in Open Design Alliance Drawings SDK before v2021.11. A type conversion issue exists when rendering malformed DXF and DWG files. This could allow attackers to cause a crash, potentially enabling a denial-of-service attack (crash, exit, or restart).\nCVE-2021-25175 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.19    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nAn issue was discovered in Open Design Alliance Drawings SDK before v2021.12. A memory corruption vulnerability exists when reading malformed DGN files. This could allow attackers to cause a crash, enabling a denial-of-service condition (crash, exit, or restart).\nCVE-2021-25174 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.20    MEMORY ALLOCATION WITH EXCESSIVE SIZE VALUE CWE-789\nAn issue was discovered in Open Design Alliance Drawings SDK before v2021.12. A memory allocation with excessive size vulnerability exists when reading malformed DGN files, which could allow attackers to cause a crash, enabling a denial-of-service condition (crash, exit, or restart).\nCVE-2021-25173 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nMichael DePlante (@izobashi), Francis Provencher {PRL}, and rgod, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends the following:\n\nJT2Go: Update to v13.1.0.1 or later (login required).\nTeamcenter Visualization: Update to v13.1.0.1 or later (login required).\nLimiting the opening of untrusted files in systems where JT2Go or Teamcenter Visualization is installed.\nApplying a defense-in-depth concept can help to reduce the probability for an untrusted code to run on the system. \nFor additional information refer to SSA-622830 and SSA-663999\nFor additional information concerning Open Design Alliance Drawings SDK issues refer to Open Design Alliance’s Security Advisories.\n\nSiemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/Industrialsecurity\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-26990",
    "CVE-2020-28383",
    "CVE-2020-27007",
    "CVE-2021-25173",
    "CVE-2020-27002",
    "CVE-2020-27005",
    "CVE-2020-26991",
    "CVE-2020-27008",
    "CVE-2020-27003",
    "CVE-2020-27000",
    "CVE-2020-28394",
    "CVE-2021-25174",
    "CVE-2021-31784",
    "CVE-2021-25177",
    "CVE-2020-27006",
    "CVE-2020-26999",
    "CVE-2020-27004",
    "CVE-2020-26989",
    "CVE-2021-25175",
    "CVE-2021-25176",
    "CVE-2020-26998",
    "CVE-2020-27001",
    "CVE-2021-25178"
  ],
  "techniques": [],
  "advisory": "icsa-21-040-06",
  "title": "Siemens JT2Go and Teamcenter Visualization (Update A) | CISA",
  "source": "ics-advisories",
  "id": "da9a1d402ea835927b73b19ea7f7934838b06454748a1836f0d62110a5685456"
}