{
  "markdown": "\nOVERVIEW\nThis updated advisory is a follow-up to the original advisory titled ICSA-16-077-01 ABB Panel Builder 800 DLL Hijacking Vulnerability that was published March 17, 2016, on the NCCIC/ICS-CERT web site.\nIvan Sanchez from Nullcode Team has identified a DLL Hijacking vulnerability in the ABB Panel Builder 800 Version 5.1 application.\n--------- Begin Update A Part 1 of 4 -------- \nPanel Builder Version 6.0 is not affected by this vulnerability.\n--------- End Update A Part 1 of 4 ---------- \nAFFECTED PRODUCTS\nThe following ABB product is affected:\n\nPanel Builder 800 Version 5.1\n\nIMPACT\nThe vulnerability could allow an attacker who successfully exploits it to insert and run arbitrary code on an affected system.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nABB is a Switzerland-based company that maintains offices in several countries around the world.\n--------- Begin Update A Part 2 of 4 -------- \nThe affected product, Panel Builder 800, is the engineering and configuration tool with which Panel 800 HMIs can be engineered and configured.\n--------- End Update A Part 2 of 4 ---------- \nAccording to ABB, Panel Builder 800s are deployed across several sectors including Critical Manufacturing, Energy, and Transportation Systems. ABB estimates that these products are deployed worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427: Uncontrolled Search Path Element, http://cwe.mitre.org/data/definitions/427.html, web site last accessed March 17, 2016\n\nIf an application calls a DLL without specifying an absolute path Windows will conduct a search for the DLL file in various set locations.\nCVE-2016-2281NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-2281, web site last accessed March 22, 2016. has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:H/UI:R/S:C/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:L/AC:H/PR:H/UI:R/S:C/C:H/I:H/A:H, web site last accessed March 17, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not exploitable remotely and cannot be exploited without user interaction.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult. An attacker must get malicious code to a specific directory in the file system of a computer where the Panel Builder 800 Version 5.1 is used, then get a legitimate user of the Panel Builder 800 Version 5.1 to execute it. This decreases the likelihood of a successful exploit.\nMITIGATION\nABB recommends that any new projects use Panel Builder 800 Version 6.0.\n--------- Begin Update A Part 3 of 4 -------- \nFiles transferred between computers should be carefully inspected, including scanning with up-to-date antivirus software and plausibility checks for the file types to be transferred, e.g., by a file transfer proxy enforcing restrictions.\nUser account management, appropriate authentication, and permission management use the principle of least privilege.\n--------- End Update A Part 3 of 4 ----------\nABB has developed and tested the following workaround. It will not correct the underlying vulnerability, but it will block the known attack vector:\nRemove the association of .pba files with the Panel Builder 800 Version 5.1.\nThis can be done via:\nControl Panel\\Programs\\Default Programs\\Set Associations\nThis workaround has the impact that it will no longer be possible to start the Panel Builder 800 Version 5.1 by a double click of a panel 800 project file. The Panel Builder 800 Version 5.1 will need to be started from a link provided by the product installation, e.g., in the Windows Start menu.\n--------- Begin Update A Part 4 of 4 -------- \nABB has produced an advisory for this vulnerability:\nhttps://library.e.abb.com/public/ad52594ac29c4b088a62f199f04ab3b3/3BSE086156_-_en_SECURITY_Advisory_-_Panel_Builder_800_5.x_vulnerability.pdf\n--------- End Update A Part 4 of 4 ----------\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed March 17, 2016. for more information on social engineering attacks.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-2281"
  ],
  "techniques": [],
  "advisory": "icsa-16-077-01a",
  "title": "ABB Panel Builder 800 DLL Hijacking Vulnerability (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0d13737536b6e2c5d4550708dfcb1994c0ea269474a675127aa4add9f1626c02"
}