{
  "markdown": "\nCVSS v3 10.0\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Hikvision\nEquipment: Cameras\nVulnerabilities: Improper Authentication, Password in Configuration File\nAFFECTED PRODUCTS\nHikvision reports that the following cameras and versions are affected:\n\nDS-2CD2xx2F-I Series\n\nV5.2.0 build 140721 to V5.4.0 build 160530\n\n\nDS-2CD2xx0F-I Series\n\nV5.2.0 build 140721 to V5.4.0 Build 160401\n\n\nDS-2CD2xx2FWD Series\n\nV5.3.1 build 150410 to V5.4.4 Build 161125\n\n\nDS- 2CD4x2xFWD Series\n\nV5.2.0 build 140721 to V5.4.0 Build 160414\n\n\nDS-2CD4xx5 Series\n\nV5.2.0 build 140721 to V5.4.0 Build 160421\n\n\nDS-2DFx Series\n\nV5.2.0 build 140805 to V5.4.5 Build 160928\n\n\nDS-2CD63xx Series\n\nV5.0.9 build 140305 to V5.3.5 Build 160106\n\n\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could lead to a malicious attacker escalating his or her privileges or assuming the identity of an authenticated user and obtaining sensitive data.\nMITIGATION\nHikvision has released updates to mitigate the improper authentication vulnerability in cameras sold through authorized distributers. Hikvision has not mitigated the password in configuration file vulnerability.\nHowever, Hikvision is aware of so-called “grey market” cameras which are sold via unauthorized channels. These cameras often use unauthorized firmware created by sources outside of Hikvision. In the case of these “grey market” devices, updating the firmware may result in converting the camera’s interface back to its original state. Users of “grey market” cameras who cannot update due to this unauthorized firmware will still be susceptible to these vulnerabilities.\nIn the Hikvision Unauthorized Distributors Notice, Hikvision encourages users to use devices sold by authorized distributers rather than so-called “grey market” devices. Hikvision’s Unauthorized Distributors Notice can be found at the following location:\nhttp://www.hikvision.com/us/about.aspx?stat=1&c_kind=293&c_kind2=10631\nNorth American models of Hikvision cameras which can be fixed and their updated firmware versions are listed below:\n\nDS-2CD2xx2F-I Series\n\nV5.4.5 build 170123 and later\n\n\nDS-2CD2xx0F-I Series\n\nV5.4.5 Build 170123 and later\n\n\nDS-2CD2xx2FWD Series\n\nV5.4.5 Build 170124 and later\n\n\nDS- 2CD4x2xFWD Series\n\nV5.4.5 Build 170228 and later\n\n\nDS-2CD4xx5 Series\n\nV5.4.5 Build 170302 and later\n\n\nDS-2DFx Series\n\nV5.4.9 Build 170123 and later\n\n\nDS-2CD63xx Series\n\nV5.4.5 Build 170206 and later\n\n\n\nThese updates are available for download at the following location:\nhttp://www.hikvision.com/us/about_10805.html\nMore information can be found by visiting Hikvision’s Vulnerability Notice:\nhttp://www.hikvision.com/us/about_10807.html\nFor Chinese-language domestic cameras, Hikvision also provides on-site tours or remote support in addition to the updated firmware listed above.\nHikvision also states that device models and firmware upgrade procedures may differ between regions. These policies will be communicated to users through Hikvision.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nThe improper authentication vulnerability occurs when an application does not adequately or correctly authenticate users. This may allow a malicious user to escalate his or her privileges on the system and gain access to sensitive information.\nCVE-2017-7921 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n\nPASSWORD IN CONFIGURATION FILE CWE-260\n\nThe password in configuration file vulnerability could allow a malicious user to escalate privileges or assume the identity of another user and access sensitive information.\nCVE-2017-7923 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nIPcamtalk user “Montecrypto” identified these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector(s): Critical Manufacturing and others\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\n",
  "cves": [
    "CVE-2017-7921",
    "CVE-2017-7923"
  ],
  "techniques": [],
  "advisory": "icsa-17-124-01",
  "title": "Hikvision Cameras | CISA",
  "source": "ics-advisories",
  "id": "57b6eecec655490579d1e26dbdefddced95239cf31f79d40d262b2c677012835"
}