{
  "markdown": " MICROSYS PROMOTIC Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryMICROSYS PROMOTIC Vulnerabilities================================= Last Revised September 06, 2018 Alert Code ICSA\\-12\\-024\\-02Overview-------- This advisory is a follow\\-up to [ICS\\-ALERT\\-11\\-286\\-01 \\- MICROSYS PROMOTIC Vulnerabilities](/ics/alerts/ICS-ALERT-11-286-01)  , released to the ICS\\-CERT Web page on October 12, 2011\\. Independent researcher Luigi Auriemma has identified and released three vulnerabilities in MICROSYS, spol. s r.o. PROMOTIC application without coordination with ICS\\-CERT, the vendor, or any other known coordinating entity. The vulnerabilities include directory traversal, ActiveX heap overflow, and ActiveX stack overflow vulnerabilities. Public exploits are known to target these vulnerabilities. ICS\\-CERT has coordinated these vulnerabilities with MICROSYS, which has produced an update. Luigi Auriemma has independently confirmed the update resolves these three vulnerabilities.Affected Products----------------- The following products are affected:* PROMOTIC versions prior to Version 8\\.1\\.5\\.Impact------ Successful exploitation of these vulnerabilities may result in denial of service or data leakage. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.Background---------- PROMOTIC is a Microsoft Windows based supervisory control and data acquisition human\\-machine interface (SCADA HMI) software programming suite for creating applications that monitor, control, and display technological processes. This suite also includes support for a [web interface](http://www.promotic.eu)  . MICROSYS, spol. s r.o. is a Czech company with headquarters in Ostrava. The PROMOTIC system is primarily used in Czech and Slovak Republics. It is also used in Poland, Hungary, Slovenia, Serbia, Bulgaria, and Romania.Vulnerability Characterization------------------------------### Vulnerability Overview#### Directory Traversal A directory traversal vulnerability may occur when a specially crafted request is passed to the web server running on Port 80\\\\TCP. Successful exploitation could result in data leakage.[CVE\\-2011\\-4518](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4518%20)  has been assigned to this vulnerability.#### ActiveX Stack Overflow A stack overflow affecting an ActiveX component used by PROMOTIC may occur when a specially crafted HTML document is opened on a client machine. Successful exploitation may cause a denial of service.[CVE\\-2011\\-4519](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4519)  has been assigned to this vulnerability.#### ActiveX Heap Overflow A Heap Overflow affecting an ActiveX component used by PROMOTIC may occur when a specially crafted HTML document is opened on a client machine. Successful exploitation may cause a denial of service.[CVE\\-2011\\-4520](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4520)  has been assigned to this vulnerability.### Vulnerability Details#### Exploitability Three of these vulnerabilities are remotely exploitable.#### Existence of Exploit Public exploits are known to target these vulnerabilities.#### Difficulty An attacker with a low skill level would be able to exploit these vulnerabilities.Mitigation---------- MICROSYS recommends that customers or affected versions of PROMOTIC update their installations by downloading the latest version from MICROSYS’ website <http://www.promotic.eu/en/firm/microsys.htm> . MICROSYS has produced a news release that contains additional information about these vulnerabilities. [http://www.promotic.eu/en/pmdoc/News.htm\\#ver80105](http://www.promotic.eu/en/pmdoc/News.htm#ver80105)  . ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides [a section for control systems security recommended practices](/ics/recommended-practices)  on the CSSP web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks:1. Do not click web links or open unsolicited attachments in e\\-mail messages.2. Refer to [*Recognizing and Avoiding Email Scams*](/reading_room/emailscams_0905.pdf) f for more information on avoiding e\\-mail scams.3. Refer to [*Avoiding Social Engineering and Phishing Attacks*](/cas/tips/ST04-014.html) for more information on social engineering attacks.![]() This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* MICROSYS-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-12-024-02)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* * [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)* * [Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-4519",
    "CVE-2011-4518",
    "CVE-2011-4520"
  ],
  "techniques": [],
  "advisory": "icsa-12-024-02",
  "title": "MICROSYS PROMOTIC Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "6c305c10b56a016be3d4fa4cecf9abb3256c36ada3de39ba5027b3229f3bdb5a"
}