{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Controlled Electronic Management Systems Ltd., a subsidiary of Johnson Controls Inc\nEquipment: CEM Systems AC2000\nVulnerability: Improper Authorization\n\n2. RISK EVALUATION\nUnder specific conditions, successful exploitation of this vulnerability could allow a remote attacker access to the system without adequate authorization.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports this vulnerability affects the following versions of CEM Systems AC2000:\n\nVersions 10.1 through 10.5\n\nThis vulnerability applies only to users who have implemented Single Sign On (SSO) and have installed the AC2000 Application Programming Interface (API).\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHORIZATION CWE-285\nUnder certain conditions, the application does not perform an adequate authorization check for functionality that requires a provable user identity.\nCVE-2021-27663 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls, Inc., reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls recommends steps to minimize risks to applying a patch to all affected versions and implementations. The fix will also be included in Version 10.5 Server Feature Pack 2, Version 10.6, and all future releases.\nTo access the patch, affected users should contact a CEM support team.\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-15 v1\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27663"
  ],
  "techniques": [],
  "advisory": "icsa-21-238-01",
  "title": "Johnson Controls Controlled Electronic Management Systems CEM Systems AC2000 | CISA",
  "source": "ics-advisories",
  "id": "d79f32b081a1998b483139e2655c38a9d5af9bf3954b1883e010797183ab5958"
}