{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Hitachi Energy\nEquipment: AFF660/665 Firewall\nVulnerability: Stack-based Buffer Overflow \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could overflow a buffer on the device and fully compromise it. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hitachi Energy AFF660/665, an industrial firewall, are affected:\n\nHitachi Energy AFF660 FW: Versions 03.0.02 and prior\nHitachi Energy AFF665 FW: Versions 03.0.02 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nAn improper parsing of URL arguments allows an attacker to exploit this vulnerability by crafting specially formed HTTP requests to overflow an internal buffer. Successful exploitation could cause a full compromise of the device.\nCVE-2020-6994 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi Energy for AFF660 FW and AFF665 FW versions 03.0.02 and prior recommends users to implement the following security measures:\n\nUse the “IP Access Restriction” feature to restrict HTTP and HTTPS traffic to trusted IP addresses. \nDisable the HTTP and HTTPS server.\n\nHitachi Energy recommends users follow the recommended security practices and firewall configurations to help protect from outside attacks. Recommended security practices include:\n\nEnsuring process control systems are physically protected from unauthorized direct access \nEnsuring process control systems have no direct connections to the Internet \nUsing a firewall system to separate process control systems from separated from other networks. The firewall system should have only the necessary ports open. \n\nHitachi Energy does not recommend process control systems be used for internet surfing, instant messaging, or receiving emails. Portable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\nFor more information, see Hitachi Energy’s security advisory 8DBD000122.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2020-6994"
  ],
  "techniques": [],
  "advisory": "icsa-22-263-02",
  "title": "Hitachi Energy AFF660/665 Series | CISA",
  "source": "ics-advisories",
  "id": "10857da482d256e93d9cb46f228705deac775d59aecae02e3b5e06e2810dc16d"
}