{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: SICK\nEquipment: MSC800\nVulnerability: Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a low-skilled remote attacker to reconfigure settings and/or disrupt the functionality of the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of MSC800, a programmable logic controller, are affected:\n\nMSC800 all versions prior to Version 4.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected firmware versions contain a hard-coded customer account password.\nCVE-2019-10979 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nTri Quach of Amazon’s Customer Fulfillment Technology Security (CFTS) group reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSICK recommends affected users upgrade to the latest firmware version (v4.0).\nThe patch and installation procedure for the firmware update is available from the responsible SICK representative. Until the firmware update is installed, general security practices should be utilized.\nIn case the referenced patches cannot be applied, the following general security practices could mitigate the associated risk.\nFor more information SICK has released a security notification that can be found at: https://www.sick.com/de/en/service-and-support/the-sick-product-security-incident-response-team-sick-psirt/w/psirt/#advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nBlocking/Monitoring Ports TCP/2111 or TCP/2112\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10979"
  ],
  "techniques": [],
  "advisory": "icsa-19-178-04",
  "title": "SICK MSC800 | CISA",
  "source": "ics-advisories",
  "id": "e5959831ec56fbdebaa4b82900c8f8a03d60ef2b5b9a58ead3dadf48e3c04bc5"
}