{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: LCDS - Leão Consultoria e Desenvolvimento de Sistemas Ltda ME\nEquipment: LAquis SCADA\nVulnerabilities: Improper Input Validation, Out-of-Bounds Read, Code Injection, Untrusted Pointer Dereference, Out-of-Bounds Write, Relative Path Traversal, Injection, Use of Hard-Coded Credentials, Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution, data exfiltration, or cause a system crash.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LAquis SCADA, an industrial automation software, are affected:\n\nSCADA 4.1.0.3870\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nOpening a specially crafted report format file allows execution of script code, which may allow remote code execution, data exfiltration, or cause a system crash.\nCVE-2018-18988 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.2    OUT-OF-BOUNDS READ CWE-125\nOpening a specially crafted project file may cause an out of bounds read, which may allow data exfiltration.\nCVE-2018-19004 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.3    IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94\nOpening a specially crafted project file may cause improper control of generation of code, which may allow remote code execution, data exfiltration, or cause a system crash.\nCVE-2018-19002 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    UNTRUSTED POINTER DEREFERENCE CWE-822\nAn attacker using a specially crafted project file can supply a pointer for a controlled memory address, which may allow remote code execution, data exfiltration, or cause a system crash.\nCVE-2018-19029 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.5    OUT-OF-BOUNDS WRITE CWE-787\nOpening specially crafted report format file may cause an out of bounds read, which may cause a system crash, allow data exfiltration, or remote code execution.\nCVE-2018-18986 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.6    RELATIVE PATH TRAVERSAL CWE-23\nThe issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to disclose sensitive information under the context of the web server process.\nCVE-2018-18990 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.7    OUT-OF-BOUNDS READ CWE-125\nOpening specially crafted project file may cause an out of bounds read, which may cause a system crash or allow data exfiltration.\nCVE-2018-18994 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.8    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS IN OUTPUT USED BY A DOWNSTREAM COMPONENT ('INJECTION') CWE-74\nTaking in user input without proper sanitation may allow an attacker to execute remote code on the server.\nCVE-2018-18992 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n3.2.9    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS IN OUTPUT USED BY A DOWNSTREAM COMPONENT ('INJECTION') CWE-74\nTaking in user input without proper authorization or sanitation may allow an attacker to execute remote code on the server.\nCVE-2018-18996 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.10    USE OF HARD-CODED CREDENTIALS CWE-798\nUse of hard coded credentials may allow an attacker unauthorized access to the system with high-privileges.\nCVE-2018-18998 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.11    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nAn authentication bypass is possible, which may allow an attacker access to sensitive data.\nCVE-2018-19000 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: South America\nCOMPANY HEADQUARTERS LOCATION: Brazil\n\n3.4 RESEARCHER\nEsteban Ruiz (mr me) working with Zero Day Initiative reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nLCDS recommends users update to Version 4.1.0.4150 which can be found at the following location:\nhttps://laquisscada.com\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-18992",
    "CVE-2018-18994",
    "CVE-2018-18986",
    "CVE-2018-19000",
    "CVE-2018-18996",
    "CVE-2018-19002",
    "CVE-2018-19004",
    "CVE-2018-19029",
    "CVE-2018-18990",
    "CVE-2018-18998",
    "CVE-2018-18988"
  ],
  "techniques": [],
  "advisory": "icsa-19-015-01",
  "title": "LCDS - Leão Consultoria e Desenvolvimento de Sistemas Ltda ME LAquis SCADA | CISA",
  "source": "ics-advisories",
  "id": "dc21d603790e7bc9f7834d30f87d118c241fe1aa191e86418842b82c46704ca4"
}