{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Teamcenter Active Workspace\nVulnerability: Cross-site Scripting\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow for malicious code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Smart Security Manager, a software management platform, are affected:\n\nTeamcenter Active Workspace v5.2: All versions prior to 5.2.9\nTeamcenter Active Workspace v6.0: All versions prior to 6.0.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION (‘CROSS-SITE SCRIPTING’) CWE-79\nThe affected product is vulnerable to a reflected cross-site scripting (XSS) vulnerability that exists in the web interface of the affected application that could allow an attacker to execute malicious code by tricking users into accessing a malicious link.\nCVE-2022-32145 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nHan Lee from Apple Information Security reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends updating to the latest versions:\n\nTeamcenter Active Workspace update to v5.2.9 or later\nTeamcenter Active Workspace update to v6.0.3 or later\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nUtilize a modern web browser with integrated XSS filtering mechanisms.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-401167\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-32145"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-15",
  "title": "Siemens Teamcenter Active Workspace | CISA",
  "source": "ics-advisories",
  "id": "bb5d8ba76e9bdbc0521082a99d36db040b84f9946cb1220a011fa866b1a4be4d"
}