{
  "markdown": "\nCVSS v3 7.4\nATTENTION: Remotely exploitable.\nVendor: Siemens\nEquipment: SINUMERIK Integrate, SINUMERIK Operate\nVulnerability: Man-in-the-Middle\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following SINUMERIK Integrate and Operate product suite versions:\n\nSINUMERIK Integrate Access MyMachine/Ethernet with\n\nAMM Service Engineer Client (ActiveX): All versions.\n\n\nSINUMERIK Integrate Access MyMachine/Ethernet and Analyze MyCondition with\n\nSINUMERIK Integrate Operate Client:\n\nAll versions between 2.0.3.00.016 (including) and 2.0.6 (excluding), and\nAll versions between 3.0.4.00.032 (including) and 3.0.6 (excluding).\n\n\nAffected SINUMERIK Integrate Operate clients are included in the following Operate releases:\n\nAll versions between V4.5 SP6 (including) and V4.5 SP6 Hotfix 8 (excluding), and\nAll versions between V4.7 SP2 Hotfix 1 (including) and V4.7 SP4 (excluding).\n\n\n\n\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow attackers in a privileged network position to capture and modify network traffic protected with transport layer security.\nMITIGATION\nSiemens provides the following updates for affected SINUMERIK Integrate and SINUMERIK Operate versions:\n\nSINUMERIK Integrate Access MyMachine/Ethernet and Analyze MyCondition with\n\nSINUMERIK Operate V4.7:\n\nUpdate to SINUMERIK Operate V4.7 SP4, or\nUpdate SINUMERIK Integrate Operate Client to V3.0.6\n\n\nSINUMERIK Operate V4.5:\n\nUpdate to SINUMERIK Operate V4.5 SP6 Hotfix 8, or\nUpdate SINUMERIK Integrate Operate Client to V2.0.6\n\n\n\n\nSINUMERIK Integrate Access MyMachine/Ethernet with\n\nAMM Service Engineer (ActiveX):\n\nReplace with AMM Service Client V4.1.0.5\nReplacement will be automatically installed when connecting to SINUMERIK Integrate V4.1 SP5 or newer.\n\n\n\n\n\nThese updates can be obtained from a local Siemens service organization. If assistance is needed in identifying a local Siemens service organization, users may contact a local Siemens hotline at the following link:\nhttps://w3.siemens.com/aspa_app/\nAs a general security measure Siemens strongly recommends users configure their environment according to Siemens operational guidelines found below:\nhttps://www.industry.siemens.com/topics/global/en/industrial-security/Documents/operational_guidelines_industrial_security_en.pdf\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-934525 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nMAN-IN-THE-MIDDLE CWE-300\n\nA channel accessible by non-endpoint (‘man-in-the-middle’) vulnerability has been identified. This could allow an unverified attacker to eavesdrop, capture, or modify communications.\nCVE-2017-2685 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\nBACKGROUND\nCritical Infrastructure Sector(s): Energy, Healthcare and Public Health, and Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-2685"
  ],
  "techniques": [],
  "advisory": "icsa-17-061-03",
  "title": "Siemens SINUMERIK Integrate and SINUMERIK Operate | CISA",
  "source": "ics-advisories",
  "id": "1c5333918b3ad8d54e010c8a2b8c0e1299bbf790e1fbb9f4a2481f36361be2a5"
}