{
  "markdown": "\nCVSS v3 8.6\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Moxa\nEquipment: NPort 5110, 5130, 5150\nVulnerabilities: Injection, Information Exposure, Resource Exhaustion\nAFFECTED PRODUCTS\nThe following versions of NPort, a serial network interface, are affected:\n\nNPort 5110 Version 2.2,\nNPort 5110 Version 2.4,\nNPort 5110 Version 2.6,\nNPort 5110 Version 2.7,\nNPort 5130 Version 3.7 and prior, and\nNPort 5150 Version 3.7 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow for remote code execution on the device.\nMITIGATION\nMoxa has produced new firmware for the affected devices that can be downloaded from:\nNPort 5110 https://www.moxa.com/support/download.aspx?type=support&id=882\nNPort 5130 and NPort 5150 https://www.moxa.com/support/download.aspx?type=support&id=356\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS IN OUTPUT USED BY A DOWNSTREAM COMPONENT ('INJECTION') CWE-74\n\nAn attacker may be able to inject packets that could potentially disrupt the availability of the device.\nCVE-2017-16719 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nINFORMATION EXPOSURE CWE-200\n\nAn attacker may be able to exploit a flaw in the handling of Ethernet frame padding that may allow for information exposure.\nCVE-2017-16715 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n\nUNCONTROLLED RESOURCE CONSUMPTION ('RESOURCE EXHAUSTION') CWE-400\n\nAn attacker may be able to exhaust memory resources by sending a large amount of TCP SYN packets.\nCVE-2017-14028 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nFlorian Adamsky reported the vulnerabilities to ICS-CERT and tested the new firmware.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, and Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-16715",
    "CVE-2017-16719",
    "CVE-2017-14028"
  ],
  "techniques": [],
  "advisory": "icsa-17-320-01",
  "title": "Moxa NPort 5110, 5130, and 5150 | CISA",
  "source": "ics-advisories",
  "id": "4452870783618f1dc13f86b1a2c953d9d1d99cf32fcde673996197b6878835b2"
}