{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.7\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: PowerFlex 527\nVulnerabilities: Improper Input Validation, Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of this these vulnerabilities could crash the device and require a manual restart to recover.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports that the following versions of PowerFlex 527 adjustable frequency AC drives are affected:\n\nPowerFlex 527: Versions v2.001.x and later\n\n3.2 Vulnerability Overview\n3.2.1 Improper Input Validation CWE-120\nA denial-of-service vulnerability exists in the PowerFlex 527 due to improper input validation in the device. If exploited, the web server will crash and need a manual restart to recover it.\nCVE-2024-2425 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nA CVSS v4 score has been calculated for CVE-2024-2425. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.2.2 Improper Input Validation CWE-120\nA denial-of-service vulnerability exists in the PowerFlex 527 due to improper input validation in the device. If exploited, a disruption in the CIP communication will occur and a manual restart will be required by the user to recover it.\nCVE-2024-2426 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nA CVSS v4 score has been calculated for CVE-2024-2426. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.2.3 Uncontrolled Resource Consumption CWE-400\nA denial-of-service vulnerability exists in the PowerFlex 527 due to improper traffic throttling in the device. If multiple data packets are sent to the device repeatedly the device will crash and require a manual restart to recover.\nCVE-2024-2427 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nA CVSS v4 score has been calculated for CVE-2024-2427. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to CISA.\n4. MITIGATIONS\nRockwell Automation does not currently have a fix for these vulnerabilities. Users of the affected software are encouraged to apply risk mitigations and security best practices, where possible.\n\nImplement network segmentation confirming the device is on an isolated network.\nDisable the web server, if not needed. The web server is disabled by default. Disabling this feature is available in v2.001.x and later.\nSecurity Best Practices\n\nFor more information, visit Rockwell Automation's security advisory page.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nMarch 26, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-2425",
    "CVE-2024-2426",
    "CVE-2024-2427"
  ],
  "techniques": [],
  "advisory": "icsa-24-086-02",
  "title": "Rockwell Automation PowerFlex 527 | CISA",
  "source": "ics-advisories",
  "id": "77a559dd90b517e3ff1d31c8890b8fd90dc6606837e8b5440805f236e3b360c9"
}