{
  "markdown": "\nCVSS v3 4.9\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: SIMATIC WinCC and SIMATIC WinCC Runtime Professional\nVulnerability: Denial of Service\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following versions of SIMATIC WinCC, SIMATIC WinCC (TIA Portal), and SIMATIC WinCC Runtime Professional:\n\nSIMATIC WinCC:\n\nV7.3: All versions prior to V7.3 Update 11, and\nV7.4: All versions prior to V7.4 SP1.\n\n\nSIMATIC WinCC Runtime Professional:\n\nV13: All versions prior to V13 SP2, and\nV14: All versions prior to V14 SP1.\n\n\nSIMATIC WinCC (TIA Portal) Professional:\n\nV13: All versions prior to V13 SP2, and\nV14: All versions prior to V14 SP1.\n\n\n\nIMPACT\nSuccessful exploitation of this vulnerability under certain circumstances may allow the attacker to cause the affected service to crash, resulting in a denial-of-service condition.\nMITIGATION\nSiemens has released updates for the following products and strongly encourages users to upgrade to the new versions as soon as possible:\n\nSIMATIC WinCC:\n\nV7.3: Update to WinCC V7.3 Update 13\n\n\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746452\n\nV7.4: Update to WinCC V7.4 SP1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746038\n\nSIMATIC WinCC Runtime Professional:\n\nV13: Update to V13 SP2\n\n\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746268\n\nV14: Update to V14 SP1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746276\n\nSIMATIC WinCC (TIA Portal) Professional:\n\nV13: Update to V13 SP2\n\n\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746075\n\nV14: Update to V14 SP1\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109746074\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-156872 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nAs a general security measure Siemens strongly recommends protecting network access to SIMATIC WinCC, SIMATIC WinCC Runtime, and SIMATIC WinCC (TIA Portal) Professional stations with appropriate mechanisms. Siemens advises configuring the environment according to Siemens operational guidelines in order to run the devices in a protected IT environment.\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION CWE-20\n\nAn authenticated, remote attacker who is a member of the “administrators” group could crash services by sending specially crafted messages to the DCOM interface.\nCVE-2017-6867 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nSergey Temnikov and Vladimir Dashchenko of the Kaspersky Lab Critical Infrastructure Defense Team reported this vulnerability directly to Siemens.\nBACKGROUND\nCritical Infrastructure Sectors: Food and Agriculture, Chemical, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-6867"
  ],
  "techniques": [],
  "advisory": "icsa-17-129-03",
  "title": "Siemens SIMATIC WinCC and SIMATIC WinCC Runtime Professional | CISA",
  "source": "ics-advisories",
  "id": "39276f444ab80e3a38fefe437e66ea93f3df9b28ff1df32b9ca59d98a9d80257"
}