{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens \nEquipment: PROFINET Devices\nVulnerability: Allocation of Resources Without Limits or Throttling\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-194-03 Siemens PROFINET Devices (Update C) that was published October 14, 2021, to the ICS webpage on www.cisa.gov/uscert. \n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to perform a denial-of-service attack if a large amount of PROFINET Discovery and Configuration Protocol (DCP) reset packets is sent to the affected devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATIC PROFINET Driver: All versions prior to v2.3\nSIMATIC NET CM 1542-1: All versions prior to v3.0\nSCALANCE X204-2 (incl. SIPLUS NET variant): All versions prior to v5.2.5\nSCALANCE X204-2FM: All versions prior to v5.2.5\nSCALANCE X204-2LD (incl. SIPLUS NET variant): All versions prior to v5.2.5\nSCALANCE X20204-2LD TS: All versions prior to v5.2.5\nSCALANCE X204 -2TS: All versions prior to v5.2.5\nSCALANCE X206-1: All versions prior to v5.2.5\nSCALANCE X206-1LD (incl. SIPLUS NET variant): All versions prior to v5.2.5\nSCALANCE X208 (incl. SIPLUS NET variant): All versions prior to v5.2.5\nSCALANCE X208PRO: All versions prior to v5.2.5\nSCALANCE X212-2: All versions prior to v5.2.5\nSCALANCE X12-2LD: All versions prior to v5.2.5\nSCALANCE X216: All versions prior to v5.2.5\nSCALANCE X224: All versions prior to v5.2.5\nDevelopment/Evaluation Kits for PROFINET IO: DK Standard Ethernet Controller: All versions\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200: All versions\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200P: All versions\nRUGGEDCOM RM1224: All versions prior to v6.4\nSCALANCE M-800: All versions prior to v6.4\nSCALANCE S615: All versions prior to v6.4\nSCALANCE W700 IEEE 802.11n: All versions\nSCALANCE W700 IEEE 802.11ac: All versions\nSCALANCE X200-4 P IRT: All versions prior to v5.5.0\nSCALANCE X201-3P IRT: All versions prior to v5.5.0\nSCALANCE X201-3P IRT PRO: All versions prior to v5.5.0\nSCALANCE X202-2 IRT: All versions prior to v5.5.0\nSCALANCE X202-2P IRT (incl. SIPLUS NET variant): All versions prior to v5.5.0\nSCALANCE X202-2P IRT PRO: All versions prior to v5.5.0\nSCALANCE X204 IRT: All versions prior to v5.5.0\nSCALANCE X204 IRT PRO: All versions prior to v5.5.0\nSCALANCE X204-2 (incl. SIPLUS NET variant): All versions\nSCALANCE X204-2FM: All versions\nSCALANCE X204-2LD (incl. SIPLUS NET variant): All versions\nSCALANCE X20204-2LD TS: All versions\nSCALANCE X204 -2TS: All versions\nSCALANCE X206-1: All versions\nSCALANCE X206-1LD (incl. SIPLUS NET variant): All versions\nSCALANCE X208 (incl. SIPLUS NET variant): All versions\nSCALANCE X208PRO: All versions\nSCALANCE X212-2: All versions\nSCALANCE X12-2LD: All versions\nSCALANCE X216: All versions\nSCALANCE X224: All versions\nSCALANCE X302-7EEC: All versions\nSCALANCE 304-2FE: All versions\n\n--------- Begin Update D Part 1 of 2 ---------\n\nSCALANCE W1748-1 M12: All versions prior to v3.0.0\nSCALANCE W1788-1 M12: All versions prior to v3.0.0\nSCALANCE W1788-2 EEC M12: All versions prior to v3.0.0\nSCALANCE W1788-2 M12: All versions prior to v3.0.0\nSCALANCE W1788-2IA M12: All versions prior to v3.0.0\nSCALANCE X302-7EEC: All versions prior to v4.1.4\nSCALANCE X306-1LDFE: All versions prior to v4.1.4\nSCALANCE X307-2EEC: All versions prior to v4.1.4\nSCALANCE X307-3: All versions prior to v4.1.4\nSCALANCE X307-3LD: All versions prior to v4.1.4\nSCALANCE X308-2 (incl. SIPLUS NET variant) All versions prior to v4.1.4\nSCALANCE X308-2LD: All versions prior to v4.1.4\nSCALANCE X308-2LH: All versions prior to v4.1.4\nSCALANCE X308-2LH+: All versions prior to v4.1.4\nSCALANCE X308-2M: All versions prior to v4.1.4\nSCALANCE X308-2M POE: All versions prior to v4.1.4\nSCALANCE X308-2M TS: All versions prior to v4.1.4\nSCALANCE X310: All versions prior to v4.1.4\nSCALANCE X310FE: All versions prior to v4.1.4\nSCALANCE X320-1FE: All versions prior to v4.1.4\nSCALANCE X320-3LDFE: All versions prior to v4.1.4\nSCALANCE X408-2: All versions prior to v4.1.4\n\n--------- End Update D Part 1 of 2 ---------\n\nSCALANCE XB-200: All versions\nSCALANCE XC-200: All versions\nSCALANCE XF201-3P IRT: All versions prior to v5.5.0\nSCALANCE XF202-2P IRT: All versions prior to v5.5.0\nSCALANCE XF204: All versions\nSCALANCE XF204 IRT: All versions prior to v5.5.0\nSCALANCE XF204-2 (incl. SIPLUS NET variant): All versions\nSCALANCE XF204-2BA IRT: All versions prior to v5.5.0\nSCALANCE XF206-1: All versions\nSCALANCE XF208: All versions\nSCALANCE XF-200BA: All versions\nSCALANCE XM400: All versions prior to v6.3.1\nSCALANCE XP-200: All versions\nSCALANCE XR324-4M EEC: All versions\nSCALANCE XR324-4M POE: All versions\nSCALANCE XR324-4M POE TS: All versions\nSCALANCE XR324-12M: All versions\nSCALANCE XR324-12M TS: All versions\nSCALANCE XR500: All versions prior to v6.3.1\nSCALANCE XR-300WG: All versions\nSIMATIC CFU PA: All versions\nSIMATIC IE/PB-LINK V3: All versions\nSIMATIC MV500 family: All versions prior to v3.0\nSIMATIC NET CM 1542-1: All versions\nSIMATIC NET CP1616/CP1604: All Versions 2.7 and prior\nSIMATIC NET CP1626: All versions\nSIMATIC NET DK-16xx PN IO: All Versions 2.7 and prior\nSIMATIC Power Line Booster PLB, Base Module (MLFB: 6ES7972-5AA10-0AB0): All versions\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): All versions prior to v4.5\nSIMOCODE proV Ethernet/IP: All versions prior to v1.1.3\nSIMOCODE proV PROFINET: All versions prior to v2.1.3\nSOFTNET-IE PNIO: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    ALLOCATION OF RESOURCES WITHOUT LIMITS OR THROTTLING CWE-770\nAffected devices contain a vulnerability that allows an unauthenticated attacker to trigger a denial-of-service condition. This vulnerability can be triggered if a large amount of DCP resent packets are sent to the device.\nCVE-2020-28400 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has provided remediations for the following affected products:\n--------- Begin Update D Part 2 of 2 ---------\n\nSCALANCE X300 switch family: Update to v4.1.4.3 or later version\nSCALANCE X408 (incl. SIPLUS Net variants): Update to v4.1.4.3 or later version\nSCALANCE W-1700 family: Update to v3.0.0 or later version\n\n--------- End Update D Part 2 of 2 -------\n\nSIMATIC NET CM 1542-1, All versions prior to v3.0: Update to v3.0 or later version\nSCALANCE X204-2 (incl. SIPLUS NET variant), All versions: Update to v5.2.5 or later version\nSCALANCE X204-2FM, All versions: Update to v5.2.5 or later version\nSCALANCE X204-2LD (incl. SIPLUS NET variant), All versions: Update to v5.2.5 or later version\nSCALANCE X204-2LD TS, All versions: Update to v5.2.5 or later version\nSCALANCE X204 -2TS, All versions: Update to v5.2.5 or later version\nSCALANCE X206-1, All versions: Update to v5.2.5 or later version\nSCALANCE X206-1LD (incl. SIPLUS NET variant), All versions: Update to v5.2.5 or later version\nSCALANCE X208 (incl. SIPLUS NET variant), All versions: Update to v5.2.5 or later version\nSCALANCE X208PRO, All versions: Update to v5.2.5 or later version\nSCALANCE X212-2, All versions: Update to v5.2.5 or later version\nSCALANCE X212-2LD, All versions: Update to v5.2.5 or later version\nSCALANCE X216, All versions: Update to v5.2.5 or later version\nSCALANCE X224, All versions: Update to v5.2.5 or later version\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200P: Update to v4.7or later version\nSCALANCE XR-300WG, All versions prior to v4.3: Update to v4.3 or later version\nSCALANCE XB-200, All versions prior to v4.3: Update to v4.3 or later version\nSCALANCE XP-200, All versions prior to v4.3: Update to v4.3 or later version\nSCALANCE XC-200, All versions prior to v4.3: Update to v4.3 or later version\nSCALANCE XF-200BA, All versions prior to v4.3: Update to v4.3 or later version\nRUGGEDCOM RM1224, All versions prior to v6.4: Update to v6.4 or later version\nSCALANCE M-800, All versions prior to v6.4: Update to v6.4 or later version\nSCALANCE S615, All versions prior to v6.4: Update to v6.4 or later version\nSCALANCE X200-4 P IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE X201-3P IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE X201-3P IRT PRO, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE X202-2 IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE X202-2P IRT (incl. SIPLUS NET variant), All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE X202-2P IRT PRO, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE X204 IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE X204 IRT PRO, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE XF201-3P IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE XF202-2P IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE XF204 IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE XF204-2BA IRT, All versions prior to v5.5.0: Update to v5.5.0 or later version\nSCALANCE XM400, All versions prior to v6.3.1: Update to v6.3.1 or later version\nSCALANCE XR500, All versions prior to v6.3.1: Update to v6.3.1 or later version\nSIMATIC MV500 family, All versions prior to v3.0: Update to v3.0 or later version\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants), All versions prior to v4.5: Update to v4.5 or later version \nSIMOCODE proV Ethernet/IP, All versions prior to v1.1.3: Update to v1.1.3 or later version\nSIMOCODE proV PROFINET, All versions prior to v2.1.3: Update to v2.1.3 or later version\n\nSiemens has also identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nBlock incoming PROFINET Discovery and Configuration Protocol (PCP) packets (Ethertype 0x8892, Frame-ID: 0xfefe) from untrusted networks.\nDisable PROFINET in products, where PROFINET is optional and not used in the environment.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for Industrial Security, and to follow the recommendations in the product manuals.\nAdditional information on Industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity \nFor more information about this vulnerability and the associated remediations, please see Siemens publication number SSA-599968\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-28400"
  ],
  "techniques": [],
  "advisory": "icsa-21-194-03",
  "title": "Siemens PROFINET Devices (Update D) | CISA",
  "source": "ics-advisories",
  "id": "083adf78337ecd820b7d6daaf6b296a2b0be75aaf684d459e0109b45cbd367c6"
}