{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely \nVendor: Mitsubishi Electric \nEquipment: MELSEC iQ-F and iQ-R Series products \nVulnerability: Predictable Seed in Pseudo-Random Number Generator (PRNG) \n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-23-017-02 Mitsubishi Electric MELSEC iQ-F, iQ-R Series (Update A) that was published January 17, 2023, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access the WEB server function by guessing the random numbers used for authentication. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Mitsubishi Electric MELSEC products are affected:\n\nMELSEC iQ-F Series with serial number 17X**** or later: \n\nFX5U-xMy/z x=32,64,80, y=T,R, z=ES,DS,ESS,DSS: Versions 1.280 and prior\nFX5UC-xMy/z x=32,64,96 y=T, z=D,DSS: Versions 1.280 and prior\n\n\nMELSEC iQ-F Series with serial number 179**** and prior: \n\nFX5U-xMy/z x=32,64,80, y=T,R, z=ES,DS,ESS,DSS: Versions 1.074 and prior\nFX5UC-xMy/z x=32,64,96 y=T, z=D,DSS: Versions 1.074 and prior\n\n\nMELSEC iQ-F Series FX5UC-32MT/DS-TS, FX5UC-32MT/DSS-TS, FX5UC-32MR/DS-TS: Versions 1.280 and prior\nFX5UJ-xMy/z x=24,40,60, y=T,R, z=ES,ESS: Versions 1.042 and prior\nFX5UJ-xMy/ES-A* x=24,40,60, y=T,R: Versions 1.043 and prior\nFX5S-xMy/z x=30,40,60,80, y=T,R, z=ES,ESS: Versions 1.003 and prior\n\n--------- Begin Update B Part 1 of 3 ---------\n\nMELSEC iQ-R Series R00/01/02CPU: Versions 33 and prior \nMELSEC iQ-R Series R04/08/16/32/120(EN)CPU: Versions 66 and prior \n\n--------- End Update B Part 1 of 3 ---------\n* These products are available in limited regions.\n4.2 VULNERABILITY OVERVIEW\n4.2.1 PREDICTABLE SEED IN PSEUDO-RANDOM NUMBER GENERATOR (PRNG) CWE-337 \nMitsubishi Electric MELSEC iQ-F and iQ-R Series products both contain an authentication bypass vulnerability in the WEB server function due to predictable seed in the pseudo-random number generator. \nCVE-2022-40267 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N). \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan \n\n4.4 RESEARCHER\nMatt Wiseman of Cisco Talos reported this vulnerability to Mitsubishi Electric. \n5. MITIGATIONS\nMitsubishi Electric has fixed the following products and recommends users apply the latest firmware update to the follow products: \n\nMELSEC iQ-F Series with serial number 17X**** or later:\n\nFX5U-xMy/z x=32,64,80, y=T,R, z=ES,DS,ESS,DSS: Update to v1.281 or later\nFX5UC-xMy/z x=32,64,96 y=T, z=D,DSS: Update to v1.281 or later\n\n\nMELSEC iQ-F Series with serial number 179**** and prior:\n\nFX5U-xMy/z x=32,64,80, y=T,R, z=ES,DS,ESS,DSS: Update to v1.075 or later\nFX5UC-xMy/z x=32,64,96 y=T, z=D,DSS: Update to v1.075 or later\n\n\nMELSEC iQ-F Series FX5UC-32MT/DS-TS, FX5UC-32MT/DSS-TS, FX5UC-32MR/DS-TS: Update to v1.281 or later\nFX5UJ-xMy/z x=24,40,60, y=T,R, z=ES,ESS: Update to v1.044 or later\nFX5UJ-xMy/ES-A* x=24,40,60, y=T,R: Update to v1.045 or later\nFX5S-xMy/z x=30,40,60,80, y=T,R, z=ES,ESS: Update to v1.004 or later\n\n--------- Begin Update B part 2 of 3 ---------\n\nMELSEC iQ-R Series R00/01/02CPU: Versions 34 or later \nMELSEC iQ-R Series R04/08/16/32/120(EN)CPU: Versions 67 or later \n\n--------- End Update B part 2 of 3 ---------\n* These products are available in limited regions. Users should contact Mitsubishi Electric to receive fixed versions.\nRefer to the following product manual for updating the firmware: \n\"5 FIRMWARE UPDATE FUNCTION\" in the MELSEC iQ-F FX5 User's Manual (Application) \n--------- Begin Update B part 3 of 3 ---------\nMELSEC iQ-R Module Configuration Manual “Appendix 2 Firmware Update Function” \n--------- End Update B part 3 of 3 ---------\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting this vulnerability:  \n\nUse a firewall or virtual private network (VPN), etc. to prevent unauthorized access when internet access is required. \nUse products inside a local area network (LAN) and block access from untrusted networks and hosts through firewalls.  \nUse the IP filter function* to block access from untrusted hosts.  For details on the IP filter function, refer to the manuals for each product: \n\"12.1 IP Filter Function\" in the MELSEC iQ-F FX5 User's Manual (Ethernet Communication)  \n\"1.13 Security\" - \"IP filter\" in the MELSEC iQ-R Ethernet User’s Manual (Application) \n\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity. \n",
  "cves": [
    "CVE-2022-40267"
  ],
  "techniques": [],
  "advisory": "icsa-23-017-02",
  "title": "Mitsubishi Electric MELSEC iQ-F, iQ-R Series (Update B) | CISA",
  "source": "ics-advisories",
  "id": "e490694d8b2becfb48e6fcbe831c3eac2be1ab7847a2668fb958d8c3291e0db1"
}