{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Automation License Manager (ALM)\nVulnerabilities: External Control of File Name or Path, Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to modify and rename license files, extract licenses, and overwrite arbitrary files on the target system, potentially leading to privilege escalation and remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following software from Siemens is affected:\n\nAutomation License Manager V5: All versions\nAutomation License Manager V6: All versions prior to V6.0 SP9 Upd4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 EXTERNAL CONTROL OF FILE NAME OR PATH CWE-73\nThe affected components allow the renaming of license files with user input without authentication. This could allow an unauthenticated remote attacker to rename and move files as a SYSTEM user.\nCVE-2022-43513 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:L)\n3.2.2 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe affected component does not correctly validate the root path for folder related operations, allowing modification of files and folders outside the intended root directory. This could allow an unauthenticated remote user to execute file operations of files outside of the specified root folder. Chained with CVE-2022-43513, this could allow remote code execution.\nCVE-2022-43514 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:L)\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nEran Jacob from OTORIO reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nAutomation License Manager V6: Update to V6.0 SP9 Upd4 or later version\nLimit remote access to port 4410/TCP to trusted systems only.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information, see the associated Siemens Security Advisory SSA-476715 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.  \n",
  "cves": [
    "CVE-2022-43513",
    "CVE-2022-43514"
  ],
  "techniques": [],
  "advisory": "icsa-23-012-10",
  "title": "Siemens Automation License Manager | CISA",
  "source": "ics-advisories",
  "id": "60660f401ad1f1f4d0e0150d5eb15026b7fe93be5c55f251d371e9fb0aa3f339"
}