{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Ovarro\nEquipment: TBoxLT2 (All models), TBox MS-CPU32, TBox MS-CPU32-S2, TBox RM2 (All models), TBox TG2 (All models)\n\n--------- Begin Update A Part 1 of 3 ---------\n\nVulnerabilities: Code Injection, Incorrect Permission Assignment for Critical Resource, Uncontrolled Resource Consumption, Insufficiently Protected Credentials, Use of Hard-coded Cryptographic Key, Relative Path Traversal\n\n--------- End Update A Part 1 of 3 ---------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-054-04 Ovarro TBox that was published March 23, 2021, to the ICS webpage on us-cert.cisa.gov. The original advisory was titled ICSA-21-054-04P Ovarro TBox and posted to the HSIN ICS library on February 23, 2021. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in remote code execution, which may cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of TBox, a remote terminal unit (RTU), are affected:\n\nTBoxLT2 (All models)\nTBox MS-CPU32\nTBox MS-CPU32-S2\nTBox RM2 (All models)\nTBox TG2 (All models)\nAll versions prior to TWinSoft 12.4 and Firmware 1.46\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94\nThe “ipk” package containing the configuration created by TWinSoft can be uploaded, extracted, and executed in the TBox, allowing malicious code execution.\nCVE-2021-22646 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nThe TBox proprietary Modbus file access functions allow attackers to read, alter, or delete the configuration file.\nCVE-2021-22648 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAn attacker could use specially crafted invalid Modbus frames to crash the system.\nCVE-2021-22642 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.4    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nAn attacker can decrypt the login password by communication capture and brute force attacks.\nCVE-2021-22640 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.5    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nTWinSoft uses the custom hardcoded user “TWinSoft” with a hardcoded key.\nCVE-2021-22644 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- Begin Update A Part 2 of 3 ---------\n4.2.6    RELATIVE PATH TRAVERSAL CWE-23\nAn attacker may use TWinSoft and a malicious source project file (TPG) to extract files on machine executing TWinSoft, which could lead to code execution.\nCVE-2021-22650 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- End Update A Part 2 of 3 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n4.4 RESEARCHER\nUri Katz of Claroty reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 3 of 3 ---------\nOvarro recommends affected users update to 12.5 or later of TWinSoft to mitigate these vulnerabilities.\n--------- End Update A Part 3 of 3 ---------\nThe latest version can be found on www.ovarro.com in the customer support section (service portal).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-22642",
    "CVE-2021-22646",
    "CVE-2021-22640",
    "CVE-2021-22650",
    "CVE-2021-22644",
    "CVE-2021-22648"
  ],
  "techniques": [],
  "advisory": "icsa-21-054-04",
  "title": "Ovarro TBox (Update A) | CISA",
  "source": "ics-advisories",
  "id": "202aeec7254914133654bdf33048dfc456887af2ddc98dcbeda5485c27734a00"
}