{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9 \nATTENTION: Exploitable remotely/low attack complexity\nVendor:  Siemens\nEquipment: Siveillance Video\nVulnerabilities: Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an authenticated remote attacker to execute code on the affected system. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following IP video management software: \n\nSiveillance Video 2020 R2: all versions prior to V20.2 HotfixRev14\nSiveillance Video 2020 R3: all versions prior to V20.3 HotfixRev12\nSiveillance Video 2021 R1: all versions prior to V21.1 HotfixRev12\nSiveillance Video 2021 R2: all versions prior to V21.2 HotfixRev8\nSiveillance Video 2022 R1: all versions prior to V22.1 HotfixRev7\nSiveillance Video 2022 R2: all versions prior to V22.2 HotfixRev5\nSiveillance Video 2022 R3: all versions prior to V22.3 HotfixRev2\nSiveillance Video 2023 R1: all versions prior to V23.1 HotfixRev1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 DESERIALIZATION OF UNTRUSTED DATA CWE-502 \nThe Event Server component of affected Siemens Siveillance Video applications deserializes data without sufficient validations. This could allow an authenticated remote attacker to execute code on the affected system. \nCVE-2023-30898 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated. The CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). \n3.2.2 DESERIALIZATION OF UNTRUSTED DATA CWE-502 \nThe Management Server component of affected Siemens Siveillance Video applications deserializes data without sufficient validations. This could allow an authenticated remote attacker to execute code on the affected system. \nCVE-2023-30899 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated. The CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\nCRITICAL INFRASTRUCTURE SECTORS: Communications, Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n3.4 RESEARCHER\nMilestone PSIRT reported these vulnerabilities to Siemens. \n4. MITIGATIONS\nSiemens has released updates for several affected products and recommends updating to the latest versions. The provided cumulative hotfix releases include the fixes for both Event Server (ES) and Management Server (MS). Ensure to apply the fixes on all relevant deployed servers: \n\nSiveillance Video 2020 R2: Update to V20.2 HotfixRev14 or later version\nSiveillance Video 2020 R3: Update to V20.3 HotfixRev12 or later version\nSiveillance Video 2021 R1: Update to V21.1 HotfixRev12 or later version\nSiveillance Video 2021 R2: Update to V21.2 HotfixRev8 or later version\nSiveillance Video 2022 R1: Update to V22.1 HotfixRev7 or later version\nSiveillance Video 2022 R2: Update to V22.2 HotfixRev5 or later version\nSiveillance Video 2022 R3: Update to V22.3 HotfixRev2 or later version\nSiveillance Video 2023 R1: Update to V23.1 HotfixRev1 or later version\n\nAs a general security measure Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices to run the devices in a protected IT environment. \nFor additional information regarding this vulnerability, see the related Milestone security advisory.\nFor further inquiries on security vulnerabilities in Siemens products, users should contact the Siemens ProductCERT.  \nFor more information, see the associated Siemens security advisory SSA-789345 in HTML and CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should: \n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. \nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. \nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. \nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have low attack complexity. \n",
  "cves": [
    "CVE-2023-30899",
    "CVE-2023-30898"
  ],
  "techniques": [],
  "advisory": "icsa-23-131-03",
  "title": "Siemens Siveillance Video Event and Management Servers | CISA",
  "source": "ics-advisories",
  "id": "5bd6f9169d0515a9abb88bf8aca2a19f70b61858a5eaf7a601f27f017ad6624d"
}