{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). \nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: low attack complexity\nVendor: Siemens\nEquipment: SIMATIC PCS neo Administration Console\nVulnerability: Insertion of Sensitive Information into Externally-Accessible File or Directory\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could get the credentials, and impersonate the admin user, thereby gaining admin access to other Windows systems.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports that the following products are affected:\n\nSIMATIC PCS neo (Administration Console): V4.0\nSIMATIC PCS neo (Administration Console): V4.0 Update 1\n\n3.2 Vulnerability Overview\n3.2.1 Insertion of Sensitive Information into Externally-Accessible File or Directory CWE-538\nThe affected application leaks Windows admin credentials. An attacker with local access to the Administration Console could get the credentials, and impersonate the admin user, thereby gaining admin access to other Windows systems.\nCVE-2023-38558 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released Security Patch 01 for the affected products and recommends users install the patch.\nSiemens has identified the following specific workarounds and mitigations that\ncustomers can apply to reduce the risk:\n\nChange the password of the Windows accounts used for the remote deployment of AC Agent and avoid to remotely deploy AC Agents\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found\nat: https://www.siemens.com/industrialsecurity\nFor more information see the associated Siemens security advisory SSA-646240 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nSeptember 19, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-38558"
  ],
  "techniques": [],
  "advisory": "icsa-23-262-01",
  "title": "Siemens SIMATIC PCS neo Administration Console | CISA",
  "source": "ics-advisories",
  "id": "e5d0dfa25f921a8e34885c2e353747b9300f065c3c3731c897298de757ab31ed"
}