{
  "markdown": "\nCVSS v3 5.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: ABB\nEquipment: netCADOPS Web Application\nVulnerability: Information Exposure\nAFFECTED PRODUCTS\nThe following versions of netCADOPS Web Application, a web interface, are affected:\n\nnetCADOPS Web Application Version 3.4 and prior,\nnetCADOPS Web Application Version 7.1 and prior,\nnetCADOPS Web Application Version 7.2x and prior,\nnetCADOPS Web Application Version 8.0 and prior, and\nnetCADOPS Web Application Version 8.1 and prior.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow critical information about the database to be exposed.\nMITIGATION\nABB has released the following product updates to mitigate the vulnerability:\n\nADMS 3.4.34.6 Release 16, February 2018\nADMS 7.1.16.1 Release 16, February 2018\nADMS 7.2.10 Release 16, February 2018\nADMS 8.0.20 Release 16, February 2018\nADMS 8.1.7.1 Release 16, February 2018\n\nPlease see ABB Cyber Security Advisory number 9AKK107045A9236 for more information about this vulnerability:\nhttp://search.abb.com/library/Download.aspx?DocumentID=9AKK107045A9592&LanguageCode=en&DocumentPartId=&Action=Launch\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nINFORMATION EXPOSURE CWE-200\n\nA vulnerability exists in the password entry section of netCADOPS Web Application that may expose critical database information.\nCVE-2018-5477 has been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:N).\nRESEARCHER\nİsmail Erkek of Barikat Internet Security reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Switzerland\n",
  "cves": [
    "CVE-2018-5477"
  ],
  "techniques": [],
  "advisory": "icsa-18-051-01",
  "title": "ABB netCADOPS Web Application | CISA",
  "source": "ics-advisories",
  "id": "f7e137c60ee994ff7dac6b1856759873fe9eda1fc6fb162645df0232846ca2b6"
}