{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Teamcenter Active Workspace\nVulnerabilities: Generation of Error Message Containing Sensitive Information, Cross-site Scripting, Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to sensitive information disclosure and reflected cross-site scripting.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Smart Security Manager, a software management platform, are affected:\n\nTeamcenter Active Workspace v4: All versions prior to v4.3.9\nTeamcenter Active Workspace v5.0: All versions prior to v5.0.7\nTeamcenter Active Workspace v5.1: All versions prior to v5.1.4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    GENERATION OF ERROR MESSAGE CONTAINING SENSITIVE INFORMATION CWE-209\nThe affected application allows verbose error messages, which allow leaking of sensitive information, such as full paths.\nCVE-2021-33711 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.2    CROSS-SITE SCRIPTING CWE-79\nA reflected cross-site scripting (XSS) vulnerability exists in the web interface of the affected devices that could allow an attacker to execute malicious JavaScript code by tricking users into accessing a malicious link.\nCVE-2021-33710 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n3.2.3    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nBy sending malformed requests, a remote attacker could leak an application token due to an error not properly handled by the system.\nCVE-2021-33709 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends applying updates where applicable:\n\nTeamcenter Active Workspace v4: Update to v4.3.9 or later (login is required)\nTeamcenter Active Workspace v5.0: Update to v5.0.7 or later (login is required)\nTeamcenter Active Workspace v5.1: Update to v5.1.4 or later (login is required)\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nAvoid untrusted files from unknown sources in Teamcenter Active Workspace.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens Operational Guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-622535.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n \n",
  "cves": [
    "CVE-2021-33711",
    "CVE-2021-33709",
    "CVE-2021-33710"
  ],
  "techniques": [],
  "advisory": "icsa-21-194-11",
  "title": "Siemens Teamcenter Active Workspace | CISA",
  "source": "ics-advisories",
  "id": "c50b3d90a9bedd07f4cb8f10053c5b59e31db96eef4daff289299a51f10e2b69"
}