{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: 3S-Smart Software Solutions\nEquipment: CoDeSys\nVulnerabilities: Improper Access Control, Relative Path Traversal\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-13-011-01 3S CoDeSys that was published January 10, 2013, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain unauthorized access and obtain administrative privileges.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following 3S CoDeSys Runtime versions are affected:\n--------- Begin Update A Part 1 of 3 ---------\n\nCODESYS Control Runtime embedded: Versions prior to 2.3.2.8\nCODESYS Control Runtime full: Versions prior to 2.4.7.40\nCODESYS Control RTE: Versions prior to 2.3.7.17\n\nThe CoDeSys Runtime Toolkit is used in several vendor’s products worldwide.\n--------- End Update A Part 1 of 3 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe CoDeSys Runtime Toolkit does not require users to authenticate when connecting to the device. An attacker could obtain administrative privileges on the device by default.  This could allow the attacker to compromise the availability, integrity, and confidentiality of the device.\n---------Begin Update A Part 2 of 3 ---------\nCVE-2012-6068 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n--------- End Update A Part 2 of 3 ---------\n4.2.2    RELATIVE PATH TRAVERSAL CWE-23\nThe CoDeSys Runtime Toolkit’s file transfer functionality does not perform input validation, which allows an attacker to access files and directories outside the intended scope. This may allow an attacker to upload and download any file on the device. This could allow the attacker to affect the availability, integrity, and confidentiality of the device.\n--------- Begin Update A Part 3 of 3 ---------\nCVE-2012-6069 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n--------- End Update A Part 3 of 3 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Commercial Facilities, Energy, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nIndependent researcher Reid Wightman of IOActive, formerly of Digital Bond has validated that the patch, issued by 3S, mitigates theses vulnerabilities.\n5. MITIGATIONS\nCoDeSys recommends upgrading to the latest version, which is Version 3. It can be downloaded here.\n3S released a patch which implements a password for authentication to the device.\nThe patch can be downloaded from the CoDeSys Download Center. 3S also recommends the usage of standard security methods like firewalls or virtual private network (VPN) access to prevent unauthorized access to the controller.\n\nCoDeSys Version 3.X is not affected by these vulnerabilities.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2012-6069",
    "CVE-2012-6068"
  ],
  "techniques": [],
  "advisory": "icsa-13-011-01",
  "title": "3S CoDeSys (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0194514a60c0eb98d5cdfc370ae1d64025a67129aa85294d9a9d44da5f0f72af"
}