{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.4\n\nATTENTION: Low skill level to exploit\nVendor: GE\nEquipment: Mark VIe, EX2100e, EX2100e_Reg, and LS2100e \nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access system data, which could result in escalation of privilege and unauthorized access to the controller.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Mark Vie, a distributed control system, and associated products are affected:\n\nMark VIe Versions 03.03.28C to 05.02.04C,\nEX2100e All versions prior to v04.09.00C,\nEX2100e_Reg All versions prior to v04.09.00C, and\nLS2100e All versions prior to v04.09.00C\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe affected versions of the application have a path traversal vulnerability that fails to restrict the ability of an attacker to gain access to restricted information. \nCVE-2018-19003 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nCan Demirel of Biznet Bilisim reported this vulnerability to NCCIC.\n4. MITIGATIONS\nThe path traversal vulnerability has been corrected by GE. GE recommends users upgrade to the current version of ControlST software as described in CSB25378, which is available to registered users via the GE Power ServiceNow portal (https://gepowerpac.service-now.com).\nIn applications where the controller-hosted web server is not required, GE recommends turning off the web server. For all other applications, GE recommends updating the controller to the latest firmware version available in the current ControlST release. \nWith respect to EX2100e, GE recommends that all standalone excitation controls be segmented from other networks using a firewall installed inside the Excitation panels. External communication should be exclusively restricted to only those protocols specifically required for command and control, such as Modbus. Other services including HTTP must be blocked from external access. \nTo minimize the risk of exposure to this and any other vulnerabilities, GE recommends a defense-in-depth approach to protecting critical process control equipment. Guidance on technology and best practices to secure GE controllers from cyber attack are provided in the Mark VIe Control Systems Secure Deployment Guide (GEH-6839), which can be requested through GE Technical Support.\nAdditionally, GE recommends that users of affected versions take the following mitigating actions while awaiting an upgrade: \n\nMaintain tight physical access control to all critical controllers. \nLimit network availability to only the most critical needs and implement tight firewall restrictions.\nDisable any unnecessary network related functions or enable only on an as needed basis. \n\nGE provides additional up to date information concerning this issue at the following location (requires customer account/login): \nhttps://gepowerpac.service-now.com/nav_to.do?uri=%2Fkb_knowledge.do%3Fsys_id%3D62034effdb8daf0056729d67b99619d6\nOr contact GE PSIRT through https://www.ge.com/security\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-19003"
  ],
  "techniques": [],
  "advisory": "icsa-18-347-04",
  "title": "GE Mark VIe, EX2100e, EX2100e_Reg, and LS2100e | CISA",
  "source": "ics-advisories",
  "id": "b54c28cdabed571f3a798821acb2cd33c6e0c8862ba23e669c1f31fe36f704b8"
}