{
  "markdown": " Siemens SIMATIC WinCC OA UI Mobile App \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisorySiemens SIMATIC WinCC OA UI Mobile App====================================== Last Revised March 22, 2018 Alert Code ICSA\\-18\\-081\\-01### **CVSS v3 5\\.1****ATTENTION:**  Exploitable from an adjacent network.**Vendor:**  Siemens**Equipment:**  SIMATIC WinCC OA UI mobile app**Vulnerabilit** **y:**  Improper Access ControlAFFECTED PRODUCTS----------------- Siemens reports that this vulnerability affects the following products:* SIMATIC WinCC OA UI for Android: All versions prior to V3\\.15\\.10, and* SIMATIC WinCC OA UI for IOS: All versions prior to V3\\.15\\.10IMPACT------ This vulnerability could be exploited by an attacker who tricks an app user to connect to a malicious WinCC OA server. Successful exploitation of this vulnerability could allow an attacker to read and write data from and to the app’s project cache folder.MITIGATION---------- Siemens has provided the following updates for mitigation:* SIMATIC WinCC OA UI for Android: Update to V3\\.15\\.10 which can be located here:[https://play.google.com/store/apps/details?id\\=com.siemens.winccoaui](https://play.google.com/store/apps/details?id=com.siemens.winccoaui) * SIMATIC WinCC OA UI for IOS: Update to V3\\.15\\.10 which can be located here:[https://itunes.apple.com/us/app/simatic\\-wincc\\-oa\\-ui/id1073943068](https://itunes.apple.com/us/app/simatic-wincc-oa-ui/id1073943068)  Siemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk:* Only connect to a trusted WinCC OA Server.* Follow the SIMATIC WinCC OA Security Guideline for maintaining a secured SIMATIC WinCC OA environment. This guideline is available for registered users at: [https://portal.etm.at/index.php?option\\=com\\_phocadownload\\&view\\=category\\&id\\=52:security\\&Itemid\\=81](https://portal.etm.at/index.php?option=com_phocadownload&view=category&id=52:security&Itemid=81) As a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to run the devices in a protected IT environment, Siemens particularly recommends that users configure the environment according to Siemens’ Operational Guidelines for Industrial Security ( [https://www.siemens.com/cert/operational\\-guidelines\\-industrial\\-security](https://www.siemens.com/cert/operational-guidelines-industrial-security)  ), and follow the recommendations in the product manuals. Additional information on industrial security by Siemens can be found at:<https://www.siemens.com/industrialsecurity> For more information on this vulnerability and associated software updates, please see Siemens security notification SSA\\-822928 on their website:<https://www.siemens.com/cert/advisories> NCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure that they are [not accessible from the Internet](/ics/alerts/ICS-ALERT-10-301-01)  .* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. NCCIC also provides a section for [control systems security recommended practices](/ics/content/recommended-practices)  on the ICS\\-CERT web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  Additional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the [ICS\\-CERT website](/ics/)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents. In addition, NCCIC recommends that users take the following measures to protect themselves from social engineering attacks:* Do not click web links or open unsolicited attachments in email messages.* Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.* Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploits specifically target this vulnerability. High skill level is needed to exploit.VULNERABILITY OVERVIEW----------------------[IMPROPER ACCESS CONTROL CWE\\-284](https://cwe.mitre.org/data/definitions/284.html)----------------------------------------------------------------------------------- Insufficient limitation of CONTROL script capabilities could allow read and write access from one HMI project cache folder to other HMI project cache folders within the app’s sandbox on the same mobile device. This includes HMI project cache folders of other configured WinCC OA servers. This vulnerability could be exploited by an attacker who tricks an app user to connect to a malicious WinCC OA server. This could give an attacker the ability to read and write data from and to the app’s project cache folder.[CVE\\-2018\\-4844](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-4844)  has been assigned to this vulnerability. A CVSS v3 base score of 5\\.1 has been calculated; the CVSS vector string is ( [AV:A/AC:H/PR:L/UI:R/S:U/C:H/I:L/A:N](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:H/PR:L/UI:R/S:U/C:H/I:L/A:N)  ).RESEARCHER---------- Alexander Bolshev from IOActive, and Ivan Yushkevich from Embedi reported this vulnerability to Siemens.BACKGROUND----------**Critical Infrastructure Sectors:**  Chemical, Energy, Food and Agriculture, Water and Wastewater Systems.**Countries/Areas Deployed:**  Worldwide**Company Headquarters Location:**  Germany This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Siemens-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-18-081-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2018-4844"
  ],
  "techniques": [],
  "advisory": "icsa-18-081-01",
  "title": "Siemens SIMATIC WinCC OA UI Mobile App | CISA",
  "source": "ics-advisories",
  "id": "048e898ee08ea590cf3c8a2fa0f95d866298db1dc2400f03b0a5512c86dacc47"
}