{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: Sierra Wireless\nEquipment: AirLink ALEOS\nVulnerabilities: OS Command Injection, Use of Hard-coded Credentials, Unrestricted Upload of File with Dangerous Type, Cross-site Scripting, Cross-site Request Forgery, Information Exposure, Missing Encryption of Sensitive Data\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-122-03 Sierra Wireless AirLink ALEOS (Update A) that was published August 20, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow attackers to remotely execute code, discover user credentials, upload files, or discover file paths.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSierra Wireless reports the vulnerabilities affect the following AirLink ALEOS versions and products:\n--------- Begin Update B Part 1 of 2 ---------\n\nLS300, GX400, GX440, and ES440: All versions prior to 4.4.9\n\n--------- End Update B Part 1 of 2 ---------\n\nGX450 and ES450: All versions prior to 4.9.4\nMP70, MP70E, RV50, RV50X, LX40, and LX60: All versions prior to 4.12\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nA specially crafted authenticated HTTP request can inject arbitrary commands, resulting in remote code execution.\nCVE-2018-4061 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).\n4.2.2    USE OF HARD-CODED CREDENTIALS CWE-798\nActivating SNMPD outside of the WebUI can cause the activation of the hard-coded credentials, resulting in the exposure of a privileged user. An attacker can activate SNMPD without any configuration changes to trigger this vulnerability.\nCVE-2018-4062 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:H/UI:N/S:U/C:H/I:L/A:H).\n4.2.3    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nA specially crafted authenticated HTTP request can upload a file, resulting in an executable, routable code upload to the web server.\nCVE-2018-4063 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).\n4.2.4    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nA specially crafted HTTP ping request can cause reflected JavaScript to be executed and run on the user’s browser. An attacker can exploit this by convincing a user to click a link or embedded URL that redirects to the reflected cross-site scripting vulnerability.\nCVE-2018-4065 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n4.2.5    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nA specially crafted HTTP request can cause an authenticated user to perform privileged requests unknowingly, resulting in unauthenticated requests through an authenticated user. Triggering this vulnerability may allow an attacker access to authenticated pages via an authenticated user.\nCVE-2018-4066 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:H/A:H).\n4.2.6    INFORMATION EXPOSURE CWE-200\nA specially crafted authenticated HTTP request can cause an information leak, resulting in the disclosure of internal file paths.\nCVE-2018-4067 has been assigned to this vulnerability. A CVSS v3 base score of 4.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:L/I:N/A:N).\n4.2.7    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nThe ACEManager authentication functionality is delivered in plaintext XML to the web server. An attacker can listen to network traffic upstream from the device, which may allow access to credentials.\nCVE-2018-4069 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Communications, Emergency Services, Energy, Government Facilities, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Canada\n\n4.4 RESEARCHER\nCarl Hurd and Jared Rittle of Cisco Talos reported these vulnerabilities to Sierra Wireless.\n5. MITIGATIONS\n--------- Begin Update B Part 2 of 2 ---------\nSierra Wireless recommends users upgrade to the latest version of ALEOS for the products and versions below. For upgrade assistance, contact an authorized AirLink reseller, Sierra Wireless sales, technical representative, or Sierra Wireless technical support.\n\nLS300, GX400, GX440, ES440:  ALEOS 4.4.9\n\nThe ALEOS 4.4.9 Release Note is available (login required)\n\n\nGX450, ES450:  ALEOS 4.9.4.p09\nMP70, MP70E, RV50, RV50X, LX40, LX60:  ALEOS 4.12\n\nThe ALEOS 4.12.0 Release Note is available (login required)\n\n\n\n--------- End Update B Part 2 of 2 ---------\nSierra Wireless recommends users follow the actions outlined below:\n\nEnsure a strong password is set for the user account. For guidance on password strength, Sierra Wireless recommends the “memorized secret authenticator” guidelines in NIST SP800-63B.\nIf ALEOS Application Framework (AAF) is enabled, ensure a strong password is set for the AAF User account.\nIf Telnet or SSH is enabled, ensure a strong password is set for the console account.\n\nWhen connecting directly to ACEmanager:\n\nUse only HTTPS.\nUtilize an up-to-date, modern web browser with built-in CSS and CSRF protection, such as Chrome, Firefox, or Edge.\n\nFor more information, see the Sierra Wireless security advisory.\nThe following SNORT rules will detect exploitation attempts. Note that additional rules may be released at a future date and current rules are subject to change pending additional vulnerability information. For the most current rule information, please refer to a Firepower Management Center or Snort.org.\nSnort Rules: 48600, 48635, 48614 - 48621, 48747\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.​​\n\n",
  "cves": [
    "CVE-2018-4065",
    "CVE-2018-4067",
    "CVE-2018-4066",
    "CVE-2018-4063",
    "CVE-2018-4061",
    "CVE-2018-4069",
    "CVE-2018-4062"
  ],
  "techniques": [],
  "advisory": "icsa-19-122-03",
  "title": "Sierra Wireless AirLink ALEOS (Update B) | CISA",
  "source": "ics-advisories",
  "id": "d767e845fcf7ea99b1ae2b1bfc25854bf8bce72e9115b38577a1312f393b594d"
}