{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: Multiple Factory Automation Products\nVulnerabilities: Observable Timing Discrepancy, Double Free, Access of Resource Using Incompatible Type ('Type Confusion')\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could disclose information in the product or could cause denial-of-service (DoS) condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Factory Automation products are affected:\n\nGT SoftGOT2000: Versions 1.275M to 1.290C (CVE-2023-0286)\nOPC UA Data Collector: Versions 1.04E and prior (CVE-2023-0286)\nMX OPC Server UA (Software packaged with MC Works64): Versions 3.05F and later (Packaged with MC Works64 Version 4.03D and later) (CVE-2022-4304)\nOPC UA Server Unit: All versions (CVE-2022-4304)\nFX5-OPC: Versions 1.006 and prior (CVE-2022-4304, CVE-2022-4450)\n\n3.2 Vulnerability Overview\n3.2.1 OBSERVABLE TIMING DISCREPANCY CWE-208\nThe affected products contain an observable timing discrepancy vulnerability in their RSA decryption implementation. By sending specially crafted packets and performing a Bleichenbacher style attack, an attack method to decrypt ciphertext by observing the behavior when a padding error occurs, an attacker could decrypt the ciphertext and disclose sensitive information.\nCVE-2022-4304 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2 DOUBLE FREE CWE-415\nThe affected products contain a double free vulnerability when reading a PEM file. An attacker could cause denial-of-service (DoS) on the product by leading a legitimate user to importing a malicious certificate.\nCVE-2022-4450 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3 ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nThe affected products contain a type confusion vulnerability relating to X.400 address\nprocessing inside an X.509 GeneralName. An attacker could disclose sensitive information in memory of the product or cause denial-of-service (DoS) on the product by getting to load a specially crafted certificate revocation list (CRL).\nCVE-2023-0286 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends that users update their products to the following versions:\n\nGT SoftGOT2000: Version 1.295H or later\nOPC UA data collector: 1.05F or later\nMX OPC Server UA: Use recommended mitigations/workarounds\nOPC UA server unit: Use recommended mitigations/workarounds\nFX5-OPC: Version 1.010 or later\n\nMitsubishi Electric recommends that users take the following mitigation measures to minimize the risk of exploiting these vulnerabilities:\n\nGT SoftGOT2000 and OPC UA Data Collector: Do not load untrusted certificate revocation lists (CRLs).\nMX OPC Server UA: Use within a LAN and block access from untrusted networks and hosts through firewalls. Restrict physical access to the product, as well as to computers and network devices located within the same network as the product. Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.\nOPC UA Server Unit: Use within a LAN and block access from untrusted networks and hosts through firewalls. Restrict physical access to the product, as well as to computers and network devices located within the same network as the product. Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required. Set a security policy other than 'None' in security setting function to prevent unauthorized access. For details on security setting function, please refer to the MELSEC iQ-R OPC UA Server Unit User's Manual (Application), section 1.1 \"OPC UA Server Function\".\nFX5-OPC: Use within a LAN and block access from untrusted networks and hosts through firewalls. Restrict physical access to the product, as well as to computers and network devices located within the same network as the product. Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required. Use the IP filter function to block access from untrusted hosts. For details on the IP filter function, please refer to the MELSEC iQ-F FX5 OPC UA Module User's Manual section 4.4 \"IP Filter.\" Do not import untrusted certificates.\n\nFor additional details, see the [Mitsubishi Electric advisory 2023-018].(https://www.mitsubishielectric.com/en/psirt/vulnerability/pdf/2023-018_en.pdf).\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJanuary 4, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-0286",
    "CVE-2022-4450",
    "CVE-2022-4304"
  ],
  "techniques": [],
  "advisory": "icsa-24-004-02",
  "title": "Mitsubishi Electric Factory Automation Products | CISA",
  "source": "ics-advisories",
  "id": "bebe9f859b3a7c07cef0ea78f744496e867d72e41cb1b1a3ebbae387c7647edc"
}