{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nVendor: Hitachi Energy\nEquipment: Relion 670/650/SAM600-IO\nVulnerability: Insecure Default Initialization of Resource\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could hijack existing TCP sessions to inject packets of their choosing or cause denial-of-service conditions.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi Energy reports this vulnerability affects the following Relion products:\n\nRelion 670/650 series: All revisions of Version 2.2.0\nRelion 670/650/SAM600-IO series: All revisions of Version 2.2.1\nRelion 670 series: All revisions of Version 2.2.2\nRelion 670 series: All revisions of Version 2.2.3 until 2.2.3.3\nRelion 670/650 series: All revisions of Version 2.2.4\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSECURE DEFAULT INITIALIZATION OF RESOURCE CWE-1188\nA vulnerability exists in the early boot process of the product in which there is a tiny time gap where a previous version of VxWorks is loaded prior to booting up the complete application firmware. The older version of VxWorks is susceptible to Urgent/11, which may allow for remote code execution on the device before the operating system is loaded.\nCVE-2021-35535 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nA Department of Energy CyTRICS researcher from Idaho National Laboratory reported this vulnerability to Hitachi Energy.\n4. MITIGATIONS\nHitachi Energy recommends the following actions to mitigate this vulnerability:\n\nRelion 670/650 series Version 2.2.0: Upgrade to Version 2.2.5\nRelion 670/650/SAM600-IO series Version 2.2.1: Upgrade to Version 2.2.5\nRelion 670 series Version 2.2.2: Upgrade to Version 2.2.5\nRelion 670 series Version 2.2.3: Update to Revision 2.2.3.4 or upgrade to Version 2.2.5\nRelion 670/650 series Version 2.2.4: Upgrade to Version 2.2.5\n\nHitachi Energy recommends the following security practices and firewall configurations to help protect process control networks from attacks that originate from outside the network:\n\nPhysically protect process control systems from direct access by unauthorized personnel.\nDo not directly connect to the Internet.\nSeparate from other networks by means of a firewall system that has a minimal number of ports exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving e-mails. \nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nPlease see Hitachi Energy advisory 8DBD000061 for additional mitigation and update information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-35535"
  ],
  "techniques": [],
  "advisory": "icsa-21-336-05",
  "title": "Hitachi Energy Relion 670/650/SAM600-IO | CISA",
  "source": "ics-advisories",
  "id": "595bfd8b757421f9f4e32f19963509df2d24ca9b68f4ac03887cdecf59cd342d"
}