{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: VISAM\nEquipment: VBASE\nVulnerabilities: Relative Path Traversal, Incorrect Default Permissions, Inadequate Encryption Strength, Insecure Storage of Sensitive Information, Stack-based Buffer Overflow\n\n2.UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-084-01 VISAM Automation Base (VBASE) (Update A) that was published July 8, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to read the contents of unexpected files, escalate privileges to system level, execute arbitrary code on the targeted system, bypass security mechanisms, and discover the cryptographic key for the web login.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of VBASE, an automation platform, are affected:\n\nVBASE Editor, Version 11.5.0.2\nVBASE Web-Remote Module\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    RELATIVE PATH TRAVERSAL CWE-23\nInput passed in the URL is not properly verified before use, which may allow an attacker to read arbitrary files from local resources.\nCVE-2020-7008 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.2    INCORRECT DEFAULT PERMISSIONS CWE-276\nWeak or insecure permissions on the VBASE directory may result in elevation of privileges or malicious effects on the system the next time a privileged user runs the application.\nCVE-2020-7004 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H).\n4.2.3    INADEQUATE ENCRYPTION STRENGTH CWE-326\nWeak hashing algorithm and insecure permissions may allow a local attacker to bypass the password-protected mechanism through brute-force attacks, cracking techniques, or overwriting the password hash.\nCVE-2020-10601 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).\n4.2.4    INSECURE STORAGE OF SENSITIVE INFORMATION CWE-922\nAn unauthenticated attacker may discover the cryptographic key from the web server and gain information about the login and the encryption/decryption mechanism, which may be exploited to bypass authentication of the HTML5 HMI web interface.\nCVE-2020-7000 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.5    STACK-BASED BUFFER OVERFLOW CWE-121\nA vulnerable ActiveX component may be exploited resulting in a buffer overflow, which may allow remote attackers to cause a denial-of-service condition and execute arbitrary code. \nCVE-2020-10599 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nGjoko Krstic of Applied Risk reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update B Part 1 of 1 ---------\nVISAM recommends users update to VBASE v11.7.0.2 or later. A download link will be provided by submitting a request form.\nFor more information, please contact VISAM using the information provided on their contact page.\n--------- End Update B Part 1 of 1 ---------\nFor more information about these vulnerabilities and how VISAM plans to address them, please contact VISAM using the information provided on their contact page (German language).\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-10601",
    "CVE-2020-7000",
    "CVE-2020-7008",
    "CVE-2020-10599",
    "CVE-2020-7004"
  ],
  "techniques": [],
  "advisory": "icsa-20-084-01",
  "title": "VISAM Automation Base (VBASE) (Update B) | CISA",
  "source": "ics-advisories",
  "id": "fd5c32057da4ef297e220a4a73346c434ea293ff09a501cd6b97257aa9e91864"
}