{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.3\n\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: Fuji Electric\nEquipment: V-Server\nVulnerabilities: Use-After Free, Untrusted Pointer Dereference, Heap-based Buffer Overflow, Out-of-Bounds Write, Integer Underflow, Out-of-Bounds Read, and Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow for remote code execution on the device, causing a denial of service condition or information exposure.\n3. TECHNICAL DETAILS\n\n3.1 AFFECTED PRODUCTS\nThe following versions of V-Server, a data collection and management service, are affected:\n\nV-Server 4.0.3.0 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE AFTER FREE CWE-416\nA use after free vulnerability has been identified, which may allow remote code execution.\nCVE-2018-14809 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.2    UNTRUSTED POINTER DEREFERENCE CWE-822\nMultiple untrusted pointer dereference vulnerabilities have been identified, which may allow remote code execution.\nCVE-2018-14811 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.3    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap-based buffer overflow vulnerability has been identified, which may allow remote code execution.\nCVE-2018-14813 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.4    OUT-OF-BOUNDS WRITE CWE-787\nSeveral out-of-bounds write vulnerabilities have been identified, which may allow remote code execution.\nCVE-2018-14815 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.5    INTEGER UNDERFLOW CWE-191\nAn integer underflow vulnerability has been identified, which may allow remote code execution.\nCVE-2018-14817 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.6    OUT-OF-BOUNDS READ CWE-125\nAn out-of-bounds read vulnerability has been identified, which may allow remote code execution.\nCVE-2018-14819 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.7    STACK-BASED BUFFER OVERFLOW CWE-121\nA stack-based buffer overflow vulnerability has been identified, which may allow remote code execution.\nCVE-2018-14823 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nSteven Seeley (mr_me) of Source Incite and Ghirmay Desta working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nFuji Electric has released Version 4.0.4.0 of the software that can be downloaded from (login required):\nhttp://monitouch.fujielectric.com/site/support-e/download-index-01.html\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n \n",
  "cves": [
    "CVE-2018-14817",
    "CVE-2018-14809",
    "CVE-2018-14819",
    "CVE-2018-14811",
    "CVE-2018-14823",
    "CVE-2018-14815",
    "CVE-2018-14813"
  ],
  "techniques": [],
  "advisory": "icsa-18-254-01",
  "title": "Fuji Electric V-Server | CISA",
  "source": "ics-advisories",
  "id": "341ca5f7f209866b327693bea8238c95e49ea750ac9407f2434f859db7b513de"
}