{
  "markdown": " Unitronics UNIOPC Server Input Handling Vulnerability (Update A) \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryUnitronics UNIOPC Server Input Handling Vulnerability (Update A)================================================================ Last Revised May 08, 2013 Alert Code ICSA\\-11\\-279\\-03AOverview-------- Independent security researchers Billy Rios and Terry McCorkle have identified a vulnerability in Unitronics’ UniOPC Server product.**\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin Update A Part 1 of 3 \\-\\-\\-\\-\\-\\-\\-\\-**  This vulnerability is a result of improper handling of input by a third\\-party component, https50\\.ocx, which is part of “IP\\*Works! SSL.”/n Software: IP\\*Works! SSL, http://www.nsoftware.com/ipworks/ssl/, website last accessed October 12, 2011\\.**\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin End A Part 1 of 3 \\-\\-\\-\\-\\-\\-\\-\\-**  IP\\*Works! is used in the UniOPC product. Successful exploitation of this vulnerability results in a crash and could result in the execution of arbitrary code. Industrial Control Systems Cyber Emergency Response Team (ICS\\-CERT) has coordinated with Unitronics and the security researchers. Unitronics has released a new version that does not contain the vulnerable component. The researchers have confirmed that the vulnerable component is not present in the new version. However, customers installing the new version on a system that had previously contained an affected version of UniOPC are still vulnerable as the update does not remove the vulnerable component.Affected Products----------------- This vulnerability affects versions of Unitronics UniOPC prior to Version 2\\.0\\.0\\.Impact------ Exploitation of this vulnerability could result in the execution of arbitrary code on a system running an affected version of the Unitronics UniOPC product. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.Background----------**\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin Update A Part 2 of 3 \\-\\-\\-\\-\\-\\-\\-\\-**  Unitronics is based in Israel. UniOPC Server provides the ability to read and write data between Unitronics programmable logic controllers (PLCs) and other OPC applications.**\\-\\-\\-\\-\\-\\-\\-\\-\\- End Update A Part 2 of 3 \\-\\-\\-\\-\\-\\-\\-\\-**  UniOPC Server is a standalone product that runs independently of other Unitronics software. According to Unitronics, UniOPC is used worldwide in multiple sectors.Vulnerability Characterization------------------------------### Vulnerability Overview**\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin Update A Part 3 of 3 \\-\\-\\-\\-\\-\\-\\-\\-**  This vulnerability resides in the https50\\.ocx component of “IP\\*Works! SSL” that is used as part of the Unitronics UniOPC product.**\\-\\-\\-\\-\\-\\-\\-\\-\\- End Update A Part 3 of 3 \\-\\-\\-\\-\\-\\-\\-\\-**  An attacker could build a specially crafted website that accesses the vulnerable function to cause a crash and potentially execute arbitrary code.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable.#### Existence of Exploit No known exploits specifically target this vulnerability.#### Difficulty An attacker with a low to medium skill level may exploit this vulnerability.Mitigation---------- Unitronics has released Version 2\\.0\\.0 of UniOPC Server. Unitronics recommends that users of all versions of the UniOPC Server product download and install Version 2\\.0\\.0 or newer from the following location: [http://www.unitronics.com/Content.aspx?page\\=Downloads](http://www.unitronics.com/Content.aspx?page=Downloads)  . Unitronics has not provided mitigation steps for existing customers who are currently using affected versions of UniOPC. The vulnerable component will remain on the system even after the new version has been installed. To manually remove the vulnerable component, the researcher suggests the following steps:1. Ensure that no other applications are using https50\\.ocx prior to its removal.2. From a command prompt type: regsvr32 /U c:\\\\windows\\\\system32\\\\https50\\.ocx3. Delete the c:\\\\windows\\\\system32\\\\https50\\.ocx file. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. In addition to installing the latest version of UniOPC Server, ICS\\-CERT encourages asset owners to take additional defensive measures to protect their systems from this and other vulnerabilities.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks:1. Do not click web links or open unsolicited attachments in e\\-mail messages.2. Refer to [*Recognizing and Avoiding Email Scams*](/reading_room/emailscams_0905.pdf) for more information on avoiding e\\-mail scams.3. Refer to [*Avoiding Social Engineering and Phishing Attacks*](/cas/tips/ST04-014.html) for more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Unitronics-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-279-03a)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-279-03a",
  "title": "Unitronics UNIOPC Server Input Handling Vulnerability (Update A) | CISA",
  "source": "ics-advisories",
  "id": "427d0bf224777b8cb51f4a0d7216a10444d7472bff01d2dfec3a694be7f85178"
}