{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Fazecast\nEquipment: jSerialComm\nVulnerability: Uncontrolled Search Path Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker to execute arbitrary code on a targeted system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of jSerialComm, a platform-independent serial communication for Java, are affected:\n\nVersion 2.2.2 and prior\n\nSchneider Electric reports the vulnerability affects the following EcoStruxure IT Gateway versions:\n\nVersions 1.5.x, 1.6.x, 1.7.x\n\nCISA will update this document as more mitigations are identified by affected vendors.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nAn uncontrolled search path element vulnerability could allow a malicious DLL file with the same name of any resident DLLs inside the software installation to execute arbitrary code.\nCVE-2020-10626 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRyan Wincey (@rwincey) of Securifera working with Trend Micro’s Zero Day Initiative reported this vulnerability to CISA.\n4. MITIGATIONS\nFazecast, Inc., recommends users update jSerialComm to Version 2.3 or later.\nSchneider Electric recommends users upgrade EcoStruxure IT Gateway to Version 1.8.1 or later.\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks..\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely.\n",
  "cves": [
    "CVE-2020-10626"
  ],
  "techniques": [],
  "advisory": "icsa-20-126-01",
  "title": "Fazecast jSerialComm | CISA",
  "source": "ics-advisories",
  "id": "961e7d266d95c504ba7969f4452a716c59af5d67391ad3e94379d165a56f1281"
}