{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELSEC iQ-R, iQ-L Series and MELIPC Series\nVulnerability: Improper Resource Shutdown or Release\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to cause a denial-of-service condition in the module's ethernet communication.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports this vulnerability affects the following MELSEC iQ-R, iQ-L series CPU module, and MELIPC series:\n\nMELSEC iQ-R Series R00CPU: firmware versions 32 and prior\nMELSEC iQ-R Series R01CPU: firmware versions 32 and prior\nMELSEC iQ-R Series R02CPU: firmware versions 32 and prior\nMELSEC iQ-R Series R04(EN)CPU: firmware versions 65 and prior\nMELSEC iQ-R Series R08(EN)CPU: firmware versions 65 and prior\nMELSEC iQ-R Series R16(EN)CPU: firmware versions 65 and prior\nMELSEC iQ-R Series R32(EN)CPU: firmware versions 65 and prior\nMELSEC iQ-R Series R120(EN)CPU: firmware versions 65 and prior\nMELSEC iQ-R Series R08SFCPU: firmware versions 29 and prior\nMELSEC iQ-R Series R16SFCPU: firmware versions 29 and prior\nMELSEC iQ-R Series R32SFCPU: firmware versions 29 and prior\nMELSEC iQ-R Series R120SFCPU: firmware versions 29 and prior\nMELSEC iQ-R Series R12CCPU-V: firmware versions 17 and prior\nMELSEC iQ-L Series L04HCPU: firmware versions 05 and prior\nMELSEC iQ-L Series L08HCPU: firmware versions 05 and prior\nMELSEC iQ-L Series L16HCPU: firmware versions 05 and prior\nMELSEC iQ-L Series L32HCPU: firmware versions 05 and prior\nMELIPC Series MI5122-VW: firmware versions 07 and prior\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER RESOURCE SHUTDOWN OR RELEASE CWE-404\nA denial-of-service vulnerability due to improper resource shutdown or release exists in Mitsubishi Electric MELSEC iQ-R, iQ-L series CPU module, and MELIPC series. This vulnerability could allow a remote attacker to cause a denial-of-service condition in the module's ethernet communication by sending specially crafted packets.\nCVE-2022-33324 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric fixed the following products:\n\nMELSEC iQ-R Series R00CPU: firmware versions 33 or later\nMELSEC iQ-R Series R01CPU: firmware versions 33 or later\nMELSEC iQ-R Series R02CPU: firmware versions 33 or later\nMELSEC iQ-R Series R04(EN)CPU: firmware versions 66 or later\nMELSEC iQ-R Series R08(EN)CPU: firmware versions 66 or later\nMELSEC iQ-R Series R16(EN)CPU: firmware versions 66 or later\nMELSEC iQ-R Series R32(EN)CPU: firmware versions 66 or later\nMELSEC iQ-R Series R120(EN)CPU: firmware versions 66 or later\nMELSEC iQ-R Series R08SFCPU: firmware versions 30 or later\nMELSEC iQ-R Series R16SFCPU: firmware versions 30 or later\nMELSEC iQ-R Series R32SFCPU: firmware versions 30 or later\nMELSEC iQ-R Series R120SFCPU: firmware versions 30 or later\nMELSEC iQ-R Series R12CCPU-V: firmware versions 18 or later\nMELSEC iQ-L Series L04HCPU: firmware versions 06 or later\nMELSEC iQ-L Series L08HCPU: firmware versions 06 or later\nMELSEC iQ-L Series L16HCPU: firmware versions 06 or later\nMELSEC iQ-L Series L32HCPU: firmware versions 06 or later\nMELIPC Series MI5122-VW: firmware versions 08 or later\n\nMitsubishi Electric offers the following countermeasures for users:\n\nMELSEC iQ-R series products: Refer to \"Appendix 2 Firmware Update Function\" in the MELSEC iQ-R Module Configuration Manual to check if the firmware version of your product is updatable.\n\nFor updatable products: Download a fixed firmware update file from the Mitsubishi Electric site and update the firmware. Refer to \"Appendix 2 Firmware Update Function\" in the MELSEC iQ-R Module Configuration Manual for information on how to update the firmware.\nFor non-updatable products: Follow the mitigation measures below. Mitsubishi Electric has released fixed versions as shown above, but the products cannot be updated.\n\n\nMELIPC Series or MELSEC iQ-L Series products: Follow the mitigation measures below. Mitsubishi Electric has released fixed versions as shown above, but the products cannot be updated.\n\nMitsubishi Electric recommends users take mitigation measures to minimize the risk of exploiting this vulnerability:\n\nUse a firewall, virtual private network (VPN), or other means to prevent unauthorized access when internet access is required.\nUse the product inside a local area network (LAN) and use firewalls to block access from untrusted networks and hosts.\nUse an IP filter function to block access from untrusted hosts. For details on the remote password function and IP filter function, users can refer to the following manual for each product:\n\nMELSEC iQ-R Ethernet User's Manual (Application) 1.13 Security \"IP filter.\"\nMELSEC iQ-L CPU module User's Manual (Application) 24.1 \"IP filter Function.\"\nMELSEC iQ-R C Controller Module User's Manual (Application) 6.6 Security Function \"IP filter.\"\nMELIPC MI5000 Series User's Manual (Application) \"11.3 IP Filter Function.\"\n\n\n\nFor specific update instructions and additional details, see Mitsubishi Electric advisory 2022-018.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nDecember 22, 2022: Initial Publication\nJuly 13, 2023: Update A - Added new mitigation information for MELSEC iQ-R Series R08/16/32/120SFCPU firmware\nDecember 12, 2023: Update B - Added new mitigation information for MELSEC iQ-R Series R12CCPU-V firmware\nMay 30, 2024: Update C - Added new mitigation information for MELIPC Series\nJuly 9, 2024: Update D - Added new mitigation information for MELSEC iQ-L Series\n\n",
  "cves": [
    "CVE-2022-33324"
  ],
  "techniques": [],
  "advisory": "icsa-22-356-03",
  "title": "Mitsubishi Electric MELSEC iQ-R, iQ-L Series and MELIPC Series (Update D)) | CISA",
  "source": "ics-advisories",
  "id": "1ce6bfb3788a7184f3651766804ae43381bcc7e87a929b8093cd34a4872b99d6"
}