{
  "markdown": "\nCVSS v3 7.2\nVendor: Moxa\nEquipment: SoftNVR-IA Live Viewer\nVulnerability: Uncontrolled Search Path Element\nAFFECTED PRODUCTS\nThe following versions of SoftNVR-IA Live Viewer, a video surveillance software designed for industrial automation systems, are affected:\n\nSoftNVR-IA Live Viewer, Version 3.30.3122 and prior versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to execute code from a malicious DLL on the affected system with the same privileges as the application that loaded the malicious DLL.\nMITIGATION\nMoxa has provided software update Version 3.4 for SoftNVR-IA Live Viewer which fixes this vulnerability. Moxa recommends users update to the new version, which is available at the following location:\nhttps://www.moxa.com/support/download.aspx?type=support&id=11320\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\n\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nAn uncontrolled search path element (DLL Hijacking) vulnerability has been identified.\nTo exploit this vulnerability, an attacker could rename a malicious DLL to meet the criteria of the application, and the application would not verify that the DLL is correct. The attacker needs to have administrative access to the default install location in order to plant the insecure DLL. Once loaded by the application, the DLL could run malicious code at the privilege level of the application.\nCVE-2017-5170 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:H/UI:R/S:C/C:H/I:H/A:H).\nRESEARCHER\nIndependent security researcher Karn Ganeshen identified this vulnerability.\nBACKGROUND\nCritical Infrastructure Sector(s): Critical Manufacturing, Energy, and Transportation Systems.\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-5170"
  ],
  "techniques": [],
  "advisory": "icsa-17-220-02",
  "title": "Moxa SoftNVR-IA Live Viewer | CISA",
  "source": "ics-advisories",
  "id": "17c3150e9ad7791d23d5a735bc07625b9e57f0b3ea270909e74d24df46d70909"
}