{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Honeywell\nEquipment: Performance IP Cameras and Performance NVRs\nVulnerability: Information Exposure\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to view device configuration information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Honeywell Performance IP Series cameras and Performance Series NVRs are affected:\nPerformance IP Series cameras:\n\nHBD3PR2\nH4D3PRV3\nHED3PR3\nH4D3PRV2\nHBD3PR1\nH4W8PR2\nHBW8PR2\nH2W2PC1M\nH2W4PER3\nH2W2PER3\nHEW2PER3\nHEW4PER3B\nHBW2PER1\nHEW4PER2\nHEW4PER2B\nHEW2PER2\nH4W2PER2\nHBW2PER2\nH4W2PER3\nHPW2P1\n\nPerformance Series NVRs:\n\nHEN08104\nHEN08144\nHEN081124\nHEN16104\nHEN16144\nHEN16184\nHEN16204\nHEN162244\nHEN16284\nHEN16304\nHEN16384\nHEN32104\nHEN321124\nHEN32204\nHEN32284\nHEN322164\nHEN32304\nHEN32384\nHEN323164\nHEN64204\nHEN64304\nHEN643164\nHEN643324\nHEN643484\nHEN04103\nHEN04113\nHEN04123\nHEN08103\nHEN08113\nHEN08123\nHEN08143\nHEN16103\nHEN16123\nHEN16143\nHEN16163\nHEN04103L\nHEN08103L\nHEN16103L\nHEN32103L\n\n3.2 VULNERABILITY OVERVIEW\n2.2.1    INFORMATION EXPOSURE CWE-200\nThe integrated web server of the affected devices could allow remote attackers to obtain web configuration data in JSON format for IP cameras and NVRs (Network Video Recorders), which can be accessed without authentication over the network. \nCVE-2019-13523 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nIsmail Bulbil reported this vulnerability to CISA.\n4. MITIGATIONS\nHoneywell has released firmware update packages for all affected products. The updates can be obtained with a customer account at the following location (login required):\nhttps://mywebtech.honeywell.com/Home\nHoneywell also recommends the following mitigating factors that users should take to mitigate this vulnerability:\n\nUpdate firmware of vulnerable devices according to affected devices outlined in this advisory.\nIsolate affected systems from the Internet or create additional layers of defense between affected systems and the Internet by placing the affected hardware behind a firewall or into a DMZ.\nIf remote connections to the network are required, consider using a VPN or other means to ensure secure remote connections into the network where the device is located.\n\nMore information on this issue can be found in Honeywell security notification SN 2019-04-30 01 at the following location on the Honeywell site:\nhttps://www.security.honeywell.com/-/media/Security/Resources/PDF/Product-Warranty/Security-Notification-May-2019-pdf.pdf?la=en-US&hash=15B712A99CD068FF0D8CB494BC96AB46E2122672\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13523"
  ],
  "techniques": [],
  "advisory": "icsa-19-260-03",
  "title": "Honeywell Performance IP Cameras and Performance NVRs | CISA",
  "source": "ics-advisories",
  "id": "c1366ec98474ff9b939c79a0f8849fc205b92c53472d214232d7ae048344548e"
}