{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC, SIMOCODE, SINAMICS, SITOP, and TIM\nVulnerability: Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-19-099-06 Siemens SIMATIC, SIMOCODE, SINAMICS, SITOP, and TIM (Update H) that was published June 9, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition leading to a restart of the webserver.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products and versions are affected:\n\nSIMATIC CP 1616 and CP 1604: All versions\nSIMATIC CP443-1 (incl. SIPLUS NET variants): All versions\nSIMATIC CP443-1 Advanced (incl. SIPLUS NET variants): All versions\nSIMATIC CP443-1 OPC UA (incl. SIPLUS NET variants): All versions\nSIMATIC CP343-1 Advanced (incl. SIPLUS NET variants): All versions\nSIMATIC ET 200 SP Open Controller CPU 1515SP PC (incl. SIPLUS variants): All versions prior to v2.1.6\nSIMATIC ET 200 SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions prior to v2.7\nSIMATIC HMI Comfort Outdoor Panels 7\" & 15\" (incl. SIPLUS variants): All versions prior to v15.1 Upd 4\nSIMATIC HMI Comfort Panels 4\" - 22\" (incl. SIPLUS variants): All versions prior to v15.1 Upd 4\nSIMATIC HMI KTP Mobile Panels KTP400F, KTP700, KTP700F, KTP900 and KTP900F (incl. SIPLUS variants):\n\tAll versions prior to v 15.1 Upd 4\nSIMATIC IPC DiagMonitor: All versions\nSIMATIC RF182C: All versions\nSIMATIC RF185C: All versions prior to v1.10\nSIMATIC RF186C: All versions prior to v1.10\nSIMATIC RF188C: All versions prior to v1.10\nSIMATIC RF600 family: All versions prior to v3.2.1\nSIMATIC RF181-EIP: All versions\nSIMATIC S7-1500 Software Controller: All versions prior to v2.7\nSIMATIC Teleservice Adapter IE Advanced: All versions\nSIMATIC Teleservice Adapter IE Basic: All versions\nSIMATIC Teleservice Adapter IE Standard: All versions\nSIMATIC WinAC RTX (F) 2010: All versions prior to SP3\nSIMATIC S7-1500 CPU Family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to v2.6.1\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to v3.X.16\nSIMATIC S7-400 PN/DP v6 and below CPU family (incl. SIPLUS variants): All versions\nSIMATIC S7-400 PN/DP v7 CPU family (incl. SIPLUS variants): All versions\nSIMATIC S7-PLCSIM Advanced: All versions prior to v2.0 SP1 UPD1\nSIMATIC WinCC Runtime Advanced: All versions prior to v15.1 Upd 4\nSIMOCODE pro VPN (incl. SIPLUS variants): All versions prior to v2.1.3\n\n--------- Begin Update I Part 1 of 2 ---------\n\nSIMOCODE pro V EIP (incl. SIPLUS variants): All versions prior to 1.1.3\nSIMATIC Teleservice Adapter IE Advanced: All versions\nSIMATIC Teleservice Adapter IE Basic: All versions\nSIMATIC Teleservice Adapter IE Standard: All versions\n\n--------- End Update I Part 1 of 2 ---------\n\nSINAMICS S120 v4.6 Control Unit (incl. SIPLUS variants): All versions prior to v5.2\nSINAMICS S120 v4.7 Control Unit (incl. SIPLUS variants): All versions\nSINAMICS S120 v4.7 SP1 Control Unit (incl. SIPLUS variants): All versions prior to v5.2\nSINAMICS S120 v4.8 Control Unit (incl. SIPLUS variants): All versions prior to v4.8 HF6\nSINAMICS S120 v5.1 Control Unit (incl. SIPLUS variants): All versions\nSINAMICS S120 v5.1 SP1 Control Unit (incl. SIPLUS variants): All versions prior to v5.1 SP1 HF4\nSINAMICS G130 v4.6 Control Unit: All versions prior to v5.2\nSINAMICS G130 v4.7 Control Unit: All versions prior to v5.2\nSINAMICS G130 v4.7 SP1 Control Unit: All versions prior to v5.2\nSINAMICS G130 v4.8 Control Unit: All versions prior to v4.8 HF6\nSINAMICS G130 v5.1 Control Unit: All versions\nSINAMICS G130 v5.1 SP1 Control Unit: All versions prior to v5.1 SP1 HF4\nSINAMICS G150 v4.6 Control Unit: All versions prior to v5.2\nSINAMICS G150 v4.7 Control Unit: All versions\nSINAMICS G150 v4.7 SP1 Control Unit: All versions prior to v5.2\nSINAMICS G150 v4.8 Control Unit: All versions prior to v4.8 HF6\nSINAMICS G150 v5.1 Control Unit: All versions\nSINAMICS G150 v5.1 SP1 Control Unit: All versions prior to v5.1 SP1 HF4\nSINAMICS S150 v4.6 Control Unit: All versions prior to v5.2\nSINAMICS S150 v4.7 Control Unit: All versions\nSINAMICS S150 v4.7 SP1 Control Unit: All versions prior to v5.2\nSINAMICS S150 v4.8 Control Unit: All versions prior to v4.8 HF6\nSINAMICS S150 v5.1 Control Unit: All versions\nSINAMICS S150 v5.1 SP1 Control Unit: All versions prior to v5.1 SP1 HF4\nSINAMICS S210 v5.1 Control Unit: All versions\nSINAMICS S210 v5.1 SP1 Control Unit: All versions\nSITOP Manager: All versions prior to v1.1\nSITOP UPS1600 (incl. SIPLUS variants): All versions prior to v2.3\nRFID 181EIP: All versions\nSITOP PSU8600: All versions prior to v1.5\nTIM 1531 IRC (incl. SIPLUS NET variants): All versions prior to v2\nSIMATIC IPC DiagMonitor: All versions prior to v5.1.3\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS READ CWE-125\nThe webserver of the affected devices contains a vulnerability that may allow an attacker to cause a denial-of-service condition, which leads to a restart of the webserver.\nCVE-2019-6568 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA. Artem Zinenko of Kaspersky identified that SIPLUS is also affected.\n5. MITIGATIONS\nSiemens recommends upgrading to the following firmware updates for the products below:\n\nSIMATIC ET 200 SP Open Controller CPU 1515SP PC (incl. SIPLUS variants): Update to v2.1.6\nSIMATIC ET 200 SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): Update to v2.7\nSIMATIC HMI Comfort Outdoor Panels 7\" & 15\" (incl. SIPLUS variants): Update to v15.1 Upd4\nSIMATIC HMI Comfort Panels 4\" - 22\" (incl. SIPLUS variants): Update to v15.1 Upd4\nSIMATIC HMI KTP Mobile Panels KTP400F, KTP700, KTP700F, KTP900 and KTP900F (incl. SIPLUS variants): Update to v15.1 Upd4\nSIMATIC IPC DiagMonitor: Update to v5.1.3\nSIMATIC RF185C, RF186C, and RF188C: Update to v1.1.0\nSIMATIC RF600R: Update to v3.2.1\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): Update to v2.6.1\nSIMATIC S7-1500 Software Controller: Update to v2.7\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): Update to v3.X.16\nSIMATIC S7-PLCSIM Advanced: Update to v2.0 SP1 Upd1\nSIMATIC WinAC RTX (F) 2010: Update to SP3 and apply BIOS and MS Windows updates\nSIMATIC WinCC Runtime Advanced: Update to v15.1 Upd4\nSIMOCODE pro VPN (incl. SIPLUS variants): Update to v2.1.3\n\n--------- Begin Update I Part 2 of 2 ---------\n\nSIMOCODE pro V EIP (incl. SIPLUS variants): Update to v1.1.3\n\n--------- End Update I Part 2 of 2 ---------\n\nSINAMICS G130 v5.1 Control Unit: Update to v5.1 SP1 HF4 or later version, or to latest version ofv5.2\nSINAMICS G130 v5.1 SP1 Control Unit: Update to v5.1 SP1 HF4 or later version\nSINAMICS G150 v5.1 Control Unit:  Update to v5.1 SP1 HF4 or later version, or to latest version ofv5.2\nSINAMICS G150 v5.1 SP1Control Unit: Update to v5.1 SP1 HF4 or later version\nSINAMICS S120 v5.1 Control Unit (incl. SIPLUS variants): Update to v5.1 SP1 HF4 or later version, or to latest version ofv5.2\nSINAMICS S120 v5.1 SP1 Control Unit(incl. SIPLUS variants): Update to v5.1 SP1 HF4 or later version\nSINAMICS S150 v5.1 Control Unit: Update to v5.1 SP1 HF4 or later version, or to latest version ofv5.2\nSINAMICS S150 v5.1 SP1 Control Unit: Update to v5.1 SP1 HF4 or later version\nSINAMICS G130 v4.6, v4.7, and v4.7 SP1: Update to v5.2 (latest version)\nSINAMICS G130 v4.8: Update to v4.8 HF6\nSINAMICS G150 v4.6 and v4.7 SP1: Update to v5.2 (latest version)\nSINAMICS G150 v4.8: Update to v4.8 HF6\nSINAMICS S120 v4.6 and v4.7 SP1 (incl. SIPLUS variants): Update to v5.2 (latest version)\nSINAMICS S120 v4.8 (incl. SIPLUS variants): Update to v4.8 HF6\nSINAMICS S150 v4.6 and v4.7 SP1: Update to v5.2 (latest version)\nSINAMICS S150 v4.8: Update to v4.8 HF6\nSITOP Manager: Update to v1.1\nSITOP PSU8600: Update to v1.5 \nSITOP UPS1600 (incl. SIPLUS variants): Update to v2.3\nTIM 1531 IRC (incl. SIPLUS NET variants): Update to v2.1\n\nFor all other affected products, Siemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nApply appropriate strategies for mitigation as described in the general security recommendation section.\nRestrict network access to the integrated webserver.\nDeactivate the webserver if not required and if deactivation is supported by the product.\nFor SINAMICS S, G130, G150 devices: perform upgrade to a new fixed version, for example v5.2.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-480230\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-6568"
  ],
  "techniques": [],
  "advisory": "icsa-19-099-06",
  "title": "Siemens SIMATIC, SIMOCODE, SINAMICS, SITOP, and TIM (Update I) | CISA",
  "source": "ics-advisories",
  "id": "734519185dfb04bba4d1780fcd39001765493e7028dd9d940db8e7a07b987ecf"
}