{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: WebAccess\nVulnerabilities: Stack-based Buffer Overflow, External Control of File Name or Path, Improper Privilege Management, Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute arbitrary code, access files and perform actions at a privileged level, or delete files on the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WebAccess are affected:\n\nWebAccess Versions 8.3.1 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nSeveral stack-based buffer overflow vulnerabilities have been identified, which may allow an attacker to execute arbitrary code.\nCVE-2018-14816 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    EXTERNAL CONTROL OF FILE NAME OR PATH CWE-73\nA .dll component is susceptible to external control of file name or path vulnerability, which may allow an arbitrary file deletion when processing.\nCVE-2018-14820 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nAn improper privilege management vulnerability has been identified, which may allow an attacker to access those files and perform actions at a system administrator level.\nCVE-2018-14828 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nA path traversal vulnerability may allow an attacker to execute arbitrary code.\nCVE-2018-14806 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, United States, and Europe\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nMat Powell of Trend Micro Zero Day Initiative working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nAdvantech has released Version 8.3.3 of WebAccess to address the reported vulnerabilities. Users can download the latest version of WebAccess at the following location:\nhttp://support.advantech.com/support/DownloadSRDetail_New.aspx?SR_ID=1-MS9MJV&Doc_Source=Download\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-14806",
    "CVE-2018-14828",
    "CVE-2018-14820",
    "CVE-2018-14816"
  ],
  "techniques": [],
  "advisory": "icsa-18-296-01",
  "title": "Advantech WebAccess | CISA",
  "source": "ics-advisories",
  "id": "241b7011c37431753a52d5b66d090b67d63e126e1d5c0ce63b1469692ee65498"
}