{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.4\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: Mendix SAML Module\nVulnerability: Authentication Bypass by Capture-replay\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA- ICSA-22-258-04 Siemens Mendix SAML Module (Update A) that was published November 10th, 2022 on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote attackers to gain unauthenticated access to the application.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reported this vulnerability affects the following versions of Mendix SAML Module, a SAML cloud authentication application:\n\nFor CVE-2022-37011\n\nMendix SAML Module (Mendix 7 compatible): All versions prior to V1.17.0\nMendix SAML Module (Mendix 8 compatible): All versions prior to V2.3.0\nMendix SAML Module (Mendix 9 compatible): All versions prior to V3.3.1\n\n\nFor CVE-2022-44457\n\nMendix SAML Module (Mendix 7 compatible): Versions  V1.17.0 and later.\nMendix SAML Module (Mendix 8 compatible): Versions V2.3.0 and later, up to but not including Version V2.3.2.\nMendix SAML Module (Mendix 9 compatible): Versions V3.3.1 and later, up to but not including Version V3.3.5.\n\n\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nAffected versions of the module provide insufficient protection from packet capture replay. This could allow unauthorized remote attackers to bypass authentication and access the application.\nCVE-2022-37011 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.2    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nWhen the non-recommended and non-default option “Allow Idp initiated authentication” is enabled, the affected versions insufficiently protect from packet capture replay.\nCVE-2022-44457 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens and Mendix recommend users update to the latest versions of the respective devices:\n\nFor CVE-2022-37011\n\nMendix SAML Module (Mendix 7 compatible): Update to version V1.17.0 or later\nMendix SAML Module (Mendix 8 compatible): Update to version V2.3.0 or later\nMendix SAML Module (Mendix 9 compatible): Update to version V3.3.1 or later\n\n\n\n\nFor CVE-2022-44457\n--------- Begin Update B part 1 of 1 ---------\n\nMendix SAML Module (Mendix 7 compatible): Update to version V.17.2 or later\n\n\n--------- End Update B part 1 of 1 ---------\n\nMendix SAML Module (Mendix 8 compatible): Update to version V2.3.2 or later\nMendix SAML Module (Mendix 9 compatible): Update to version V3.3.5 or later\n\n\n\nFor applications upgraded to Mendix 9 from earlier Mendix versions, CVE-2022-37011 was resolved in V3.3.0. CVE-2022-44457 was resolved in V3.3.4.\nFor compatibility reasons, the versions listed as fixed for CVE-2022-37011 still contain this issue, but only when the not recommended, non-default configuration option ‘Allow Idp Initiated Authentication’ is enabled.\nCVE-2022-44457 describes the incomplete fix for CVE-2022-37011 in a specific, non-default configuration. The latest version updates also fix the issue for the non-default configuration.\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see SSA-638652 in HTML or CSAF formats.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-37011",
    "CVE-2022-44457"
  ],
  "techniques": [],
  "advisory": "icsa-22-258-04",
  "title": "Siemens Mendix SAML Module (Update B) | CISA",
  "source": "ics-advisories",
  "id": "3a032dc8e883e979c9b0ef9a0b28d23d8100921c765cc7b844a85410ae5c7ef1"
}