{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELSEC-F Series\nVulnerability: Lack of Administrator Control Over Security\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to a denial-of-service condition in the communication function of the product or cause other unspecified effects.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of MELSEC-F Series with FX3U-ENET, an Ethernet-Internet block, are affected:\n\nFX3U-ENET Firmware Version 1.14 and prior\nFX3U-ENET-L Firmware Version 1.14 and prior\nFX3U-ENET-P502 Firmware Version 1.14 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    LACK OF ADMINISTRATOR CONTROL OVER SECURITY CWE-671\nThe affected product is vulnerable due to a lack of administrative controls, which may allow an attacker to remotely send specially crafted packets and cause a denial-of-service condition or other unspecified effects.\nCVE-2021-20612 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric corrected this vulnerability in the following products and versions:\n\nFX3U-ENET: Firmware Version 1.16 or later\nFX3U-ENET-L: Firmware Version 1.16 or later\nFX3U-ENET-P502: Firmware Version 1.16 or later\n\nMitsubishi Electric recommends users to take the following mitigations:\n\nUse a firewall or virtual private network (VPN) to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\n\nPlease contact Mitsubishi Electric Support for assistance and review the Mitsubishi Electric security advisory for more information about this issue.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-20612"
  ],
  "techniques": [],
  "advisory": "icsa-22-013-01",
  "title": "Mitsubishi Electric MELSEC-F Series | CISA",
  "source": "ics-advisories",
  "id": "9c7095cf2debd9d201395b4b6c7ec4512fe1aa4b8fab4552b7dd30c2d39b9df4"
}