{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: MELSEC-F Series\nVulnerability: NULL Pointer Dereference\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may cause a denial-of-service condition in communication with the product. System reset may be required for recovery.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports this vulnerability exists in the following MELSEC-F series Ethernet interface block:\n\nFX3U-ENET: Firmware Version 1.14 and prior\nFX3U-ENET-L: Firmware Version 1.14 and prior\nFX3U-ENET-P502: Firmware Version 1.14 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    NULL POINTER DEREFERENCE CWE-476\nMalicious attacker may cause a denial-of-service condition in communication with the product by sending specially crafted packets.\nCVE-2021-20596 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric Corporation recommends using the newest version of firmware possible. The fixed products and versions are as follows:\n\nFX3U-ENET：Firmware Version 1.16 or later\nFX3U-ENET-L：Firmware Version 1.16 or later\nFX3U-ENET-P502：Firmware Version 1.16 or later\n\nTo minimize the risk of exploiting this vulnerability, Mitsubishi Electric Corporation recommends users take the following mitigations:\n\nUse a firewall or virtual private network (VPN), etc., to prevent unauthorized access when Internet access is required.\nUse within a LAN and block access from untrusted networks and hosts through firewalls.\n\nPlease refer to the Mitsubishi Electric advisory for further details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-20596"
  ],
  "techniques": [],
  "advisory": "icsa-21-201-01",
  "title": "Mitsubishi Electric MELSEC-F Series | CISA",
  "source": "ics-advisories",
  "id": "babc6e43d0bdd59928495025a65e2da7ed224c9e5b021d2b5be3f1f2dcfcc68e"
}