{
  "markdown": "\nOVERVIEW\nZDI (Zero Day Initiative) has identified one information disclosure and two buffer overflow vulnerabilities, and independent researcher Jeremy Brown has identified hard-coded credentials in Pro-face’s GP-Pro EX HMI software. Pro-face has produced a module to mitigate these vulnerabilities.\nThese vulnerabilities could be exploited remotely, and some can be exploited without user interaction.\nAFFECTED PRODUCTS\nPro-face reports that these vulnerabilities affect the following versions of GP-Pro EX:\n\nModels: EX-ED, PFXEXEDV, PFXEXEDLS, PFXEXGRPLS; and\nVersions: 1.00 to Ver. 4.0.4\n\nIMPACT\nIt is possible for an attacker to force a stack-based buffer overflow. An attacker can leverage these vulnerabilities to execute arbitrary code in the context of the process.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nPro-face is a US-based company that maintains offices in several countries around the world, including Asia, India, Australia, the Americas, and Europe. Schneider Electric has recently acquired Pro-face.\nThe affected product, GP-Pro EX, is an HMI Screen Editor and Logic Programing software. According to Pro-face, GP-Pro EX is deployed across several sectors including Commercial Facilities, Critical Manufacturing, Energy, Water and Wastewater Systems, and others. Pro-face estimates that this product is used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nHEAP-BASED BUFFER OVERFLOWCWE-122: Heap-based Buffer Overflow, http://cwe.mitre.org/data/definitions/122.html, web site last accessed April 5, 2016.\n\nIt is possible for an attacker to force a heap-based buffer overflow. An attacker can leverage this vulnerability to execute arbitrary code in the context of the process.\nCVE-2016-2290NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-2290, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H, web site last accessed April 5, 2016.\n\nOUT-OF-BOUNDS READCWE-125:Out-of-bounds Read, http://cwe.mitre.org/data/definitions/125.html, web site last accessed April 5, 2016.\n\nIt is possible for an attacker to force an out-of-bounds read. An attacker can leverage this vulnerability to execute arbitrary code in the context of the process.\nCVE-2016-2291NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-2291, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N, web site last accessed April 5, 2016.\n\nSTACK-BASED BUFFER OVERFLOWCWE-121:Stack Buffer Overflow, http://cwe.mitre.org/data/definitions/121.html, web site last accessed April 5, 2016.\n\nIt is possible for an attacker to force a stack-based buffer overflow. An attacker can leverage this vulnerability to execute arbitrary code in the context of the process.\nCVE-2016-2292NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-2292, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N, web site last accessed April 5, 2016.\n\nUSE OF HARD-CODED CREDENTIALSCWE-798:Use of Hard-coded Credentials, http://cwe.mitre.org/data/definitions/798.html, web site last accessed April 5, 2016.\n\nHard-coded credentials in the FTP server allow for a remote user to have access to the project on the device.\nCVE-2016-7921NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-7921, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.1 have been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N, web site last accessed April 5, 2016.\n\nAUTHENTICATION BYPASS ISSUESCWE-592:Authentication Bypass Issues, http://cwe.mitre.org/data/definitions/592.html, web site last accessed April 5, 2016.\n\nAuthentication bypass issues in the FTP server allow for a remote user to have access to the project on the device.\nCVE-2016-7921NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-7921, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 9.1 have been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N, web site last accessed April 5, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely, and some can be exploited without user interaction.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nPro-face has released the following module:\nGP-Pro EX (Ver. 4.05.000 or later). The Update Module includes:\n\nEditor: Ver.4.05.000,\nTransfer Tool: Ver.4.05.000, and\nSystem/Runtime: Ver.4.5.0\n\nTo download the module, free member registration for “Otasuke Pro!” is required at:\nhttp://www.hmisource.com/otasuke/download/update/proex/\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed April 5, 2016. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed April 5, 2016. for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2016-7921",
    "CVE-2016-2291",
    "CVE-2016-2290",
    "CVE-2016-2292"
  ],
  "techniques": [],
  "advisory": "icsa-16-096-01",
  "title": "Pro-face GP-Pro EX HMI Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "764440b05353337fa145dbdb593f6d7dae46eafb924e64b8ba72d531a4fcd0ca"
}