{
  "markdown": "\nCVSS v3 8.3\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Delta Electronics\nEquipment: WPLSoft\nVulnerabilities: Stack-based Buffer Overflow, Heap-based Buffer Overflow, Out-of-bounds Write.\nAFFECTED PRODUCTS\nThe following versions of WPLSoft, a PLC programming software, are affected:\n\nWPLSoft, Versions 2.45.0 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow remote code execution or cause the software the attacker is accessing to crash.\nMITIGATION\nDelta Electronics recommends affected users update their software to the latest version of WPLSoft V2.46.0 that is available at the following location:\nhttp://www.deltaww.com/Products/PluginWebUserControl/downloadCenterCounter.aspx?DID=5043&DocPath=1&hl=en-US\nAdditionally, Delta recommends users restrict the application’s interaction with trusted files.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nThe application utilizes a fixed length stack buffer where a value larger than the buffer can be read from a file into the buffer, causing the buffer to be overwritten, which may allow remote code execution or cause the application to crash.\nCVE-2018-7494 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:H/A:H).\n\nHEAP-BASED BUFFER OVERFLOW CWE-122\n\nThe application utilizes a fixed length heap buffer where a value larger than the buffer can be read from a file into the buffer, causing the buffer to be overwritten, which may allow remote code execution or cause the application to crash.\nCVE-2018-7507 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:H/A:H).\n\nOUT-OF-BOUNDS WRITE CWE-787\n\nThe application writes data from a file outside the bounds of the intended buffer space, which could cause memory corruption or may allow remote code execution.\nCVE-2018-7509 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:H/A:H).\nRESEARCHER\nAxt working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Energy\nCountries/Areas Deployed: Asia, Europe, United States\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2018-7509",
    "CVE-2018-7494",
    "CVE-2018-7507"
  ],
  "techniques": [],
  "advisory": "icsa-18-058-02",
  "title": "Delta Electronics WPLSoft | CISA",
  "source": "ics-advisories",
  "id": "82a09d98c3518d58fa7015a53d0c036c8a5961f2da82cfb23f4c42106f6fac0d"
}