{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable Remotely/Low attack complexity\nVendor: Gessler GmbH\nEquipment: WEB-MASTER\nVulnerabilities: Use of Weak Credentials, Use of Weak Hash\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a user to take control of the web management of the device. An attacker with access to the device could also extract and break the password hashes for all users stored on the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Gessler GmbH WEB-MASTER, an emergency lighting management system, are affected:\n\nWEB-MASTER: version 7.9\n\n3.2 Vulnerability Overview\n3.2.1 USE OF WEAK CREDENTIALS CWE-1391\nGessler GmbH WEB-MASTER has a restoration account that uses weak hard coded credentials and if exploited could allow an attacker control over the web management of the device.\nCVE-2024-1039 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2 USE OF WEAK HASH CWE-328\nGessler GmbH WEB-MASTER user account is stored using a weak hashing algorithm. The attacker can restore the passwords by breaking the hashes stored on the device.\nCVE-2024-1040 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worlwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nFelix Eberstaller and Nino Fürthauer of Limes Security reported these vulnerabilities to CISA.\n4. MITIGATIONS\nGessler GmbH recommends updating EZ2 to 3.2 or greater and WebMaster to 4.4 or greater to mitigate these vulnerabilities. Updates have to be applied by Gessler GmbH technicians. For more information contact Gessler GmbH.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nFebruary 1, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-1040",
    "CVE-2024-1039"
  ],
  "techniques": [],
  "advisory": "icsa-24-032-01",
  "title": "Gessler GmbH WEB-MASTER | CISA",
  "source": "ics-advisories",
  "id": "4c0613f936eb08b65b49a9bfe9b5b7bf2b71e0b30dcd7bba43adbbd26ea6ff7e"
}