{
  "markdown": "\nOverview\nThis Advisory is a follow-up to the original Alert titled “ICS-ALERT-11-332-01A—Siemens Automation License Manager Vulnerabilities” that was published December 02, 2011, on the ICS-CERT web page.\nICS-CERT is aware of publicly disclosed reports of four vulnerabilities in Siemens Automation License Manager (ALM) application. These vulnerabilities include:\n\nBuffer overflow\nException\nNull pointer\nImproper input validation.\n\nIndependent researcher Luigi Auriemma publicly disclosed four vulnerabilities along with proof-of-concept (PoC) exploit code without coordination from Siemens, ICS-CERT, or any other coordinating entity known to ICS-CERT.\nSiemens has confirmed these vulnerabilities and has released a patch to address the issue. ICS-CERT has not validated the patch.\nAffected Products\nSiemens software products that include ALM Version 4.0 to 5.1+SP1+Upd1 are affected by the buffer overflow, exception, and null pointer vulnerabilities.\nSiemens software products that include ALM Version 2.0 to 5.1+SP1+Upd2 are affected by the improper input validation vulnerability.\nImpact\nSuccessful exploitation of these vulnerabilities could result in denial of service, write to memory, file corruption, or remote code execution.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBackground\nSiemens is a German multinational company headquartered in Munich with activities in the fields of industry, energy, and healthcare.\nSiemens ALM is an application that centrally manages licenses for various Siemens products. The products contact ALM either locally or remotely to verify their license. This software is used in many industries including: food and beverage, water and wastewater, oil and gas, and chemical.\nVulnerability Characterization\nVulnerability Overview\nBuffer Overflow\nALM does not check the length of a field used in various commands sent to the server via TCP port 4410. This vulnerability may lead to remote code execution.\nCVE-2011-4529 has been assigned to this vulnerability. A CVSS V2 base score of 8.3 has also been calculated by Siemens.\nException\nIn multiple cases, ALM does not check the length of fields used in various commands sent to the server via TCP Port 4410. These vulnerabilities cause exceptions within the application, which cause the application to quit and enable denial-of-service attacks.\nCVE-2011-4530 has been assigned to this vulnerability. A CVSS V2 base score of 6.1 has also been calculated by Siemens.\nNull Pointer\nALM does not check the content of a field used for command sent to the server via TCP port 4410. This vulnerability causes a null pointer dereference, which cause the application to quit and enables a Denial-of-Service attack.\nCVE-2011-4531  has been assigned to this vulnerability. A CVSS v2 base score of 6.1 has also been calculated by Siemens.\nImproper Input Validation\nALM uses an ActiveX control in its graphical user interface. This control exports a method that allows saving a file to the local hard disk. A malicious web site that the user accesses with Internet Explorer may delete the content of any file on the system that the user is allowed to write to, and create new files.\nCVE-2011-4532 has been assigned to this vulnerability. A CVSS v2 base score of 8.8 has also been calculated by Siemens.\nVulnerability Details\nExploitability\nThese vulnerabilities are remotely exploitable.\nExistence of Exploit\nPublicly released PoC code exists for these vulnerabilities.\nDifficulty\nCrafting a working exploit for these vulnerabilities would require a moderate skill level. Social engineering is required to exploit the improper input validation vulnerability.\nMitigation\nSiemens has released a patch to its customers to address these vulnerabilities. Customers of vulnerable versions of Siemens ALM should deploy the Siemens patch.\nFor more information, please see Siemens’ Security Advisory announcement.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n\n",
  "cves": [
    "CVE-2011-4532",
    "CVE-2011-4531",
    "CVE-2011-4529",
    "CVE-2011-4530"
  ],
  "techniques": [],
  "advisory": "icsa-11-361-01",
  "title": "Siemens Automation License Manager Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "782bc00b3bb0ee1548fdacb8768931fd77cbb4f975fe97c5e25f8ec94e00c564"
}