{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE X-300 switch family devices\nVulnerabilities: Improper Input Validation, Use of Insufficiently Random Values, Stack-based Buffer Overflow, Cross-site Request Forgery, Improper Access Control, Basic XSS, Classic Buffer Overflow, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthenticated attacker to reboot, cause denial-of-service conditions, and impact the system by other means through buffer overflow vulnerabilities.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSCALANCE X302-7 EEC: All versions prior to v4.1.4\nSCALANCE X304-2FE: All versions prior to v4.1.4\nSCALANCE X306-1LD FE: All versions prior to v4.1.4\nSCALANCE X307-2 EEC: All versions prior to v4.1.4\nSCALANCE X307-3: All versions prior to v4.1.4\nSCALANCE X307-3LD: All versions prior to v4.1.4\nSCALANCE X308-2: All versions prior to v4.1.4\nSCALANCE X308-2LD: All versions prior to v4.1.4\nSCALANCE X308-2LH: All versions prior to v4.1.4\nSCALANCE X308-2LH+: All versions prior to v4.1.4\nSCALANCE X308-2M: All versions prior to v4.1.4\nSCALANCE X308-2M POE: All versions prior to v4.1.4\nSCALANCE X308-2M TS: All versions prior to v4.1.4\nSCALANCE X310: All versions prior to v4.1.4\nSCALANCE X310FE: All versions prior to v4.1.4\nSCALANCE X320-1 FE: All versions prior to v4.1.4\nSCALANCE X320-1-2LD FE: All versions prior to v4.1.4\nSCALANCE X408-2: All versions prior to v4.1.4\nSCALANCE XR324-4M EEC: All versions prior to v4.1.4\nSCALANCE XR324-4M PoE: All versions prior to v4.1.4\nSCALANCE XR324-4M PoE TS: All versions prior to v4.1.4\nSCALANCE XR324-12M: All versions prior to v4.1.4\nSCALANCE XR324-12M TS: All versions prior to v4.1.4\nSIPLUS NET SCALANCE X308-2: All versions prior to v4.1.4\nSmart Security Manager: Versions 1.5 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nAffected devices do not properly validate the HTTP headers of incoming requests. This could allow an unauthenticated remote attacker to crash affected devices.\nCVE-2022-25751 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:H).\n3.2.2    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nThe webserver of affected devices calculates session ids and nonces in an insecure manner. This could allow an unauthenticated remote attacker to brute-force session ids and hijack existing sessions.\nCVE-2022-25752 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    STACK-BASED BUFFER OVERFLOW CWE-121\nThe handling of arguments such as IP addresses in the CLI of affected devices is prone to buffer overflows. This could allow an authenticated remote attacker to execute arbitrary code on the device.\nCVE-2022-25753 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nThe integrated web server of the affected device could allow remote attackers to perform actions with the permissions of a victim user, provided the victim user has an active session and is induced to trigger the malicious request.\nCVE-2022-25754 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:H).\n3.2.5    IMPROPER ACCESS CONTROL CWE-284\nThe webserver of an affected device is missing specific security headers. This could allow a remote attacker to extract confidential session information under certain circumstances.\nCVE-2022-25755 has been assigned to this vulnerability. A CVSS v3 base score of 2.6 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.6    IMPROPER NEUTRALIZATION OF SCRIPT-RELATED HTML TAGS IN A WEB PAGE (BASIC XSS) CWE-80\nThe integrated web server could allow Cross-Site Scripting (XSS) attacks if unsuspecting users are tricked into accessing a malicious link. This can be used by an attacker to trigger a malicious request on the affected device.\nCVE-2022-25756 has been assigned to this vulnerability. A CVSS v3 base score of 7.9 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.2.7    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT (‘CLASSIC BUFFER OVERFLOW') CWE-120\nAffected devices do not properly validate the GET parameter XNo of incoming HTTP requests. This could allow an unauthenticated remote attacker to crash affected devices.\nCVE-2022-26334 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:H).\n3.2.8    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT (‘CLASSIC BUFFER OVERFLOW') CWE-120\nAffected devices do not properly validate the URI of incoming HTTP GET requests. This could allow an unauthenticated remote attacker to crash affected devices.\nCVE-2022-26335 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.9    OUT-OF-BOUNDS READ CWE-125\nAffected devices do not properly validate if a certain SNMP key exists. An attacker could use this to trigger a reboot of an affected device by requesting specific SNMP information from the device.\nCVE-2022-26380 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMichael Messner and Abian Blome of Siemens Energy coordinated the disclosure of CVE-2022-25751 and CVE-2022-25756 to CISA.\n4. MITIGATIONS\nSiemens recommends upgrading all X-300 switch family devices to v4.1.4 or later.\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict access to the affected systems, especially to Ports 22/TCP, 161/UDP, and 443/TCP and use trusted IP addresses only.\nDisable SNMP service, if possible.\nDeactivate the webserver if not required, and if deactivation is supported by the product.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to the Siemens operational guidelines for industrial security and follow the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-836527\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-25755",
    "CVE-2022-25754",
    "CVE-2022-25751",
    "CVE-2022-26334",
    "CVE-2022-26335",
    "CVE-2022-25753",
    "CVE-2022-25756",
    "CVE-2022-26380",
    "CVE-2022-25752"
  ],
  "techniques": [],
  "advisory": "icsa-22-104-09",
  "title": "Siemens SCALANCE X-300 Switches | CISA",
  "source": "ics-advisories",
  "id": "4ef4580ea4c31357a97a067edc9ce8899a9c2499d07ba509740d28cd0ca75bc6"
}