{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.4\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Siemens \nEquipment: Polarion ALM \nVulnerability: Injection  \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to perform host header injection attacks. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens Polarion ALM, an application lifecycle management software, are affected: \n\nAll versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS IN OUTPUT USED BY A DOWNSTREAM COMPONENT ('INJECTION') CWE-74\nThe affected application contains a host header injection vulnerability that could allow an attacker to spoof host header information and redirect users to malicious websites.  \nCVE-2022-46265 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide  \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nPongsathon Sirithanyakul, Juttikhun Jirathanan, and Warunyou Sunpachit of IT Select Lab reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk: \n\nIn the product’s Apache HTTP Server configuration, check “polarion.conf” or “polarion-cluster.conf” for the below misconfiguration: \n\n“RedirectMatch permanent ^/$ /polarion/” which must be changed to “RedirectMatch permanent \"^/$\"https://<their-polarion-host-here>/polarion/”\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and to follow the recommendations in the product manuals.  Additional information on industrial security by Siemens can be found here.   \nFor more information, see Siemens security advisory SSA-792594 in HTML or CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2022-46265"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-08",
  "title": "Siemens Polarion ALM | CISA",
  "source": "ics-advisories",
  "id": "19e0546152a1c0444ecfb481588795e41b161ed9c7e245cacc9df5bebb4b34aa"
}