{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: Fuji Electric\nEquipment: FRENIC Loader, FRENIC-Mini (C1), FRENIC-Mini (C2), FRENIC-Eco, FRENIC-Multi, FRENIC-MEGA, FRENIC-Ace\nVulnerabilities: Buffer Over-read, Out-of-bounds Read, Stack-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-270-03 Fuji Electric FRENIC Devices that was published September 27, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow for arbitrary remote code execution affecting the availability of the device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of FRENIC Loader, FRENIC-Mini (C1), FRENIC-Mini (C2), FRENIC-Eco, FRENIC-Multi, FRENIC-MEGA, FRENIC-Ace, HVAC drive devices, are affected:\n\nFRENIC LOADER v3.3 v7.3.4.1a of FRENIC-Mini (C1), FRENIC-Mini (C2), FRENIC-Eco, FRENIC-Multi, FRENIC-MEGA, FRENIC-Ace\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    BUFFER OVER-READ CWE-126\nA buffer over-read vulnerability may allow remote code execution on the device. \nCVE-2018-14790 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    OUT-OF-BOUNDS READ CWE-125\nThe program does not properly parse FNC files that may allow for information disclosure. \nCVE-2018-14798 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.3    STACK-BASED BUFFER OVERFLOW CWE-121\nThe program does not properly check user-supplied comments which may allow for arbitrary remote code execution. \nCVE-2018-14802 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nMichael Flanders and Ghirmay Desta working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to NCCIC.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 --------\nFuji Electric has released a new version of firmware for the affected FRENIC Loader products that can be found at:\nhttps://felib.fujielectric.co.jp/download/search2.htm?dosearch=1&siteswitch=1&product1_id=P10008&product2_id=&product3_id=&series_id=&documentGroup=&material1_id=&material2_id=&stopproduct=&site=america&lang=en.\n--------- End Update A Part 1 of 1 --------\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-14802",
    "CVE-2018-14798",
    "CVE-2018-14790"
  ],
  "techniques": [],
  "advisory": "icsa-18-270-03",
  "title": "Fuji Electric FRENIC Devices (Update A) | CISA",
  "source": "ics-advisories",
  "id": "25bd878268d8a8b57b356e1b3342658a4627fd87ece2958250071d0868323d18"
}