{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Hitachi Energy\nEquipment: IEC 61850 MMS-Server\nVulnerability: Improper Resource Shutdown or Release\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause products using the IEC 61850 MMS-server communication stack to stop accepting new MMS-client connections.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions Hitachi Energy equipment using the IEC 61850 communication stack are affected:\n\nTXpert Hub CoreTec 4 version 2.0.x\nTXpert Hub CoreTec 4 version 2.1.x\nTXpert Hub CoreTec 4 version 2.2.x\nTXpert Hub CoreTec 4 version 2.3.x\nTXpert Hub CoreTec 4 version 2.4.x\nTXpert Hub CoreTec 4 version 3.0.x\nTXpert Hub CoreTec 5 version 3.0.x\nTego1_r15b08 (FOX615 System Release R15B)\nTego1_r2a16_03 (FOX615 System Release R14A)\nTego1_r2a16\nTego1_r1e01\nTego1_r1d02\nTego1_r1c07\nTego1_r1b02\nGMS600 version 1.3\nRelion 670 1.2 (Limited)\nRelion 670 2.0 (Limited)\nRelion 650 version 1.1 (Limited)\nRelion 650 version 1.3 (Limited)\nRelion 650 version 2.1 (Classic)\nRelion 670 version 2.1 (Classic)\nRelion SAM600-IO 2.2.1\nRelion SAM600-IO 2.2.5\nRelion 670/650 version 2.2.0\nRelion 670/650 version 2.2.1\nRelion 670/650 version 2.2.2\nRelion 670/650 version 2.2.3\nRelion 670/650 version 2.2.4\nRelion 670/650 version 2.2.5\nITT600 SA Explorer version 1.1.0\nITT600 SA Explorer version 1.1.1\nITT600 SA Explorer version 1.1.2\nITT600 SA Explorer version 1.5.0\nITT600 SA Explorer version 1.5.1\nITT600 SA Explorer version 1.6.0\nITT600 SA Explorer version 1.6.0.1\nITT600 SA Explorer version 1.7.0\nITT600 SA Explorer version 1.7.2\nITT600 SA Explorer version 1.8.0\nITT600 SA Explorer version 2.0.1\nITT600 SA Explorer version 2.0.2\nITT600 SA Explorer version 2.0.3\nITT600 SA Explorer version 2.0.4.1\nITT600 SA Explorer version 2.0.5.0\nITT600 SA Explorer version 2.0.5.4\nITT600 SA Explorer version 2.1.0.4\nITT600 SA Explorer version 2.1.0.5\nMSM version 2.2.3 and prior\nPWC600 version 1.0\nPWC600 version 1.1\nPWC600 version 1.2\nREB500 all V8.x versions\nREB500 all V7.x versions\nRTU500 series CMU Firmware version 12.0.1 to 12.0.14\nRTU500 series CMU Firmware version 12.2.1 to 12.2.11\nRTU500 series CMU Firmware version 12.4.1 to 12.4.11\nRTU500 series CMU Firmware version 12.6.1 to 12.6.8  \nRTU500 series CMU Firmware version 12.7.1 to 12.7.4  \nRTU500 series CMU Firmware version 13.2.1 to 13.2.5  \nRTU500 series CMU Firmware version 13.3.1 to 13.3.3  \nRTU500 series CMU Firmware version 13.4.1\nSYS600 version 10.1 to 10.3.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER RESOURCE SHUTDOWN OR RELEASE CWE-404\nAn attacker could exploit the IEC 61850 MMS-Server communication stack by forcing the communication stack to stop accepting new MMS-client connections.\nCVE-2022-3353 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi Energy provided updates for the following products. Contact Hitachi Energy for update information.\n\nMSM Server update to version 2.2.5\ntego1_r15b08 (FOX615 System Release R15B) update to tego1_r16a11 (FOX615 System Release R16A)\nREB500 all V8.x versions update to REB500 firmware to version 8.3.3.0 when released.\nRTU500 series CMU Firmware version 12.0.1 to 12.0.14 Update to CMU Firmware version 12.0.15\nRTU500 series CMU Firmware version 12.2.1 to 12.2.11 Update to CMU Firmware version 12.2.12\nRTU500 series CMU Firmware version 12.4.1 to 12.4.11 Update to CMU Firmware version 12.4.12\nRTU500 series CMU Firmware version 12.6.1 to 12.6.8 Update to CMU Firmware version 12.6.9\nRTU500 series CMU Firmware version 12.7.1 to 12.7.4 Update to CMU Firmware version 12.7.5\nRTU500 series CMU Firmware version 13.2.1 to 13.2.5 Update to CMU Firmware version 13.2.6\nRTU500 series CMU Firmware version 13.3.1 to 13.3.3 Update to CMU Firmware version 13.3.4\nRTU500 series CMU Firmware version 13.4.1 Update to CMU Firmware version 13.4.2\nSYS600 version 10.1 to 10.3.1 update to SYS600 version 10.4.1\n\nFor all versions, Hitachi Energy recommends that users apply these general mitigation factors: \n\nUpgrade the system once a remediated version is available.\nApply Hitachi Energy recommended security practices and firewall configurations to help protect a process control network from attacks that originate from outside the network. Such practices include: \n\nPhysically protecting process control systems from direct access by unauthorized personnel.\nNot allowing direct connections to the internet.\n\nProcess control systems should not be used for internet surfing, instant messaging, or receiving emails.\n\n\nUse a firewall system that has a minimal number of exposed ports to separate the process control network from other networks. \n\nConnection to other networks must be evaluated as necessary. \n\n\nScan portable computers and removable storage media carefully for viruses before connection to a control system.\n\n\nMSM is not designed nor intended to be connected to the internet. Disconnect the device from any internet facing network.\n\nAdopt user access management and updated antivirus protection engines equipped with the latest signature rules for computers that have installed and are operating the MMS Client application. \nUse the default operating system (OS) user access management function to limit unauthorized access and/or rogue commands via the MMS Client application.\n\n\n\nFor more information, see the Hitachi Energy advisories for the corresponding affected products: \n\n8DBD000124 TXpert Hub CoreTec 4 and 5 Products \n8DBD000132 RTU500 series \n8DBD000127 Relion 670, 650 series, and SAM600-IO \n8DBD000131 REB500 series \n8DBD000130 PWC600 \n8DBD000129 MSM \n8DBD000133 MicroSCADA X SYS600 \n8DBD000128 ITT600 SA Explorer \n8DBD000126 GMS600 \n8DBD000125 FOX61x TEGO1\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-3353"
  ],
  "techniques": [],
  "advisory": "icsa-23-089-01",
  "title": "Hitachi Energy IEC 61850 MMS-Server | CISA",
  "source": "ics-advisories",
  "id": "43a31f176350ff96909ecb82fe582ccfda2281e17340adb84bb420a3efc6961f"
}