{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity/public exploits available\nVendor: Siemens \nEquipment: SCALANCE\nVulnerabilities: Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS), Uncontrolled Resource Consumption, Use of Insufficiently Random Values, Improper Access Control, Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nExploitation of these vulnerabilities could result in a denial-of-service condition, hijacking of web sessions, and the loss of confidential or sensitive information.\n3. TECHNICAL DETAILS\n\n\n3.1 AFFECTED PRODUCTS\nThe following Siemens software is affected:\n\nSCALANCE X204RNA (HSR) (6GK5204-0BA00-2MB2): All versions prior to V3.2.7\nSCALANCE X204RNA (PRP) (6GK5204-0BA00-2KB2): All versions prior to V3.2.7\nSCALANCE X204RNA EEC (HSR) (6GK5204-0BS00-2NA3): All versions prior to V3.2.7\nSCALANCE X204RNA EEC (PRP) (6GK5204-0BS00-3LA3): All versions prior to V3.2.7\nSCALANCE X204RNA EEC (PRP/HSR) (6GK5204-0BS00-3PA3): All versions prior to V3.2.7\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SCRIPT-RELATED HTML TAGS IN A WEB PAGE (BASIC XSS) CWE-80\nThe integrated web server could allow cross-site scripting (XSS) attacks if unsuspecting users are tricked into accessing a malicious link, which an attacker could use to trigger a malicious request on the affected device.\nCVE-2022-46350 has been assigned to this vulnerability. A CVSS v3 base score of 7.9 has been calculated. the CVSS vector string is (CVSS:3.1/AV:A/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H)\n3.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nSpecially crafted PROFINET DCP packets could cause a denial-of-service condition of affected products on a local Ethernet segment (Layer 2).\nCVE-2022-46351 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated. the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H)\n3.2.3    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nSpecially crafted PROFINET DCP packets could cause a denial-of-service condition of affected products.\nCVE-2022-46352 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H)\n3.2.4    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nThe webserver of affected devices insecurely calculates session IDs and nonces. This could allow an unauthenticated remote attacker to brute-force session IDs and hijack existing sessions.\nCVE-2022-46353 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H)\n3.2.5    IMPROPER ACCESS CONTROL CWE-284\nThe webservers of affected devices are missing specific security headers. This could allow a remote attacker to extract confidential session information under certain circumstances.\nCVE-2022-46354 has been assigned to this vulnerability. A CVSS v3 base score of 2.6 has been calculated. the CVSS vector string is (CVSS:3.1/AV:A/AC:H/PR:N/UI:R/S:U/C:L/I:N/A:N)\n3.2.6    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe affected products are vulnerable to an exposure of sensitive information to an unauthorized actor vulnerability by leaking sensitive data in the HTTP Referer.\nCVE-2022-46355 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated. the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N)\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens released updates for the affected products and recommends updating to the latest versions:\n\nUpdate to V3.2.7 or later version\n\nSiemens identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nRestrict access to affected systems, especially to ports 22/TCP, 80/TCP, 443/TCP, and 161/UDP to only trusted IP addresses.\nDisable the simple network management protocol (SNMP) service if not required and if the product supports disabling.\nDeactivate the webserver if not required and if the product supports deactivation.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens Industrial Security webpage. \nFor further inquiries on security vulnerabilities in Siemens products, users should contact Siemens ProductCERT.\nFor more information, see the associated Siemens security advisory SSA-363821 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have a low attack complexity.\n",
  "cves": [
    "CVE-2022-46350",
    "CVE-2022-46355",
    "CVE-2022-46352",
    "CVE-2022-46353",
    "CVE-2022-46351",
    "CVE-2022-46354"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-02",
  "title": "Siemens SCALANCE X-200RNA Switch Devices | CISA",
  "source": "ics-advisories",
  "id": "f64f7d23ebb23233e12c575a0c42b32d002762a6f4c6fd3a64d5108617cd20a2"
}