{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Emerson \nEquipment: Rosemount X-STREAM Gas Analyzer\nVulnerability: Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker through a specially crafted URL to download files and obtain sensitive information.\n3. TECHNICAL DETAILS\n\n\n3.1 AFFECTED PRODUCTS\nThe following versions of Emerson’s Rosemount X-STREAM gas analysis software, are affected:\n\nX-STREAM enhanced XEGP – all revisions \nX-STREAM enhanced XEGK – all revisions \nX-STREAM enhanced XEFD – all revisions \nX-STREAM enhanced XEXF – all revisions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe affected products are vulnerable to improper authentication for accessing log and backup data, which could allow an attacker with a specially crafted URL to obtain access to sensitive information. \nCVE-2020-27254 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy, Chemical\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nMaxim Rupp reported this vulnerability to CISA.\n4. MITIGATIONS\nEmerson recommends users update the firmware of any affected products. A new release that addresses the issues identified in this Cybersecurity Notification impacting the affected products is available. For information on how to obtain the update contact TechSupport.Hasselroth@emerson.com\nIn addition, Emerson recommends users of affected products continue to utilize current cybersecurity industry best practices. In the event such infrastructure is not implemented within an end user’s network, action should be taken to ensure the affected products are connected to a well-protected network and properly segmented from the Internet. For more information on the Emerson Security notifications page. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. \n \n",
  "cves": [
    "CVE-2020-27254"
  ],
  "techniques": [],
  "advisory": "icsa-20-352-01",
  "title": "Emerson Rosemount X-STREAM | CISA",
  "source": "ics-advisories",
  "id": "e0c69684874cf584571dfbbde1264f2f23737cc5c2250a81db651df66473235b"
}