{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Sub-IoT project \nEquipment: DASH 7 Alliance Protocol stack implementation \nVulnerability: Out-of-bounds Write \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to create an out-of-bounds write condition. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Sub-IoT implementation of the Dash7 Alliance protocol, a low power, sub-GHz Internet of Things (IoT) communication protocol, are affected: \n\nSub-IoT DASH 7 Alliance protocol implementation: All versions prior to 0.5.0 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 OUT-OF-BOUNDS WRITE CWE-787 \nThe Sub-IoT implementation of the DASH 7 Alliance protocol has a vulnerability that can lead to an out-of-bounds write. If the protocol has been compiled using default settings, this will only grant the attacker access to allocated but unused memory. However, if it was configured using non-default settings, there is the possibility that exploiting this vulnerability could lead to system crashes and remote code execution. \nCVE-2023-0847 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: N/A \n\n3.4 RESEARCHER\nBehrang Fouladi of Firmalyzer reported this vulnerability to CISA. \n4. MITIGATIONS\nSub-IoT recommends users reinstall with version 0.5.0 or later. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2023-0847"
  ],
  "techniques": [],
  "advisory": "icsa-23-047-13",
  "title": "Sub-IoT DASH 7 Alliance Protocol stack implementation | CISA",
  "source": "ics-advisories",
  "id": "fbe032f030cdb2d9a9378460beb002636e21d7643fa9505bf9c5230ff4540594"
}