{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE S-600 Firewall\nVulnerabilities: Resource Exhaustion, Cross-site Scripting\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-042-10 Siemens SCALANCE S-600 (Update A) that was published August 11, 2020 to the ICS webpage on us-cert.cisa.gov. \n3. RISK EVALUATION\nThese vulnerabilities could allow a remote attacker to conduct denial-of-service or cross-site scripting attacks. User interaction is required for a successful exploitation of the cross-site-scripting attack.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SCALANCE S-600, are affected:\n--------- Begin Update B Part 1 of 2 ---------\n\nSCALANCE S602, all versions v3.0 or higher and prior to v4.1\nSCALANCE S612, all versions v3.0 or higher and prior to v4.1\nSCALANCE S623, all versions v3.0 or higher and prior to v4.1\nSCALANCE S627-2M, all versions v3.0 or higher and prior to v4.1\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CROSS-SITE SCRIPTING CWE-80\nThe integrated configuration web server of the affected devices could allow cross-site scripting (XSS) attacks if unsuspecting users are tricked into accessing a malicious link.\nCVE-2019-6585 has been assigned to this vulnerability. A CVSS v3 base score of 4.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:C/C:L/I:L/A:N).\n4.2.2    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nSpecially crafted packets sent to Port 443/TCP of affected devices could cause a denial-of-service condition of the web server.\nCVE-2019-13925 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.3    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nSpecially crafted packets sent to Port 443/TCP of affected devices could cause a denial-of-service condition of the web server. A cold reboot is required to restore the functionality of the device.\nCVE-2019-13926 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nMelih Berk Ekşioğlu reported some of these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations that customers can apply to reduce the risk: \n--------- Begin Update B Part 2 of 2 ---------\n\nFor versions v3.0 and higher, Update to v4.1\n\n--------- End Update B Part 2 of 2 ---------\n\nOnly access links from trusted sources in the browser you use to access the SCALANCE S-600 administration website. \nFor SCALANCE S-600 family (S602, S612, S623, S627-2M): migrate to a successor product within the SCALANCE SC-600 family, v2.1 or later version. For details refer to the notice of discontinuation.\n\nFor more information on these vulnerabilities and associated software updates, please see Siemens security advisory SSA-591405\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6585",
    "CVE-2019-13926",
    "CVE-2019-13925"
  ],
  "techniques": [],
  "advisory": "icsa-20-042-10",
  "title": "Siemens SCALANCE S-600 (Update B) | CISA",
  "source": "ics-advisories",
  "id": "dd3e2c41d29d6d5e488b3819b1cb6360ae0eb1e94fb1f2265a62338696cec33a"
}