{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: FactoryTalk View Machine Edition\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute code remotely with specially crafted malicious packets or by using a self-made library to bypass security checks.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Rockwell Automation products are affected:\n\nFactoryTalk View Machine Edition: v13.0\nFactoryTalk View Machine Edition: v12.0 and prior\n\n3.2 Vulnerability Overview\n3.2.1 Improper Input Validation CWE-20\nFactoryTalk View Machine Edition on the PanelView Plus, improperly verifies user's input, which allows unauthenticated attacker to achieve remote code executed via crafted malicious packets. The device has the functionality, through a CIP class, to execute exported functions from libraries. There is a routine that restricts it to execute specific functions from two dynamic link library files. By using a CIP class, an attacker can upload a self-made library to the device which allows the attacker to bypass the security check and execute any code written in the function.\nCVE-2023-2071 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nYuval Gordon, CPS Research, and the Microsoft Threat Intelligence Community reported this vulnerability to Rockwell Automation.\n4. MITIGATIONS\nRockwell recommends updating FactoryTalk View Machine Edition with v12.0 & v13.0 patch\nUsers of the affected versions are encouraged by Rockwell Automation to upgrade to corrected firmware revisions. Users are also strongly encouraged to implement Rockwell Automation's suggested security best practices to minimize the risk of the vulnerability.\n\nInstall the security patches for the respective versions\nSecurity Best Practices\n\nFor more information and to see Rockwell's detection rules, see Rockwell Automation's Security Advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\nSeptember 21, 2023: Initial Publication\n",
  "cves": [
    "CVE-2023-2071"
  ],
  "techniques": [],
  "advisory": "icsa-23-264-06",
  "title": "Rockwell Automation FactoryTalk View Machine Edition | CISA",
  "source": "ics-advisories",
  "id": "b5b42d95b99955348c13bb4dc07ee3fdbb76f5bd2f535285258b03e8bee8cfc3"
}