{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: GMS600, PWC600, and Relion 670/650/SAM600-IO\nVulnerability: Improper Access Controls\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-343-01 Hitachi Energy GMS600, PWC600, and Relion that was published December 9, 2021, on the ICS webpage at cisa.gov/ics. \n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker with user credentials to bypass security controls enforced by the product, which may lead to unauthorized modifications on data/firmware, and/or permanent disabling of the product.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Hitachi Energy GMS600 and PWC600 circuit breaker monitoring systems are affected:\n\nGMS600: Version 1.2.0\nGMS600: Version 1.3.0\nGMS600: Version 1.3.1.0\nPWC600: Version 1.1.0.0\nPWC600: Version 1.1.0.1\nPWC600: Version 1.0.1.0\nPWC600: Version 1.0.1.1\nPWC600: Version 1.0.1.3\nPWC600: Version 1.0.1.4\nRelion 670/650 series: Version 2.2.0, all revisions\nRelion 670/650/SAM600-IO series: Version 2.2.1, all revisions\nRelion 670 series: Version 2.2.2, all revisions\nRelion 670 series: Version 2.2.3, revisions up to 2.2.3.4\nRelion 670/650 series: Version 2.2.4, all revisions\nRelion 670/650/SAM600-IO series: Version 2.2.5, revisions up to 2.2.5.1\nRelion 670/650 series: Version 2.1, all revisions\nRelion 670 series: Version 2.0, all revisions\nRelion 650 series: Version 1.3, all revisions\nRelion 650 series: Version 1.2, all revisions\nRelion 650 series: Version 1.1, all revisions\nRelion 650 series: Version 1.0, all revisions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER ACCESS CONTROLS CWE-284\nAn attacker could exploit this vulnerability by first gaining access to credentials of any account or have access to a session ticket issued for an account. After gaining access via the configuration tool that accesses the proprietary Open Data-base Connectivity (ODBC) protocol (TCP 2102), the database table can be manipulated for privilege escalation, which then allows unauthorized modification or permanent disabling of the device.\nCVE-2021-35534 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION:  Switzerland\n\n4.4 RESEARCHER\nA Department of Energy CyTRICS researcher from Idaho National Laboratory reported this vulnerability to Hitachi Energy.\n5. MITIGATIONS\nHitachi Energy recommends upgrading to the latest version of their software when it becomes available:\n\nRelion 670 series Version 2.2.3: Update to Version 2.2.3.5\nRelion 670/650/SAM600-IO series Version 2.2.5: Update to Version 2.2.5.2\nRelion 650 series Version 1.3: Update to Version 1.3.0.8\nRelion 650 series Version 1.2: Update to Version 1.3\n\n--------- Begin Update A Part 1 of 1 --------- \n\nRelion 670 series Version 2.2.3 to 2.2.3.4: Update to Version 2.2.3.5 \nRelion 670/650/SAM600-IO series Version 2.2.5 to revision 2.2.5.1: Update to Version 2.2.5.2 \nRelion 670/650 series Version 2.1, all revisions: Update to Version 2.1.0.5 \n\n--------- End Update A Part 1 of 1 --------- \nFor other affected versions, please follow mitigation factors in Hitachi Energy’s advisories.\nHitachi Energy recommends the following security practices and firewall configurations to help protect process control networks from attacks that originate from outside the network:\nPhysically protect process control systems from direct access by unauthorized personnel.\n\nDo not directly connect to the Internet.\nSeparate from other networks by means of a firewall system that has a minimal number of ports exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving e-mails.\nLimit open database connectivity (ODBC) protocol for device configuration within the substation only.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nFor additional information and support please contact your product provider or Hitachi Energy service organization. For contact information, visit Hitachi Energy contact-centers.\nPlease see the Hitachi Energy PWC600, GMS600, and Relion advisories for additional mitigation and update information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-35534"
  ],
  "techniques": [],
  "advisory": "icsa-21-343-01",
  "title": "Hitachi Energy GMS600, PWC600, and Relion (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c8aa0c738dbb89bb12009ef858d0c712ef114ce16a1d0ae448b1ec0f9b8f5955"
}