{
  "markdown": "\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: Eaton\nEquipment: ELCSoft\nVulnerability: Improper Input Validation\nAFFECTED PRODUCTS\nELCSoft is programming software for all Eaton ELC programmable logic controllers. The ELC programmable logic controllers are not affected by this vulnerability. The following versions of ELCSoft are affected:\n\nELCSoft Versions 2.04.02 and prior.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code.\nMITIGATION\nEaton has released new firmware for ELCSoft that is available via the following link:\nhttp://www.eaton.com/ecm/idcplg?IdcService=GET_FILE&allowInterrupt=1&RevisionSelectionMethod=LatestReleased&noSaveAs=0&Rendition=Primary&dDocName=PCT_3313148\nEaton states the current firmware needs to be uninstalled prior to loading the update.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION CWE-20\n\nThere are multiple cases where specially crafted files could cause a buffer overflow which, in turn, may allow remote execution of arbitrary code.\nCVE-2018-7511 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\nRESEARCHER\nAriele Caltabiano (kimiya) and axt working with Trend Micro's Zero Day Initiative reported the vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Dublin, Ireland\n",
  "cves": [
    "CVE-2018-7511"
  ],
  "techniques": [],
  "advisory": "icsa-18-065-03",
  "title": "Eaton ELCSoft | CISA",
  "source": "ics-advisories",
  "id": "1b93ae06f31e7e55cfc556766c90fe1bfaf2387f8c81c73ea112d13c86e298ee"
}