{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Low skill level to exploit\nVendor: GE Digital\nEquipment: HMI/SCADA iFIX\nVulnerabilities: Incorrect Permission Assignment for Critical Resource\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to escalate their privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following product is affected:\n\nHMI/SCADA iFIX: Versions 6.1 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nThe affected product allows a local authenticated user to modify system-wide iFIX configurations through the registry. This may allow privilege escalation.  \nCVE-2019-18243 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:N).\n3.2.2    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nThe affected product allows a local authenticated user to modify system-wide iFIX configurations through section objects. This may allow privilege escalation. \nCVE-2019-18255 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nWilliam Knowles of Applied Risk reported these vulnerabilities to CISA. Sharon Brizinov of Claroty also reported these vulnerabilities separately to GE.\n4. MITIGATIONS\nGE Digital recommends users immediately upgrade all instances of the affected software to GE Digital’s iFIX product v6.5. GE Digital believes the upgrade contains security enhancements that will help mitigate the risk that the vulnerabilities may be exploited by an attacker.\nPlease contact your GE Digital Channel representative or email gedigitalsalesupport@ge.com \nGE Digital also recommends the following for further reduction of risk:\n\nFollow the iFIX Secure Deployment Guide: Customer Page or Partner Page.\n\nFor more information refer to GE Digital Product Security Advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nRestrict access to the device by following least privilege principles.\n\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. \n",
  "cves": [
    "CVE-2019-18255",
    "CVE-2019-18243"
  ],
  "techniques": [],
  "advisory": "icsa-21-040-01",
  "title": "GE Digital HMI/SCADA iFIX | CISA",
  "source": "ics-advisories",
  "id": "094e6842eb156b4cc5d8a40a03b0c6ae9ffa8bf889768ffb27097abb81257bfa"
}