{
  "markdown": "\nOVERVIEW\nResearcher Jared Bird of Allina Health reported multiple vulnerabilities in the AMTELCO miSecureMessage (MSM) medical messaging system. AMTELCO has an update available to all customers that mitigates the vulnerabilities. The vulnerabilities were discovered during cooperative testing between Allina Health and AMTELCO. This issue was separately reported to CERT/CC, which posted a notification on April 11, 2014, available here:\nhttp://www.kb.cert.org/vuls/id/251628\nThese vulnerabilities can be exploited remotely. Exploits that target these vulnerabilities are known to be publicly available.\nAFFECTED PRODUCTS\nThe following AMTELCO products are affected:\n\nmiSecureMessages, Version 6.2 (to include Android, iPhone, and Blackberry mobile device applications).\n\nIMPACT\nThe MSMs Release 6.2 web service may be susceptible to intrusion, allowing an intruder to receive messages intended for MSM users.\nImpact to individual organizations and users depends on many factors that are unique to each organization and user. NCCIC/ICS-CERT recommends that organizations and users evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nAMTELCO is a US-based company that provides call center communication systems and software applications for call centers, contact centers, healthcare facilities, higher education facilities, executive suites, and developers. In addition to call center systems, AMTELCO offers web-based hosted services and other wireless applications.\nThe affected products, MSMs, is a HIPAA-compliant, cloud-based messaging and notification application for doctors and hospitals to communicate securely with patients over cellphone and Wi-Fi. AMTELCO products are used in the United States and in more than 20 foreign countries.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nINFORMATION EXPOSURECWE-200: Information Exposure, http://cwe.mitre.org/data/definitions/200.html, web site last accessed May 01, 2014.\n\nMSM does not have sufficient session management to prevent modification of message requests. This could allow a valid user to retrieve sensitive message contents and exposing personally identifiable information of other users.\nCVE-2014-2347NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-2347, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:S/C:C/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:S/C:C/I:P/A:N, web site last accessed May 01, 2014.\n\nAUTHENTICATIONCWE-287: Improper Authentication, http://cwe.mitre.org/data/definitions/287.html, web site last accessed May 01, 2014.\n\nMSM does not contain sufficient authentication complexity that may allow an attacker to receive message traffic between healthcare providers and patients, potentially exposing personally identifiable information.\nCVE-2014-0357NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-0357, web site last accessed May 01, 2014. has been assigned to this vulnerability. A CVSS v2 base score of 7 has been assigned; the CVSS vector string is (AV:N/AC:M/Au:S/C:C/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:N/AC:M/Au:S/C:C/I:P/A:N, web site last accessed May 01, 2014.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nExploits that target these vulnerabilities are publicly available.\nDIFFICULTY\nCrafting a working exploit for these vulnerabilities would need a moderate skill level. An amount of session modification is required to exploit these vulnerabilities. This decreases the likelihood of a successful exploit.\nMITIGATION\nAMTELCO has developed an update, Version 6.3, that resolves these vulnerabilities.\nSchedule an upgrade by emailing or calling AMTELCO’s Field Engineering Department at:email: service@amtelco.comphone: 1-800-553-7679\nLink to the Security Advisory (registration required):\nhttps://service.amtelco.com/INFINITY/MSM/MSM6.2SecurityBriefing.pdf\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. Individuals should report any malicious activity to their healthcare provider.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed May 01, 2014. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed May 01, 2014. for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2014-0357",
    "CVE-2014-2347"
  ],
  "techniques": [],
  "advisory": "icsa-14-121-01",
  "title": "AMTELCO miSecure Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "2a035b0e24082b57a4f221a29e4e1be990061379a5cbbd992a5fb38360c8a4ce"
}