{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nVendor: Yokogawa\nEquipment: CENTUM series and Exaopc\nVulnerability: Permissions, Privileges, and Access Controls\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a local attacker to generate false system or process alarms, or block system or process alarm displays.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Yokogawa products are affected:\n\nCENTUM series\n\nCENTUM CS 1000 all versions,\nCENTUM CS 3000 versions R3.09.50 and prior,\nCENTUM CS 3000 Small versions R3.09.50 and prior,\nCENTUM VP versions R6.03.10 and prior,\nCENTUM VP Small versions R6.03.10 and prior,\nCENTUM VP Basic versions R6.03.10 and prior.\n\n\nExaopc versions R3.75.00 and prior,\nB/M9000 CS all versions, and\nB/M9000 VP versions R8.01.01 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 PERMISSIONS, PRIVILEGES, AND ACCESS CONTROLS CWE-264\nA weakness in access controls may allow a local attacker to exploit the message management function of the system.\nCVE-2018-8838 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Food and Agriculture\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Japan\n\n3.4 RESEARCHER\nYokogawa, working with JPCERT, reported this vulnerability to NCCIC.\n4. MITIGATIONS\nYokogawa has produced the following mitigations for the affected products.\n\nCENTUM Series\n\nCENTUM CS 1000, CENTUM CS 3000, CENTUM CS 3000 Small – No updates will be provided as these products are at end of support. Yokogawa recommends that affected users upgrade to the latest CENTUM VP.\nCENTUM VP, CENTUM VP Small, CENTUM VP BASIC – affected users should update to version R5.04.B2 or R6.04.00.\n\n\nExaopc – affected users should update to version R3.76.00\nB/M9000CS – The vulnerability does not exist in this product however, the existence of affected software on the same PC may affect alarms for this device.\nB/M9000 VP – The vulnerability does not exist in this product however, the existence of affected software on the same PC may affect alarms for this device.\n\nPlease see Yokogawa Security Advisory Report YSAR-18-0001 at the following location for more information:\nhttps://web-material3.yokogawa.com/YSAR-18-0001-E.pdf\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-8838"
  ],
  "techniques": [],
  "advisory": "icsa-18-102-01",
  "title": "Yokogawa CENTUM and Exaopc | CISA",
  "source": "ics-advisories",
  "id": "681a76799c753d2ec286845281f8900bb8e056a6e08c289a33b443a7bc441cd3"
}