{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Various SCALANCE, SIMATIC, SIPLUS products\nVulnerabilities: Data Processing Errors, NULL Pointer Dereference\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-042-02 Siemens Industrial Products SNMP Vulnerabilities (Update E) that was published February 10, 2022, to the ICS webpage on www.cisa.gov/uscert.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote attackers to conduct a denial-of-service attack by sending specially crafted packets to Port 161/UDP (SNMP).\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nIE/PB LINK PN IO (including SIPLUS NET variants): All versions prior to v4.0.1\nSCALANCE S602: All versions prior to v4.1\nSCALANCE S612: All versions prior to v4.1\nSCALANCE S623: All versions prior to v4.1\nSCALANCE S627-2M: All versions prior to v4.1\nSIMATIC CP 343-1 Advanced (6GK7343-1GX31-0XE0):All versions\nSIMATIC CP 443-1 (6GK7443-1EX30-0XE0): All versions\nSIMATIC CP 443-1 Advanced (6GK7443-1GX30-0XE0):: All versions\nSIMATIC CP 443-1 OPC UA (6GK7443-1UX00-0XE0): All versions\nSIMATIC CP 1623 (6GK1162-3AA00): All versions prior to v14.00.15.00_51.25.00.01\nSIMATIC CP 1626 (6GK1162-6AA01): All versions prior to v1.1.1\nSIMATIC CP 1628(6GK1162-8AA00):  All versions prior to v14.00.15.00_51.25.00.01\nSIPLUS NET CP 343-1 Advanced (6AG1343-1GX31-4XE0): All versions\nSIPLUS NET CP 443-1 (6AG1443-1EX30-4XE0): All versions\nSIPLUS NET CP 443-1 Advanced (6AG1443-1GX30-4XE0): All version\nTIM 1531 IRC (including SIPLUS NET variants): All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    DATA PROCESSING ERRORS CWE-19\nAn error in the message handling of SNMP messages allows remote attackers to cause a denial-of-service condition and execute arbitrary code via a crafted packet sent on Port 161/UDP (SNMP).\nCVE-2015-5621 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    NULL POINTER DEREFERENCE CWE-476\nA NULL pointer exception bug within the SNMP handling code allows authenticated attacker to remotely cause a denial-of-service condition via a crafted packet sent on Port 161/UDP (SNMP).\nCVE-2018-18065 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nArtem Zinenko of Kaspersky Lab reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens has released updates for several affected products and recommends users update to the new version. Siemens is preparing further updates and recommends specific countermeasures until patches are available.\n\nFor IE/PB LINK PN IO, update to v4.0.1\nFor SCALANCE S602, SCALANCE S612, SCALANCE S623, and SCALANCE S627-2M products: Update to v4.1 (Update is only available via Siemens Support contact). Upgrade hardware to successor product from SCALANCE SC-600 family\n\n--------- Begin Update F Part 1 of 1 ---------\n\nFor SIMATIC NET CP 1623 the updated firmware is contained in SIMATIC NET PC Software v14 Update 14 or later version or SIMATIC NET PC Software v16 or later version\n\n--------- End Update F Part 1 of 1 ---------\n\nFor SIMATIC NET CP 1626, update to v1.1.1 or later version\nFor TIM 1531 IRC or SIPLUS NET variants, update to Version 2.0 \n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDisable SNMP if this is supported by the product (refer to the product documentation). Disabling SNMP fully mitigates these vulnerabilities.\nProtect network access to Port 161/UDP of affected devices.\nApply cell protection concept and implement defense-in-depth.\nUse VPN for protecting network communication between cells.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity.\nFor more information on the vulnerabilities and detailed mitigation instructions, please see Siemens security advisory SSA-978220\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2015-5621",
    "CVE-2018-18065"
  ],
  "techniques": [],
  "advisory": "icsa-20-042-02",
  "title": "Siemens Industrial Products SNMP (Update F) | CISA",
  "source": "ics-advisories",
  "id": "848b9387540154f53921b20fce385a38bb228cb177aa3281f56fb08f9593c094"
}