{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: RUGGEDCOM ROX\nVulnerability: Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker to cause a permanent denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of RUGGEDCOM ROX, switches and serial-to-Ethernet devices, are affected:\n\nRUGGEDCOM ROX MX5000: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1400: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1500: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1501: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1510: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1511: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1512: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1524: All versions prior to v2.14.1\nRUGGEDCOM ROX RX1536: All versions prior to v2.14.1\nRUGGEDCOM ROX RX5000: All versions prior to v2.14.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAffected devices write crash-dumps without checking if enough space is available on the file system. Once the crash-dump fills the entire root file system, affected devices fail to boot. An attacker can leverage this vulnerability to cause a permanent denial-of-service condition.\nCVE-2021-41546 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n•    CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\n•    COUNTRIES/AREAS DEPLOYED: Worldwide\n•    COMPANY HEADQUARTERS LOCATION: Germany\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends updating to the latest versions:\n\nUpdate to v2.14.1 or later version.\nRestrict access to the affected systems, especially to Port 443/TCP, to trusted IP addresses only.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-173565\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-41546"
  ],
  "techniques": [],
  "advisory": "icsa-21-287-08",
  "title": "Siemens RUGGEDCOM ROX Devices | CISA",
  "source": "ics-advisories",
  "id": "1e77694b7beb6cf22557e520b34e8dc8391433444c9b25ed5202bdf7dc1391e0"
}