{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Multiple\nEquipment: Nut/Net, CycloneTCP, NDKTCPIP, FNET, uIP-Contiki-OS, uC/TCP-IP, uIP-Contiki-NG, uIP, picoTCP-NG, picoTCP, MPLAB Net, Nucleus NET, Nucleus ReadyStart\nVulnerabilities: Use of Insufficiently Random Values\n\nCISA is aware of a public report, known as “NUMBER:JACK” that details vulnerabilities found in multiple open-source and proprietary TCP/IP stacks. CISA is issuing this advisory to provide early notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\nThe various open-source stacks may be implemented in forked repositories.\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-042-01 Multiple Embedded TCP/IP stacks (Update A) that was published February 18, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of weak initial sequence numbers (ISN) can be used to hijack or spoof TCP connections, cause denial-of-service conditions, inject malicious data, or bypass authentication.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following have been reported to be affected:\n\nNut/Net, Version 5.1 and prior\nCycloneTCP, Version 1.9.6 and prior\nNDKTCPIP, Version 2.25 and prior\nFNET, Version 4.6.3\nuIP-Contiki-OS (end-of-life [EOL]), Version 3.0 and prior\nuC/TCP-IP (EOL), Version 3.6.0 and prior\nuIP-Contiki-NG, Version 4.5 and prior\nuIP (EOL), Version 1.0 and prior\npicoTCP-NG, Version 1.7.0 and prior\npicoTCP (EOL), Version 1.7.0 and prior\nMPLAB Net, Version 3.6.1 and prior\nNucleus NET, All versions prior to Version 5.2\nNucleus ReadyStart for ARM, MIPS, and PPC, All versions prior to Version 2012.12\n\n--------- Begin Update B Part 1 of 2 ---------\n\nCapital VSTAR, All Versions\nNucleus Source Code, All Versions\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nNut/Net software relies on highly predictable source values and has consistent increments when generating initial sequence numbers (ISN), which may allow an attacker to spoof or disrupt TCP connections. \nCVE-2020-27213 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.2    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nuC/TCP-IP ISN generation relies on a linear congruential generator (LCG), which is reversable from observed output streams as the algorithm is seeded with publicly recoverable information. This defect may allow an attacker to spoof or disrupt TCP connections. \nCVE-2020-27630 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.3    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nCycloneTCP ISN generation relies on a linear congruential generator (LCG), which is reversable from observed output streams as the algorithm is seeded with publicly recoverable information. This defect may allow an attacker to spoof or disrupt TCP connections.\nCVE-2020-27631 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.4    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nNDKTCPIP software is initialized with a consistent value and has consistent increments when generating initial sequence numbers (ISN), which may allow an attacker to spoof or disrupt TCP connections. \nCVE-2020-27632 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.5    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nFNET software is initialized with a consistent value and has consistent increments when generating initial sequence numbers (ISN), which may allow an attacker to spoof or disrupt TCP connections. \nCVE-2020-27633 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.6    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nuIP, Contiki-OS, and Contiki-NG software is initialized with a consistent value and has consistent increments when generating initial sequence numbers (ISN), which may allow an attacker to spoof or disrupt TCP connections. \nCVE-2020-27634 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.7    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nPicoTCP PicoTCP-NG software ISN generation relies on a linear congruential generator (LCG), which is reversable from observed output streams as the algorithm is seeded with publicly recoverable information. This defect may allow an attacker to spoof or disrupt TCP connections.\nCVE-2020-27635 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.8    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nMPLAB software ISN generation relies on a linear congruential generator (LCG), which is reversable from observed output streams as the algorithm is seeded with publicly recoverable information. This defect may allow an attacker to spoof or disrupt TCP connections.\nCVE-2020-27636 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.9    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nNucleus NET and Nucleus ReadyStart software ISN generation relies on a combination of values that can be acquired from capturing network traffic, which may allow an attacker to spoof or disrupt TCP connections. \nCVE-2020-28388 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Multiple\n\n4.4 RESEARCHER\nDaniel dos Santos, Stanislav Dashevskyi, Jos Wetzels, and Amine Amri of Forescout Research Labs reported these vulnerabilities to CISA.\n5. MITIGATIONS\n\nuIP-Contiki-OS (end-of-life [EOL]). See general recommendations below.\nuIP-Contiki-NG has a patch in progress. See general recommendations below until a patch is made available.\nuIP (EOL). See general recommendations below.\nThe maintainers of picoTCP-NG recommend users update to Version 2.1 or later. \npicoTCP (EOL), See general recommendations below.\nThe maintainers of MPLAB Net recommend users update to Version 3.6.4 or later. \nSiemens recommends Nucleus NET users update to the latest version of Nucleus ReadyStart or to protect transmitted data with cryptographic protocols such as Transport Layer Security. Additional information can be found here.\nSiemens recommends Nucleus ReadyStart for ARM, MIPS, and PPC users update to v2012.12 or later or to protect transmitted data with cryptographic protocols such as Transport Layer Security. Additional information can be found here. \n\n--------- Begin Update B Part 2 of 2 ---------\n\n\n\nSiemens recommends for Capital VSTAR and Nucleus Source Code users contact Siemens customer support to receive patch and update information. Additional information can be found here.\n\n--------- End Update B Part 2 of 2 ---------\n\nNut/Net has a patch in progress. See general recommendations below until a patch is made available.\nuC/TCP-IP (EOL). See general recommendations below. Patched in the latest version of Micrium OS (successor project).\nThe maintainers of CycloneTCP recommend users update to Version 2.0.0 or later. \nTexas Instruments recommends NDKTCPIP users update to Version 7.02 or later.\nThe maintainer of FNET recommends users update to v4.7.1\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\nUtilize cryptographic protocols such as Transport Layer Security to protect transported data.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-27631",
    "CVE-2020-27634",
    "CVE-2020-28388",
    "CVE-2020-27632",
    "CVE-2020-27633",
    "CVE-2020-27635",
    "CVE-2020-27213",
    "CVE-2020-27636",
    "CVE-2020-27630"
  ],
  "techniques": [],
  "advisory": "icsa-21-042-01",
  "title": "Multiple Embedded TCP/IP Stacks (Update B) | CISA",
  "source": "ics-advisories",
  "id": "0f25e46233dca9a896821d5f5cc4bf89090380aa90d82e2064416bba443af886"
}