{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Exploitable from an adjacent network/low skill level to exploit\nVendor: Siemens\nEquipment: SIMOTICS, Desigo, APOGEE, and TALON\nVulnerability: Business Logic Errors\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-105-06 Siemens SIMOTICS, Desigo, APOGEE, and TALON (Update C) that was published April 14, 2021, on the ICS webpage at cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to affect the availability and integrity of the device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following products and versions:\n\nAPOGEE MEC/MBC/PXC (P2): All versions prior to 2.8.2\n\n--------- Begin Update D Part 1 of 2 ---------\n\nAPOGEE PXC Series (P2): All versions between 2.8.2 and v2.8.19\n\n--------- End Update D Part 1 of 2 ---------\n\nDesigo PXC00-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC00-U: All versions, 2.3x to v6.00.327\nDesigo PXC001-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC12-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC22-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC22.1-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC36.1-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC50-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC64-U: All versions, 2.3x to v6.00.327\nDesigo PXC100-E.D: All versions, 2.3x to v6.00.327\nDesigo PXC128-U: All versions, 2.3x to v6.00.327\nDesigo PXC200-E.D: All versions, 2.3x to v6.00.327\nDesigo PXM20-E: All versions, 2.3x to v6.00.327\nSIMOTICS CONNECT 400: All versions prior to 0.3.0.330\nTALON TC Series (BACnet): All versions prior to 3.5.3\nAPOGEE PXC Series (BACnet): All versions prior to 3.5.3\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    BUSINESS LOGIC ERRORS CWE-840\nThe affected products could allow an attacker to change the IP address of the device to an invalid value. This may allow an attacker to make device configuration changes and affect its availability.\nCVE-2019-13939 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends users update to the latest version of their software where applicable.\n\nDesigo Products: Update to v6.00.327\nSIMOTICS CONNECT 400: Update to v0.3.0.330\nTALON TC Series (BACnet): Update to v3.5.3\nAPOGEE PXC Series (BACnet): Update to v3.5.3\n\n--------- Begin Update D Part 2 of 2 ---------\n\nAPOGEE PXC Series (P2): Update to v2.8.19 or later (contact Siemens for assistance)\n\n--------- End Update D Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDisable the DHCP client and use static IP address configuration instead (Note that the DHCP client is disabled by default on APOGEE/TALON and Desigo products).\nAPOGEE MEC, MBC, PXC (versions prior to v2.8.2): Use static IP address configuration as described above\nAPOGEE PXC Series and TALON TC Series products: If using a static IP address is not possible, update to the fix version listed above or contact your local Siemens office for support.\n\nAs a general security measure Siemens strongly recommends users protect network access to affected products with appropriate mechanisms. Users are advised to follow recommended security practices in order to run the devices in a protected IT environment. Additional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens Security Advisory SSA-162506\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13939"
  ],
  "techniques": [],
  "advisory": "icsa-20-105-06",
  "title": "Siemens SIMOTICS, Desigo, APOGEE, and TALON (Update D) | CISA",
  "source": "ics-advisories",
  "id": "87288d1882daafccfb98994253fd0922549b6b47309c8a856390778d27979e0b"
}