{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.3\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: WebAccess/SCADA\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a stack buffer overflow condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WebAccess/SCADA, a SCADA software platform, are affected:\n\nWebAccess/SCADA Version 8.3.2 installed on Windows 2008 R2 SP1.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nLack of proper validation of user supplied input may allow an attacker to cause the overflow of a buffer on the stack. \nCVE-2018-18999 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, United States, Europe\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nJacob Baines of Tenable Network Security reported this vulnerability to NCCIC.\n4. MITIGATIONS\nAdvantech has released Version 8.3.4 of WebAccess/SCADA to address the reported vulnerability. Users can download the latest version of WebAccess/SCADA at the following location (registration required):\nhttp://support.advantech.com/support/DownloadSRDetail_New.aspx?SR_ID=1-S9MJV&Doc_Source=Download\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-18999"
  ],
  "techniques": [],
  "advisory": "icsa-18-352-02",
  "title": "Advantech WebAccess/SCADA | CISA",
  "source": "ics-advisories",
  "id": "134ad5cc1726f9e4bf52d2fb9262315abcf230c877f2273d59e01adc98302d8b"
}