{
  "markdown": "\nOverview\nICS-CERT has received a report from independent security researcher Dmitriy Pletnev of Secunia Research about ActiveX control buffer overflow vulnerabilities with proof-of-concept exploit code affecting the InduSoft ISSymbol product. Secunia has coordinated with InduSoft, who has produced a patch that mitigates these vulnerabilities. ICS-CERT has not validated the patch.\nAffected Products\nThe vulnerabilities affect InduSoft Web Studio Versions 7.0B2 (Build: 0301.1009.2904.0000) and 7.0 (Build: 0301.1102.0303.0000).\nImpact\nAn attacker who successfully exploits any of these vulnerabilities may be able to execute arbitrary code on the target system.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their environment, architecture, and product implementation.\nBackground\nInduSoft Web Studio is used to develop human-machine interfaces, SCADA systems, and embedded instrumentation systems. InduSoft is often integrated as a third-party application in control systems.\nVulnerability Characterization\nVulnerability Overview\nBoundary errors on processing the “Open,” “Close,” and “SetCurrentLanguage” methods for this ActiveX control can be exploited to cause heap and stack-based buffer overflows via overly long strings assigned to the properties.\nCVE-2011-0342 has been assigned for these vulnerabilities.b. http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-0342, website last accessed September 30, 2011. A CVSS base score of 10.0 has been assigned.\nVulnerability Details\nExploitability\nThese vulnerabilities are remotely exploitable.\nExistence of Exploit\nPublic exploits are known to target these vulnerabilities.\nDifficulty\nAn attacker with a low skill level can create the denial of service; an attacker would require more skill to execute arbitrary code.\nMitigation\nInduSoft recommends that customers of InduSoft Web Studio software upgrade to the latest version and install the latest service pack. The latest service pack is available for download at InduSoft’s Security Updates and Hotfixes webpage.\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks:\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\n\nWhen remote access is required, use secure methods such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\nThe Control Systems Security Program (CSSP) also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2011-0342"
  ],
  "techniques": [],
  "advisory": "icsa-11-273-02",
  "title": "InduSoft ISSymbol ActiveX Control Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "e554a3b3b71503adea79ca82747c854a9b64f2121328067972b09f045bdda591"
}