{
  "markdown": " Magnetrol HART DTM Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryMagnetrol HART DTM Vulnerability================================ Last Revised August 29, 2018 Alert Code ICSA\\-15\\-027\\-01OVERVIEW-------- Alexander Bolshev of Digital Security has identified an improper input validation vulnerability in the CodeWrights GmbH HART Device Type Manager (DTM) library extension utilized by some Magnetrol products. CodeWrights GmbH has updated its software library to mitigate this vulnerability. Magnetrol has integrated this update and released its revised library extensions.AFFECTED PRODUCTS----------------- The following products can use the vulnerable HART DMT library extension and are affected:* Eclipse Model 705 Guided Wave Radar transmitter (Firmware Version 3\\.x),* Echotel Model 355 Ultrasonic transmitter (Firmware Version 1\\.x),* Model R82 Pulse Burst Radar Transmitter (Firmware Versions 1\\.x and 2\\.x), and* Thermatel Model TA2 Thermal Mass Flowmeter (Firmware Version 2\\.x).IMPACT------ The vulnerability causes the HART DTM component to crash and also causes the HART service to stop responding. No loss of information or loss of control or view by the control system results from an attacker successfully exploiting this vulnerability. Impact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Magnetrol is a US\\-based company that maintains offices in several countries around the world, including the US, Belgium, Brazil, China, and the United Arab Emirates. The affected products are field devices using HART protocol. According to Magnetrol, these products are deployed across multiple critical infrastructure sectors worldwide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### IMPROPER INPUT VALIDATIONCWE\\-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20\\.html, web site last accessed January 27, 2015\\. By sending specially crafted response packets to the 4 mA to 20 mA current loop, the DTM component stops functioning, and the FDT Frame application becomes unresponsive. CVE\\-2014\\-9191NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-9191, web site last accessed January 27, 2015\\. has been assigned to this vulnerability. A CVSS v2 base score of 1\\.8 has been assigned; the CVSS vector string is (AV:A/AC:H/Au:N/C:N/I:N/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:A/AC:H/Au:N/C:N/I:N/A:P, web site last accessed January 27, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This exploit is possible from any adjacent network between the FDT/DTM frame application and the HART transmitter on the 4 mA to 20 mA current loop.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY Crafting a working exploit for this vulnerability would be difficult. Compromised access at any point between the HART transmitter and Frame Application with DTM will allow a malicious user to unencapsulate, modify, re\\-encapsulate and send malicious packets. This exploit requires timing the spoofed response to crash the FDT/DTM components. This increases the difficulty of a successful exploit.MITIGATION---------- Magnetrol has updated the software library impacted. The update can be downloaded here:[http://us.magnetrol.com/Product\\_Catalog.aspx?Id\\=5](http://us.magnetrol.com/Product_Catalog.aspx?Id=5)  ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Magnetrol-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-027-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* * [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)* * [Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2014-9191"
  ],
  "techniques": [],
  "advisory": "icsa-15-027-01",
  "title": "Magnetrol HART DTM Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "ef7068d7e88cf5b0c3eb5527e5e95fafdb99c94425e4dda28cc0b29b1dede01a"
}