{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: FTP Server of Nucleus RTOS based APOGEE, TALON and Desigo PXC/PXM Products\nVulnerabilities: Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to generate a denial-of-service condition on devices incorporating a vulnerable version of the file transfer protocol (FTP) server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following products which use FTP Server of Nucleus RTOS: \n\nAPOGEE MBC (PPC) (BACnet): All versions\nAPOGEE MBC (PPC) (P2 Ethernet): All versions\nAPOGEE MEC (PPC) (BACnet): All versions\nAPOGEE MEC (PPC) (P2 Ethernet): All versions\nAPOGEE PXC Compact (BACnet): All versions\nAPOGEE PXC Compact (P2 Ethernet): All versions\nAPOGEE PXC Modular (BACnet): All versions\nAPOGEE PXC Modular (P2 Ethernet): All versions\nDesigo PXC00-E.D: All versions since and including V2.3\nDesigo PXC00-U: All versions since and including V2.3\nDesigo PXC001-E.D: All versions since and including V2.3\nDesigo PXC12-E.D: All versions since and including V2.3\nDesigo PXC22-E.D: All versions since and including V2.3\nDesigo PXC22.1-E.D: All versions since and including V2.3\nDesigo PXC36.1-E.D: All versions since and including V2.3\nDesigo PXC50-E.D: All versions since and including V2.3\nDesigo PXC64-U: All versions since and including V2.3\nDesigo PXC100-E.D: All versions since and including V2.3\nDesigo PXC128-U: All versions since and including V2.3\nDesigo PXC200-E.D: All versions since and including V2.3\nDesigo PXM20-E: All versions since and including V2.3\nTALON TC Compact (BACnet): All versions\nTALON TC Modular (BACnet): All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe FTP server does not properly release memory resources reserved for incomplete connection attempts by FTP clients. This could allow a remote attacker to generate a denial-of-service condition on devices incorporating a vulnerable version of the FTP server.\nCVE-2022-38371 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Government Facilities \nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens ProductCERT reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens is preparing updates and recommends specific countermeasures for products where updates are in process or are not yet available:\n\nDisable the FTP service \n\nNote: The FTP service is disabled by default on APOGEE, Desigo, and TALON products.\nAs a general security measure, Siemens strongly recommends protecting network access to affected products with appropriate mechanisms and advises users follow recommended security practices to run devices in a protected IT environment.\nSiemens has provided additional information on industrial security on the Siemens Industrial Security web page.\nFor more information, see the associated Siemens Security Advisory SSA-935500 in HTML or CSAF formats.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has a low attack complexity.\n",
  "cves": [
    "CVE-2022-38371"
  ],
  "techniques": [],
  "advisory": "icsa-22-286-12",
  "title": "Siemens APOGEE, TALON and Desigo PXC/PXM Products | CISA",
  "source": "ics-advisories",
  "id": "b738a256f24f52fd8068df142e60053375adbdd090aafc30b2fec3ebe6cfaac7"
}