{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Moxa\nEquipment: MB3170 series, MB3180 series, MB3270 series, MB3280 series, MB3480 series, and MB3660 series\nVulnerabilities: Stack-based Buffer Overflow, Integer Overflow to Buffer Overflow, Cross-site Request Forgery, Use of a Broken or Risky Cryptographic Algorithm, Information Exposure, Cleartext Transmission of Sensitive Information, Weak Password Requirements, Cleartext Storage of Sensitive Information, Incorrectly Specified Destination in a Communication Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device, cause a buffer overflow, allow remote execution of arbitrary code, or allow access to sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMoxa reports these vulnerabilities affects the following protocol gateways:\n\nMB3170 series firmware, Version 4.0 or lower\nMB3270 series firmware, Version 4.0 or lower\nMB3180 series firmware, Version 2.0 or lower\nMB3280 series firmware, Version 3.0 or lower\nMB3480 series firmware, Version 3.0 or lower\nMB3660 series firmware, Version 2.2 or lower\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nTwo separate issues cause a buffer overflow in the built-in web server that may allow a remote attacker to initiate a DoS attack and execute arbitrary code.\nCVE-2019-9099 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    INTEGER OVERFLOW TO BUFFER OVERFLOW CWE-680\nAn integer overflow causes unexpected memory allocation that can lead to a buffer overflow.\nCVE-2019-9098 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    CROSS-SITE REQUEST FORGERY CWE-352\nA predictable mechanism of generating tokens allows remote attackers to bypass the cross-site request forgery (CSRF) protection mechanism.\nCVE-2019-9102 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nA weak cryptographic algorithm with predictable variables may allow sensitive information to be revealed.\nCVE-2019-9095 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.5    INFORMATION EXPOSURE CWE-200\nAn attacker can access sensitive information and usernames via the built-in web service without proper authorization\nCVE-2019-9103 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.6    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nSensitive information is transmitted over some web applications in clear text.\nCVE-2019-9101 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AAV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.7    WEAK PASSWORD REQUIREMENTS CWE-521\nWeak password requirements may allow an attacker to gain access by using brute force.\nCVE-2019-9096 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.8    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nSensitive information is stored in configuration files without encryption, which may allow an attacker to access an administrative account.\nCVE-2019-9104 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.2.9    INCORRECTLY SPECIFIED DESTINATION IN A COMMUNICATION CHANNEL CWE-941\nThe web service may become temporarily unavailable if an attacker is able to overload the system to cause the service to crash.\nCVE-2019-9097 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nIlya Karpov and Evgeniy Druzhinin from Rostelecom-Solar, and Maxim Kozhevnikov from Positive Technologies reported these vulnerabilities to Moxa.\n4. MITIGATIONS\nMoxa has developed the following solutions to address the vulnerabilities:\n\nMB3170 Series: Download the new firmware.\nMB3270 Series: Download the new firmware.\nMB3180 Series: Download the new firmware.\n\nMoxa also recommends users follow below instructions to mitigate potential risks: \n\nUpgrade to the latest firmware and disable HTTP and Telnet communications.\nUse Moxa utilities (MGate Manager, NPort Administration Suite Utility) to change device configurations or monitor the device status remotely.\nUse a VPN tunnel for a secure and protected connection between the devices and host PC.\n\n\n\n\nMB3280 Series: Download the new firmware.\nMB3480 Series: Download the new firmware.\nMB3660 Series: Download the new firmware.\n\nPlease see Moxa’s security advisory for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-9101",
    "CVE-2019-9099",
    "CVE-2019-9096",
    "CVE-2019-9095",
    "CVE-2019-9103",
    "CVE-2019-9104",
    "CVE-2019-9098",
    "CVE-2019-9097",
    "CVE-2019-9102"
  ],
  "techniques": [],
  "advisory": "icsa-20-056-01",
  "title": "Moxa MB3xxx Series Protocol Gateways | CISA",
  "source": "ics-advisories",
  "id": "bf0431e868033d7a9c3a8f4c0b5b48be00cc84a557e1a7032e21edbff4724056"
}