{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Questa Simulation and ModelSim Simulation\nVulnerability: Insufficiently Protected Credentials\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-350-13 Siemens Questa and ModelSim that was published December 16, 2021, on the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow access to unencrypted data.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Questa and ModelSim, integrated circuit simulators, are affected:\n\nModelSim Simulation: All Versions\nQuesta Simulation: All Versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nThe affected product is vulnerable to insufficiently protected keys required for decrypting intellectual property data, which could allow an attacker to discover the keys and bypass the protection intended by IEEE 1735 standard.\nCVE-2021-42023 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nJulian Speith and Christof Paar from Max Planck Institute for Security and Privacy coordinated this vulnerability with Siemens.\nFlorian Schweins and Alexander May from Ruhr University coordinated this vulnerability with Siemens.\n5. MITIGATIONS\nSiemens recommends upgrading to the lastest version of the following products, login is required:\n--------- Begin Update A part 1 of 2 ---------\n\nModelSim Simulation new releases.\nQuesta Simulation new releases.\n\n--------- End Update A part 1 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nCompany-internal use of encrypted design IP data: Apply technical and procedural measures to ensure access to the data is granted on a need-to-know basis.\nCompanies that deliver encrypted design IP data to their customers: Ensure procedural and contractual measures are in place that minimize the risk of unauthorized access to the data.\n\n--------- Begin Update A part 2 of 2 ---------\nFor more information, see Siemens Security Advisory SSA-400332 in HTML or CSAF.\n--------- End Update A part 2 of 2 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-42023"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-13",
  "title": "Siemens Questa and ModelSim (Update A) | CISA",
  "source": "ics-advisories",
  "id": "9422c59be29f45854c56c62a5bd074054da287cc09b31355c8f1ae45e6ab947c"
}