{
  "markdown": "\nOverview\nICS-CERT has received reports and investigated infections of the MariposaDefence Intelligence, http://defintel.com/docs/MariposaAnalysis.pdf, website last accessed March 15, 2010. botnet, which have affected the business networks of multiple control system owners in recent months.\nICS-CERT has no information to indicate that these infections have specifically targeted United States Critical Infrastructure and Key Resources (CIKR), or any specific sector or organization.\nBackground\nIn May 2009, Defence Intelligence announced the discovery of a botnet, called “Mariposa.” An investigation followed this discovery and targeted bringing down the criminal network behind what has become one of the largest botnets on record.\nAfter months of investigation by the Guardia Civil in Spain, the FBI, security firm Panda Security, and Defence Intelligence, authorities took down a 12.7 million strong zombie network in December. In February 2010, Spanish authorities arrested three suspects in Spain.John Leyden, http://www.theregister.co.uk/2010/03/04/mariposapolicehuntmorebotherders/, website last accessed March 15, 2010.\nAlthough the primary command and control (C2) infrastructure for the Mariposa botnet is considered to have been rendered inoperative by the Mariposa Working Group,PandaLabs, http://pandalabs.pandasecurity.com/mariposa-botnet/, website last accessed March 15, 2010. malware files that were used by the botnet are still thought to be on computers in production environments and should be identified and removed. Additionally, it is not uncommon for new groups to assume control of old or abandoned botnets by compromising existing command and control or by establishing new command and control infrastructure using slightly modified malware.\nDetails\nIn February 2010, a US utility company (USUTIL1) was notified by another US Utility partner company (USUTIL2) that a USUTIL1 employee had visited USUTIL2 with a Mariposa-infected laptop. There had been no indication from USUTIL1’s computer network defense mechanisms (Anti-Virus, Intrusion Detection Systems, Firewalls etc.) that an infection had occurred and USUTIL2’s notification was USUTIL1’s first indication that there was an issue.\nUSUTIL1’s investigation found that the initial infection vector may have been a USB drive shared at an industry conference. An instructor shared a USB drive among participants at a training event attended by USUTIL1’s employee. It is believed that when the employee returned and connected his laptop to the corporate network, the malware spread to multiple business systems.\nTo date, none of USUTIL1’s control systems are known to be affected by the botnet malware.\nUSUTIL1’s internal investigation found the malware file “Schl.exe” in deleted files on one system. USUTIL1’s continued searching and found other systems with this deleted file. These systems were also attempting to make UDP connections with systems outside of their firewall.\nICS-CERT was contacted and at the request of the organization, deployed a fly-away team to assist with identification and analysis of the malware.\nAnalysis\nA dynamic analysis was made on the file schl.exe. The method used for code injection is similar to the method described by Defence IntelligenceDefence Intelligence, http://defintel.com/docs/MariposaAnalysis.pdf, website last accessed March 15, 2010. however, callbacks appeared to be unique. It should be noted that the following information is solely from ICS-CERT’s investigation into the malware variant found at USUTIL1. This information, along with other open source information should be leveraged in any comprehensive detection and mitigation activities.\nThe following information can be used to develop detection signatures:\nFile: SCHL.EXE\nSize: 140800MD5: 645C4DD7508B3DC83807FCF9918FE1C7SHA1: d452e2df58fad206b2213683356033822ff335c9Type: PE32 executable for MS Windows (GUI) Intel 80386 32-bit\nAntivirus Identification\nMicrosoft: Trojan:Win32/MeredropMcafee: Backdoor-EEC.genSymantec: Trojan Horse\nDNS Lookups\nhnox[dot]orgsocksa[dot]comronpc[dot]net\nCallbacks\n\n\n\nDomain\nIP\nProtocol/Port\n\n\n\n\nhnox[dot]org\n92.241.165.162\nUDP 21039\n\n\nsocksa[dot]com\n92.241.164.82\nUDP 21039\n\n\nronpc[dot]net\n92.241.164.82\nUDP 21039\n\n\n\nNote: All network traffic in/out is UDP\nThe initial outbound packet is 49 bytes (7 bytes encrypted payload) to hnox[dot]org or socksa[dot]com, using UDP port 21039, for the purpose of establishing the C2 channel. The C2 server responds from 21039 to the same local port, with a UDP packet of varying length and encrypted payload. C2 command syntax appears to be consistent with the Mariposa botnet.\nMalware Files\nschl.exe – dropperjack.exe – dropped fileconfig.inf – dropped filedesktop.ini – dropped file (0-byte file located at source of originally executed file)\nBotnets, including Mariposa, are highly dynamic. C2 operators frequently update their code to evade detection or implement new features. Other files may also be associated with Mariposa, so the list above is not a complete list of files used by Mariposa. For example, Defence IntelligenceeDefence Intelligence, http://defintel.com/docs/MariposaAnalysis.pdf, website last accessed March 15, 2010. has also identified blackjackson.exe, which provided Mariposa with distributed denial-of-service (DDoS) capability by using the BlackEnergy DDoS bot.\nWindows Registry Modifications\nKey: [HKEY_LOCAL_MACHINE\\Software\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon]Value: \"Taskman\" = \"<file_path>\\schl.exe\"\nNote: Where \"file path\" = location of schl.exe when executed\nDomain Names Observed as C2 Servers\nThe following domain names have been observed as command and control servers:\n\nbf2back.sinip.es\nbfisback.no-ip.org\nbfisback.sinip.es\nbinaryfeed.in\nbooster.estr.es\nbutterfly.BigMoney.biz\nbutterfly.sinip.es\ndefintelsucks.com\ndefintelsucks.net\ndefintelsucks.sinip.es\nextraperlo.biz\ngusanodeseda.mobi\ngusanodeseda.net\ngusanodeseda.sinip.es\nlalundelau.sinip.es\nlegion.sinip.es\nlegionarios.servecounterstrike.com\nmierda.notengodominio.com\nqwertasdfg.sinip.es\nsexme.in\nshv4.no-ip.biz\nshv4b.getmyip.com\ntamiflux.net\ntamiflux.org\nthejacksonfive.biz\nthejacksonfive.mobi\nthejacksonfive.us\nthesexydude.com\nyouare.sexidude.com\nyougotissuez.com\n\nICS-CERT Identified Malware Files\nICS-CERT identified the following three malware files during analysis:\n\nschl.exe\njack.exe\nconfig.inf\n\nOutbound Command & Control Attempts\nICS-CERT observed attempted UDP C2 connections with the following IP addresses:\n\n24.173.86.145\n67.210.170.32\n92.241.165.162\n62.128.52.191\n74.208.162.142\n200.74.244.84\n66.197.176.41\n76.73.56.12\n204.16.173.30\n67.210.170.131\n87.106.179.75\n\nMariposa M alware UDP Ports\nMariposa malware has been observed using the following UDP ports:\n\n3431\n3435\n5907\n3433\n3437\n21039\n3434\n5906\n\nAffected Operating Systems\nAlthough botnet malware can affect any operating system, most current botnets including Mariposa target Windows systems.Zeng, Hu, & Shin, “Detection of Botnets Using Combined Host- and Network-Level Information,” 16th ACM Conference on Computer and Communications Security, November 2009:2.\nImpact\nAlthough the primary Mariposa C2 is believed to be inactive, the malware is still spreading. The possibility exists that another actor will attempt to “commandeer” the existing C2 or create a new C2 infrastructure. Without C2 direction, the malware won’t perform malicious actions; however, the malware still presents a risk and any remaining Mariposa malware should be identified, removed, and systems should be properly re-imaged or restored if re-imaging is not feasible.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.\nRecommendations\nBecause IP addresses, UDP ports, and domains used by the C2 structure of Mariposa changed continually, it created a difficult challenge for security administrators to mitigate the capabilities of this botnet. The best mitigation strategy is to track down compromised systems using all information available about the malware. Organizations should establish firewall rules to block communication from malware to known command and control sites and monitor their network for this activity to identify compromised machines. Additionally, UDP connections are used for Mariposa communication, so observance of your network activity is the best place to start. If one system is frequently sending outbound UDP packets, regardless of port, mark it as suspicious and investigate the source of the traffic on the system.\nIt is important to identify all of the infected machines and to disable them simultaneously to prevent re-infection of your assets. Advanced threats such as botnets can be extremely difficult to eradicate. If a compromised system is missed, the threat can re-infect “clean” systems. Clean systems should be isolated while the remainder of the network is cleaned, or the clean systems risk being re-infected. In large networks, this can be a challenging exercise.\nAs mentioned, IP addresses, ports, and domains used by Mariposa’s C2 system have continually changed. These changes created new malware variants (mariposa had over 1,500 variants) resulting in a persistent and dynamic botnet. It is important to use all available information when eradicating and defending against a botnet infection to ensure that all variants are detected and properly removed.Here are some general guidelines for dealing with Mariposa malware:\n\nAny infected systems should be immediately isolated from the network.\nAny systems sharing network drives with the infected systems, including file servers hosting said network drives, should also be isolated from the network.Reimage infected hosts prior to returning to normal operation.\nConsider maintaining an infected system for more detailed analysis (i.e., digital media analysis, malware collection).\nReview antivirus software specific removal guidelines for the malware if re-imaging is not possible.\nUsers should refrain from or be administratively prohibited from browsing the Internet using Windows accounts with Administrator-level privileges. This reduces the potential damage an infection can inflict upon a system.\nOrganizations should warn users about the risks of using USB drives on business systems. For more information, review ICS-CERT CSAR -10-090-01- USBs Used as Attack Vectorg and US-CERT Cyber Security Tip ST08-001, “Using Caution with USB Drives.”US-CERT Cyber Security Tip, http://www.us-cert.gov/cas/tips/ST08-001html, website last accessed March 15, 2010.\nKeep systems up to date with the latest patches and antivirus signatures.\nEstablish an internet proxy service and monitor it for suspicious activity.\nMonitor IDS/IPS solutions for connections to the malicious domains and IP addresses listed in ICS-CERT advisories and US-CERT CIINs.\nDo NOT trust unsolicited e-mail.\nDo NOT click links and attachments in unsolicited e-mail messages.\nEmploy the use of a spam filter.\nTo educate users about social engineering and phishing attacks, review US-CERT Cyber Security Tip ST04-014, “Avoiding Social Engineering and Phishing Attacks.”\nTo learn more about botnets, review US-CERT Cyber Security Tip ST06-001, “Understanding Hidden Threats: Rootkits and Botnets.\"\n\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-10-090-01",
  "title": "Mariposa Botnet | CISA",
  "source": "ics-advisories",
  "id": "ee6d3e78b1a274c246a1d1aae5699e3464cd41c0629384703ec8f3580e2627de"
}