{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Moxa\nEquipment: OnCell G3100-HSPA Series\nVulnerabilities: Reliance on Cookies without Validation and Integrity Checking, Improper Handling of Length Parameter Inconsistency, NULL Pointer Dereference\nAFFECTED PRODUCTS\nThe following versions of OnCell, a high-speed industrial-grade IP gateway, are affected:\n\nOnCell G3100-HSPA Series version 1.4 Build 16062919 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow an attacker to remotely execute code on the device.\nMITIGATION\nMoxa has released new firmware for OnCell G3100-HSPA that is available via the following link:\nhttps://www.moxa.com/support/download.aspx?type=support&id=13668\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nRELIANCE ON COOKIES WITHOUT VALIDATION AND INTEGRITY CHECKING CWE-565\n\nThe application allows a cookie parameter to consist of only digits, allowing an attacker to perform a brute force attack bypassing authentication and gaining access to device functions.\nCVE-2018-5455 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nIMPROPER HANDLING OF LENGTH PARAMETER INCONSISTENCY CWE-130\n\nAn attacker may be able to edit the element of an HTTP request, causing the device to become unavailable.\nCVE-2018-5453 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nNULL POINTER DEREFERENCE CWE-476\n\nThe application does not check for a NULL value, allowing for an attacker to perform a denial of service attack.\nCVE-2018-5449 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nKirill Nesterov, Eugenie Potseluevskaya, and Radu Motspan of Kaspersky Labs reported the vulnerabilities to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2018-5453",
    "CVE-2018-5449",
    "CVE-2018-5455"
  ],
  "techniques": [],
  "advisory": "icsa-18-060-02",
  "title": "Moxa OnCell G3100-HSPA Series | CISA",
  "source": "ics-advisories",
  "id": "33e61d2ebbc87793bd2af1560b97de9efb8da3d769ace08f127ee8de926c8487"
}