{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 5.4\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: Modicon M580, Modicon M340, Modicon Premium, and Modicon Quantum\nVulnerability: Use of Insufficiently Random Values\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to hijack TCP connections or cause information leakage.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Modicon products are affected:\n\nModicon M580 firmware versions prior to Version 2.30\nModicon M340 firmware, all versions\nModicon Premium, all firmware versions\nModicon Quantum, all firmware versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nThe device has predictable TCP initial sequence numbers that allow attackers to hijack TCP connections carrying unsecured communications.\nCVE-2019-6821 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nDavid Formby and Raheem Beyah of Fortiphyd Logic and Georgia Tech reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSchneider Electric reports the following mitigations:\n\nModicon M580 firmware Version 2.80 is available for download. For more information see Schneider Electric advisory SEVD-2019-134-03\nModicon M340: currently, no fix is available.\n\nSchneider Electric recommends that affected users set up network segmentation and implement a firewall to block all remote/external access to TCP ports.\nConfigure the Access Control List following the recommendations of the user manual “Modicon M340 for Ethernet Communications Modules and Processors User Manual,” in the chapter titled “Messaging Configuration Parameters,” which is available here: https://download.schneiderelectric.com/files?p_enDocType=User+guide&p_File_Name=31007131_K01_000_16.pdf&p_Doc_Ref=31007131K01000\n\n\nModicon Premium and Modicon Quantum\n\nSet up network segmentation and implement a firewall to block all unauthorized access to all TCP ports.\n\n\n\nIn December 2018, Schneider Electric reported that the Modicon Premium and Quantum controllers reached the End of Commercialization life cycle. For more information, please see Schneider Electric advisory SEVD-2019-134-03\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-6821"
  ],
  "techniques": [],
  "advisory": "icsa-19-136-01",
  "title": "Schneider Electric Modicon Controllers | CISA",
  "source": "ics-advisories",
  "id": "f2dd7e1edd860b5fb15328f73d08b10b649e96fa4e9ba0d5f7ae3ad28566fc96"
}