{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.7\nATTENTION: Exploitable remotely\nVendor: Hitachi ABB Power Grids\nEquipment: Retail Operations and Counterparty Settlement Billing (CSB)\nVulnerability: Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access database credentials, shut down the product, and access or alter system data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi ABB Power Grids reports this vulnerability affects the following utility usage and billing software products:\n\nRetail Operations: All Versions 5.7.2 and prior\nCounterparty Settlement and Billing (CSB): All Versions 5.7.2 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nAn attacker who has gained access to an authorized user’s computer could exploit this vulnerability to access database credentials and gain read/edit access to application data.\nCVE-2021-35529 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\n4. MITIGATIONS\nHitachi ABB Power Grids recommends updating to Version 5.7.3 or later, which resolves this vulnerability. For more information on this advisory, see the Hitachi ABB Power Grids security advisory or contact Hitachi ABB Power Grids.\nHitachi ABB Power Grids suggests  recommended security practices, operating systems hardening, and firewall configurations can help protect a user’s computer from the attacks. An entry point for this vulnerability is the unsecured operating system on which the product is installed. Hitachi ABB Power Grids recommends hardening the operating system accordingly.\n\nFollow the hardening guidelines published by The Center for Internet Security (CIS).\nRoutinely monitor the application process log for unrecognized user sessions originating from outside the application.\n\nFor additional information, please see the following Hitachi ABB Power Grids security advisories:\n\nRetail Operations\nCounterparty Settlement Billing (CSB)\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-35529"
  ],
  "techniques": [],
  "advisory": "icsa-21-236-02",
  "title": "Hitachi ABB Power Grids Retail Operations and CSB Products | CISA",
  "source": "ics-advisories",
  "id": "fd6d37daea3faa6459303fc6df2e64cead2b90087b364123fc9be204e817d424"
}