{
  "markdown": "\nOverview\nSecurity researchers Scott Bell and Blair Strang of Security-Assessment.com have released a report detailing a stack overflow vulnerability affecting ICONICS GENESIS32 and BizViz products. The vulnerable ActiveX control, GenVersion.dll, is a component of WebHMI, which is incorporated in both GENESIS32 and BizViz products. Successful exploitation of this vulnerability allows remote arbitrary code execution.\nICS-CERT has confirmed that ICONICS has issued a patch that addresses this vulnerability. ICONICS confirmed that Security-Assessment.com has validated that this patch fully resolves this vulnerability.\nAffected Products\nAccording to ICONICS, GENESIS32 and BizViz (Versions 9 through 9.21) are affected by this vulnerability.\nImpact\nIf successfully exploited, this vulnerability results in remote arbitrary code execution with privileges of the current user.\nActual impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.\nBackground\nICONICS is a US based company that maintains offices in several countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia.\nThe affected products, GENESIS32 and BizViz, are web based HMI SCADA systems. According to ICONICS, GENESIS32 is deployed across several sectors including manufacturing, building automation, oil and gas, water and wastewater, electric utilities, and others. ICONICS estimates that 55% of GENESIS32 installations are in the United States, 45% are in Europe, and 5% are in Asia.\nVulnerability (or Malware) Characterization\nVulnerability (or Malware) Overview\nAccording to Security-Assessment.com, exploitation of this vulnerability requires a user with the “GenVersion.dll” ActiveX control installed to visit a web page containing specially crafted JavaScript. “GenVersion.dll” is a component used by the WebHMI interface. By passing a specially crafted string to the “SetActiveXGUID” method, it is possible to overflow a static buffer and execute arbitrary code with the privileges of the logged on user.\nUsers could be lured into visiting malicious sites using social engineering or phishing techniquesc.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable using a specially crafted string sent to the “SetActiveXGUID” method.\nExistence of Exploit\nAn exploit targeting this vulnerability is publicly available.\nDifficulty\nThis vulnerability requires moderate skill to exploit. Social engineering techniques are also needed to exploit this vulnerability.\nMitigation\nICONICS has released a patch that addresses this vulnerability for each of the affected products. ICONICS recommends that users of GENESIS32 and BizViz install the patch entitled “WebHMI V9.21 Patch.”\nICONICS also plans to address this vulnerability in the upcoming version 9.22 update of GENESIS32 and BizViz. ICONICS expects this update to be available in June 2011.\nICONICS has updated their “Whitepaper on Security Vulnerabilities” to include details of this vulnerability.\nFor additional product support, users can contact ICONICS by phone at (508) 543-8600 or by e-mail at support@iconics.com.\nICS-CERT recommends that users also take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nICS-CERT encourages asset owners to minimize network exposure for all control system devices. Critical devices should not directly face the Internet. Locate control system networks and remote devices behind firewalls and isolate them from the business network. When remote access is required, use secure methods such as Virtual Private Networks (VPNs).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nThe Control Systems Security Program (CSSP) also provides a recommended practices section for control systems, on the US-CERT website. Several recommended practices are available for reading or download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-131-01",
  "title": "ICONICS GENESIS32 and BizViz ActiveX Stack Overflow | CISA",
  "source": "ics-advisories",
  "id": "6504a5ee043974a6dc5cdaf514e99e2ade4faa2f99f24632d024c5ea945bf61b"
}