{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 5.3\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SICAM A8000 RTU\nVulnerability: Uncaught Exception\n\n2. RISK EVALUATION\nThe SICAM A8000 RTU series is affected by a security vulnerability that could allow unauthenticated remote users to cause a denial-of-service condition on the web server of affected products.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SICAM A8000 RTU, a telecontrol and automation device, are affected:\n\nSICAM A8000 CP-8000 versions prior to v14,\nSICAM A8000 CP-802X versions prior to v14, and\nSICAM A8000 CP-8050 versions prior to v2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCAUGHT EXCEPTION CWE-248\nSpecially crafted network packets sent to Ports 80/TCP or 443/TCP could allow an unauthenticated remote attacker to cause a denial-of-service condition on a web server.\nCVE-2018-13798 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nEmanuel Duss and Nicolas Heiniger from Compass Security reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has released updates for all product variants and recommends users update to the new versions:\nhttps://support.industry.siemens.com/cs/search?search=a8000%20cp8000\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nLimit access to the web server on Ports 80/TCP and 443/TCP with an external firewall.\nApply a Defense-in-Depth strategy.\n\nFor additional information see Siemens’ security advisory SSA-579309 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-13798"
  ],
  "techniques": [],
  "advisory": "icsa-19-038-01",
  "title": "Siemens SICAM A8000 RTU Series | CISA",
  "source": "ics-advisories",
  "id": "3acb1d8f003474871fe2ae43840d43d6ac7c4071bdeee41c7d5675ea6ec0fb28"
}