{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.0\nVendor: Exacq Technologies, Inc., a subsidiary of Johnson Controls, Inc.\nEquipment: exacqVision\nVulnerability: Off-by-one Error\n\n2. RISK EVALUATION\nA local attacker could exploit this vulnerability to obtain “Super User” access to the underlying Ubuntu Linux operating system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports the vulnerability affects the following products running on unpatched versions of the Ubuntu operating system:\n\nLinux based Z-Series and A-Series\nQ-Series\nG-Series\nLegacy LC-Series\nLegacy ELP-Series\nexacqVision Network Video Recorders (NVR)\nLinux based C-Series Workstations\nS-Series Storage Servers\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OFF-BY-ONE ERROR CWE-193\nThe affected product calculates or uses an incorrect maximum or minimum value that is one more or one less than the correct value.\nCVE-2021-3156 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls recommends users install the latest security updates for the Ubuntu Linux operating system.\nUsers may contact Exacq technical support for assistance with updating their operating system.\nFor more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-04\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High attack complexity.\n",
  "cves": [
    "CVE-2021-3156"
  ],
  "techniques": [],
  "advisory": "icsa-21-119-03",
  "title": "Johnson Controls Exacq Technologies exacqVision | CISA",
  "source": "ics-advisories",
  "id": "284f405dbf0a3ecb93d2d6915277cc8610f7e20e1804a553046551e62280b346"
}