{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.7\nVendor: Exacq Technologies, Inc., a subsidiary of Johnson Controls\nEquipment: exacqVision Server\nVulnerability: Unquoted Search Path or Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated user to elevate their privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThis vulnerability impacts exacqVision server Versions 9.6 and 9.8\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nSome services have an unquoted service path. If an authenticated user is able to insert code in the system root path, that code can be executed during the application startup.\nCVE-2019-7590 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nGjoko Kristic of Zero Science Lab reported this vulnerability to Johnson Controls.\n4. MITIGATIONS\nJohnson Controls recommends the following:\n\nUsers should upgrade to the latest product, Version 19.03\nFurther ICS security notices and product security guidance are located at the Johnson Controls product security website.\n\nFor questions concerning this product, contact Johnson Controls Global Product Security; email: productsecurity@jci.com.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-7590"
  ],
  "techniques": [],
  "advisory": "icsa-19-199-01",
  "title": "Johnson Controls exacqVision Server | CISA",
  "source": "ics-advisories",
  "id": "06f6f40a7931aa1f4cbb63d4725becc6a5b04a512cef3f41b31b1cbd3073cccf"
}