{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: AVEVA Software, LLC. (AVEVA)\nEquipment: InTouch\nVulnerability: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated user to remotely execute code with the same privileges as those of the InTouch View process which could lead to a compromise of the InTouch HMI.Systems are only vulnerable if the operating system locales do not use a dot floating point separator.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AVEVA InTouch, a HMI Platform, are affected:\n\nInTouch 2014 R2 SP1 and prior,\nInTouch 2017,\nInTouch 2017 Update 1, and\nInTouch 2017 Update 2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nAn unauthenticated user could send a specially crafted packet that could overflow the buffer on a locale not using a dot floating point separator. Exploitation could allow remote code execution under the privileges of the InTouch View process.\nCVE-2018-10628 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Food and Agriculture, Chemical, and Water and Wastewater \nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nGeorge Lashenko of CyberX reported this vulnerability to NCCIC.\n4. MITIGATIONS\nAVEVA recommends the following mitigations for each version of software affected:\nInTouch 2014 R2 SP1 - Apply HF-11_1_SP1/CR149705 as soon as possible. Those using versions of InTouch older than 2014 R2 SP1 should first upgrade to a supported version of InTouch and then apply the corresponding hotfix.\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=5057 (login required)\nInTouch 2017 Update 2 - Apply HF-17_2/CR149706 as soon as possible. Those using InTouch 2017 or 2017 Update 1 should first upgrade to InTouch 2017 Update 2, then apply HF-17_2/CR149706.\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=5058 (login required)\nFor more information AVEVA has released a Security Bulletin:\nhttps://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityBulletin_LFSec127(003).pdf\nTo contact AVEVA support visit:\nhttps://softwaresupport.aveva.com/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2018-10628"
  ],
  "techniques": [],
  "advisory": "icsa-18-200-02",
  "title": "AVEVA InTouch | CISA",
  "source": "ics-advisories",
  "id": "d54a98e9d7f01c608ba555179ff13304481f352c3c628e27deeb389e33b1ff60"
}