{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: ControlLogix, GuardLogix\nVulnerability: Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to crash the device by exploiting a Denial-of-Service (DoS) vulnerability.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Rockwell Automation ControlLogix and GuardLogix programmable logic controllers are affected:\n\nControlLogix 5570: Firmware version 20.011\nControlLogix 5570 Redundancy: Firmware versions 20.054_kit1\nGuardLogix 5570: Firmware version 20.011\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nA Denial-of-Service (DoS) vulnerability exists that, if exploited, the product could potentially experience a major nonrecoverable fault (MNRF). The device will restart itself to recover from the MNRF.\nCVE-2024 21916 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation users with the affected software are encouraged to apply the risk mitigations, if possible. Additionally, Rockwell Automation encourages users to implement their suggested security best practices to minimize the risk of vulnerability.\n\nControlLogix 5570: Corrected in v33.016, 34.013, 35.012, 36.011 and later\nControlLogix 5570 Redundancy: Corrected in v33.053_kit1, 34.052_kit1, 35.052_kit1, 36.051_kit1 and later\nGuardLogix 5570: Corrected in v33.016, 34.013, 35.012, 36.011 and later\n\nFor more information, see Rockwell Automation's security advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJanuary 30, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-21916"
  ],
  "techniques": [],
  "advisory": "icsa-24-030-05",
  "title": "Rockwell Automation ControlLogix and GuardLogix | CISA",
  "source": "ics-advisories",
  "id": "3385e83aa1203498d4cc2e2ebea37527924e81a5e64c5d72706dbf976c7898ed"
}