{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0 \nATTENTION: Exploitable remotely/low attack complexity\nVendor: Johnson Controls Inc.\nEquipment: OpenBlue Enterprise Manager Data Collector\nVulnerabilities: Improper Authentication, Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker, under certain circumstances, to make application programming interface (API) calls to the OpenBlue Enterprise Manager Data Collector, which do not require authentication and may expose sensitive information to an unauthorized user.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Johnson Controls products are affected: \n\nOpenBlue Enterprise Manager Data Collector: Firmware versions prior to 3.2.5.75\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER AUTHENTICATION CWE-287\nUnder certain circumstances, API calls to the OpenBlue Enterprise Manager Data Collector do not require authentication.\nCVE-2023-2024 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:N).\n3.2.2 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nUnder certain circumstances, API calls to the OpenBlue Enterprise Manager Data Collector may expose sensitive information to an unauthorized user.\nCVE-2023-2025 has been assigned to this vulnerability. A CVSS v3 base score of 5.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nRushank Shetty, Security Researcher at Northwestern Mutual, reported this vulnerability to Johnson Controls, Inc.; Johnson Controls, Inc. reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls recommends updating OpenBlue Enterprise Manager Data Collector firmware to version 3.2.5.75. Users must contact Johnson Controls to obtain the update.\nFor more information, refer to Johnson Controls Product Security Advisory JCI-PSA-2023-04 v1\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2023-2025",
    "CVE-2023-2024"
  ],
  "techniques": [],
  "advisory": "icsa-23-138-04",
  "title": "Johnson Controls OpenBlue Enterprise Manager Data Collector | CISA",
  "source": "ics-advisories",
  "id": "51245c20ac3910d00f31c7123caee9bb56154d0c0b5c2b8ed4d6f8ad47f29467"
}