{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: GX Works3, MX OPC UA Module Configurator-R\nVulnerabilities: Cleartext Storage of Sensitive Information, Use of Hard-coded Password, Insufficiently Protected Credentials, Use of Hard-coded Cryptographic Key, Cleartext Storage of Sensitive Information in Memory\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-333-05 Mitsubishi Electric FA Engineering Software that was published December 6, 2022, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow unauthorized users to gain access to the MELSEC iQ-R/F/L series CPU modules and the MELSEC iQ-R series OPC UA server module or to view and execute programs or view project files without permissions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Mitsubishi Electric FA Engineering Software are affected: \n\nGX Works3:  \n\n1.000A to 1.011M (affected by CVE-2022-25164, CVE-2022-29825, CVE-2022-29826, CVE-2022-29827, CVE-2022-29828, CVE-2022-29829, CVE-2022-29830) \n1.015R to 1.087R (affected by CVE-2022-25164, CVE-2022-29825, CVE-2022-29826, CVE-2022-29827, CVE-2022-29828, CVE-2022-29829, CVE-2022-29830, CVE-2022-29831, CVE-2022-29832, CVE-2022-29833)\n1.090U (affected by CVE-2022-25164, CVE-2022-29825, CVE-2022-29827, CVE-2022-29828, CVE-2022-29829, CVE-2022-29830, CVE-2022-29831, CVE-2022-29832, CVE-2022-29833)\n\n\t\t --------- Begin Update B Part 1 of 2 --------- \n1.095Z (affected by CVE-2022-25164, CVE-2022-29827, CVE-2022-29828, CVE-2022-29830, CVE-2022-29831, CVE-2022-29832, CVE-2022-29833) \n1.096A and later (affected by CVE-2022-29827, CVE-2022-29828, CVE-2022-29832, CVE-2022-29833) \n\n\nMX OPC UA Module Configurator-R: 1.08J and prior (affected by CVE-2022-25164)\n\n\nGX Works2: All versions (affected by CVE-2022-29832) \nGX Developer: 8.40S and later (affected by CVE-2022-29832) \nGT Designer3 Version1 (GOT2000): 1.122C to 1.290C (affected by CVE-2022-29825, CVE-2022-29829) \nMotion Control Settings (GX Works3 related software): \n\n1.000A to 1.033K (affected by CVE-2022-29826, CVE-2022-29830) \n1.035M to 1.042U (affected by CVE-2022-29826, CVE-2022-29829, CVE-2022-29830) \n1.045X and later (affected by CVE-2022-29830) \n\n\n\n             --------- End Update B Part 1 of 2 --------- \n4.2 VULNERABILITY OVERVIEW\n4.2.1 CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could gain access to the CPU module and the OPC UA server module.\nCVE-2022-25164 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.2.2 CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could view or execute programs.\nCVE-2022-29826 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.2.3 USE OF HARD-CODED PASSWORD CWE-259\nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could view programs and project files or execute programs.\nCVE-2022-29825 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.2.4 USE OF HARD-CODED PASSWORD CWE-259\nIf this vulnerability is exploited, unauthorized users could obtain information about the safety CPU module project file.\nCVE-2022-29831 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.5 INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could access the safety CPU module.\nCVE-2022-29833 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:N).\n4.2.6 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could view or execute programs.\nCVE-2022-29827 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.2.7 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could view or execute programs.\nCVE-2022-29828 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.2.8 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could view or execute programs.\nCVE-2022-29829 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.2.9 USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nIf this vulnerability is exploited, sensitive information could be tampered with or disclosed. As a result, information about project files could be obtained without permission by unauthorized users.\nCVE-2022-29830 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.10 CLEARTEXT STORAGE OF SENSITIVE INFORMATION IN MEMORY CWE-316 \nIf this vulnerability is exploited, sensitive information could be disclosed. As a result, unauthorized users could obtain information about the safety CPU module or project file for MELSEC Q/FX/L series with security setting. \nCVE-2022-29832 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nAnton Dorfman, Vladimir Nazarov, Dmitry Sklyarov, and Iliya Rogachev of Positive Technologies reported CVE-2022-25164, CVE-2022-29825, CVE-2022-29826, CVE-2022-29827, CVE-2022-29828, CVE-2022-29829, and CVE-2022-29830 to Mitsubishi Electric. Ivan Speziale of Nozomi Networks reported CVE-2022-29831, CVE-2022-29832, and CVE-2022-29833 to CISA.\n5. MITIGATIONS\nMitsubishi Electric released and recommends users update to the latest version:   \n\nGX Works3:\n\nCVE-2022-29826: Download fixed Ver. 1.090U or later\nCVE-2022-29825 and CVE-2022-29829: Download fixed Ver. 1.095Z or later. Then set security key’s secure mode to “enable”.\n\n--------- Begin Update B Part 2 of 2 ---------\nCVE-2022-25164, CVE-2022-29830, and CVE-2022-29831: Download fixed Ver. 1.096A or later. Then set security version to “2”.\n\n\nMX OPC UA Module Configurator-R:\n\nCVE-2022-25164: Download fixed Ver. 1.09K or later. Update the firmware version of the OPC UA server module to 10 or later.\n\n\n\n--------- End Update B Part 2 of 2 ---------\n\nGT Designer3 Version1 (GOT2000):\n\nCVE-2022-29825 and CVE-2022-29829: Download fixed Ver. 1.295H or later. Then set security key’s secure mode to “enable”.\n\n\nMotion Control Setting:\n\nCVE-2022-29826 and CVE-2022-29829: Download fixed Ver. 1.045X or later. Apply CVE-2022-29826 or CVE-2022-29829 mitigations for GX Works3 as well.\n\n\n\nFor all other listed vulnerabilities, Mitsubishi Electric released mitigations/workarounds for users to follow:\n\nEnsure malicious actors cannot access project files, configuration files, security keys stored on the host machine via untrusted networks or hosts.\nInstall antivirus software on the host machine running the software.\nEncrypt project files and security keys when sending or receiving over the internet.\nUse the \"authentication with a certificate\" function instead of \"username / password authentication\" for user authentication for access from OPC UA clients to MELSEC iQ-R series OPC UA server modules (MX OPC UA Module Configurator-R only).\n\nFor specific update instructions and additional details see the Mitsubishi Electric advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2022-29829",
    "CVE-2022-29825",
    "CVE-2022-25164",
    "CVE-2022-29833",
    "CVE-2022-29826",
    "CVE-2022-29827",
    "CVE-2022-29830",
    "CVE-2022-29831",
    "CVE-2022-29832",
    "CVE-2022-29828"
  ],
  "techniques": [
    "T2000"
  ],
  "advisory": "icsa-22-333-05",
  "title": "Mitsubishi Electric FA Engineering Software (Update B) | CISA",
  "source": "ics-advisories",
  "id": "aa621d0653f2c7a62a0b5be578bf41dd11f41a5aa6ce904aa1c3b9cef61a7ee1"
}