{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Kantech, a subsidiary of Johnson Controls\nEquipment: EntraPass\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow malicious code execution with system-level privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Kantech EntraPass security management software are affected:\n\nCorporate Edition: All versions prior to v8.10\nGlobal Edition: All versions prior to v8.10\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1     IMPROPER INPUT VALIDATION CWE-20\nAn issue with an API may allow an attacker to upload and execute malicious code with system-level privileges.\nCVE-2019-7589 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJoachim Kerschbaumer reported this vulnerability to Johnson Controls.\n3. MITIGATIONS\nJohnson Controls recommends the following:\n\nUpgrade to EntraPass Version 8.10\nFor users unable to upgrade, please reference the Johnson Controls Product Security Advisory for temporary workaround instructions.\n\nFor questions concerning this product, contact Johnson Controls Global Product Security; email: productsecurity@jci.com\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-7589"
  ],
  "techniques": [],
  "advisory": "icsa-20-070-04",
  "title": "Johnson Controls Kantech EntraPass | CISA",
  "source": "ics-advisories",
  "id": "3806f0c8326712346158fde7cd7a61c759ef00ec90d116857494b7169adddf38"
}