{
  "markdown": " Mitsubishi Electric MELSEC iQ\\-R, Q and L Series (Update D) \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryMitsubishi Electric MELSEC iQ\\-R, Q and L Series (Update D)=========================================================== Last Revised December 19, 2023 Alert Code ICSA\\-20\\-303\\-01**[View CSAF](https://github.com/cisagov/CSAF)**1\\. EXECUTIVE SUMMARY---------------------* **CVSS v3 7\\.5*** **ATTENTION**  : Exploitable remotely/low attack complexity* **Vendor**  : Mitsubishi Electric* **Equipment**  : MELSEC iQ\\-R, Q, and L Series* **Vulnerability**  : Uncontrolled Resource Consumption2\\. RISK EVALUATION------------------- Successful exploitation of this vulnerability could cause a denial\\-of\\-service condition in the Ethernet port on the CPU module.3\\. TECHNICAL DETAILS---------------------### 3\\.1 AFFECTED PRODUCTS Mitsubishi Electric reports that the following MELSEC programmable controllers are affected:* MELSEC iQ\\-R R00 CPU firmware: versions 20 and earlier* MELSEC iQ\\-R R01 CPU firmware: versions 20 and earlier* MELSEC iQ\\-R R02 CPU firmware: versions 20 and earlier* MELSEC iQ\\-R R04 (EN) CPU firmware: versions 52 and earlier* MELSEC iQ\\-R R08 (EN) CPU firmware: versions 52 and earlier* MELSEC iQ\\-R R16 (EN) CPU firmware: versions 52 and earlier* MELSEC iQ\\-R R32 (EN) CPU firmware: versions 52 and earlier* MELSEC iQ\\-R R120 (EN) CPU firmware: versions 52 and earlier* MELSEC iQ\\-R R08 SFCPU firmware: versions 22 and earlier* MELSEC iQ\\-R R16 SFCPU firmware: versions 22 and earlier* MELSEC iQ\\-R R32 SFCPU firmware: versions 22 and earlier* MELSEC iQ\\-R R120 SFCPU firmware: versions 22 and earlier* MELSEC iQ\\-R R08 PCPU firmware: versions 25 and earlier* MELSEC iQ\\-R R16 PCPU firmware: versions 25 and earlier* MELSEC iQ\\-R R32 PCPU firmware: versions 25 and earlier* MELSEC iQ\\-R R120 PCPU firmware: versions 25 and earlier* MELSEC iQ\\-R R16 MTCPU operating system software: version 21 and earlier* MELSEC iQ\\-R R32 MTCPU operating system software: version 21 and earlier* MELSEC iQ\\-R R64 MTCPU operating system software: version 21 and earlier* MELSEC Q Q03 UDECPU: serial number 22081 and earlier* MELSEC Q Q04 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q06 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q10 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q13 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q20 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q26 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q50 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q100 UDEHCPU: serial number 22081 and earlier* MELSEC Q Q03 UDVCPU: serial number 22031 and earlier* MELSEC Q Q04 UDVCPU: serial number 22031 and earlier* MELSEC Q Q06 UDVCPU: serial number 22031 and earlier* MELSEC Q Q13 UDVCPU: serial number 22031 and earlier* MELSEC Q Q26 UDVCPU: serial number 22031 and earlier* MELSEC Q Q04 UDPVCPU: serial number 22031 and earlier* MELSEC Q Q06 UDPVCPU: serial number 22031 and earlier* MELSEC Q Q13 UDPVCPU: serial number 22031 and earlier* MELSEC Q Q26 UDPVCPU: serial number 22031 and earlier* MELSEC Q Q172 DCPU\\-S1 operating system software: version V and earlier* MELSEC Q Q173 DCPU\\-S1 operating system software: version V and earlier* MELSEC Q Q172 DSCPU operating system software: version W and earlier* MELSEC Q Q173 DSCPU operating system software: version W and earlier* MELSEC Q Q170 MCPU operating system software: version V and earlier* MELSEC Q Q170 MSCPU(\\-S1\\) operating system software: version W and earlier* MELSEC Q MR\\-MQ100 operating system software: version E and earlier* MELSEC L L02 CPU (\\-P): serial number 23121 and earlier* MELSEC L L06 CPU (\\-P): serial number 23121 and earlier* MELSEC L L26 CPU (\\-P): serial number 23121 and earlier* MELSEC L L26 CPU \\- (P) BT: serial number 23121 and earlier### 3\\.2 Vulnerability Overview**3\\.2\\.1 [Uncontrolled Resource Consumption CWE\\-400](https://cwe.mitre.org/data/definitions/400.html)** Mitsubishi Electric MELSEC iQ\\-R, Q, and L Series CPU modules are vulnerable to uncontrolled resource consumption. When the CPU module receives a specially crafted packet from a malicious attacker, Ethernet communication may enter a denial\\-of\\-service condition and a reset is required to recover it.[CVE\\-2020\\-5652](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2020-5652)  has been assigned to this vulnerability. A CVSS v3\\.1 base score of 7\\.5 has been calculated; the CVSS vector string is ( [AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H](https://www.first.org/cvss/calculator/3.1#CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H)  ).### 3\\.3 BACKGROUND* **CRITICAL INFRASTRUCTURE SECTORS:**  Critical Manufacturing* **COUNTRIES/AREAS DEPLOYED:**  Worldwide* **COMPANY HEADQUARTERS LOCATION:**  Japan### 3\\.4 RESEARCHER joker63 of ZheJiangQiAnTechnology reported this vulnerability to Mitsubishi Electric.4\\. MITIGATIONS--------------- Mitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting this vulnerability:* Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.* Use within a LAN and block access from untrusted networks and hosts through firewalls. Please refer to Mitsubishi Electric's website for details on available patches. Mitsubishi Electric recommends users update their products by downloading and applying the latest versions. Please contact a Mitsubishi Electric representative for additional details. For specific additional details, see \\[Mitsubishi Electric advisory 2020\\-013].( [https://www.mitsubishielectric.com/en/psirt/vulnerability/pdf/2020\\-013\\_en.pdf](https://www.mitsubishielectric.com/en/psirt/vulnerability/pdf/2020-013_en.pdf)  ). CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:* Minimize network exposure for all control system devices and/or systems, ensuring they are [not accessible from the internet](https://www.cisa.gov/uscert/ics/alerts/ICS-ALERT-10-301-01)  . CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for [control systems security recommended practices](https://www.cisa.gov/resources-tools/resources/ics-recommended-practices)  on the ICS webpage on [cisa.gov/ics](https://www.cisa.gov/topics/industrial-control-systems)  . Several CISA products detailing cyber defense best practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](https://us-cert.cisa.gov/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . CISA encourages organizations to implement recommended cybersecurity strategies for [proactive defense of ICS assets](https://www.cisa.gov/sites/default/files/publications/Cybersecurity_Best_Practices_for_Industrial_Control_Systems.pdf)  . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at [cisa.gov/ics](https://www.cisa.gov/topics/industrial-control-systems)  in the technical information paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](https://www.cisa.gov/uscert/ics/tips/ICS-TIP-12-146-01B)  . No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.5\\. UPDATE HISTORY------------------* October 29, 2020: Initial Publication* May 18, 2021: Update A \\- Added an affected product* January 13, 2022: Update B \\- Added additional affected products* April 4, 2022: Update C \\- Added additional affected products* December 19, 2023: Update D \\- Update to the researcher section and affected products This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Mitsubishi Electric-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-20-303-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2020-5652"
  ],
  "techniques": [],
  "advisory": "icsa-20-303-01",
  "title": "Mitsubishi Electric MELSEC iQ-R, Q and L Series (Update D) | CISA",
  "source": "ics-advisories",
  "id": "40af84b949f2d020fb968413afb649165ee14a58dd21b4c54ebcd4e1e6a3519e"
}