{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available\nVendor: Fuji Electric\nEquipment: Alpha5 Smart Loader\nVulnerabilities: Classic Buffer Overflow, Heap-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-270-02 Fuji Electric Alpha5 Smart Loader that was published September 27, 2018, on the NCCIC/ICS-CERT website. This advisory includes mitigations for a classic buffer overflow and heap-based buffer overflow vulnerabilities in the Fuji Electric Alpha5 Smart Loader product.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow for arbitrary remote code execution on the device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Alpha5 Smart Loader, a servo drive, are affected:\n\nAlpha5 Smart Loader Versions 3.7 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT ('CLASSIC BUFFER OVERFLOW') CWE-120\nA buffer overflow information disclosure vulnerability occurs when parsing certain file types.\nCVE-2018-14788 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe device does not perform a check on the length/size of a project file before copying the entire contents of the file to a heap-based buffer.\nCVE-2018-14794 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Europe and Asia\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nMichael Flanders working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 ---------\nFuji Electric has released a new version of the Alpha Loader software that can be obtained from (login required):\nhttps://felib.fujielectric.co.jp/download/login.htm?site=global&lang=en\n--------- End Update A Part 1 of 1 ---------\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-14788",
    "CVE-2018-14794"
  ],
  "techniques": [],
  "advisory": "icsa-18-270-02",
  "title": "Fuji Electric Alpha5 Smart Loader (Update A) | CISA",
  "source": "ics-advisories",
  "id": "3685c912436b16bce9414d6b0160970ce8ddd198ebd2acf8da90132af49133b7"
}