{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SINEC NMS\nVulnerability: OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated remote attacker with system privileges to execute arbitrary code on the system under certain conditions.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SINEC NMS are affected:\n\nSINEC NMS: All versions prior to v1.0 SP2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nThe affected application incorrectly neutralizes special elements when creating batch operations, which could lead to command injection. An authenticated remote attacker with administrative privileges could exploit this vulnerability to execute arbitrary code.\nCVE-2021-33721 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nNoam Moshe from Claroty reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released updates for the following products:\n\nSINEC NMS: Update to v1.0 SP2 or later version\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens operational guidelines for industrial security and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-756744\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-33721"
  ],
  "techniques": [],
  "advisory": "icsa-21-222-04",
  "title": "Siemens SINEC NMS | CISA",
  "source": "ics-advisories",
  "id": "00b0b27697f102609fb239af5a833a5e47a62fd875bff45a913bac9a52e0a9e6"
}