{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Newport\nEquipment: XPS-Cx, XPS-Qx\nVulnerability: Improper Authentication\nAFFECTED PRODUCTS\nThe following versions of XPS-Cx and XPS-Qx, a universal motion controller, are affected:\n\nXPS-Cx all versions, and\nXPS-Qx all versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to view and edit settings without authenticating by accessing a specific uniform resource locator (URL).\nMITIGATION\nNewport reports that this issue will be addressed in the next generation XPS-Dx controller.\nNCCIC/ICS-CERT and Newport recommend that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nNot connect control components and control networks to an open network such as the Internet or an office network. Newport recommends putting control components and control networks behind a firewall.\nLimit physical and electronic access to all automation components to authorized personnel only.\nChange the default passwords before first use. This will reduce the risk of unauthorized access to systems.\nRegularly change passwords. This will reduce the risk of unauthorized access to systems.\nIf remote access to control components and control networks is required, use a Virtual Private Network (VPN).\nRegularly perform threat analyses. Check whether the measures taken meet company security requirements.\nUse “defense-in-depth” mechanisms in the system’s security configuration to restrict the access to and control of individual products and networks.\nMinimize network exposure for all control system devices and/or systems and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nAn attacker may bypass authentication by accessing a specific uniform resource locator (URL).\nCVE-2017-7919 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nMaxim Rupp identified the vulnerability.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2017-7919"
  ],
  "techniques": [],
  "advisory": "icsa-17-178-01",
  "title": "Newport XPS-Cx, XPS-Qx | CISA",
  "source": "ics-advisories",
  "id": "d8f11ab5c9dc39dd5e4e3c8d8b79f346c22610e6da95f325ba749ca60c7ccd7e"
}