{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nVendor: Mitsubishi Electric\nEquipment: MELIPC , MELSEC iQ-R, and MELSEC Q Series\nVulnerabilities: Processor Optimization Removal or Modification of Security-Critical Code, Observable Discrepancy\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a malicious attacker to disclose information in the affected products.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports the following versions of FA Engineering Software Products are affected. For the correspondence table of the affected products and each vulnerability, refer to Mitsubishi Electric's security bulletin.\n\nMELIPC MI5122-VW: All Versions\nMELIPC MI2012-W: All Versions\nMELIPC MI1002-W: All Versions\nMELIPC MI3321G-W: All Versions\nMELIPC MI3315G-W: All Versions\nMELSEC iQ-R R102WCPU-W: All Versions\nMELSEC Q Q24DHCCPU-V: All Versions\nMELSEC Q Q24DHCCPU-VG: All Versions\nMELSEC Q Q24DHCCPU-LS: All Versions\nMELSEC Q Q26DHCCPU-LS: All Versions\n\n3.2 Vulnerability Overview\n3.2.1 PROCESSOR OPTIMIZATION REMOVAL OR MODIFICATION OF SECURITY-CRITICAL CODE CWE-1037\nThe affected product is vulnerable to processor optimization removal or modification of security critical code, which may allow a malicious attacker to disclose information in the affected products.\nCVE-2022-21151 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:C/C:H/I:N/A:N).\n3.2.2 OBSERVABLE DISCREPANCY CWE-203\nThe affected product is vulnerable to an observable discrepancy, which may allow a malicious attacker to disclose information in the affected products.\nCVE-2021-33149 has been assigned to this vulnerability. A CVSS v3.1 base score of 2.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends that users take the following mitigation measures to minimize the risk of exploiting these vulnerabilities:\n\nRestrict physical access to the product by unauthorized users.\n\nPlease contact your local Mitsubishi Electric representative for further questions.\nFor additional information see Mitsubishi Electric advisory 2023-017.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. These vulnerabilities have a high attack complexity.\n5. UPDATE HISTORY\n\nDecember 7, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2021-33149",
    "CVE-2022-21151"
  ],
  "techniques": [],
  "advisory": "icsa-23-341-01",
  "title": "Mitsubishi Electric FA Engineering Software Products | CISA",
  "source": "ics-advisories",
  "id": "08053e4bbbe9a7d76822720d47da035f00840da23e7669d7a391f21acd33f9d7"
}