{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 7.0\nATTENTION: Exploitable remotely\nVendor: Johnson Controls, Inc.\nEquipment: Illustra Pro Gen 4\nVulnerability: Dependency on Vulnerable Third-Party Component\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could impact confidentiality and integrity of the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nJohnson Controls reports that the following versions of Illustra Pro Gen 4 Camera are affected:\n\nIllustra Pro Gen 4 Camera: Version SS016.05.03.01.0010 and prior\n\n3.2 Vulnerability Overview\n3.2.1 Dependency on Vulnerable Third-Party Component CWE-1395\nUnder certain circumstances the camera may be susceptible to known vulnerabilities associated with JQuery versions prior to 3.5.0 third-party component\nCVE-2024-32753 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:C/C:H/I:L/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-32753. A base score of 7.0 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:P/PR:N/UI:A/VC:H/VI:L/VA:N/SC:H/SI:L/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls reported this vulnerability to CISA\n4. MITIGATIONS\nJohnson Controls recommends that users update Illustra Pro Gen 4 camera to version SS016.24.03.00.0007. For more detailed mitigation instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2024-05 v1\nAligning with CISA recommendations, Johnson Controls recommends taking steps to minimize risks to all building automation systems.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nJuly 09, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-32753"
  ],
  "techniques": [],
  "advisory": "icsa-24-191-03",
  "title": "Johnson Controls Illustra Pro Gen 4 | CISA",
  "source": "ics-advisories",
  "id": "95dea2072c75bb2e20c63ae5f9f76085cadb430c09deefe1037ce76eccf4d9e1"
}