{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Haas Automation, Inc\nEquipment: Haas Controller\nVulnerabilities: Missing Authentication for Critical Function, Insufficient Granularity of Access Control, Cleartext Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthorized attacker to cause denial-of-service of the production line, damage the tools used in the production line, introduce defects in pieces of the production line, and perform remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Haas Controller, a Computer Numerical Control (CNC), are affected:\n\nHaas Controller: Version 100.20.000.1110\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nAuthentication is currently unsupported in Haas Controller version 100.20.000.1110 when using the “Ethernet Q Commands” service, which allows any user on the same network segment as the controller (even while connected remotely) to access the service and write unauthorized macros to the device.\nCVE-2022-2474 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    INSUFFICIENT GRANULARITY OF ACCESS CONTROL CWE-1220\nHaas Controller version 100.20.000.1110 has insufficient granularity of access control when using the \"Ethernet Q Commands\" service. Any user is able to write macros into registers outside of the authorized accessible range. This could allow a user to access privileged resources or resources out of context.\nCVE-2022-2475 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nCommunication traffic involving \"Ethernet Q Commands\" service of Haas Controller version 100.20.000.1110 is transmitted in cleartext. This allows an attacker to obtain sensitive information being passed to and from the controller.\nCVE-2022-41636 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMarco Balduzzi of Trend Micro and Francesco Sortino from Celada Spa reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHaas Automation recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:  \n\nLocate control system devices and/or systems behind firewalls and isolate them from business networks.\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nEnsure physical access controls are in place; only authorized end-users should have access to control systems.\n\nThe researcher recommends the following workarounds to reduce risk:\n\nAdd authentication to the “Ethernet Q Commands” service and use a strong enforced password.\nAdd encryption where possible to prevent data sniffing and capturing of the authentication password.\nLimit the number of macros that can be written.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-2474",
    "CVE-2022-41636",
    "CVE-2022-2475"
  ],
  "techniques": [],
  "advisory": "icsa-22-298-01",
  "title": "Haas Controller | CISA",
  "source": "ics-advisories",
  "id": "32aec09758e5b4475402e5a3ec6cc71c65ff3a8fdb4bd500532fbeca07022049"
}