{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.4\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: EcoStruxure\nVulnerability: Open Redirect\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to use this device as a platform to conduct a phishing attack.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of EcoStruxure, an IoT-enabled architecture and platform, are affected:\n\nEcoStruxure Power Monitoring Expert (PME) Version 8.2 (all editions),\nEcoStruxure Energy Expert 1.3 (formerly Power Manager),\nEcoStruxure Power SCADA Operation (PSO) 8.2 Advanced Reports and Dashboards Module,\nEcoStruxure Power Monitoring Expert (PME) Version 9.0,\nEcoStruxure Energy Expert Version 2.0, and\nEcoStruxure Power SCADA Operation (PSO) 9.0 Advanced Reports and Dashboards Module.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    URL REDIRECTION TO UNTRUSTED SITE ('OPEN REDIRECT') CWE-601\nVictims of phishing attacks can be redirected to a malicious websites via URL redirection.\nCVE-2018-7797 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Energy, Food and Agriculture, Government Facilities, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nDonato Onofri of Business Integration Partners S.p.A reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSchneider Electric recommends upgrading to the versions listed below, which include fixes for the reported vulnerability:\n\nPME 8.2 and Energy Expert 1.3 and PSO 8.2 with Advance Reports and Dashboard Module:\n\nhttps://schneider-electric.box.com/v/PME82-CU3-GeneralRelease\n\nPME 9.0 and Energy Expert 2.0 and PSO 9.0 with Advanced Reports and Dashboards Module:\n\nhttps://schneider-electric.box.com/v/PME90-CU1-18328-01\nFor more information refer to Schneider Electric’s security notification:\nhttps://www.schneider-electric.com/ww/en/download/document/SEVD-2018-347-01\nSchneider Electric also recommends the following cybersecurity best practices:\n\nLocate control and safety system networks and remote devices behind firewalls, and isolate them from the business network.\nPhysical controls should be in place so that no unauthorized person would have access to the ICS and safety controllers, peripheral equipment, or the ICS and safety networks.\nAll controllers should reside in locked cabinets and never be left in “Program” mode.\nAll programming software should be kept in locked cabinets and should never be connected to any network other than the network for the devices that it is intended.\nAll methods of mobile data exchange with the isolated network, such as CDs, USB drives, etc., should be scanned before use in the terminals or any node connected to these networks.\nLaptops that have connected to any other network besides the intended network should never be allowed to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nFor further information related to cybersecurity in Schneider Electric’s products, visit the company’s cybersecurity web page:\nhttp://www2.schneider-electric.com/sites/corporate/en/support/cybersecurity/cybersecurity.page\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-7797"
  ],
  "techniques": [],
  "advisory": "icsa-18-354-02",
  "title": "Schneider Electric EcoStruxure | CISA",
  "source": "ics-advisories",
  "id": "3aa1156d06bc83e1db2c67961f3ffcfac80ec5119a1c4b17ba648d454ba19ab7"
}