{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendors: Siemens and PKE\nEquipment: SiNVR/SiVMS Video Server\nVulnerabilities: Cleartext Storage in a File or on Disk, Path Traversal, Improper Input Validation, Weak Cryptography for Passwords\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-070-01 Siemens SiNVR 3 (Update A) that was published April 20, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in unauthorized access to server data and possible denial-of-service conditions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SiNVR/SiVMS Video Server, a video management solution, are affected:\n\nSiNVR 3 Central Control Server (CCS): All versions Moved to SSA-761844 and ICSA-21-103-10\nSiNVR/SiVMS Video Server: All versions prior to v5.0.0\nSiNVR/SiVMS Video Server: v5.0.0 and later is affected by CVE-2019-19298 and CVE-2019-19299\n\n--------- Begin Update B Part 1 of 2 ---------\n\nSiNVR/SiVMS Video Server: v5.0.0 and later is affected by CVE-2019-19299\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\nCVE-2019-19290, CVE-2019-19292, CVE-2019-19293, CVE-2019-19294, and CVE-2019-19295 have been moved to SSA-761844 and ICSA-21-103-10\n4.2.1    CLEARTEXT STORAGE IN A FILE OR ON DISK CWE-313\nThe FTP services of the SiNVR/SiVMS Video Server maintain log files that store login credentials in cleartext. In configurations where the FTP service is enabled, authenticated remote attackers could extract login credentials of other users of the service.\nCVE-2019-19291 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string  is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N). \n4.2.2    PATH TRAVERSAL CWE-22\nSuccessful exploitation could allow an authenticated remote attacker to access and download arbitrary files from the server if the FTP services are enabled.\nCVE-2019-19296 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string  is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:N).\n4.2.3    PATH TRAVERSAL CWE-22\nSuccessful exploitation could allow an authenticated remote attacker to access and download arbitrary files from the server.\nCVE-2019-19297 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string  is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.4    IMPROPER INPUT VALIDATION CWE-20\nSuccessful exploitation could allow an unauthenticated remote attacker to cause a denial-of-service condition by sending malformed HTTP requests.\nCVE-2019-19298 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string  is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.5    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThe affected product contains weak cryptography when exposing device passwords. This could allow an unauthenticated remote attacker to read and decrypt the passwords and conduct further attacks.\nCVE-2019-19299 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string  is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n•    CRITICAL INFRASTRUCTURE SECTORS: Information Technology\n•    COUNTRIES/AREAS DEPLOYED: Worldwide\n•    COMPANY HEADQUARTERS LOCATION: Germany\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\n--------- Begin Update B Part 2 of 2 ---------\nSiemens and PKE recommend users to update to v5.0.0 or later.\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nApply ACL/firewall configuration on the video servers to ensure only legitimate systems can access the configured server ports.\nHarden all systems accordingly to prevent unauthorized access.\nConsider applying encryption and authentication on the network (e.g., via TLS on application level or via IPSec on host level).\nDisable the two FTP services of the video server.\nThe update to v5.0.2 also provides an additional authentication feature that allows users to protect access to the streaming service via individual account names and passwords for every stream recorder. Users are encouraged to configure this feature accordingly. For details, see the release notes of v5.0.2\n\n--------- End Update B Part 2 of 2 ---------\nAs a general security measure Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. Siemens advises users to follow recommended security practices to run the devices in a protected IT environment.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens security advisory SSA-844761 and PKE security advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\nExercise principles of least privilege.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-19293",
    "CVE-2019-19290",
    "CVE-2019-19294",
    "CVE-2019-19296",
    "CVE-2019-19297",
    "CVE-2019-19295",
    "CVE-2019-19298",
    "CVE-2019-19291",
    "CVE-2019-19292",
    "CVE-2019-19299"
  ],
  "techniques": [],
  "advisory": "icsa-20-070-01",
  "title": "Siemens and PKE SiNVR/SiVMS Video Server (Update B) | CISA",
  "source": "ics-advisories",
  "id": "d2079e2ef07fc90deee219e62932f8a8bf5b2c6efc1c8ddbe3e3fac163f09eac"
}