{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Wind River\nEquipment: VxWorks\nVulnerabilities: Stack-based Buffer Overflow, Heap-based Buffer Overflow, Integer Underflow, Improper Restriction of Operations within the Bounds of a Memory Buffer, Race Condition, Argument Condition or Modification, Null Pointer Dereference, Argument Injection or Modification\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-211-01 Wind River VxWorks that was published July 30, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nWind River reports the following versions of VxWorks are affected:\n\nAll versions of VxWorks under CURRENT support (6.9.4.11, Vx7 SR540, Vx7 SR610) are affected by one or more of the CVE numbers detailed below.\nOlder, End-of-Life versions of VxWorks back to 6.5 are also affected by one or more of the CVE numbers below.\nAll versions of the discontinued product Advanced Networking Technology (ANT) are likely affected by one or more of the CVE numbers below.\nThe VxWorks bootrom network stack leverages the same IPnet source as VxWorks and, as a result, is also technically vulnerable to CVE-2019-12256. The same patches and mitigations apply to VxWorks and the bootrom network stack. However, the bootrom normally uses statically assigned IP-addresses, not DHCP. If that is true, then the defects related to those protocols do not apply in practice. Also a successful exploit of the bootrom network stack has a more difficult timing component. In typical applications, the bootrom does not listen to TCP-ports, which means that the TCP-related issues must be timed with the target downloading data from the network.\nVxWorks 653 MCE 3.x may be affected. Contact Wind River customer support (support@windriver.com) for more details.\n\nThe following VxWorks products are not affected:\n\nThe latest release of VxWorks, VxWorks 7 SR620, is NOT affected by any of these CVEs\nVxWorks 5.3 through VxWorks 6.4 inclusive are NOT affected.\nVxWorks Cert versions are NOT affected.\nVxWorks 653 Versions 2.x and earlier are NOT affected.\nVxWorks 653 MCE 3.x Cert Edition and later are NOT affected.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThis vulnerability resides in the IPv4 option parsing and may be triggered by IPv4 packets containing invalid options.\nThe most likely outcome of triggering this defect is that the tNet0 task crashes. This vulnerability can result in remote code execution.\nCVE-2019-12256 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nDHCP packets may go past the local area network (LAN) via DHCP-relays, but are otherwise confined to the LAN.\nThe DHCP-client may be used by VxWorks and in the bootrom. Bootrom, using DHCP/BOOTP, is only vulnerable during the boot-process.\nThis vulnerability may be used to overwrite the heap, which could result in a later crash when a task requests memory from the heap. This vulnerability can result in remote code execution.\nCVE-2019-12257 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    INTEGER UNDERFLOW (WRAP OR WRAPAROUND) CWE-191\nAn attacker can either hijack an existing TCP-session and inject bad TCP-segments or establish a new TCP-session on any TCP-port listened to by the target.\nThis vulnerability could lead to a buffer overflow of up to a full TCP receive-window (by default, 10k-64k depending on version). The buffer overflow occurs in the task calling recv()/recvfrom()/recvmsg().\nApplications that pass a buffer equal to or larger than a full TCP-window are not susceptible to this attack. Applications passing a stack-allocated variable as a buffer are the easiest to exploit.\nThe most likely outcome is a crash of the application reading from the affected socket, which could result in remote code execution.\nCVE-2019-12255 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.4    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThis vulnerability could lead to a buffer overflow of up to a full TCP receive-window (by default, 10k-64k depending on version). The buffer overflow happens in the task calling recv()/recvfrom()/recvmsg().\nApplications that pass a buffer equal to or larger than a full TCP-window are not susceptible to this attack. Applications passing a stack-allocated variable as a buffer are the easiest to exploit.\nThe most likely outcome is a crash of the application reading from the affected socket, which could result in remote code execution.\nCVE-2019-12260 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.5    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe impact of this vulnerability is a buffer overflow of up to a full TCP receive-window (by default, 10k-64k depending on version). The buffer overflow happens in the task calling recv()/recvfrom()/recvmsg().\nApplications that pass a buffer equal to or larger than a full TCP-window are not susceptible to this attack. Applications passing a stack-allocated variable as a buffer are the easiest to exploit.\nThe most likely outcome is a crash of the application reading from the affected socket, which could result in remote code execution.\nCVE-2019-12261 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.6    CONCURRENT EXECUTION USING SHARED RESOURCE WITH IMPROPER SYNCHRONIZATION ('RACE CONDITION') CWE-362\nThis vulnerability relies on a race-condition between the network task (tNet0) and the receiving application. It is very difficult to trigger the race on a system with a single CPU-thread enabled, and there is no way to reliably trigger a race on SMP targets.\nCVE-2019-12263 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.7    ARGUMENT INJECTION OR MODIFICATION CWE-88\nAn attacker with the source and destination TCP-port and IP-addresses of a session can inject invalid TCP-segments into the flow, causing the TCP-session to be reset.\nAn application will see this as an ECONNRESET error message when using the socket after such an attack.\nThe most likely outcome is a crash of the application reading from the affected socket.\nCVE-2019-12258 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.8    NULL POINTER DEREFERENCE CWE-476\nThis vulnerability requires that at least one IPv4 multicast address has been assigned to the target in an incorrect way (e.g., using the API intended for assigning unicast-addresses).\nAn attacker may use CVE-2019-12264 to incorrectly assign a multicast IP-address.\nAn attacker on the same LAN as the target system may use this vulnerability to cause a NULL-pointer dereference, which most likely will crash the tNet0 task.\nCVE-2019-12259 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:H).\n4.2.9    ARGUMENT INJECTION OR MODIFICATION CWE-88\nAn attacker residing on the LAN can send reverse-ARP responses to the victim system to assign unicast IPv4 addresses to the target.\nCVE-2019-12262 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:H).\n4.2.10    ARGUMENT INJECTION OR MODIFICATION CWE-88\nAn attacker residing on the LAN may choose to hijack a DHCP-client session that requests an IPv4 address. The attacker can send a multicast IP-address in the DHCP offer/ack message, which the victim system then incorrectly assigns.\nThis vulnerability can be combined with CVE-2019-12259 to create a denial-of-service condition.\nCVE-2019-12264 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n4.2.11    ARGUMENT INJECTION OR MODIFICATION CWE-88\nThe IGMPv3 reception handler does not expect packets to be spread across multiple IP-fragments.\nCVE-2019-12265 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Information Technology, Healthcare and Public Health, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nWind River, working with Armis researchers Gregory Vishnepolsky, Dor Zusman, and Ben Seri, reported these vulnerabilities to CISA.\n5. MITIGATIONS\nWind River has produced controls and patches to mitigate the reported vulnerabilities. To obtain patches, email PSIRT@windriver.com and indicate the VxWorks major version for which you need source patches.\nFor more detailed information on the vulnerabilities and the mitigating controls, please see the Wind River advisory at: https://www.windriver.com/security/announcements/tcp-ip-network-stack-ipnet-urgent11/\nAdditional vendors affected by the reported vulnerabilities have also released security advisories related to their affected products. Those advisories are as follows:\nRockwell Automation (login required) - https://rockwellautomation.custhelp.com/app/answers/detail/a_id/1088561\nXerox - https://security.business.xerox.com/en-us/news/wind-river-vxworks-ipnet-tcp-ip-stack-vulnerabilities/\n--------- Begin Update A Part 1 of 1 ---------\nDräger – https://static.draeger.com/security\nSchneider Electric – https://www.se.com/ww/en/download/document/SESB-2019-214-01/\n--------- End Update A Part 1 of 1 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-12255",
    "CVE-2019-12260",
    "CVE-2019-12257",
    "CVE-2019-12256",
    "CVE-2019-12259",
    "CVE-2019-12263",
    "CVE-2019-12258",
    "CVE-2019-12264",
    "CVE-2019-12262",
    "CVE-2019-12265",
    "CVE-2019-12261"
  ],
  "techniques": [],
  "advisory": "icsa-19-211-01",
  "title": "Wind River VxWorks (Update A) | CISA",
  "source": "ics-advisories",
  "id": "11d8b1e5166a2b8d9c7cbf36a3141ec6b170e9adf11824da0728f1dcf7a636bf"
}