{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: OPC Foundation Local Discovery Server of several industrial products\nVulnerability: Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-132-12 Siemens Industrial Products (Update B) that was published August 11, 2022, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a denial-of-service condition on the service or the device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the OPC Foundation Local Discovery Server of the following Siemens industrial products: \n\nSIMATIC NET PC Software v14: All versions prior to v14 SP1 Update 14\nSIMATIC NET PC Software v15: All versions\nSIMATIC NET PC Software v16: All versions prior to V16 Update 6\nSIMATIC NET PC Software v17: All versions prior to v17 SP1\nSIMATIC Process Historian OPC UA Server: All versions prior to 2020 SP1\nSIMATIC WinCC: All versions\n\n--------- Begin Update C Part 1 of 2 ---------\n\nSIMATIC WinCC Runtime Professional: All versions prior 10 v18\nSIMATIC WinCC Unified Scada Runtime: All versions prior 10 v18\n\n--------- End Update C Part 1 of 2 ---------\n\nTeleControl Server Basic v3: All versions prior to v3.1.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nIn OPC Foundation Local Discovery Server versions before 1.04.402.463, remote attackers can cause a denial-of-service condition by sending  targeted messages that lead to access of a memory location after the end of a buffer.\nCVE-2021-40142 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has released updates for several affected products and recommends updating to the latest versions. Siemens is preparing further updates and recommends specific countermeasures for products where updates are not, or not yet, available.\n\nSIMATIC NET PC Software v14: Update to v14 SP1 Update 14 or later version\nSIMATIC NET PC Software v16: Update to V16 Update 6 or later version\nSIMATIC NET PC Software v17: Update to v17 SP1 or later version\nSIMATIC Process Historian OPC UA Server: Update to Version 2020 SP1 or later version (see below)\n\nFor PCS neo: Update to PCS neo v3.1 SP1\nFor PCS 7: Update to PCS 7 v9.1 SP1\n\n\nFor WinCC: Contact Siemens support\n\n--------- Begin Update C Part 2 of 2 ---------\n\nSIMATIC WinCC Runtime Professional: Update to V18 or later version\nSIMATIC WinCC Unified Scada Runtime: Update to V18 or later version \n\n--------- End Update C Part 2 of 2 ---------\n\nTeleControl Server Basic V3: Update to V3.1.1 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nDeactivate the OPC Local Discovery Server service if supported by the product use case. The local discovery server service is not activated in the default configuration.\nUse a VPN for protecting network communication between cells.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-321292\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-40142"
  ],
  "techniques": [],
  "advisory": "icsa-22-132-12",
  "title": "Siemens Industrial Products (Update C) | CISA",
  "source": "ics-advisories",
  "id": "26fccf3dc0900dad91ec03a32004ef6aac5b703172a8458102e6a74aff172a9d"
}