{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 2.3\nATTENTION: Low skill level to exploit\nVendor: HMS Networks\nEquipment: Ewon Flexy and Cosy\nVulnerability: Permissive Cross-domain Policy with Untrusted Domains\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow attackers to retrieve limited confidential information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Ewon products are affected:\n\nFlexy and Cosy: All versions prior to 14.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PERMISSIVE CROSS-DOMAIN POLICY WITH UNTRUSTED DOMAINS CWE-942\nAffected devices use wildcards such as (*) under which domains can request resources. An attacker with local access and high privileges could inject scripts into the Cross-origin Resource Sharing (CORS) configuration that could abuse this vulnerability, allowing the attacker to retrieve limited confidential information through sniffing.\nCVE-2020-16230 has been assigned to this vulnerability. A CVSS v3 base score of 2.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Sweden\n\n3.4 RESEARCHER\nParth Srivastava of Protiviti India Member Private Limited reported this vulnerability to HMS Networks.\n4. MITIGATIONS\nHMS Networks recommends the following mitigations:\n\nUpdate firmware to the latest version available.\nUse secure Talk2M cloud solutions to create a VPN tunnel connecting Ewon devices remotely.\nDo not publicly expose the WAN IP of your devices on the internet.\nUse the WAN firewall, which is built into all Ewon devices.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nPractice principles of least privilege.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-16230"
  ],
  "techniques": [],
  "advisory": "icsa-20-254-03",
  "title": "HMS Networks Ewon Flexy and Cosy | CISA",
  "source": "ics-advisories",
  "id": "475485188e5f049b18e0b026de506858fd46485e2cbb20783ef157070df3c318"
}