{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.0\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: TIA Administrator (TIA Portal)\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an execution of some commands without proper authentication.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of TIA Administrator are affected:\n\nTIA Administrator: All versions prior to v1.0 SP1 Upd1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe integrated configuration web application (TIA Administrator) may allow an attacker to execute certain application commands without proper authentication.\nCVE-2019-10915 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nJoseph Bingham of Tenable reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends users update to v1.0 SP1 Upd1 or later.\n\nSiemens also recommends users restrict access to Port 8888/TCP to localhost (default).\n\nFor more information on this vulnerability and associated software updates, please see Siemens’ security advisory SSA-721298 at: https://www.siemens.com/cert/advisories.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-10915"
  ],
  "techniques": [],
  "advisory": "icsa-19-192-03",
  "title": "Siemens TIA Administrator (TIA Portal) | CISA",
  "source": "ics-advisories",
  "id": "f89b9d977aa2a560b2b0c76f85d6fba7c54c6a4562122f2832286bdc0c5a94af"
}