{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Phoenix Contact\nEquipment: ILC 131 ETH, ILC 131 ETH/XC, ILC 151 ETH, ILC 151 ETH/XC, ILC 171 ETH 2TX, ILC 191 ETH 2TX, ILC 191 ME/AN, and AXC 1050\nVulnerability: Missing Authentication for Critical Function\n\nCISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized attacker to change configurations, manipulate services, or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the classic line industrial controllers are affected:\n\nILC 1x0: All variants\nILC 1x1: All variants\nILC 3xx: All variants\nAXC 1050: Article number 2700988\nAXC 1050XC: Article number 2701295\nAXC 3050: Article number 2700989\nRFC 480S: Article number 2404577\nRFC 470S: Article number 2916794\nRFC 460R: Article number 2700784\nRFC 430 ETH: Article number 2730190\nRFC 450 ETH: Article number 2730200\nPC WORX SRT: Article number 2701680\nPC WORX RT BASIC: Article number 2700291\nFC 350 PCI ETH: Article number 2730844\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product does not feature a function to authenticate communication protocols, which could allow an unauthorized attacker to change or download the configuration, start or stop services, update or modify the firmware, or shut down the device.\nCVE-2019-9201 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSergiu Sechel reported this vulnerability to Phoenix Contact.\nDaniel dos Santos and Jos Wetzels of Forescout Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nPhoenix Contact has provided the following mitigations and workarounds:\n\nPhoenix Contact classic line controllers are designed and developed for use in closed industrial networks. The control and configuration protocols do not feature authentication mechanisms by design. Phoenix Contact recommends using the devices exclusively in closed networks, protected by a suitable firewall.\nIf the use of an affected controller in protected zones is not suitable, OT communication protocols should be disabled either by using the CPU services via console or web-based management according to the controller type.\nInformation for which controllers and from which firmware version communication protocols can be disabled are described in Phoenix Contact’s application note for classic line controllers, or the manual to the respective controller, which is available for download at the Phoenix Contact website.\n\nFor detailed information on Phoenix Contact’s recommendations for measures to protect network-capable devices, please refer to their application note for classic line controllers: \nMeasures to protect devices based on classic control technology\nController supporting CPU services or WBM for disabling communication protocols:\n\nILC 1x0: All variants, firmware: no fix\nILC 1x1: All variants, firmware: 4.42\nILC 1x1 GMS/GPRS: Article number2700977, firmware: 4.42\nILC 3xx: All variants, firmware 3.98\nAXC 1050: Article number 2700988, firmware 3.01, 5.00 (WBM)\nAXC 1050XC: Article number 2701295, firmware 3.01, 5.00 (WBM)\nAXC 3050: Article number 2700989, firmware 5.60, 6.30 (WBM)\nRFC 480S PN 4TX: Article number 2404577, firmware 6.10\nRFC 470 PN 3TX: Article number 291660, firmware 4.20\nRFC 470S PN 3TX: Article number 2916794, firmware 4.20\nRFC 460R PN 3TX: Article number 2700784, firmware 5.00\nRFC 460R PN 3TX-S: Article number 1096407, firmware 5.30\nRFC 430 ETH-IB: Article number 2730190, no fix\nRFC 450 ETH-IB: Article number 2730200, no fix\nPC WORX SRT: Article number 2701680, no fix\nPC WORX RT BASIC: Article number 2700291, no fix\nFC 350 PCI ETH: Article number 2730844, no fix\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-9201"
  ],
  "techniques": [],
  "advisory": "icsa-22-172-05",
  "title": "Phoenix Contact Classic Line Industrial Controllers | CISA",
  "source": "ics-advisories",
  "id": "9b50f642a2658c4bac5b2b427f3d5818130534eab21ce4e0008d299c13b43daa"
}