{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: GE/Emerson\nEquipment: PACSystems RX3i\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the system to change to halt-mode, resulting in a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nEmerson reports this vulnerability affects the following GE PACSystem products and versions:\n\nCPE100: All versions prior to R9.85\nCPE115: All versions prior to R9.85\nCPE302: All versions prior to R9.90\nCPE305: All versions prior to R9.90\nCPE310: All versions prior to R9.90\nCRU320: (End of Life; Upgrade to CPE330)\nCPE330: All versions prior to R9.90\nCPE400: All versions prior to R9.90\nCPL410: All versions prior to R9.90\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nSending specially manipulated packets can cause the module state to change to halt-mode, resulting in a denial-of-service condition. An operator must reboot the CPU module after removing battery or energy pack to recover from halt-mode.\nCVE-2019-13524 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Dams, Defense Industrial Base, Energy, Food and Agricultural, Government Facilities, Information Technology, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJin Kyung Lee and Yeop Chang of NSR (National Security Research Institute) reported this vulnerability to CISA.\n4. MITIGATIONS\nEmerson has acquired the affected products from GE. All inquiries should be directed to Emerson:\n1-888-565-4155\n1-434-214-8532 (if toll free 800 option is unavailable)\nTech Support:\nsupport.mas@emerson.com\nSales/Order Support:\ncustomercare.mas@emerson.com\nEmerson recommends users upgrade to the following versions:\n\nVersion R9.85\n\nCPE100 – Upgrade Kit: 41G2393-MS10-000-A5.zip\nCPE115 – Upgrade Kit: 41G2556-MS10-000-A2.zip\n\n\nVersion R9.90\n\nCPE302 – Upgrade Kit: CPE302_FW9_90_41G2552-FW01-000-A3.zip\nCPE305 – Upgrade Kit: CPE305_FW9_90_41G1733-MS10-000-A20.zip\nCPE310 – Upgrade Kit: CPE310_FW9_90_41G1734-MS10-000-A20.zip\nCPE330 – Upgrade Kit: CPE330_FW9_90_41G2016-FW01-000-A16.zip\nCPE400 – Upgrade Kit: CPE400_FW9_90_41G2376-FW01-000-A7.zip\nCPL410 – Upgrade Kit: CPL410_FW9_90_41G2617-FW01-000-A3.zip\n\n\n\n\nEmerson notes that CPU/CRU320 has reached end of life. They recommend users upgrade to CPE330.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13524"
  ],
  "techniques": [],
  "advisory": "icsa-20-014-01",
  "title": "GE PACSystems RX3i | CISA",
  "source": "ics-advisories",
  "id": "573000f660b1c586b284053ff94bb96d565741c41b04724c673e04b50d7fdcc8"
}