{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Schneider Electric\nEquipment: Easergy Studio\nVulnerability: Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain full control of a workstation.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Schneider Electric Easergy Studio, a software solution for configuring, monitoring, and managing control devices, are affected:\n\nEasergy Studio: Versions prior to v9.3.5\n\n3.2 Vulnerability Overview\n3.2.1 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA deserialization of untrusted data vulnerability exists in Schneider Electric Easergy Studio versions prior to v9.3.5 that could allow an attacker logged in with a user level account to gain higher privileges by providing a harmful serialized object.\nCVE-2023-7032 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nSina Kheirkhah (@SinSinology) of Summoning Team (@SummoningTeam) working with Trend Micro Zero Day Initiative reported this vulnerability to CISA.\n4. MITIGATIONS\nSchneider Electric has released the following mitigations/fixes for the following products:\n\nEasergy Studio: Version 9.3.6 of Easergy Studio includes a fix for this vulnerability and is available via SESU (Schneider Electric Software Update).\n\nCustomers of Schneider Electric should use appropriate patching methodologies when applying these patches to their systems. Schneider Electric strongly recommend the use of back-ups and evaluating the impact of these patches in a Test and Development environment or on an offline infrastructure. Contact Schneider Electric's Customer Care Center if assistance is needed in removing a patch.\nIf customers choose not to apply the remediation provided above, they should immediately apply Schneider Electric's General Security Recommendations to reduce the risk of exploit. For more information, see Schneider Electric SEVD-2024-009-02.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nJanuary 11, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-7032"
  ],
  "techniques": [],
  "advisory": "icsa-24-011-05",
  "title": "Schneider Electric Easergy Studio | CISA",
  "source": "ics-advisories",
  "id": "2725131b2bfdb9724ad87239809d648f2def8453a3b423d88293760843fd2485"
}