{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Rockwell Automation\nEquipment: Arena Simulation Software\nVulnerabilities: Incorrect Restriction of Operations within the Bounds of a Memory Buffer\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a malicious user to commit unauthorized arbitrary code to the software using a memory buffer overflow.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Rockwell Automation product is affected:\n\nArena Simulation Software: v16.20.01\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INCORRECT RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nRockwell Automation Arena Simulation software v16.00 is vulnerable due to a memory buffer overflow, which could allow a malicious user to commit unauthorized arbitrary code.\nCVE-2023-29460 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2 INCORRECT RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A  MEMORY BUFFER CWE-119\nRockwell Automation Arena Simulation software v16.00 is vulnerable due to a memory buffer overflow, which could allow a malicious user to commit unauthorized arbitrary code.\nCVE-2023-29461 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3 INCORRECT RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119 \nRockwell Automation Arena Simulation software v16.00 is vulnerable due to a memory buffer overflow, which could allow a malicious user to remotely execute arbitrary code. \nCVE-2023-29462 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSimon Janz of Trend Micro’s Zero Day Initiative reported these vulnerabilities to Rockwell Automation.\n4. MITIGATIONS\nRockwell Automation recommends upgrading the affected product software to 16.20.01.\nRockwell Automation encourages users to implement their suggested security best practices to minimize exploitation risk of these vulnerabilities.\nFor additional information, refer to Rockwell Automation’s Security Bulletin.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2023-29460",
    "CVE-2023-29461",
    "CVE-2023-29462"
  ],
  "techniques": [],
  "advisory": "icsa-23-131-10",
  "title": "Rockwell Automation Arena Simulation Software | CISA",
  "source": "ics-advisories",
  "id": "4f423ee627eac7d207490f5e686fe7936db7ccdf6b0fc7e32b2e97c54c825513"
}