{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC, SIMOTICS\nVulnerability: TOCTOU Race Condition \n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-224-05 Siemens SIMATIC, SIMOTICS that was published August 11, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to read a discrete set of traffic over the air after a Wi-Fi device state change.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATIC RF350M: All versions\nSIMATIC RF650M: All versions\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMOTICS CONNECT 400: All versions prior to 0.4.0.22\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    TIME-OF-CHECK TIME-OF-USE (TOCTOU) RACE CONDITION) CWE-367\nSpecially timed and crafted traffic can cause internal errors (related to state transitions) in a WLAN device that can lead to improper Layer 2 Wi-Fi encryption and information disclosure over the air for a discrete set of traffic. This issue was discovered on Broadcom Wi-Fi client devices.\nCVE-2019-15126 has been assigned to this vulnerability. A CVSS v3 base score of 3.1 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nSIMATIC RF350M and RF650M: Disable Wi-Fi, if possible\n\n--------- Begin Update A Part 2 of 2 ---------\n\nSIMOTICS CONNECT 400: Update to v0.4.0.22\n\n--------- End Update A Part 2 of 2 ---------\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-712518\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-15126"
  ],
  "techniques": [],
  "advisory": "icsa-20-224-05",
  "title": "Siemens SIMATIC, SIMOTICS (Update A) | CISA",
  "source": "ics-advisories",
  "id": "0e51b8773e199453d5a0c0d2a8b8ea0d7f418f6c0a4ab5ccd209e018e037716c"
}