{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Phoenix Contact\nEquipment: Emalytics Controller ILC 2050 BI(L)\nVulnerability: Incorrect Permission Assignment for Critical Resource\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to change the device configuration and start or stop services.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Emalytics Controller are affected:\n\nILC 2050 BI (Article number 2403160): all versions prior to 1.2.3\nILC 2050 BI-L (Article number 2404671): all versions prior to 1.2.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nThis device lacks proper permissions for read and write access to the configuration and start/stop services. \nCVE-2020-8768 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\n4. MITIGATIONS\nPhoenix Contact strongly recommends affected users update to engineering software Emalytics v1.2.3 or higher and recommission the controllers. The updated version is available on the vendor's product page.\nPlease see advisory number VDE-2020-001 from CERT@VDE for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-8768"
  ],
  "techniques": [],
  "advisory": "icsa-20-063-02",
  "title": "PHOENIX CONTACT Emalytics Controller ILC | CISA",
  "source": "ics-advisories",
  "id": "ee40dce7201b6aed71fd4a274b7ef1d60f20ded9634eacd0d4a8f8debc42eb6d"
}