{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 7.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: RTU500 Series\nVulnerabilities: Unrestricted Upload of File with Dangerous Type\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow the attacker to upload or transfer files of dangerous types that can be automatically processed within the product's environment.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hitachi's RTU500 series CMU Firmware are affected:\n\nRTU500 series CMU Firmware: Version 12.0.1 - 12.0.14\nRTU500 series CMU Firmware: Version 12.2.1 - 12.2.11\nRTU500 series CMU Firmware: Version 12.4.1 - 12.4.11\nRTU500 series CMU Firmware: Version 12.6.1 - 12.6.9\nRTU500 series CMU Firmware: Version 12.7.1 - 12.7.6\nRTU500 series CMU Firmware: Version 13.2.1 - 13.2.6\nRTU500 series CMU Firmware: Version 13.4.1 - 13.4.4\nRTU500 series CMU Firmware: Version 13.5.1 - 13.5.3\n\n3.2 Vulnerability Overview\n3.2.1 UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nA vulnerability exists in the stb-language file handling that affects the RTU500 series product versions listed below. A malicious actor could print random memory content in the RTU500 system log, if an authorized user uploads a specially crafted stb-language file.\nCVE-2024-1531 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:L/I:L/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-1531. A base score of 7.0 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:H/UI:N/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N).\n3.2.2 UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nA vulnerability exists in the stb-language file handling that affects the RTU500 series product versions listed below. A malicious actor could enforce diagnostic texts being displayed as empty strings, if an authorized user uploads a specially crafted stb-language file.\nCVE-2024-1532 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:N/I:N/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-1532. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:H/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy has released the following mitigations for CVE-2024-1531 and CVE-2024-1532:\n\nRTU500 series CMU Firmware Version 12.7.1 - 12.7.6: Update to CMU Firmware Version 12.7.7\nRTU500 series CMU Firmware Version 13.2.1 - 13.2.6: Update to CMU Firmware Version 13.2.7\n\nUntil the updates are made available, Hitachi Energy recommends the following general mitigation factors/workarounds for the products with RTU500 series CMU firmware Versions 12.0.1 - 12.0.14, 12.2.1 - 12.2.11, 12.4.1 - 12.4.11, 12.6.1 - 12.6.9, 13.4.1 - 13.4.4, and 13.5.1 - 13.5.3 to address the vulnerabilities CVE-2024-1531 and CVE-2024-1532:\n\nRecommended security practices and firewall configurations can help protect a process control network from attacks originating from outside the network including.\nPhysically protect process control systems from direct access by unauthorized personnel.\nDo not allow process control systems direct connections to the Internet.\nSeparate process control systems from other networks by means of a firewall system that has a minimal number of ports exposed.\nProcess control systems should not be used for Internet surfing, instant messaging, or receiving emails.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nFor more information, see Hitachi Energy's Security Advisories:\n\nCybersecurity Advisory Multiple Vulnerabilities in Hitachi Energy's RTU500 series Product\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. PUBLICATION HISTORY\n\nApril 25, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-1531",
    "CVE-2024-1532"
  ],
  "techniques": [],
  "advisory": "icsa-24-116-01",
  "title": "Multiple Vulnerabilities in Hitachi Energy RTU500 Series | CISA",
  "source": "ics-advisories",
  "id": "ff51e1b80bfedad5a0576e77e878bc60ff4823ee610cad2a734fd045ad57ff12"
}