{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Omron\nEquipment: PLC CJ and CS Series\nVulnerabilities: Authentication Bypass by Spoofing, Authentication Bypass by Capture-replay, Unrestricted Externally Accessible Lock\n\n2. UPDATE\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-346-02 Omron PLC CJ and CS Series (Update A) published November 29, 2022, on the ICS webpage at cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to pose as an authorized user to obtain the status information of the PLC.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Omron Programmable Logic Controllers are affected:\n\nOmron PLC CJ series, all versions\nOmron PLC CS series, all versions\nOmron PLC NX1P2 series, all versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    AUTHENTICATION BYPASS BY SPOOFING CWE-290\nAn attacker could spoof arbitrary messages or execute commands.\nCVE-2019-18259 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n\n4.2.2    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nAn attacker could monitor traffic between the PLC and the controller, and replay requests that could result in the opening and closing of industrial valves.\nCVE-2019-13533 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:L/A:H).\n--------- Begin Update B Part 1 of 1 ---------\n4.2.3 UNRESTRICTED EXTERNALLY ACCESSIBLE LOCK CWE-412 \nOmron’s CS and CJ series PLCs have an unrestricted externally accessible lock vulnerability. \nCVE-2019-18269 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H). \n--------- End Update B Part 1 of 1 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nJipeng You (XDU) and n0b0dy reported these vulnerabilities to CISA.\n5. MITIGATIONS\nOmron recommends the following mitigation measures:\n\nFilter FINS port: Protect access to Omron’s PLC with a firewall and blocking unnecessary remote access to FINS port (default: 9600).\nFilter IP addresses: Protect access to Omron’s PLC with a firewall and filtering devices connected to the PLC by IP address.\n\nFor more information provided by Omron on these vulnerabilities refer to Vulnerabilities in Omron CS and CJ series CPU PLCs.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-13533",
    "CVE-2019-18259",
    "CVE-2019-18269"
  ],
  "techniques": [],
  "advisory": "icsa-19-346-02",
  "title": "Omron PLC CJ and CS Series (Update B) | CISA",
  "source": "ics-advisories",
  "id": "94e61512de6ec24a464670a2c39f980db982e8da8ad8a14d3e78181ef2caaa6e"
}