{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: ABB\nEquipment: Central Licensing System (CLS)\nVulnerabilities: Information Exposure; Improper Restriction of XML External Entity Reference; Uncontrolled Resource Consumption; Permissions, Privilege, and Access Controls; Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to take control of the affected system node remotely and cause an affected CLS Server node to stop or prevent legitimate access to the affected CLS Server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following ABB CLS products and versions are affected:\n\nABB Ability System 800xA and related system extensions: Versions 5.1, 6.0, 6.1\nCompact HMI: Versions 5.1, 6.0\nControl Builder Safe: Versions 1.0, 1.1, 2.0\nABB Ability Symphony Plus – S+ Operations: Versions 3.0 to 3.2\nABB Ability Symphony Plus – S+ Engineering: Versions 1.1 to 2.2\nComposer Harmony: Versions 5.1, 6.0, 6.1\nComposer Melody (incl. SPE for Melody 1.0 SPx): Versions 5.3, 6.1, 6.2, 6.3\nHarmony OPC Server (HAOPC): Standalone Versions 6.0, 6.1, 7.0\nABB Ability System 800xA / Advant OCS Control Builder A: Versions 1.3, 1.4\nAdvant OCS AC 100 OPC Server: Versions 5.1, 6.0, 6.1\nComposer CTK: Versions 6.1, 6.2\nAdvaBuild: Versions 3.7 SP1, 3.7 SP2\nOPC Server MOD 300 (non-800xA): Version 1.4\nOPC Data Link: Versions 2.1, 2.2\nABB Ability Knowledge Manager: Versions 8.0, 9.0, 9.1\nABB Ability Manufacturing Operations Management: Versions 1812, 1909\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INFORMATION EXPOSURE CWE-200\nConfidential data is written in an unprotected file, which may allow an attacker to login to the affected node as a low privileged user and read confidential data from an unprotected file.\nCVE-2020-8481 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nThe affected products are vulnerable to an external entity injection, which may allow an attacker to read arbitrary files from the license server and/or from the network. An attacker could also block the license handling.\nCVE-2020-8479 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L).\n3.2.3    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe affected products are vulnerable to a denial-of-service attack, which may allow an attacker to successfully block license handling.\nCVE-2020-8475 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.2.4    PERMISSIONS, PRIVILEGES, AND ACCESS CONTROLS CWE-264\nThe affected products are vulnerable to elevation of privileges, which may allow an attacker to alter licenses assigned to system nodes. This could potentially lead to a situation where legitimate nodes in the system network are denied licenses.\nCVE-2020-8476 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.2.5    IMPROPER ACCESS CONTROL CWE-284\nThe affected products are vulnerable to weak file permissions, which may allow an attacker to block license handling, escalate privileges, and execute arbitrary code.\nCVE-2020-8471 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nWilliam Knowles of Applied Risk reported these vulnerabilities to ABB.\n4. MITIGATIONS\nABB recommends the following mitigations:\n\nUpgrade ABB CLS to the following versions:\n\n5.1 Rev A (5.1.0.38)\n5.1 Rev E (5.1.0.99)\n6.0 (6.0.0.26)\n6.0.3.3 (6.0.03000.192)\n6.1 RU1 (6.1.00100.417)\nIf ABB Central Licensing Server 5.1 (5.1.0.14) or earlier has been used on the currently used hardware, please contact ABB for further assistance.\n\n\nVulnerabilities pertaining to CVE-2020-8475 and CVE-2020-8476 will be corrected in future product versions. Updates will be added to this advisory once they become available.\nMethods for preventing unauthorized access to nodes on the CLS network include but are not limited to usage of IPSec and by separating the Client Server Network from other networks with firewalls.\nEnsure only authorized individuals have access to user accounts on the system nodes.\nInteractive login to service accounts should be blocked.\n\nFor more information, please see ABB's cybersecurity advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-8476",
    "CVE-2020-8471",
    "CVE-2020-8475",
    "CVE-2020-8479",
    "CVE-2020-8481"
  ],
  "techniques": [],
  "advisory": "icsa-20-154-04",
  "title": "ABB Central Licensing System | CISA",
  "source": "ics-advisories",
  "id": "6b732000f4d53338da6b656466bbc4e8f75220a2fc8c972f07d395c5af3ead0a"
}