{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.8\nATTENTION: Low attack complexity\nVendor: Schneider Electric\nEquipment: Schneider Electric Software Update (SESU)\nVulnerability: Insufficient Entropy\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause unintended connection from an internal network to an external network.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Schneider Electric Software Update, are affected:\n\nSchneider Electric Software Update: v2.3.0 through v2.5.1\n\nSchneider Electric Software Update is used by the following products:\n\nEcoStruxure Augmented Operator Advisor\nEcoStruxure Control Expert (formerly known as Unity Pro)\nEcoStruxure Process Expert (formerly known as EcoStruxure Hybrid Distributed Control System)\nEcoStruxure Machine Expert (formerly known as SoMachine or SoMachine Motion)\nEcoStruxure Machine Expert Basic\nEcoStruxure Operator Terminal Expert\nEcoStruxure Plant Builder\nEcoStruxure Power Design\nEcoStruxure Automation Expert\nEcoStruxure Automation Maintenance Expert\nEurotherm Data Reviewer\nEurotherm iTools\neXLhoist Configuration Software\nSchneider Electric Floating License Manager\nSchneider Electric License Manager \nHarmony XB5SSoft\nSoMove\nVersatile Software BLUE\nVijeo Designer\nOsiSense XX Configuration Software\nZelio Soft 2\n\nNote: This vulnerability affects all products listed above, but this is not a complete list of products. Some of the products might not deliver SESU as part of the product package; however, SESU can be downloaded and used to manage product updates. It may also be possible more components for one product are listed in the “SESU Managed Products” dialog for update.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENT ENTROPY CWE-331\nAn insufficient entropy vulnerability exists, which could cause unintended connection from an internal network to an external network when an attacker manages to decrypt the SESU proxy password from the registry.\nCVE-2021-22799 has been assigned to this vulnerability. A CVSS v3 base score of 3.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nNozomi Networks reported this vulnerability to CISA.\n4. MITIGATIONS\nSchneider Electric recommends the following:\n\nIf SESU is installed (assuming SESU is configured as “managed product” inside the SESU application) it will indicate a security update is available. Click to download and install the new SESU version.\nIf SESU is not installed, download SESU (automatic download) and follow the installation instructions.\n\nSchneider Electric strongly recommends observing the following industry cybersecurity best practices:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls so no unauthorized personnel can access your industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in the “Program” mode.\nNever connect programming software to any network other than the network intended for that device.\nScan all methods of mobile data exchange with the isolated network such as CDs, USB drives, etc. before use in the terminals or any node connected to these networks.\nNever allow mobile devices that have connected to any other network besides the intended network to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and systems and ensure they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN are only as secure as the connected devices.\n\nSee Schneider Electric Security Notification SEVD-2021-313-02 for more information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-22799"
  ],
  "techniques": [],
  "advisory": "icsa-21-336-01",
  "title": "Schneider Electric SESU | CISA",
  "source": "ics-advisories",
  "id": "13682cb342b081daf47a886d5e2bea815c8b3543ae5622bfdf2d92c6474dc66a"
}