{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity  \nVendor: Siemens  \nEquipment: SiPass integrated AC5100, AC5102, AC5200, ACC-AP, Granta-MK3  \nVulnerability: Improper Input Validation \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated user to escalate privileges by injecting arbitrary commands executed with root privileges. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following software from Siemens is affected: \n\nSiPass integrated AC5100 (ACC): All versions  \nSiPass integrated AC5102 (ACC-G2): All versions prior to V2.85.44 \nSiPass integrated AC5200 (ACC-Lite, ACC-4, ACC-8, ACC-16, ACC-32): All versions  \nSiPass integrated ACC-AP: All versions prior to V2.85.43 \nSiPass integrated Granta-MK3 (ACC-GRANTA): All versions  \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER INPUT VALIDATION CWE-20 \nAffected devices improperly sanitize user input on the telnet command line interface. This could allow an authenticated user to escalate privileges by injecting arbitrary commands executed with root privileges. \nCVE-2022-31808 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned. The CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nAirbus Security reported this vulnerability to Siemens. Siemens reported this vulnerability to CISA. \n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: \n\nSiPass integrated ACC-AP: Update to V2.85.43 or later version \nSiPass integrated AC5102 (ACC-G2): Update to V2.85.44 or later version \nSiPass integrated AC5100 (ACC): Currently no fix is planned \nSiPass integrated AC5200 (ACC-Lite, ACC-4, ACC-8, ACC-16, ACC-32): Currently no fix is planned \nSiPass integrated Granta-MK3 (ACC-GRANTA): Currently no fix is planned \nDisable telnet access \nSet individual passwords for the main accounts provided in the ACC firmware (SIEMENS, OPERATOR) \n\nAs a general security measure, Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices that run the devices in a protected IT environment.  \nFor further inquiries on security vulnerabilities in Siemens products and solutions, users should contact the Siemens ProductCERT.  \nFor more information, see the associated Siemens security advisory SSA-658793 in HTML and CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-31808"
  ],
  "techniques": [],
  "advisory": "icsa-23-047-05",
  "title": "Siemens SiPass integrated AC5102 / ACC-G2 and ACC-AP | CISA",
  "source": "ics-advisories",
  "id": "24ab8bc85e1ae308eb7e64e54926089a4a8df3559c7cbed6a63d7b66431795c5"
}