{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.7\nATTENTION: Low attack complexity\nVendor: AutomationDirect\nEquipment: DirectLOGIC with Serial Communication\nVulnerability: Cleartext Transmission of Sensitive Information\n\n2. UPDATE OR REPOSTED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22.167-02 AutomationDirect DirectLOGIC with Serial Communication that was published June 16, 2022, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a loss of sensitive information and unauthorized changes.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of DirectLOGIC with serial communication, a programmable controller, are affected:\n\nThe following D0-06 series CPUs, prior to v2.72: \n\nD0-06DD1\nD0-06DD2\nD0-06DR\nD0-06DA\nD0-06AR\nD0-06AA\nD0-06DD1-D\nD0-06DD2-D\nD0-06DR-D\nD0-06DD2-D\nD0-06DR-D\n\n\n\n--------- Begin Update A part 1 of 2 ---------\n\nD0-05DD: All versions prior to V5.41\nD0-05DR: All versions prior to V5.41\nD0-05DA: All versions prior to V5.41\nD0-05AR: All versions prior to V5.41\nD0-05AA: All versions prior to V5.41\nD0-05AD: All versions prior to V5.41\nD0-05DD-D: All versions prior to V5.41\nD0-05DR-D: All versions prior to V5.41\nD2-230: All versions\nD2-240: All versions\nD2-250: All versions\nD2-250-1: All versions prior to V4.91\nD2-260: All versions prior to V2.71\nD2-262: All versions prior to V1.06\nD3-350: All versions\nD4-430: All versions\nD4-440: All versions\nD4-450: All versions\nD4-454: All versions prior to V1.04\nF1-130AA: All versions\nF1-130AD: All versions\nF1-130DA: All versions\nF1-130DD: All versions\nF1-130DD-D: All versions\nF1-130DR-D: All versions\nF1-130AR: All versions\nF1-130DR: All versions\n\n--------- End Update A part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe product is vulnerable to a specifically crafted serial message to the CPU serial port that will cause the PLC to respond with the PLC password in cleartext. This could allow an attacker to access and make unauthorized changes.\nCVE-2022-2003 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nSam Hanson of Dragos reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A part 2 of 2 ---------\nAutomationDirect recommends the following mitigations for the affected products:\n\nUpdate all D0-06 series CPUs to firmware version 2.72 or later\nUpdate all DL05 series CPUs to firmware version 5.41 or later\nD2-230/240/250 is obsolete and cannot be upgraded. AutomationDirect recommends upgrading to a newer PLC (D2-262 or newer PLC families; CLICK, Do-more/BRX and Productivity Series).\nUpdate D2-250-1 to firmware version 4.91 or later\nUpdate D2-260 to firmware version 2.71 or later\nUpdate D2-262 to firmware version 1.06 or later\nD3-350 is obsolete and cannot be upgraded. AutomationDirect recommends upgrading to a newer PLC (D2-262 or newer PLC families; CLICK, Do-more/BRX and Productivity Series).\nD4-430/440/450 is obsolete and cannot be upgraded. AutomationDirect recommends upgrading to a newer PLC (D4-454 or newer PLC families; CLICK, Do-more/BRX and Productivity Series).\nUpdate D4-454 to firmware version 1.04 or later\nAll DL105 CPUs (F1-130xx) are obsolete and cannot be upgraded. AutomationDirect recommends upgrading to a newer PLC (CLICK, Do-more/BRX and Productivity Series).\n\nAll DirectLogic PLC firmware can be found on the Product Firmware page. The updated firmware will no longer respond with the password when requested with the specially crafted message.\nAdditional brute force mitigation for password access has also been added. Three incorrect password entries will result in a 3 hour lock out of password entry. Power cycling will allow subsequent password attempts.\n--------- End Update A part 2 of 2 ---------\nWhile automation networks and systems have built-in password protection schemes, this is only one step in securing the affected systems. Automation control system networks must incorporate data protection and security measures at least as robust as a typical business computer system. AutomationDirect recommends users of PLCs, HMI products, and other SCADA system products perform independent network security analysis to determine the proper level of security required for the application.\nAutomationDirect has identified the specific mitigation actions listed below:\n\nSecure physical access.\nIsolate and air gap networks when possible.\nConsider some of the AutomationDirect newer PLC families.\n\nUsers should refer to the following link for supporting information related to security considerations.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-2003"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-02",
  "title": "AutomationDirect DirectLOGIC with Serial Communication (Update A) | CISA",
  "source": "ics-advisories",
  "id": "8b733ed0e82e5910e62cd6486f4c23a1a5d00d1d5edf2fc370ee1968e31d0775"
}