{
  "markdown": "\nOverview\nSiemens has reported to ICS-CERT that denial-of-service (DoS) vulnerabilities exist in the SIMATIC S7-400 V6 and SIMATIC S7-400 V5 PN CPU products. Siemens has produced a firmware update that mitigates the vulnerability affecting the S7-400 V6.\nSiemens will not fix the vulnerability that affects the S7-400 V5 because that product version has reached end-of-life and has been discontinued.\nBoth vulnerabilities could be exploited remotely.\nAffected Products\nSiemens reports that one of the vulnerabilities affects the following products within the S7-400 CPU family with firmware Versions 6.0.1 and 6.0.2\n\nCPU 412-2 PN (6ES7412-2EK06-0AB0)\nCPU 414-3 PN/DP (6ES7414-3EM06-0AB0)\nCPU 414F-3 PN/DP (6ES7414-3FM06-0AB0)\nCPU 416-3 PN/DP (6ES7416-3ES06-0AB0)\nCPU 416F-3 PN (6ES7416-3FS06-0AB0)\n\nAnother vulnerability affects the following products within the S7-400 CPU family with firmware Version 5:\n\nCPU 414-3 PN/DP (6ES7414-3EM05-0AB0)\nCPU 416-3 PN/DP (6ES7416-3ER05-0AB0)\nCPU 416F-3 PN/DP (6ES7416-3FR05-0AB0)\n\nImpact\nWhen specially crafted packets are received on Ethernet interfaces by the SIMATIC S7-400, the device can default into defect mode. A PLC in defect mode needs to be manually reset to return to normal operation.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nProducts in the Siemens SIMATIC S7-400 CPU family have been designed for process control in industrial environments such as manufacturing, power generation and distribution, food and beverages, and chemical industries worldwide.\nVulnerability Characterization\nVulnerability Overview\nDenial of ServiceCWE-404: Improper Resource Shutdown or Release, http://cwe.mitre.org/data/definitions/404.html, Web site last accessed July 30, 2012.\nWhen the Ethernet port on a SIMATIC S7-400 V6 receives a malformed IP packet, the device could go into the defect mode. The SIMATIC S7-400 V6 CPU defect mode locks out the unit so that it is not available for process control. An attacker could use this vulnerability to perform a DoS attack.\nCVE-2012-3016 has been assigned to this vulnerability. A CVSS v2 base score of 7.8 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:N/A:C).\nVulnerability Details\nExploitability\nThese vulnerabilities could be exploited remotely.\nExistence of Exploit\nNo known public exploits specifically target these vulnerabilities.\nDifficulty\nAn attacker with a low skill could exploit these vulnerabilities.\nMitigation\nSiemens has released security advisories (SSA-589272 and SSA-617264) that detail the vulnerabilities in the two SIMATIC S7-400 CPU and the recommended security practices to secure the systems.\nSiemens provided firmware update V6.0.3CPU 412-2 PN, http://support.automation.siemens.com/WW/view/en/45645157, Website last visited July 26, 2012., CPU 414-3 PN/DP, CPU 414F-3 PN/DP, http://support.automation.siemens.com/WW/view/en/45645228, Website last visited July 30, 2012., CPU 416-3 PN/DP, CPU 416F-3 PN, http://support.automation.siemens.com/WW/view/en/45645229, Website last visited July 30, 2012. that closes the vulnerability affecting the S7-400 V6 by fixing the flawed packet processing implementation.\nSiemens is not providing a firmware update for SIMATIC S7-400 V5 PN CPUs because this version has reached end-of-life and has been discontinued.\nICS-CERT encourages asset owners to take the following additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP Web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01A—Cyber Intrusion Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2012-3016"
  ],
  "techniques": [],
  "advisory": "icsa-12-212-02",
  "title": "Siemens SIMATIC S7-400 PN CPU DoS | CISA",
  "source": "ics-advisories",
  "id": "3ead74b75184d02e447439ac0922495292296381013f0a3689a9aeb2a872fbaf"
}