{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Siemens \nEquipment: Mendix Email Connector \nVulnerability: Improper Access Control \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated remote attacker to read and manipulate sensitive information. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens Mendix Email Connector, a software management platform, are affected: \n\nMendix Email Connector: Versions prior to 2.0.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER ACCESS CONTROL CWE-284 \nSiemens Mendix Email Connector versions prior to 2.0.0 improperly handle access control for some module entities, which could allow an authenticated remote attacker to read and manipulate sensitive information. \nCVE-2022-45936 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens prepared an updated fix and recommends users update to Mendix Email Connector version 2.0.0 or later. \nSiemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk: \n\nDo not use the default user role of the module. \n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends  configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.  \nFor more information, see Siemens Security Advisory SSA-224632 in HTML or CSAF. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2022-45936"
  ],
  "techniques": [],
  "advisory": "icsa-22-349-17",
  "title": "Siemens Mendix Email Connector | CISA",
  "source": "ics-advisories",
  "id": "235e0e7544e1447a918fc3eff788934c2cc637335f87db3b7a339ff3edd075a0"
}