{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.6\n\nATTENTION: Low skill level to exploit\nVendor: Delta Electronics\nEquipment: Delta Industrial Automation TPEditor\nVulnerabilities: Out-of-bounds Write, Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the accessed device, resulting in a buffer overflow condition that may allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Delta Industrial Automation TPEditor, a programming software for Delta text panels operating on Windows, are affected:\n\nTPEditor Versions 1.90 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nMultiple stack-based buffer overflow vulnerabilities may be exploited by processing specially crafted project files lacking user input validation before copying data from project files onto the stack and may allow an attacker to remotely execute arbitrary code.\nCVE-2018-17929 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H).\n3.2.2    OUT-OF-BOUNDS WRITE CWE-787\nMultiple out-of-bounds write vulnerabilities may be exploited by processing specially crafted project files lacking user input validation, which may cause the system to write outside the intended buffer area and may allow remote code execution.\nCVE-2018-17927 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTOR: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nAriele Caltabiano (kimiya) of 9SG Security Team and Mat Powell working with Trend Micro’s Zero Day Initiative (ZDI) reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nDelta Electronics recommends affected users update to the latest version of Delta Industrial Automation TPEditor, Version 1.91, which is available for download at: http://www.deltaww.com/Products/PluginWebUserControl/downloadCenterCounter.aspx?DID=4536&DocPath=1&hl=en-US.\nDelta Electronics also recommends affected users restrict the interaction with the application to trusted files.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-17927",
    "CVE-2018-17929"
  ],
  "techniques": [],
  "advisory": "icsa-18-284-03",
  "title": "Delta Industrial Automation TPEditor | CISA",
  "source": "ics-advisories",
  "id": "345fb3d53a13f0bb6ce63612b1d4456b4ab605992847ac885a0ecd0c861c6f56"
}