{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Kunbus\nEquipment: PR100088 Modbus gateway\n\nVulnerabilities: Improper Authentication, Information Exposure Through Query Strings in GET Request, Missing Authentication for Critical Function, Improper Input Validation, Cleartext Storage of Sensitive Information\n\n\n2.   UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-19-036-05 (Update A) Kunbus PR100088 Modbus Gateway that was published February 7, 2019, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to achieve remote code execution and/or cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of PR100088 Modbus gateway are affected:\n\nPR100088 Modbus gateway: All versions prior to Release R02 (or Software Version 1.1.13166)\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHENTICATION CWE-287\nAn attacker may be able change the password for an admin user who is currently or previously logged in, provided the device has not been restarted.\nCVE-2019-6527 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n4.2.2    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nRegisters used to store Modbus values can be read and written from the web interface without authentication.\nCVE-2019-6533 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H)\n4.2.3    IMPROPER INPUT VALIDATION CWE-20\nAn attacker could specially craft an FTP request that could crash the device.\nCVE-2019-6529 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n4.2.4    INFORMATION EXPOSURE THROUGH QUERY STRINGS IN GET REQUEST CWE-598\nAn attacker could retrieve passwords from an HTTP GET request if the attacker is in an MITM position.\nCVE-2019-6531 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n4.2.5    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nAn attacker could retrieve plain-text credentials stored in an XML file through FTP.\nCVE-2019-6549 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nNicolas Merle of Applied Risk reported these vulnerabilities to NCCIC. NCCIC coordinated these vulnerabilities with BSI Germany.\n5. MITIGATIONS\nKunbus recommends the following:\n--------- Begin Update B Part 1 of 1 ---------\n\nUpdate to Version R03: the updated file can be downloaded from here (Install instructions can be found in the readme file included in the download): https://www.kunbus.de/sicherheitshinweise/update-ii-sicherheitshinweis-f%C3%BCr-gateway-modul-modbus-tcp-slave-art-nr-100088.html?file=files/media/bugfixes/SU_100088_R03.zip\n\n--------- End Update B Part 1 of 1 ---------\n\nThese devices are not intended to be used in a public network. Rather, these devices are intended for use in an industrial environment with a protected network architecture.\n\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6533",
    "CVE-2019-6549",
    "CVE-2019-6531",
    "CVE-2019-6529",
    "CVE-2019-6527"
  ],
  "techniques": [],
  "advisory": "icsa-19-036-05",
  "title": "Kunbus PR100088 Modbus Gateway (Update B) | CISA",
  "source": "ics-advisories",
  "id": "8923c329bd0e2ba131d3ce3352d7b7cdaa802c7e809edfe2a51e4f38d76b832b"
}