{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SIMATIC, SINAMICS\nVulnerabilities: Uncontrolled Search Path Element, Heap-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-161-05 Siemens SIMATIC, SINAMICS (Update B) that was published December 8, 2020, to the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to affect the availability of the devices under certain conditions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATIC PCS 7: All versions including v8.2 and prior\nSIMATIC PCS 7 v9.0: All versions prior to 9.0 SP3\n\n--------- Begin Update C Part 1 of 2 ---------\n\nSIMATIC PDM: All versions prior to 9.2\n\n--------- End Update C Part 1 of 2 ---------\n\nSIMATIC STEP 7 v5.X: All versions prior to 5.6 SP2 HF3\nSINAMICS STARTER (containing STEP 7 OEM version): All versions prior to 5.4 HF2\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nThe affected product is vulnerable to DLL hijacking, which may allow an attacker with local access to execute code with elevated privileges.\nCVE-2020-7585 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe affected product is vulnerable to a stack-based buffer overflow, which may allow an attacker with local access to cause a denial-of-service condition.\nCVE-2020-7586 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nUri Katz of Claroty reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens recommends applying updates, where available:\n\nSIMATIC STEP 7 v5.X: Update to v5.6 SP2 HF3 or later\nSINAMICS STARTER (containing STEP 7 OEM version): Update to v5.4 HF2 or later\nSIMATIC PCS 7 v9.0: Update to v9.0 SP3 (Software can be obtained by contacting local support)\n\n--------- Begin Update C Part 2 of 2 ---------\n\nSIMATIC PDM: Update to v9.2 or later\n\n--------- End Update C Part 2 of 2 ---------\nSiemens recommends the following to reduce the risk:\n\nRestrict access to project files on the engineering station to trusted users.\nOnly use project files from trusted sources.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-689942\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-7585",
    "CVE-2020-7586"
  ],
  "techniques": [],
  "advisory": "icsa-20-161-05",
  "title": "Siemens SIMATIC, SINAMICS (Update C) | CISA",
  "source": "ics-advisories",
  "id": "b58697dfdc2836d10151f3b4e6ad062b4ca5bb0f4ea0704eece909499c80e6b1"
}