{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable from an adjacent network/low attack complexity\nVendor: Siemens\nEquipment: Devices using the PROFINET Discovery and Configuration Protocol (DCP)\nVulnerabilities: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-17-129-02 Siemens PROFINET DCP (Update U) that was published October 14, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause the targeted device to enter a denial-of-service condition, which may require human interaction to recover the system.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports these vulnerabilities affect the following products using PROFINET DCP:\n\nDevelopment/Evaluation Kits DK Standard Ethernet Controller: All versions prior to v4.1.1 Patch04\nDevelopment/Evaluation Kits for PROFINET IO EK-ERTEC 200: All versions prior to v4.2.1 Patch03\nDevelopment/Evaluation Kits for PROFINET IO EK-ERTEC 200P: All versions prior to v4.4.0 Patch01\n IE/AS-i Link PN IO: All versions\nIE/PB-Link: All versions prior to v3.0\nSCALANCE M-800 / S615: All versions prior to v04.03\nSCALANCE W700: All versions prior to v6.1\nSCALANCE X408: All versions prior to v4.1.0\nSCALANCE X414: All versions prior to v3.10.2\nSCALANCE X-200 switch family (incl. SIPLUS NET variants): All versions prior to v5.2.2\nSCALANCE X-200IRT switch family (incl. SIPLUS NET variants): All versions prior to v5.4.0\nSCALANCE X-300 switch family (incl. SIPLUS NET variants): All versions prior to v4.1.0\nSCALANCE XM-400, XR-500 families: All versions prior to v6.1\nSIMATIC CM 1542-1: All versions prior to v2.0\nSIMATIC CM 1542SP-1: All versions prior to v1.0.15\nSIMATIC CP 343-1 (incl. SIPLUS variants): All versions prior to v3.1.3\nSIMATIC CP 343-1 Advanced (incl. SIPLUS variants): All versions\nSIMATIC CP 343-1 Lean (incl. SIPLUS variants): All versions prior to v3.1.3\nSIMATIC CP 443-1 (incl. SIPLUS variants): All versions prior to v3.2.17\nSIMATIC CP 443-1 Advanced (incl. SIPLUS variants): All versions prior to v3.2.17\nSIMATIC CP 443-1 OPC-UA: All versions\nSIMATIC CP 1243-1 (incl. SIPLUS variants): All versions prior to v2.1.82\nSIMATIC CP 1243-1 DNP3 (incl. SIPLUS variants): All versions\nSIMATIC CP 1243-1 IEC (incl. SIPLUS variants): All versions\nSIMATIC CP 1243-1 IRC (incl. SIPLUS variants): All versions prior to v2.1.82\nSIMATIC CP 1542SP-1 IRC (incl. SIPLUS variants): All versions prior to v1.0.15\nSIMATIC CP 1543-1 (incl. SIPLUS variants): All versions prior to v2.1\nSIMATIC CP 1543SP-1 (incl. SIPLUS variants): All versions prior to v1.0.15\nSIMATIC CP 1604: All versions prior to v2.7\nSIMATIC CP 1616: All versions prior to v2.7\nSIMATIC DK-16xx PN IO: All versions prior to v2.7\nSIMATIC ET 200AL: All versions prior to v1.0.2\nSIMATIC ET200ecoPN, 4AO U/I 4xM12 (6ES7145-6HD00-0AB0): All versions\nSIMATIC ET200ecoPN, 8 DIO, DC24V/1,3A, 8xM12 (6ES7147-6BG00-0AB0): All versions\nSIMATIC ET200ecoPN, 8 DO, DC24V/2A, 8xM12 (6ES7142-6BR00-0AB0): All versions\nSIMATIC ET200ecoPN, 8AI RTD/TC 8xM12 (6ES7144-6KD50-0AB0): All versions\nSIMATIC ET200ecoPN, 8AI; 4 U/I; 4 RTD/TC 8xM12 (6ES7144-6KD00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DI, DC24V, 4xM12 (6ES7141-6BF00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DI, DC24V, 8xM12 (6ES7141-6BG00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DO, DC24V/0,5A, 4xM12 (6ES7142-6BF50-0AB0): All versions\nSIMATIC ET200ecoPN, 8DO, DC24V/1,3A, 4xM12 (6ES7142-6BF00-0AB0): All versions\nSIMATIC ET200ecoPN, 8DO, DC24V/1,3A, 8xM12 (6ES7142-6BG00-0AB0): All versions\nSIMATIC ET200ecoPN, 16DI, DC24V, 8xM12 (6ES7141-6BH00-0AB0): All versions\nSIMATIC ET200ecoPN, 16DO DC24V/1,3A, 8xM12 (6ES7142-6BH00-0AB0): All versions\nSIMATIC ET200ecoPN: IO-Link Master (6ES7148-6JA00-0AB0): All versions\nSIMATIC ET200M (incl. SIPLUS variants): All versions\nSIMATIC ET200MP IM155-5 PN BA (incl. SIPLUS variants): All versions prior to v4.0.1\nSIMATIC ET200MP IM155-5 PN HF (incl. SIPLUS variants): All versions prior to v4.2\nSIMATIC ET200MP IM155-5 PN ST (incl. SIPLUS variants): All versions prior to v4.1\nSIMATIC ET200pro: All versions\nSIMATIC ET200S (incl. SIPLUS variants): All versions\nSIMATIC ET200SP (incl. SIPLUS variants, except IM155-6 PN ST and IM155-6 PN HF): All versions\nSIMATIC ET200SP IM155-6 PN HF (incl. SIPLUS variants): All versions prior to v4.2.0\nSIMATIC ET200SP IM155-6 PN HS (incl. SIPLUS variants): All versions prior to v4.0.1\nSIMATIC ET200SP IM155-6 PN ST (incl. SIPLUS variants): All versions prior to v4.1.0\nSIMATIC HMI Comfort Panels, HMI Multi Panels, HMI Mobile Panels (incl. SIPLUS variants): All versions prior to v15.1\nSIMATIC MV400 family: All versions prior to v7.0.6\nSIMATIC PN/PN Coupler (incl. SIPLUS NET variants): All versions prior to v4.0\nSIMATIC RF650R: All versions prior to v3.0\nSIMATIC RF680R: All versions prior to v3.0\nSIMATIC RF685R: All versions prior to v3.0\nSIMATIC S7-200 SMART: All versions prior to v2.3\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to v3.X.14\nSIMATIC S7-400 H V6 CPU family (incl. SIPLUS variants): All versions prior to v6.0.7\nSIMATIC S7-400 PN/DP V6 CPU family (incl. SIPLUS variants): All versions prior to v6.0.6\nSIMATIC S7-400 PN/DP V7 CPU family (incl. SIPLUS variants): All versions prior to v7.0.2\nSIMATIC S7-410 CPU family (incl. SIPLUS variants): All versions prior to v8.2\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): All versions prior to v4.2.1\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to v2.1\nSIMATIC S7-1500 Software Controller (incl. F): All versions prior to v2.1\nSIMATIC TDC CP51M1: All versions prior to v1.1.8\nSIMATIC TDC CPU555: All versions prior to v1.1.1\nSIMATIC Teleservice Adapter IE Advanced: All versions\nSIMATIC Teleservice Adapter IE Basic: All versions\nSIMATIC Teleservice Adapter IE Standard: All versions\nSIMATIC WinAC RTX (F) 2010: All versions prior to SIMATIC WinAC RTX 2010 SP3\nSIMOCODE pro V PN (incl. SIPLUS variants): All versions prior to v2.0.0\nSIMOTION (incl. SIPLUS variants): All versions prior to v4.5 HF1\nSINAMICS DCM w. PN: All versions prior to v1.4 SP1 HF5\nSINAMICS DCP w. PN: All versions prior to v1.2 HF1\nSINAMICS G110M w. PN: All versions prior to v4.7 SP6 HF3\nSINAMICS G120(C/P/D) w. PN (incl. SIPLUS variants): All versions prior to v4.7 SP6 HF3\nSINAMICS G130 v4.7 w. PN: All versions prior to v4.7 HF27\nSINAMICS G130 v4.8 w. PN: All versions prior to v4.8 HF4\nSINAMICS G150 v4.7 w. PN: v4.7: All versions prior to v4.7 HF27\nSINAMICS G150 v4.8 w. PN: All versions prior to v4.8 HF4\nSINAMICS S110 w. PN: All versions prior to V4.4 SP3 HF5\nSINAMICS S120 prior to v4.7 w. PN (incl. SIPLUS variants): All versions prior to v4.7\nSINAMICS S120 v4.7 SP1 w. PN (incl. SIPLUS variants): All versions\nSINAMICS S120 v4.7 w. PN (incl. SIPLUS variants): All versions prior to v4.7 HF27\nSINAMICS S120 v4.8 w. PN (incl. SIPLUS variants): All versions prior to v4.8 HF4\nSINAMICS S150 v4.7 w. PN: All versions prior to v4.7 HF27\nSINAMICS S150 v4.8 w. PN: All versions prior to v4.8 HF4\nSINAMICS V90 w. PN: All versions prior to v1.01\nSINUMERIK 828D v4.5 and prior: All versions prior to v4.5 SP6 HF2\nSINUMERIK 828D v4.7: All versions prior to v4.7 SP4 HF1\nSINUMERIK 840D sl v4.5 and prior: All versions prior to v4.5 SP6 HF2\nSINUMERIK 840D sl v4.7: All versions prior to v4.7 SP4 HF1\nSIRIUS ACT 3SU1 interface module PROFINET: All versions prior to v1.1.0\nSIRIUS Motor Starter M200D PROFINET: All versions\nSIRIUS Soft Starter 3RW44 PN: All versions\nSITOP PSU8600 PROFINET: All versions prior to v1.2.0\nSITOP UPS1600 PROFINET (incl. SIPLUS variants): All versions prior to v2.2.0\nSoftnet PROFINET IO for PC-based Windows systems: All versions prior to v14 SP1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1 UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nSpecially crafted PROFINET DCP broadcast packets could cause a denial-of-service condition of affected products on a local Ethernet segment (Layer 2). Human interaction is required to recover the systems. PROFIBUS interfaces are not affected..\nCVE-2017-2680 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2 UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nSpecially crafted PROFINET DCP packets sent on a local Ethernet segment (Layer 2) to an affected product could cause a denial-of-service condition in that product. Human interaction is required to recover the system. PROFIBUS interfaces are not affected.\n\nThis vulnerability affects only SIMATIC HMI Multi Panels and HMI Mobile Panels, and S7-300/S7-400 devices.\n\nCVE-2017-2681 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nDuan JinTong, Ma ShaoShuai, and Cheng Lei from the NSFOCUS Security Team reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nThe attacker must have network access to the local Ethernet segment (Layer 2).\nSiemens provides firmware updates fixing these vulnerabilities for the following affected products and recommends users update to the new fixed version:\n\nDevelopment/Evaluation Kits DK Standard Ethernet Controller: Update to v4.1.1 Patch04\nDevelopment/Evaluation Kits EK-ERTEC 200P PN IO: Update to v4.4.0 Patch01\nDevelopment/Evaluation Kits EK-ERTEC 200 PN IO: Update to v4.2.1 Patch03\nIE/PB-Link: Update to v3.0\nSCALANCE M-800, S615: Update to v04.3\nSCALANCE W700: Update to v6.1.0\nSCALANCE X-300/X408: Update to v4.1.0\nSCALANCE X414: Update to v3.10.2\nSCALANCE X-200: Update to v5.2.2\nSCALANCE X-200IRT: Update to v5.4.0\nSCALANCE XM-400: Update to v6.1\nSCALANCE XR-500: Update to v6.1\nSIMATIC DK-16xx PN IO: Update to v2.7\nSIMATIC ET 200AL: Update to v1.0.2\nSIMATIC ET 200MP IM155-5 PN BA: Update to v4.0.1 or newer\nSIMATIC ET 200MP IM155-5 PN HF: Update to v4.2\nSIMATIC ET 200MP IM155-5 PN ST: Update to v4.1\n\n--------- Begin Update V Part 1 of 1 ---------\n\nSIMATIC ET 200SP: No remediation is currently planned\n\n--------- End Update V Part 1 of 1 ---------\n\nSIMATIC ET 200SP IM155-6 PN HF: Update to v4.2.0\nSIMATIC ET 200SP IM155-6 PN HS: Update to v4.0.1\nSIMATIC ET 200SP IM155-6 PN ST: Update to v4.1.0\nSIMATIC HMI Comfort Panels, HMI Multi Panels, HMI Mobile Panels: Update to v15.1\nSIMATIC MV400 family: Update to v7.0.6\nSIMATIC NET CM 1542-1: Update to v2.0\nSIMATIC NET CM 1542SP-1: Update to v1.0.15\nSIMATIC NET CP 343-1 Std and SIMATIC NET CP 343-1 Lean: Update to v3.1.3\nSIMATIC NET CP 443-1 Advanced: Update to v3.2.17\nSIMATIC NET CP 443-1 Standard: Update to v3.2.17\nSIMATIC NET CP 1243-1 and SIMATIC NET CP 1243-1 IRC: Update to v3.1\nSIMATIC NET CP 1542SP-1, CP 1542SP-1 IRC, and CP 1543SP-1: Update to v1.0.15\nSIMATIC NET CP 1543-1: Update to v2.1\nSIMATIC NET CP 1604, 1616: Update to v2.8.0\nSIMATIC PN/PN Coupler: Update to v4.0\nSIMATIC RF650R, RF680R, RF685R: Update to v3.0\nSIMATIC S7-200 SMART: Contact a Siemens representative or customer support to update to v2.3\nSIMATIC S7-300 CPU family: Update to v3.X.14\nSIMATIC S7-400 H V6 CPU family: Update to v6.0.7\nSIMATIC S7-400 PN/DP V6 CPU family: Update to v6.0.6\nSIMATIC S7-400 PN/DP V7 CPU family: Update to v7.0.2\nSIMATIC S7-410 CPU family: Update to v8.2\nSIMATIC S7-1200 including F: Update to v4.2.1\nSIMATIC S7-1500 including F, T and TF: Update to v2.1\nSIMATIC S7-1500 Software Controller including F: Update to v2.1\nSIMATIC TDC CP51M1: Update to v1.1.8\nSIMATIC TDC CPU555: Update to v1.1.1\nSIMATIC Teleservice Adapters (IE Basic, IE Standard, IE Advanced): migrate to a successor product within the SCALANCE M-800 family. For details refer to the notice of discontinuation.\nSIMATIC WinAC RTX (F) 2010: Update to SIMATIC WinAC RTX 2010 SP3 and apply BIOS and Microsoft Windows updates\nSIMOCODE pro V PN: Update to v2.0.0\nSIMOTION: Update to v4.5 HF1\nSINAMICS DCM w. PN: Update to v1.4 SP1 HF5\nSINAMICS DCP w. PN: Update to v1.2 HF1\nSINAMICS G110M/G120(C/P/D) w. PN: Update to v4.7 SP6 HF3\nSINAMICS G130 and G150 v4.7: Update to v4.7 HF27\nSINAMICS G130 and G150 v4.8: Update to v4.8 HF4\nSINAMICS S110 w. PN: Update to v4.4 SP3 HF5\nSINAMICS S120 v4.7: Update to v4.7 HF27\nSINAMICS S120 v4.8: Update to v4.8 HF4\nSINAMICS S150 v4.7: Update to v4.7 HF27\nSINAMICS S150: v4.8: Update to v4.8 HF4\nSINAMICS v90 w. PN: Update to v1.1\nSINUMERIK 828D v4.5: Update to v4.5 SP6 HF2\nSINUMERIK 828D v4.7: Update to v4.7 SP4 HF1\nSINUMERIK 840D sl v4.5 and prior: Update to v4.5 SP6 HF8\nSINUMERIK 840D sl v4.7: Update to v4.7 SP4 HF1\n\nSINUMERIK software updates listed above can be obtained from a Siemens account manager.\n\nSIRIUS ACT 3SU1 interface module PROFINET: Update to v1.1.0\nSITOP PSU8600 PROFINET: Update to v1.2.0\nSITOP UPS1600 PROFINET: Update to v2.2.0\nSoftnet PROFINET IO for PC-based Windows systems: Update to v14 SP1\n\nSiemens is preparing updates for the remaining affected products and recommends the following mitigations in the meantime:\n\nApply cell protection concept.\nUse VPN for protecting network communication between cells.\nApply defense-in-depth.\n\nAs a general security measure Siemens strongly recommends protecting industrial control systems networks with appropriate mechanisms. Siemens strongly recommends verifying the affected products are protected as described in PROFINET Security Guidelines and Siemens Operational Guidelines in order to run the devices in a protected IT environment.\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-293562\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2017-2681",
    "CVE-2017-2680"
  ],
  "techniques": [],
  "advisory": "icsa-17-129-02",
  "title": "Siemens PROFINET DCP (Update V) | CISA",
  "source": "ics-advisories",
  "id": "f91e693092125108cae553aa54247c297e238e591c1c9348f6774bca507e6cfb"
}