{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Sequi\nEquipment: Sequi PortBloque S\nVulnerabilities: Improper Authentication, Improper Authorization\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in unauthorized changes to device configuration, to include adding new users or changing existing passwords for persistent access to the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Sequi PortBloque S, a serial Modbus firewall, are affected:\n\nSequi PortBloque S: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe affected product has improper authentication issues which may allow an attacker to bypass the authentication process and gain user-level access to the device.\nCVE-2022-2662 has been assigned to this vulnerability. A CVSS v3 base score of 9.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.2.2    IMPROPER AUTHORIZATION CWE-285\nThe affected product has an improper authorization vulnerability, which may allow a low-privileged user to perform administrative functions using specifically crafted requests.\nCVE-2022-2661 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nByron Chaney of Accenture Security reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAs of August 9, 2022, Sequi has not responded to requests to work with CISA to mitigate these vulnerabilities. Users of this affected product should contact Sequi for additional information.\nCISA will update this ICSA to reflect any patches, updates, or mitigation information Sequi provides in the future.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-2662",
    "CVE-2022-2661"
  ],
  "techniques": [],
  "advisory": "icsa-22-228-07",
  "title": "Sequi PortBloque S | CISA",
  "source": "ics-advisories",
  "id": "490bdd9cf9a3f25b46277a23f77081cf6568650faa87f9da6c85a3373a17c601"
}