{
  "markdown": "\nOverview\nICS-CERT has received a report from independent security researchers Billy Rios and Terry McCorkle concerning ICONICS GENESIS32 and BizViz products. This vulnerability involves a design issue in a GENESIS32 ActiveX control that can set an arbitrary domain to the trusted zone. ICONICS has validated the researchers’ claims for multiple versions of GENESIS32 and BizViz.\nICS-CERT has coordinated this vulnerability report with ICONICS and they have released a patch that addresses the vulnerability. The researchers have validated that the patch mitigates the reported vulnerabilities.\nAffected Products\nAccording to ICONICS, this vulnerability exists in two ICONICS products. The products and versions affected are:\n\nGENESIS32 – Version 9.21, including Workbench / WebHMI components\nBizViz – Version 9.21\n\nImpact\nSuccessful exploitation of this vulnerability could result in arbitrary domain intrusion into the trusted zone, introducing the potential for remote code execution.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on the environment, architecture, and product implementation.\nBackground\nICONICS is a US-based company that maintains offices in several countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia.\nThe affected products, GENESIS32 and BizViz, are web-based SCADA systems. According to ICONICS, GENESIS32 is deployed across several sectors including manufacturing, building automation, oil and gas, water and wastewater, electric utilities, and others. ICONICS estimates that these products are primarily used in the United States and Europe with a small percentage in Asia.\nVulnerability Characterization\nVulnerability Overview\nExploitation of the ICONICS GENESIS Workbench32/WebHMI component SetTrustedZone Policy vulnerability requires creation of a website that can load and use the IcoSetServer ActiveX control in a way that inserts an arbitrary domain into the Trusted Zone.\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo known exploits specifically target this vulnerability.\nDifficulty\nAn attacker would require at least a moderate skill level to perform a code-execution exploit of the SetTrustedZone policy vulnerability.\nMitigation\nThe patch and ICONICS whitepaper are available from the ICONICS website. ICONICS has two mitigations available for this vulnerability:\n\nCustomers can upgrade their product to Version 9.22.\nCustomers with Version 9.21 can apply the patch included with the Version 9.21 Security Updates download, which is available on ICONICS website. ICONICS has included a “readme” file with the download that provides instructions for applying the patch.\n\nIn addition to the patch, ICONICS has also released an updated version of their “Whitepaper on Security Vulnerabilities” that includes details of this vulnerability.\nICS-CERT encourages asset owners to minimize network exposure for all control system devices. Critical devices should not directly face the Internet. Locate control system networks and remote devices behind firewalls and isolate them from the business network. When remote access is required, use secure methods such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\nUse previous recommendations as needed. List the any other information products that might be specific to the topic. In addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nThe CSSP also provides a section for control system security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-182-01",
  "title": "ICONICS GENESIS32 and BizViz ActiveX Trusted Zone Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "3e7ef378ea55220ab5c40ebd8014d4ca7379e955f7b76b7a6f0e5c97af850ce6"
}