{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Rockwell Automation\nEquipment: Allen-Bradley MicroLogix 1100 and 1400\nVulnerabilities: Predictable Value Range from Previous Values; Reusing a Nonce, Key Pair in Encryption; Information Exposure; Improper Restriction of Excessive Authentication Attempts; Weak Password Requirements\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on April 25, 2017, and is being released to the ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following versions of the Allen-Bradley MicroLogix 1100 programmable-logic controller are affected:\n\n1763-L16AWA, Series A and B, Version 16.00 and prior versions;\n1763-L16BBB, Series A and B, Version 16.00 and prior versions;\n1763-L16BWA, Series A and B, Version 16.00 and prior versions; and\n1763-L16DWD, Series A and B, Version 16.00 and prior versions.\n\nThe following versions of the Allen-Bradley MicroLogix 1400 programmable logic controller are affected:\n\n1766-L32AWA, Series A and B, Version 16.00 and prior versions;\n1766-L32BWA, Series A and B, Version 16.00 and prior versions;\n1766-L32BWAA, Series A and B, Version 16.00 and prior versions;\n1766-L32BXB, Series A and B, Version 16.00 and prior versions;\n1766-L32BXBA, Series A and B, Version 16.00 and prior versions; and\n1766-L32AWAA, Series A and B, Version 16.00 and prior versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow a remote attacker to gain unauthorized access to the affected programmable logic controllers and to spoof or disrupt TCP connections.\nMITIGATION\nRockwell Automation has released a new firmware version for the Allen-Bradley MicroLogix 1400 Series B controllers, FRN 21.00, to address the identified vulnerabilities. Rockwell Automation encourages users to apply the latest firmware versions that address the identified vulnerabilities.\nRockwell Automation’s new firmware version for the Allen-Bradley MicroLogix 1400 Series B controllers, FRN 21.00, is available at the following location:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?Keyword=1766-Lxx&crumb=112\nThere are no firmware versions to address these vulnerabilities in the Allen-Bradley MicroLogix 1100 or MicroLogix 1400 Series A controllers, but Rockwell Automation has offered some compensating controls. Rockwell Automation reports that users can disable the web server on the Allen-Bradley MicroLogix 1100 and 1400 Series A controllers to protect against the exploitation of the improper restriction of excessive authentication attempts and weak password requirements vulnerabilities.\nRockwell Automation recommends that if it is not needed, users should consider disabling the web server to further mitigate these threats.\n\nDisable the web server on the MicroLogix 1100 and 1400 controllers, if not needed, as it is enabled by default. See Knowledge Base article: 732398 for detailed instructions on disabling the web server. The Web Server Tech Note, KB: 732398 – How to Disable the Web Server in MicroLogix 1100 and 1400 is available at the following URL with a valid account:\n\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/732398\n\nSet the mode to RUN via LCD soft keyswitch to prohibit any re-enabling of the web server while the keyswitch is in this mode.\n\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nPREDICTABLE VALUE RANGE FROM PREVIOUS VALUES CWE-343\n\nInsufficiently random TCP initial sequence numbers are generated, which may allow an attacker to predict the numbers from previous values. This may allow an attacker to spoof or disrupt TCP connections, resulting in a denial of service for the target device.\nCVE-2017-7901 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:L/A:L).\n\nREUSING A NONCE, KEY PAIR IN ENCRYPTION CWE-323\n\nThe affected product reuses nonces, which may allow an attacker to capture and replay a valid request until the nonce is changed.\nCVE-2017-7902 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:L).\n\nINFORMATION EXPOSURE CWE-200\n\nUser credentials are sent to the web server using the HTTP GET method, which may result in the credentials being logged. This could make user credentials available for unauthorized retrieval.\nCVE-2017-7899 has been assigned to this vulnerability. A CVSS v3 base score of 3.1 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:U/C:L/I:L/A:N).\n\nIMPROPER RESTRICTION OF EXCESSIVE AUTHENTICATION ATTEMPTS CWE-307\n\nThere are no penalties for repeatedly entering incorrect passwords.\nCVE-2017-7898 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nWEAK PASSWORD REQUIREMENTS CWE-521\n\nThe affected products use a numeric password with a small maximum character size for the password.\nCVE-2017-7903 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nThese vulnerabilities were reported to ICS-CERT by Rockwell Automation, David Formby and Raheem Beyah of Georgia Tech and Fortiphyd Logic, Inc. Rockwell Automation also reported a vulnerability that was initially identified by Ilya Karpov of Positive Technologies.\nBACKGROUND\nCritical Infrastructure Sectors: Food and Agriculture, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Milwaukee, Wisconsin\n",
  "cves": [
    "CVE-2017-7898",
    "CVE-2017-7901",
    "CVE-2017-7902",
    "CVE-2017-7903",
    "CVE-2017-7899"
  ],
  "techniques": [],
  "advisory": "icsa-17-115-04",
  "title": "Rockwell Automation Allen-Bradley MicroLogix 1100 and 1400 | CISA",
  "source": "ics-advisories",
  "id": "20a655d192fd7d208355e5b6b7741f0fbf2ad78ae520bf5f649998c93cbb6754"
}