{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.2\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: Modicon M221\nVulnerability: Insufficient Verification of Data Authenticity\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause a change of IPv4 configuration (IP address, mask, and gateway) when remotely connected to the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following Modicon products: \n\nModicon M221, all versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nImproper implementation of the network configuration module in UMAS protocol, which may allow an attacker to intercept a target PLC’s network traffic by remotely modifying configuration parameters. \nCVE-2018-7798 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nEran Goldstein of CRITIFENCE reported this vulnerability to NCCIC.\n4. MITIGATIONS\nSchneider Electric recommends the following mitigations to reduce the risk:\n\nSet up a firewall blocking all remote/external access to Port 502. \nWithin the Modicon M221 application, users should disable all unused protocols, especially programming protocol, as described in section “Configuring Ethernet Network” of SoMachine Basic online help. This will prevent remote programming of the M221 PLC.\n\nSchneider Electric’s security notice SEVD-2018-270-01 is available at the following location:\nhttps://www.schneider-electric.com/en/download/document/SEVD-2018-270-01/\nSchneider Electric also recommends the following industry cybersecurity practices:\n\nLocate control and safety system networks and remote devices behind firewalls, and isolate them from the business network. \nPhysical controls should be in place so that no unauthorized person would have access to the ICS and safety controllers, peripheral equipment or the ICS and safety networks. \nAll controllers should reside in locked cabinets and never be left in the “Program” mode. \nAll programming software should be kept in locked cabinets and should never be connected to any network other than the network for the devices that it is intended. \nAll methods of mobile data exchange with the isolated network such as CDs, USB drives, etc., should be scanned before use in the terminals or any node connected to these networks. \nLaptops that have connected to any other network besides the intended network should never be allowed to connect to the safety or control networks without proper sanitation. \nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet. \nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. \n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-7798"
  ],
  "techniques": [],
  "advisory": "icsa-18-324-02",
  "title": "Schneider Electric Modicon M221 | CISA",
  "source": "ics-advisories",
  "id": "3b467424e1acf432f3228ab7155414142d215e1d615982f157db12ba87a1112c"
}