{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: WAGO\nEquipment: 750-88x and 750-352\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-308-01 WAGO Series 750-88x and 750-352 that was published November 3, 2020, to the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to crash the device being accessed using a denial-of-service attack.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe firmware versions prior to FW11 of the following WAGO Series products are affected:\n\n750-352\n750-831/xxx-xxx\n750-852\n750-880/xxx-xxx\n750-881\n750-889\n\n--------- Begin Update A Part 1 of 1 ---------\n\n750-331/xxx-xxx\n750-829\n750-882\n750-885\n\n--------- End Update A Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nAn attacker can execute a denial-of-service attack by sending a series of maliciously constructed packets to HTTP(S) Ports 80/443, which may cause the device to crash. \nCVE-2020-12516 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States, Germany, Switzerland, Poland, China, India\n\n4.4 RESEARCHER\nWilliam Knowles (Applied Risk) of CERT@VDE reported this vulnerability to WAGO.\n5. MITIGATIONS\nWAGO recommends updating to the latest firmware, Version FW14\nOther mitigations and workarounds are available to help reduce the risk:\n\nRestrict network access to the device.\nDo not directly connect the device to the Internet.\nDisable unused TCP/UDP ports.\n\nCERT@VDE has published an advisory regarding this vulnerability.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-12516"
  ],
  "techniques": [],
  "advisory": "icsa-20-308-01",
  "title": "WAGO Series 750-88x and 750-352 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "a308e6e0d733ca94a5496a79de14fb29d515ef3099d6330d3b50c771f57b0ea6"
}