{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 2.5\nATTENTION: Exploitable locally\nVendor: Mitsubishi Electric Corporation\nEquipment: GX Works2\nVulnerability: Denial-of-Service\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a Denial-of-service (DoS) due to improper input validation in the simulation function of GX Works2 by sending specially crafted packets.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n\nGX Works2: all versions\n\n3.2 Vulnerability Overview\n3.2.1 Improper Input Validation CWE-20\nAn attacker may be able to cause denial-of-service (DoS) condition on the function by sending specially crafted packets. However, the attacker would need to send the packets from within the same personal computer where the function is running.\nCVE-2023-5274 has been assigned to this vulnerability. A CVSS v3.1 base score of 2.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:L).\n3.2.2 Improper Input Validation CWE-20\nAn attacker may be able to cause denial-of-service (DoS) condition on the function by sending specially crafted packets. However, the attacker would need to send the packets from within the same personal computer where the function is running.\nCVE-2023-5275 has been assigned to this vulnerability. A CVSS v3.1 base score of 2.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\njoker63 of ZheJiangQiAnTechnology reported these vulnerabilities to Mitsubishi Electric.\n4. MITIGATIONS\nMitsubishi Electric recommends that users take the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\n\nInstall an antivirus software in your personal computer using the affected product.\n\n\nUse your personal computer with the affected product within the LAN and block remote login from untrusted networks, hosts, and users.\n\n\nWhen connecting your personal computer with the affected product to the Internet, use a firewall, virtual private network (VPN), etc., to prevent unauthorized access, and allow only trusted users to remote login.\n\n\nDon't open untrusted files or click untrusted links.\nFor more information, see the Mitsubishi security advisory.\n\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. These vulnerabilities have a high attack complexity.\n5. UPDATE HISTORY\n\nNovember 28, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-5275",
    "CVE-2023-5274"
  ],
  "techniques": [],
  "advisory": "icsa-23-331-03",
  "title": "Mitsubishi Electric GX Works2 | CISA",
  "source": "ics-advisories",
  "id": "50af16006ca4958fbd5d5c48bfab231169cb580eff9c157d518e0832fade1878"
}