{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: AutomationDirect\nEquipment: C-more EA9 HMI\nVulnerabilities: Uncontrolled Search Path Element, Cleartext Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause a loss of sensitive information and the ability to run code execution with elevated privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of C-more EA9, an industrial touch screen HMI, are affected:\n\nC-more EA9 with the following part numbers, all versions prior to 6.73: \n\nEA9-T6CL\nEA9-T6CL-R\nEA9-T7CL\nEA9-T7CL-R\nEA9-T8CL\nEA9-T10CL\nEA9-T10WCL\nEA9-T12CL\nEA9-T15CL\nEA9-T15CL-R\nEA9-RHMI\nEA9-PGMSW \n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nThe affected product has a DLL vulnerability in the install directory that may allow an attacker to execute code during the installation process.\nCVE-2022-2006 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe affected products’ HTTP webserver uses an insecure mechanism to transport credentials from client to web server, which may allow an attacker to obtain the login credentials and login as a valid user.\nCVE-2022-2005 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSam Hanson of Dragos reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAutomationDirect recommends users upgrade to firmware Version 6.73 or later, which supports TLS security options for the webserver.\nWhile automation networks and systems have built-in password protection schemes, this is only one step in securing the affected systems. Automation control system networks must incorporate data protection and security measures at least as robust as a typical business computer system. AutomationDirect recommends users of PLCs, HMI products, and other SCADA system products perform independent network security analysis to determine the proper level of security required for the application.\nAutomationDirect has identified the following mitigations for instances where systems cannot be upgraded to Version 6.73 or later:\n\nThe Webserver feature can be disabled on the HMI using the programming software.\nPlace the HMI panel behind a VPN: Access to and from critical control system assets in the modern environment is usually LAN based, but still should be considered remote if the operator is traversing across different networks. virtual private networking (VPN) is often considered the best approach in securing trans-network communication.\n\nPlease refer to the following link for supporting information related to security considerations.\nFor additional information, please refer to AutomationDirect Product Advisory.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-2006",
    "CVE-2022-2005"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-01",
  "title": "AutomationDirect C-More EA9 HMI | CISA",
  "source": "ics-advisories",
  "id": "25cb7dacfc5ba9b6ce43c959d48f27afbff2fb7df40abd37c7efc5ffa14c6593"
}