{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SINEMA Remote Connect (Client and Server)\nVulnerabilities: Incorrect Calculation of Buffer Size, Out-of-bounds Read, Stack-based Buffer Overflow, Improper Handling of Insufficient Permissions\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-099-04 Siemens SINEMA Remote Connect that was published April 9, 2019, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to circumvent the system authorization for certain functionalities, and to execute privileged functions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected: \n\nSINEMA Remote Connect Client; all versions prior to v2.0 HF1\nSINEMA Remote Connect Server; all versions prior to v2.0\n\nNote that not every product listed above is affected by every vulnerability described below. Please see the Siemens advisory for more detail.\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INCORRECT CALCULATION OF BUFFER SIZE CWE-131\nThe HTTP client curl is vulnerable to a buffer overrun.\nThe vulnerability could be exploited by an attacker providing a malicious HTTP server. Successful exploitation requires no system privileges. User interaction by a legitimate use is required to exploit the vulnerability. An attacker could use the vulnerability to compromise confidentiality, integrity and availability of the affected device.\nCVE-2018-14618 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H) \n4.2.2    OUT-OF-BOUNDS READ CWE-125\nThe HTTP client library libcurl is vulnerable to a heap buffer out-of-bounds read. \nThe vulnerability could be exploited by an attacker providing a malicious HTTP server. Successful exploitation requires no system privileges and no user interaction. An attacker could use the vulnerability to compromise availability of the affected system.\nCVE-2018-16890 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.3    STACK-BASED BUFFER OVERFLOW CWE-121\nThe HTTP client library libcurl is vulnerable to a stack-based buffer overflow.\nThe vulnerability could be exploited by an attacker providing a malicious HTTP server. Successful exploitation requires no system privileges and no user interaction. An attacker could use the vulnerability to compromise confidentiality, integrity and availability of the affected system.\nCVE-2019-3822 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n--------- Begin Update A Part 1 of 1 ---------\n4.2.4    OUT-OF-BOUNDS READ CWE-125\nThe libcurl library versions 7.34.0 to and including 7.63.0 are vulnerable to a heap out-of-bounds read in the code handling the end-of-response for SMTP.  This vulnerability could allow an attacker to trigger a denial-of-service condition on the affected devices.\nCVE-2019-3823 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n--------- End Update A Part 1 of 1 ---------\n4.2.5    IMPROPER HANDLING OF INSUFFICIENT PERMISSIONS CWE-280\nDue to insufficient checking of user permissions, an attacker may access URLs that require special authorization.\nThe vulnerability could be exploited by an attacker with network access to the affected system. An attacker must have access to a low privileged account to exploit the vulnerability. An attacker could use the vulnerability to compromise confidentiality, integrity and availability of the affected system.\nCVE-2019-6570 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens ProductCERT reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens currently has updates for the following products: \n\nSINEMA Remote Connect Client: Update to v2.0 HF1 \nSINEMA Remote Connect Server: Update to v2.0 \n\nSiemens recommends users apply the following specific workarounds and mitigations to reduce the risk:\n\nTurn off NTLM authentication to mitigate CVE-2018-16890 and CVE-2019-3822\nTurn off SMTP to mitigate CVE-2019-3822\nApply defense-in-depth strategies.\n\nSiemens recommends users configure their environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-436177\nFor further inquiries on security vulnerabilities in Siemens products and solutions, please contact Siemens ProductCERT.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6570",
    "CVE-2018-14618",
    "CVE-2019-3822",
    "CVE-2018-16890",
    "CVE-2019-3823"
  ],
  "techniques": [],
  "advisory": "icsa-19-099-04",
  "title": "Siemens SINEMA Remote Connect (Update A) | CISA",
  "source": "ics-advisories",
  "id": "7313fbe0c4d0b5b5ff0683963bc8f29ee07a14fca698967cfe2333928dc0d029"
}