{
  "markdown": " Schneider Electric VAMPSET Buffer Overflow \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisorySchneider Electric VAMPSET Buffer Overflow========================================== Last Revised September 06, 2018 Alert Code ICSA\\-14\\-254\\-01OVERVIEW-------- Aivar Liimets of Martem AS has identified a buffer overflow vulnerability in Schneider Electric’s VAMPSET software product. He reported it directly to Schneider Electric who reported it to NCCIC/ICS\\-CERT once the problem was fixed. Schneider Electric has produced an update that mitigates this vulnerability. Mr. Liimets has tested the update to validate that it resolves the vulnerability.AFFECTED PRODUCTS----------------- The following Schneider Electric versions are affected:* VAMPSET, v2\\.2\\.136 and all previous versions.IMPACT------ VAMPSET software halts when trying to open a corrupted file. Even though Windows operating system remains operational, VAMPSET does not respond until the corresponding process is terminated. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Schneider Electric corporate headquarters is located in Paris, France, and maintains offices in more than 100 countries worldwide. The affected product, VAMPSET software, is used to configure and maintain multiple protection relays and arc monitoring units. According to Schneider Electric, this product is deployed in the Energy sector. Schneider Electric estimates that this product is used on all continents, in some 60 countries world\\-wide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### STACK\\-BASED BUFFER OVERFLOWCWE\\-121: Stack\\-based Buffer Overflow, http://cwe.mitre.org/data/definitions/121\\.html, web site last accessed September 11, 2014\\. The vulnerability in VAMPSET is caused by opening corrupted VAMPSET setting files or disturbance recording files. This vulnerability causes VAMPSET to become halted when trying to open a corrupted file. The Windows operating system remains operational while VAMPSET does not respond until the corresponding process is terminated. CVE\\-2014\\-5407NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-5407 , NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 4\\.1 has been assigned; the CVSS vector string is (AV:L/AC:M/Au:S/C:P/I:P/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:L/AC:M/Au:S/C:P/I:P/A:P, web site last accessed September 11, 2014\\.### VULNERABILITY DETAILS#### EXPLOITABILITY The exploit is only triggered when a local user runs the vulnerable application and loads the malformed VAMPSET setting file.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY Crafting a working exploit for this vulnerability would be difficult. Social engineering is required to convince the user to accept the malformed VAMPSET setting file. Additional user interaction is needed to load the malformed file. This decreases the likelihood of a successful exploit.MITIGATION---------- Schneider Electric released an update for distribution on August 21, 2014\\. The VAMPSET setting tool, v.2\\.2\\.145 or newer, can be found here:[http://www.schneider\\-electric.com/products/ww/en/2300\\-ied\\-user\\-software/2320\\-vamp\\-user\\-software/62050\\-vamp\\-software/](http://www.schneider-electric.com/products/ww/en/2300-ied-user-software/2320-vamp-user-software/62050-vamp-software/)  Schneider Electric recommends that all customers and users install and use VAMPSET v.2\\.2\\.145 or newer. To protect the computer and configuration files from unauthorized escalation of privileges through manipulation, Schneider Electric recommends users employ best IT practices to secure their computers and relay’s configuration files and to use User Access Control (UAC) to further improve the security of the computer. Additionally, to minimize the risk of attack, users who are not directly using this software on a regular basis are strongly encouraged to delete this application from their computer to reduce the likelihood of attack and to store relay configuration files in the client’s protected location. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. In addition, ICS\\-CERT recommends that users take the following measures to protect themselves from social engineering attacks:1. Do not click web links or open unsolicited attachments in email messages.2. Refer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us\\-cert.gov/reading\\_room/emailscams\\_0905\\.pdf, web site last accessed September 11, 2014\\. for more information on avoiding email scams.3. Refer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04\\-014, http://www.us\\-cert.gov/cas/tips/ST04\\-014\\.html, web site last accessed September 11, 2014\\. for more information on social engineering attacks. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Schneider Electric-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-14-254-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2014-5407"
  ],
  "techniques": [],
  "advisory": "icsa-14-254-01",
  "title": "Schneider Electric VAMPSET Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "04b330ab00a62f026e3f76fb1d74f2bc637a87b7f10f74269324ca277c07e295"
}