{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SENTRON powermanager\nVulnerability: Incorrect Permission Assignment for Critical Resource\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated local attacker to inject arbitrary code and escalate privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SENTRON powermanager, a power monitoring software to analyze energy consumption, are affected:\n\nSENTRON powermanager Version 3: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nThe affected application assigns improper access rights to a specific folder containing configuration files.\nCVE-2021-37207 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nNoam Moshe of Claroty reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has released a security patch for SENTRON powermanager v3.6 HF1 and recommends updating to the latest version.\nSiemens recommends users also harden the application server to prevent local access by untrusted personnel.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue and the mitigations, please see Siemens security advisory SSA-537983\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-37207"
  ],
  "techniques": [],
  "advisory": "icsa-21-315-10",
  "title": "Siemens SENTRON powermanager | CISA",
  "source": "ics-advisories",
  "id": "a0cba589c78f411c5220718f310c69fa50ee1b9c4bb98523dd3ca73736eada3c"
}