{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: AVEVA\nEquipment: Historian Server\nVulnerability: SQL Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated user to get read and write access to the database.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AVEVA Historian Server, a Process database, are affected:\n\nHistorian Server: Version 2023 R2\nHistorian Server: Versions 2023 to 2023 P03\nHistorian Server: Versions 2020 to 2020 R2 SP1 P01\n\n3.2 Vulnerability Overview\n3.2.1 CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')\nAVEVA Historian Server has a vulnerability, if exploited, could allow a malicious SQL command to execute under the privileges of an interactive Historian REST Interface user who had been socially engineered by a miscreant into opening a specially crafted URL.\nCVE-2024-6456 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-6456. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nMaurizio Gatti from Accenture S.p.A reported this vulnerability to AVEVA.\n4. MITIGATIONS\nAVEVA recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation. Users with affected product versions should apply security updates as soon as possible.\nAVEVA recommends Historian is upgraded by AVEVA System Platform media:\n\n(Recommended) All affected versions can be fixed by upgrading to AVEVA System Platform 2023 R2 P01\n(Alternative 1) Historian 2023 through 2023 P03 can be fixed by upgrading to AVEVA System Platform 2023 P04\n(Alternative 2) Historian 2020 R2 through 2020 R2 SP1 P01 can be fixed by first upgrading to AVEVA System Platform 2020 R2 SP1 P01 and then applying Hotfix 3190476. Please contact AVEVA Global Customer Support for instructions on how to download and apply this security fix.\n\nAVEVA also recommends the following general defensive measures:\n\nEstablish procedures for Historian REST Interface users to verify the source of URLs shared with them is trusted before opening.\n\nFor information on how to reach AVEVA support for your product, please refer to this link: AVEVA Customer Support. If you discover errors or omissions in this advisory, please report the finding to Support.\nFor the latest AVEVA security information and security updates, please visit AVEVA Security Central.\nAveva recommends users looking for general information regarding how to secure Industrial Control Systems reference the NIST Guide to Operational Technology (OT) Security, NIST SP800-82r3.\nFor more information, see AVEVA's Security Bulletin AVEVA-2024-005.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nAugust 15, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-6456"
  ],
  "techniques": [],
  "advisory": "icsa-24-228-10",
  "title": "AVEVA Historian Web Server | CISA",
  "source": "ics-advisories",
  "id": "a7d963402763f7c42f81e761b6f417f303b7929b559ea87def2989f825ca775e"
}