{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.4\nATTENTION: Exploitable remotely \nVendor: Siemens\nEquipment: Industrial Edge Management\nVulnerability: Improper Certificate Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to inject malicious maintenance requests by exploiting improper certification validation. An attacker could exploit this vulnerability by sending statistics, activating remote support, exchanging the initial keys when onboarding, querying new extensions, or accessing sensitive data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Industrial Edge Management, an application and device management platform, are affected:\n\nAll versions prior to V1.5.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER CERTIFICATE VALIDATION CWE-295\nAll versions of Siemens Industrial Edge Management prior to version 1.5.1 do not properly validate the server certificate when initiating a TLS connection. This could allow an attacker to spoof a trusted entity’s certificate by interfering in the communication path between the client and the intended server.\nCVE-2022-40147 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends users to update to v1.5.1 or later (login required).\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends  configuring the environment according to Siemens’ operational guidelines for industrial security and to follow the recommendations in the product manuals.\nFor more information, see Siemens Security Advisory SSA-459643 in HTML or CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-40147"
  ],
  "techniques": [],
  "advisory": "icsa-22-286-02",
  "title": "Siemens Industrial Edge Management | CISA",
  "source": "ics-advisories",
  "id": "d10e5cc60834f098efd81858ce089f07ade43ec0ca12c4883236456e82aea053"
}