{
  "markdown": "\n1. EXECUTIVE SUMMARY\n--------- Begin Update A Part 1 of 4 ---------\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\n\n--------- End Update A Part 1 of 4 ---------\n\nVendor: WECON Technology Co., Ltd. (WECON)\nEquipment: PI Studio\nVulnerabilities: Stack-based Buffer Overflow, Out-of-bounds Write, Information Exposure Through XML External Entity Reference, Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-277-01 WECON PI Studio that was published October 4, 2018, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\n--------- Begin Update A Part 2 of 4 ----------\nSuccessful exploitation of these vulnerabilities may allow execution of code and disclose sensitive information under the context of administrator.\n--------- End Update A Part 2 of 4 ---------\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of PI Studio, an HMI project programmer, are affected:\n\nPI Studio HMI: Versions 4.1.9 and prior\n\n--------- Begin Update A Part 3 of 4 ---------\n\nPI Studio: Versions 4.2.125 and prior\n\n--------- End Update A Part 3 of 4 ---------\n4.2 VULNERABILITY OVERVIEW\n--------- Begin Update A Part 4 of 4 ---------\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nWhen parsing specific files the process does not properly validate the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code under the context of an administrator. \nCVE-2018-14818 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    OUT-OF-BOUNDS WRITE CWE-787\nWhen parsing specific files the process does not properly validate user-supplied data, which can result in multiple write instances past the end of an allocated object. An attacker can leverage this vulnerability to execute code under the context of an administrator. \nCVE-2018-14810 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.3    INFORMATION EXPOSURE THROUGH XML EXTERNAL ENTITY REFERENCE CWE-611\nWhen parsing project files the XMLParser that ships with Wecon PIStudio is vulnerable to a XML external entity injection attack, which may allow sensitive information disclosure.\nCVE-2018-17889 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n4.2.4    OUT-OF-BOUNDS READ CWE-125\nWhen parsing specific files the process does not properly validate user-supplied data, which can result in a read past the end of an allocated object.\nCVE-2018-14814 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n--------- End Update A Part 4 of 4 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: China\n\n4.4 RESEARCHER\nMat Powell of Trend Micro’s Zero Day Initiative and Natnael Samson (Natti), working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n5. MITIGATIONS\nWECON has verified these vulnerabilities but has not yet released an updated version. CISA is working with WECON and will update this advisory once an updated version is released.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-14810",
    "CVE-2018-14814",
    "CVE-2018-14818",
    "CVE-2018-17889"
  ],
  "techniques": [],
  "advisory": "icsa-18-277-01",
  "title": "WECON PI Studio (Update A) | CISA",
  "source": "ics-advisories",
  "id": "616d5537456d3ae328b809dcf2283543465971c4c6226f98333fd4742f62827c"
}