{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/high attack complexity\nVendor: Mitsubishi Electric\nEquipment: GX Works2\nVulnerability: Improper Handling of Length Parameter Inconsistency\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may cause a denial-of-service condition in GX Works2.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of GX Works2, an engineering software suite, are affected:\n\nGX Works2: Versions 1.606G and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER HANDLING OF LENGTH PARAMETER INCONSISTENCY CWE-130\nIf an attacker tampers with a program file in a Mitsubishi Electric PLC by sending malicious crafted packets to the PLC, reading the program file into GX Works2, the engineering software incorrectly handles a length field that is inconsistent with the actual length of the associated data, which could result in a denial-of-service condition in the software.\nCVE-2021-20608 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends users download and update the latest version of each software product:\n\nGX Works2, version 1.610L or later\n\nMitsubishi Electric has included the following directions for updates:\n\nUnzip the downloaded file (zip format).\nRun \"setup.exe\" in the extracted folder to install.\n\nFor users of software for which the fixed version has not been released, or those who are not able to immediately update the software, Mitsubishi Electric recommends the following mitigations to minimize risk:\n\nRestrict the connection of all control system devices and systems to the network so  they can only be accessed from trusted networks and hosts.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nUse virtual private network (VPN) when remote access to Mitsubishi Electric PLC is required.\n\nFor specific update instructions and additional details see the Mitsubishi Electric advisory.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-20608"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-04",
  "title": "Mitsubishi Electric GX Works2 | CISA",
  "source": "ics-advisories",
  "id": "eb2f33ca06421269452e7ecb60388dda4b5241de91ef12b3fd7b8d6b0e3a8e8f"
}