{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: Solid Edge\nVulnerabilities: Out-of-bounds Write, Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow arbitrary code execution on an affected system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Solid Edge, a portfolio of software tools, are affected:\n\nSolid Edge: All versions prior to SE2021MP2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThe affected applications lack proper validation of user-supplied data when parsing PAR files. This could result in an out-of-bounds write into uninitialized memory. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-28381 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS WRITE CWE-787\nThe affected applications lack proper validation of user-supplied data when parsing PAR files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-28382 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    OUT-OF-BOUNDS WRITE CWE-787\nThe affected applications lack proper validation of user-supplied data when parsing PAR files. This can result in an out-of-bounds write past the memory location of a read only image address. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-28383 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected applications lack proper validation of user-supplied data when parsing PAR files. This could lead to a stack-based buffer overflow. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-28384 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.5    OUT-OF-BOUNDS WRITE CWE-787\nThe affected applications lack proper validation of user-supplied data when parsing DFT files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-28386 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.6    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected applications lack proper validation of user-supplied data when parsing of PAR files. This could result in a stack-based buffer overflow. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-26989 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nrgod, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens has published a security advisory and released an update to Version SE2021MP2 or later for Solid Edge and recommends users update to the latest version (login required).\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nSiemens recommends limiting opening of untrusted files from unknown sources in Solid Edge.\nApplying a defense-in-depth concept can help to reduce the probability untrusted code is run on the system. Siemens recommends applying the defense-in-depth concept.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manual.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens security advisory SSA-979834\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-28386",
    "CVE-2020-28383",
    "CVE-2020-28384",
    "CVE-2020-28382",
    "CVE-2020-26989",
    "CVE-2020-28381"
  ],
  "techniques": [],
  "advisory": "icsa-21-012-04",
  "title": "Siemens Solid Edge | CISA",
  "source": "ics-advisories",
  "id": "1b3c91918af00cedbd1a9debf8d398b5613a7418791d41d52a5c72e7873b1ada"
}