{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Meridian Cooperative\nEquipment: Meridian\nVulnerability: Improper Access Control\n\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a disclosure of sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Meridian utility software are affected:\n\nVersion 22.02\nVersion 22.03\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nPrivate user information such as name, address, and daily energy usage can be accessed online without proper authentication.\nCVE-2022-29578 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBrandon Roach reported this vulnerability to CISA.\n4. MITIGATIONS\nActive users have been updated to Version 22.04 or later by Meridian Cooperative and are no longer affected by this vulnerability. Contact Meridian Cooperative (login required) for additional information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n \nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-29578"
  ],
  "techniques": [],
  "advisory": "icsa-22-165-02",
  "title": "Meridian Cooperative Meridian | CISA",
  "source": "ics-advisories",
  "id": "3dd47609f832a24db5709d2a9a92b6e70394b21554d552357590b5e394a15892"
}