{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Inductive Automation\nEquipment: Ignition\nVulnerability: Improper Restriction of XML External Entity Reference\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-22-207-01 Inductive Automation Ignition that was published July 26, 2022, to the ICS webpage at www.cisa.gov/ics\n3.RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain file contents.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Inductive Automation Ignition software are affected:\n-------- Begin Update A Part 1 of 1 ---------\n\nInductive Automation Ignition: All versions from 8.1 to those prior to v8.1.8\nInductive Automation Ignition: All 7.9 versions prior to v7.9.21\n\n--------- End Update A Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nDue to an XML external entity reference, the software parses XML in the backup/restore functionality without XML security flags, which may lead to a XXE attack while restoring the backup.\nCVE-2022-1704 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:N/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Information Technology\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nKeval Shah reported this vulnerability to CISA.\n5. MITIGATIONS\nInductive Automation recommends users upgrade the Ignition software to the latest version:\n\nInductive Automation Ignition: Version 8.1.9 or later\nInductive Automation Ignition: Version 7.9.21 or later\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-1704"
  ],
  "techniques": [],
  "advisory": "icsa-22-207-01",
  "title": "Inductive Automation Ignition (Update A) | CISA",
  "source": "ics-advisories",
  "id": "5959e22051208b6d948f48a7fa80b4ca937862cab874955a2890ab98f7d82f86"
}