{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.8\nVendor: Eaton\nEquipment: EASYsoft\nVulnerabilities: Type Confusion, Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-007-03 Eaton EASYsoft that was published January 7, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a local attacker to modify or crash the program.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n\nVersions 7.20 and prior of EASYsoft are affected\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nThe affected product allows a pointer to be read into an object from a file, resulting in type confusion.\nCVE-2020-6656 has been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:L/A:L).\n4.2.2    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read, which may allow an attacker to modify or crash the program.\nCVE-2020-6655 has been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:L/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n4.4 RESEARCHER\nFrancis Provencher {PRL}, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 1 ---------\nEaton has patched the issues and released Version 7.22, which can be downloaded from Eaton’s website. \nNavigate to Eaton software download center -> Select “Software” -> “easySoft” -> v7.22\n--------- End Update A Part 1 of 1 ---------\nEaton recommends those affected by the report vulnerabilities use only .E70 files created from a fully trusted source.\nIf the application crashes due to .E70 file upload, restart the application and do not upload the .E70 file again.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nHigh skill is needed to exploit. These vulnerabilities are not exploitable remotely. No known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-6655",
    "CVE-2020-6656"
  ],
  "techniques": [],
  "advisory": "icsa-21-007-03",
  "title": "Eaton EASYsoft (Update A) | CISA",
  "source": "ics-advisories",
  "id": "95b40e1bcb386353b3419cd28be86746d146e59dd3831dd5aac42c58b1e258d5"
}