{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Remotely exploitable/low attack complexity\nVendor: Siemens\nEquipment: Industrial Products\nVulnerability: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-17-339-01 Siemens Industrial Products (Update R) published June 8, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow a remote attacker to conduct a denial-of-service attack.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following industrial products:\n\nDevelopment/Evaluation Kits for PROFINET IO: DK Standard Ethernet Controller: All versions prior to v4.1.1 Patch 05\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200P: All versions prior to v4.5\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200: All versions prior to v4.5\nSIMATIC Compact Field Unit: All versions\nSIMATIC ET 200AL: All versions\nSIMATIC ET 200M (incl. SIPLUS variants): All versions\nSIMATIC ET 200MP IM155-5 PN BA (incl. SIPLUS variants): All versions prior to v4.0.2\nSIMATIC ET 200MP IM155-5 PN HF (incl. SIPLUS variants): All versions prior to v4.2\nSIMATIC ET 200MP IM155-5 PN ST (incl. SIPLUS variants): All versions prior to v4.1\nSIMATIC ET 200S (incl. SIPLUS variants): All versions\nSIMATIC ET 200SP IM 155-6 PN BA (incl. SIPLUS variants): All versions\nSIMATIC ET 200SP IM 155-6 PN HA (incl. SIPLUS variants): All versions prior to v1.1.0\nSIMATIC ET 200SP IM 155-6 PN HF (incl. SIPLUS variants): All versions prior to v4.2.0\nSIMATIC ET 200SP IM 155-6 PN HS (incl. SIPLUS variants): All versions prior to v4.0.1\nSIMATIC ET 200SP IM 155-6 PN ST (incl. SIPLUS variants): All versions\n\n--------- Begin Update S Part 1 of 1 ---------\n\nSIMATIC ET 200ecoPN, 4AO U/I 4xM12 (6ES7145-6HD00-0AB0): All versions\nSIMATIC ET 200ecoPN, 8 DIO, DC24V/1,3A, 8xM12 (6ES7147-6BG00-0AB0): All versions\nSIMATIC ET 200ecoPN, 8 DO, DC24V/2A, 8xM12 (6ES7142-6BR00-0AB0): All versions\nSIMATIC ET 200ecoPN, 8AI RTD/TC 8xM12 (6ES7144-6KD50-0AB0): All versions\nSIMATIC ET 200ecoPN, 8AI; 4 U/I; 4 RTD/TC 8xM12 (6ES7144-6KD00-0AB0): All versions\nSIMATIC ET 200ecoPN, 8DI, DC24V, 4xM12 (6ES7141-6BF00-0AB0): All versions\nSIMATIC ET 200ecoPN, 8DI, DC24V, 8xM12 (6ES7141-6BG00-0AB0): All versions\nSIMATIC ET 200ecoPN, 8DO, DC24V/0,5A, 4xM12 (6ES7142-6BF50-0AB0): All versions\nSIMATIC ET 200ecoPN, 8DO, DC24V/1,3A, 4xM12 (6ES7142-6BF00-0AB0): All versions\nSIMATIC ET 200ecoPN, 8DO, DC24V/1,3A, 8xM12 (6ES7142-6BG00-0AB0): All versions\nSIMATIC ET 200ecoPN, 16DI, DC24V, 8xM12 (6ES7141-6BH00-0AB0): All versions\nSIMATIC ET 200ecoPN, 16DO DC24V/1,3A, 8xM12 (6ES7142-6BH00-0AB0): All versions\nSIMATIC ET 200ecoPN, IO-Link Master (6ES7148-6JA00-0AB0): All versions\n\n--------- End Update S Part 1 of 1 ---------\n\nSIMATIC ET 200pro: All versions\nSIMATIC PN/PN Coupler (incl. SIPLUS NET variants): All versions prior to v4.2.0\nSIMATIC S7-200 Smart: All versions prior to v2.03.01\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to v3.X.16\nSIMATIC S7-400 H v6 CPU family and below (incl. SIPLUS variants): All versions prior to v6.0.8\nSIMATIC S7-400 PN/DP v6 CPU family and below (incl. SIPLUS variants): All versions prior to v6.0.6\nSIMATIC S7-400 PN/DP v7 CPU family (incl. SIPLUS variants): All versions prior to v7.0.2\nSIMATIC S7-410 v8 CPU family (incl. SIPLUS variants): All versions prior to v8.2.1\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): All versions prior to v4.2.3\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions prior to v2.0\nSIMATIC S7-1500 Software Controller: All versions prior to v2.0\nSIMATIC TDC CP51M1: All versions prior to v1.1.8\nSIMATIC TDC CPU555: All versions prior to v1.1.1\nSIMATIC WinAC RTX (F) 2010: All versions prior to SP3\nSIMOCODE pro V PN (incl. SIPLUS variants): All versions prior to v2.1.1\nSIMOTION C: All versions prior to v5.1 HF1\nSIMOTION D (incl. SIPLUS variants): All versions prior to v5.1 HF1\nSIMOTION P v4.4 and v4.5: All versions prior to v4.5 HF5\nSIMOTION P v5: All versions prior to v5.1 HF1\nSINAMICS DCM w. PN: All versions prior to v1.4 SP1 HF6\nSINAMICS DCP w. PN: All versions prior to v1.2 HF2\nSINAMICS G110M w. PN: All versions prior to v4.7 SP9 HF1\nSINAMICS G120(C/P/D) w. PN (incl. SIPLUS variants): All versions prior to v4.7 SP9 HF1\nSINAMICS G130 v4.7 w. PN: All versions prior to v4.7 HF29\nSINAMICS G130 v4.8 w. PN: All versions prior to v4.8 HF4\nSINAMICS G150 v4.7 w. PN: All versions prior to v4.7 HF29\nSINAMICS G150 v4.8 w. PN: All versions prior to v4.8 HF4\nSINAMICS S110 w. PN: All versions prior to v4.4 SP3 HF6\nSINAMICS S120 v4.7 SP1 w. PN (incl. SIPLUS variants): All versions\nSINAMICS S120 v4.7 w. PN (incl. SIPLUS variants): All versions prior to v4.7 HF29\nSINAMICS S120 v4.8 w. PN: All versions prior to v4.8 HF5\nSINAMICS S120 prior to v4.7 w. PN (incl. SIPLUS variants): All versions prior to v4.7\nSINAMICS S150 v4.7 w. PN: All versions prior to v4.7 HF29\nSINAMICS S150 v4.8 w. PN:All versions prior to v4.8 HF4\nSINAMICS v90 w. PN: All versions prior to v1.02\nSINUMERIK 840D sl: All versions prior to 4.8 SP3\nSIRIUS Soft starter 3RW44 PN: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1 IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets sent to Port 161/UDP could cause a denial-of-service condition. The affected devices must be restarted manually.\nCVE-2017-12741 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nGeorge Lashenko of CyberX reported the vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has provided firmware updates for the following products to fix this vulnerability:\n\nDevelopment/Evaluation Kits for PROFINET IO: DK Standard Ethernet Controller: Update to v4.1.1 Patch 05\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200P: Update to v4.5\nDevelopment/Evaluation Kits for PROFINET IO: EK-ERTEC 200: Update to v4.5\nSIMATIC ET 200MP IM155-5 PN BA (incl. SIPLUS variants): Update to v4.0.2\nSIMATIC ET 200MP IM155-5 PN HF (incl. SIPLUS variants): Update to v4.2\nSIMATIC ET 200MP IM155-5 PN ST (incl. SIPLUS variants): Update to v4.1\nSIMATIC ET 200SP IM 155-6 PN HA (incl. SIPLUS variants): Update to v1.1.0\nSIMATIC ET 200SP IM 155-6 PN HF (incl. SIPLUS variants): Update to v4.2.0\nSIMATIC ET 200SP IM 155-6 PN HS (incl. SIPLUS variants): Update to v4.0.1\nSIMATIC PN/PN Coupler (incl. SIPLUS NET variants): Update to v4.2.0\nSIMATIC S7-200 Smart: Update to v2.03.01\nSIMATIC S7-300 CPU family (incl. related ET200 CPUs and SIPLUS variants): Update to v3.X.16\nSIMATIC S7-400 H v6 CPU family and below (incl. SIPLUS variants): Update v6.0.8\nSIMATIC S7-400 PN/DP v6 CPU family and below (incl. SIPLUS variants): Update to v6.0.6\nSIMATIC S7-400 PN/DP v7 CPU family (incl. SIPLUS variants): Update to v7.0.2\nSIMATIC S7-410 v8 CPU family (incl. SIPLUS variants): Update to v8.2.1\nSIMATIC S7-1200 CPU family (incl. SIPLUS variants): Update to v4.2.3\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): Upgrade to v2.0 and newer\nSIMATIC S7-1500 Software Controller: Upgrade to v2.0 and newer\nSIMATIC TDC CP51M1: Update to v1.1.8\nSIMATIC TDC CPU555: Update to v1.1.1\nSIMATIC WinAC RTX (F) 2010: Update to SP3 and apply BIOS and Microsoft Windows updates\nSIMOCODE pro V PN (incl. SIPLUS variants): Update to v2.1.1\nSIMOTION C: Update to v5.1 HF1\nSIMOTION D (incl. SIPLUS variants): Update to v5.1 HF1\nSIMOTION P v4.4 and 4.5: Update to v4.5 HF5 (please contact a Siemens representative for information on how to obtain this update)\nSIMOTION P v5: Update to v5.1 HF1 (please contact a Siemens representative for information on how to obtain this update)\nSINAMICS DCM w. PN: Update to v1.4 SP1 HF6\nSINAMICS DCP w. PN: Update to v1.2 HF2\nSINAMICS G110M w. PN: Update to v4.7 SP9 HF1\nSINAMICS G120(C/P/D) w. PN (incl. SIPLUS variants): Update to v4.7 SP9 HF1\nSINAMICS G130 v4.7 w. PN: Update to v4.7 HF29\nSINAMICS G130 v4.8 w. PN: Update to v4.8 HF4\nSINAMICS G150 v4.7 w. PN: Update to v4.7 HF29\nSINAMICS G150 v4.8 w. PN: Update to v4.8 HF4\nSINAMICS S110 w. PN: Update to v4.4 SP3 HF6\nSINAMICS S120 v4.7 SP1 w. PN (incl. SIPLUS variants): Update to latest version of v5.1 SP1\nSINAMICS S120 v4.7 w. PN (incl. SIPLUS variants): Update to v4.7 HF29\nSINAMICS S120 v4.8 w. PN: Update to v4.8 HF5\nSINAMICS S120 prior to v4.7 w. PN (incl. SIPLUS variants): Update to latest version of v5.1 SP1\nSINAMICS S150 v4.7 w.PN: Update to v4.7 HF29\nSINAMICS S150 v4.8 w.PN: Update to v4.8 HF4\nSINAMICS v90: Update to v1.02\nSINUMERIK 840D sl: Update to 4.8 SP3 (obtain update from a Siemens service organization)\n\nSiemens is preparing further updates and recommends the following mitigations until patches are available:\n\nDisable SNMP if this is supported by the product (refer to the product documentation). Disabling SNMP fully mitigates the vulnerability\nProtect network access to Port 161/UDP of affected devices\nApply cell protection concept\nUse VPN for protecting network communication between cells\nApply defense-in-depth\n\nSiemens recommends users configure the operational environment according to the Siemens Operational Guidelines for Industrial Security.\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-346262\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2017-12741"
  ],
  "techniques": [],
  "advisory": "icsa-17-339-01",
  "title": "Siemens Industrial Products (Update S) | CISA",
  "source": "ics-advisories",
  "id": "04e54654954ea53c8f7a7c760cc541d0d6927d3d50c992c6edb7f79694709aa1"
}