{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.2\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: S7-400 CPUs\nVulnerabilities: Improper Input Validation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-317-02 Siemens S7-400 CPUs (Update A) that was published November 13, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device being accessed which may require a manual reboot or firmware re-image to bring the system back to normal operation.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerabilities affect the following SIMATIC S7-400 products:\n--------- Begin Update B Part 1 of 1 ---------\n\nS7-400 DP V7 CPU family (including SIPLUS variants): All versions\nS7-400 H V4.5 and below CPU family (including SIPLUS variants): All versions\nS7-400 H V6 CPU family (including SIPLUS variants): All versions prior to V6.0.9 \nS7-400 PN/DP V6 and below CPU family (including SIPLUS variants): All versions\nS7-410 CPU family (including SIPLUS variants): All versions prior to V8.2.1\n\n--------- End Update B Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nSpecially crafted packets sent to Port 102/TCP via Ethernet interface, via PROFIBUS, or via multi-point interfaces (MPI) could cause the affected devices to go into defect mode. Manual reboot is required to resume normal operation.\nCVE-2018-16556 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    IMPROPER VERIFICATION OF CRYPTOGRAPHIC SIGNATURE CWE-347\nSpecially crafted packets sent to Port 102/TCP via Ethernet interface via PROFIBUS or MPI could cause a denial-of-service condition on affected devices. Recovery may require flashing with a firmware image.\nIf access protection is not configured, no privileges are required to exploit this vulnerability.\nCVE-2018-16557 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Healthcare and Public Health, Transportation.\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nZhang JiaWei and Qing YuLong from CNCERT/CC reported these vulnerabilities to Siemens.\n5. MITIGATIONS\nSiemens recommends implementing the following mitigations:\n\nConfigure protection Level 3 (read/write protection) to mitigate CVE-2018-16557\nRestrict network access to affected devices; restrict network access to Port 102/TCP for Ethernet interfaces.\nFor SIMATIC S7-CPU 410 CPUs: Activate field interface security in PCS 7 v9.0, use a SIMATIC CP443-1 Adv. to communicate with ES/OS, and update to Version 8.2.1:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109476571\n\nFor SIMATIC S7-400H V6: Update to Version 6.0.9\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109474550\n\nApply defense-in-depth:\n\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security (download: https://www.siemens.com/cert/operational-guidelines-industrial-security), and following the recommendations in the product manuals.\nFor more information on these vulnerabilities and associated software updates, please see Siemens security advisory SSA-113131 on their website:\nhttps://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-16556",
    "CVE-2018-16557"
  ],
  "techniques": [],
  "advisory": "icsa-18-317-02",
  "title": "Siemens S7-400 CPUs (Update B) | CISA",
  "source": "ics-advisories",
  "id": "1c6dc07464d4791bd7be840e997795a398d470416a2721e1fdb3d4e630cdba82"
}