{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 5.7\n\nATTENTION: Exploitable remotely/low skill level\nVendor: Tridium\nEquipment: Niagara Enterprise Security, Niagara AX, and Niagara 4\nVulnerability: Cross-site Scripting\n\n2. REPOSTED INFORMATION\nThis advisory was originally posted to the HSIN ICS-CERT library on November 29, 2018, and is being released to the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated user to inject client-side scripts into some web pages that could then be viewed by other users.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Tridium products are affected:\n\nNiagara Enterprise Security 2.3u1, all versions prior to 2.3.118.6,\nNiagara AX 3.8u4, all versions prior to 3.8.401.1,\nNiagara 4.4u2, all versions prior to 4.4.93.40.2, and\nNiagara 4.6, all versions prior to 4.6.96.28.4\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nA cross-site scripting vulnerability has been identified that may allow a remote attacker to inject code to some web pages affecting confidentiality.\nCVE-2018-18985 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Government Facilities, and Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nDaniel Santos and Elisa Costante of SecurityMatters reported the vulnerability to Tridium.\n5. MITIGATIONS\nTridium recommends that affected users upgrade to the latest versions of the software (login required).Niagara Enterprise security 2.3u1 Version 2.3.118.6:https://software.niagara-central.com/ord?portal:/download/6284Niagara AX 3.8u4 Version 3.8.401.1:https://software.niagara-central.com/ord?portal:/download/6276Niagara 4.4u2 Version 4.4.93.40.2:https://software.niagara-central.com/ord?portal:/download/6268Niagara 4.6 Version 4.6.96.28.4:https://software.niagara-central.com/ord?portal:/download/6281For more information please see Tridium’s security bulletin SB 2018-Tridium-2 at:https://www.tridium.com/~/media/tridium/library/documents/collateral/technical%20bulletins/update%20your%20niagara%20software%20-%20fixes%20cross-site%20scripting%20vulnerability_2018-11.ashx?la=en\n \nNCCIC and Tridium recommend users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nReview and validate the list of users who are authorized and who can authenticate to Niagara.\nAllow only trained and trusted persons to have physical access to the system, including devices that have connection to the system though the Ethernet port.\nIf remote connections to the network are required, consider using a VPN or other means to ensure secure remote connections into the network where the system is located.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-18985"
  ],
  "techniques": [],
  "advisory": "icsa-18-333-02",
  "title": "Tridium Niagara Enterprise Security, Niagara AX, and Niagara 4 | CISA",
  "source": "ics-advisories",
  "id": "c7438e8394663ff38248dd4a23131f2bd65b1e422f10a780dd65304286c76857"
}