{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). \n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: Desigo PXC\nVulnerability: Improper Authentication\n\n2. UPDATE INFORMATION \nThis updated advisory is a follow-up to the advisory update titled ICSA-18-025-02B Siemens Desigo PXC that was published March 22, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthenticated remote attackers to upload malicious firmware without prior authentication.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThis advisory covers only the Desigo PX Controller product line and not the Apogee PX Controller product line.\n--------- Begin Update C Part 1 of 2 ---------\nSiemens reports that the vulnerability affects all versions prior to v4.10.111, v5.00.171, v5.10.069, and v6.00.204 of the following products:\n\nDesigo Automation Controllers Compact PXC12/22/36-E.D,\nDesigo Automation Controllers Modular PXC00/50/100/200-E.D,\nDesigo Automation Controllers PXC00/64/128-U with Web module,\nDesigo Automation Controllers for Integration PXC001-E.D, and\nDesigo Operator Unit PXM20-E\n\n--------- End Update C Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHENTICATION CWE-287\nA remote attacker with network access to the device could potentially upload a new firmware image to the devices without prior authentication.\nCVE-2018-4834 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nCan Demirel and Melih Berk Eksioglu from Biznet Bilisim reported this vulnerability to Siemens.\n5. MITIGATIONS\n--------- Begin Update C Part 2 of 2 ---------\nSiemens has provided updated versions that fix the vulnerability for the affected products. Siemens recommends users update to version v4.10.111, v5.00.171, v5.10.069, or v6.00.204 or later. Updates can be obtained from Siemens customer support or a local partner.\n--------- End Update C Part 2 of 2 ----------\nAs a general security measure, Siemens strongly recommends protecting network access to the devices with appropriate mechanisms. Siemens advises configuring the environment according to Siemens operational guidelines in order to run the devices in a protected IT environment.\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-824231 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-4834"
  ],
  "techniques": [],
  "advisory": "icsa-18-025-02b",
  "title": "Siemens Desigo PXC (Update C) | CISA",
  "source": "ics-advisories",
  "id": "b61ac4a2fa6d74f7582572a364b4831fe97052213a1b2a91979c65a6070d9177"
}