{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Polarion ALM\nVulnerability: Cross-site Scripting\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-069-08 Siemens Polarion ALM that was published March 10, 2022, on the ICS webpage on www.cisa.gov/uscert. \n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow arbitrary code execution and sensitive information extraction.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 2 ---------\nSiemens reports this vulnerability affects Subversion Webclient in Polarion ALM:\n\nPolarion ALM: All versions prior to v21 R2 P2\nPolarion WebClient for SVN: All versions\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CROSS-SITE SCRIPTING CWE-79\nAn attacker could achieve cross-site scripting by sending a specially crafted link to users with administrator privileges, resulting in improper neutralization of data sent to the webpage through the SVN WebClient.\nCVE-2021-44478 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nNicolas Briand of Thales Digital Factory reported this vulnerability to Siemens.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nSiemens has released an update for the Subversion Webclient in Polarion ALM and recommends updating to the latest version.\n\nPolarion ALM: Update to v21 R2 P2 or later version\n\n--------- End Update A Part 2 of 2 ---------\nTo reduce risk, Siemens recommends users not to open links from untrusted sources while working on Polarion Subversion webclient.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/Industrialsecurity\nFor additional information, please refer to Siemens Security Advisory SSA-562051\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-44478"
  ],
  "techniques": [],
  "advisory": "icsa-22-069-08",
  "title": "Siemens Polarion ALM (Update A) | CISA",
  "source": "ics-advisories",
  "id": "950928c08ff1b4d10c293cef7989ae6b7479d975c08f98d287d1b320286a5735"
}