{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Hitachi ABB Power Grids\nEquipment: XMC20 Multiservice-Multiplexer\nVulnerability: Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to remotely take control of the product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi ABB Power Grids reports the vulnerability affects the following XMC20 Multiservice-Multiplexer products: \n\nXMC20 R4 using COGE5 versions older than co5ne_r1h07_12.esw\nXMC20 R6 using COGE5 versions older than co5ne_r2d14_03.esw\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nA vulnerability exists in a specific library included in these products. An attacker could exploit the vulnerability by sending a specially crafted message to the XMC20 node to open a communication channel without first performing authentication, resulting in unauthorized access. \nCVE-2018-10933 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy Sector\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi ABB Power Grids reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi ABB Power Grids has corrected the problem in the following product versions and recommends users apply the firmware update at the earliest availability:\n\nXMC20 R4: COGE5 Version co5ne_r1h07_12.esw (and newer)\nXMC20 R6: COGE5 Version co5ne_r2d14_03.esw (and newer)\n\nFor additional information and support please contact a product provider or a Hitachi ABB Power Grids service organization. \nHitachi ABB Power Grids published cybersecurity advisory PGVU-PGGA-XMC20-2020034 to give users more information about this issue.\nHitachi ABB Power Grids recommends the following cybersecurity practices:\n\nPhysically protect process control systems from direct access by unauthorized personnel.\nDo not directly connect control systems to the Internet. \nSeparate control systems from other networks by means of a firewall system that has a minimal number of ports exposed.\nDo not use control systems networks for Internet browsing, instant messaging, or receiving e-mails.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2018-10933"
  ],
  "techniques": [],
  "advisory": "icsa-20-294-02",
  "title": "Hitachi ABB Power Grids XMC20 Multiservice-Multiplexer | CISA",
  "source": "ics-advisories",
  "id": "dcc8fa84720feedfc4288badb5f40b2b2f32d30efd3f90c72bff23619359b06d"
}