{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 4.8\n\nATTENTION: Exploitable remotely\nVendor: Schneider Electric\nEquipment: Modicon M221\nVulnerability: Improper Check for Unusual or Exceptional Conditions\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized user to remotely reboot the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Modicon M221, a programmable logic controller (PLC), are affected:\n\nModicon M221 all references and versions prior to firmware v1.6.2.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER CHECK FOR UNUSUAL OR EXCEPTIONAL CONDITIONS CWE-754\nThe vulnerability may allow unauthorized users to remotely reboot Modicon M221 using crafted programing protocol frames.\nCVE-2018-7789 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nSchneider Electric, working with Yehonatan Kfir of Radiflow, reported the vulnerability to NCCIC.\n4. MITIGATIONS\nSchneider Electric reports that a fix for this vulnerability is implemented in Modicon M221 Firmware v1.6.2.0, delivered within SoMachine Basic v1.6 SP2, or by using the Schneider Electric Software Update tool.\nThe download for SoMachine Basic is available at:\nhttps://www.schneider-electric.com/en/download/document/SoMachineBasicV1.6SP2/\nFor more information, see the Schneider Electric security notification at:\nhttps://www.schneider-electric.com/en/download/document/SEVD-2018-233-01/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-7789"
  ],
  "techniques": [],
  "advisory": "icsa-18-240-02",
  "title": "Schneider Electric Modicon M221 | CISA",
  "source": "ics-advisories",
  "id": "a3b1e3665a0cd4fe84d1403d6e1b5c798269ba133609cc3f607b0ce60fa36358"
}