{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.0\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Sierra Wireless \nEquipment: AirLink Router with ALEOS Software \nVulnerabilities: Improper Neutralization of Argument Delimiters in a Command, Exposure of Sensitive Information to an Unauthorized Actor \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a loss of sensitive information and could allow remote code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSierra Wireless reports the following versions of AirLink router with ALEOS software are affected: \n\nAirlink Router (ES450, GX450) running ALEOS software: Versions 4.9.7 and prior \nAirlink Router (MP70, RV50, RV50x, RV55, LX 40, LX60) running ALEOS software: Versions prior to 4.16.0 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER NEUTRALIZATION OF ARGUMENT DELIMITERS IN A COMMAND ('ARGUMENT INJECTION') CWE-88 \nAirLink router versions with ALEOS software are vulnerable when users with valid ACEManager credentials and access to the ACEManager interface could manipulate the IP logging operation to execute arbitrary shell commands on the device. \nCVE-2022-46649 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). \n3.2.2 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200 \nAirLink router versions with ALEOS software are vulnerable when users with valid ACEManager credentials and access to the ACEManager interface could reconfigure the device to expose the ACEManager credentials on the pre-login status page. \nCVE-2022-46650 has been assigned to this vulnerability. A CVSS v3 base score of 4.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Canada \n\n3.4 RESEARCHER\nRoni Gavrilov and Eran Jacob from OTORIO reported these vulnerabilities to CISA. \n4. MITIGATIONS\nSierra Wireless recommends upgrading the following affected devices: \n\nUpgrade MP70, RV50, RV50x, RV55, LX 40, LX60 to ALEOS version 4.16.0 or later \nUpgrade ES450, GX450 to ALEOS version 4.9.8 (when available) or later \n\nSierra Wireless recommends the following mitigations: \n\nAlways use strong, and ideally unique random credentials for devices. ALEOS devices ship with unique random credentials by default. \nDisable access to ACEManager on the wide area network (WAN) and use the Sierra Wireless Airlink Management System (ALMS) or an alternative device management platform for remote management of ALEOS devices. \nIf the ACEManager must remain accessible via the WAN, restrict access using measures such as Private APN, VPN, or the ALEOS Trusted IP feature (restricts access to specific hosts). \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.  \n",
  "cves": [
    "CVE-2022-46649",
    "CVE-2022-46650"
  ],
  "techniques": [],
  "advisory": "icsa-23-026-04",
  "title": "Sierra Wireless AirLink Router with ALEOS Software | CISA",
  "source": "ics-advisories",
  "id": "85205ca6ef9cb7d10e9537cd3c09e13a8445149d90bad7396045bc70f71e59c9"
}