{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.1\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: General Electric\nEquipment: Communicator\nVulnerabilities: Uncontrolled Search Path, Use of Hard-coded Credentials, Improper Access Controls\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain administrative privileges, manipulate widgets and UI elements, gain control over the database, or execute administrative commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nGE reports that the following Communicator components, all versions prior to 4.0.517, are affected:\n\nCommunicator Installer\nCommunicator Application\nCommunicator PostGreSQL\nCommunicator MeterManager\nCommunicator WISE Uninstaller\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED SEARCH PATH CWE-427\nA non-administrative user may place malicious files within the installer file directory, which may allow an attacker to gain administrative privileges on a system during installation or upgrade.\nCVE-2019-6564 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    UNCONTROLLED SEARCH PATH CWE-427\nAn attacker may place malicious files within the working directory of the program, which may allow an attacker to manipulate widgets and UI elements.\nCVE-2019-6546 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    USE OF HARD-CODED CREDENTIALS CWE-798\nTwo backdoor accounts with hardcoded credentials exist, which may allow control over the database. This service is inaccessible to attackers if Windows default firewall settings are used by the end user.\nCVE-2019-6548 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    IMPROPER ACCESS CONTROLS CWE-284\nA service running with system privileges may allow an unprivileged user to perform certain administrative actions, which may allow the execution of scheduled scripts with system administrator privileges. This service is inaccessible to attackers if Windows default firewall settings are used by the end user.\nCVE-2019-6544 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.5    IMPROPER ACCESS CONTROLS CWE-284\nA non-administrative user may replace the uninstaller with a malicious version, which could allow an attacker to gain administrator privileges to the system.\nCVE-2019-6566 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nReid Wightman of Dragos reported these vulnerabilities to GE.\n4. MITIGATIONS\nGE recommends users upgrade to GE Communicator version 4.0.517 or newer, which can be downloaded from the following link:\nhttps://www.gegridsolutions.com/app/ViewFiles.aspx?prod=EPM9700&type=7\nGE recommends ensuring Windows default firewall rules are active.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nEnsure that least privilege is implemented throughout the system.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. Some of these vulnerabilities are exploitable remotely.\n",
  "cves": [
    "CVE-2019-6544",
    "CVE-2019-6564",
    "CVE-2019-6546",
    "CVE-2019-6548",
    "CVE-2019-6566"
  ],
  "techniques": [],
  "advisory": "icsa-19-122-02",
  "title": "GE Communicator | CISA",
  "source": "ics-advisories",
  "id": "26f89a85f93c492d497ace281057032529d3dff66dfc495e392bb41dd18e6622"
}