{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.5\nATTENTION: Low attack complexity\nVendor: LCDS - Leão Consultoria e Desenvolvimento de Sistemas Ltda ME\nEquipment: LAquis SCADA\nVulnerabilities: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to read and write files outside of their own directory.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LAquis SCADA, an HMI program, are affected:\n\nLAquis SCADA: Versions 4.7.1.7 and prior\n\n3.2 Vulnerability Overview\n3.2.1 Path Traversal CWE-22\nThere are multiple ways in LAquis SCADA for an attacker to access locations outside of their own directory.\nCVE-2024-5040 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-5040. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: South America\nCOMPANY HEADQUARTERS LOCATION: Brazil\n\n3.4 RESEARCHER\nNatnael Samson working with Trend Micro Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nLCDS recommends users update to version 4.7.1.371 or newer of LAquis SCADA. which has been configured to resolve the reported path traversal issues.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nEnsure that principles of least privilege are followed.\nRestrict physical access to critical systems.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nMay 21, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-5040"
  ],
  "techniques": [],
  "advisory": "icsa-24-142-01",
  "title": "LCDS LAquis SCADA | CISA",
  "source": "ics-advisories",
  "id": "ed35ff62bbe05faefb550f0784bfd246a2f3bb91e3f0efe6f8ebf571a397f03b"
}