{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC WinCC and SIMATIC PCS 7\nVulnerability: Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker with access to the affected devices to execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following SIMATIC products:\n\nSIMATIC PCS 7 v8.0 and earlier\nSIMATIC PCS 7 v8.1 and newer (if \"Encrypted Communication\" is disabled)\nSIMATIC WinCC v7.2 and earlier\nSIMATIC WinCC v7.3 and newer (if \"Encrypted Communication\" is disabled)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nIf affected installations do not have “Encrypted Communication” configured, an unauthenticated attacker with network access may be able to execute arbitrary code.\nCVE-2019-10922 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nVladimir Dashchenko and Sergey Temnikov from Kaspersky Lab reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends the following mitigations:\n\nUpgrade SIMATIC WinCC to v7.3 or newer.\nUpgrade SIMATIC PCS 7 to v8.1 or newer.\nEnable “Encrypted Communications” (some newer versions have this enabled by default).\nApply defense-in-depth concepts.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure their environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at:\nhttps://www.siemens.com/industrialsecurity\nFor more information on the vulnerability and more detailed mitigation instructions, please see Siemens security advisory SSA-705517 at the following location:\nhttp://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10922"
  ],
  "techniques": [],
  "advisory": "icsa-19-134-02",
  "title": "Siemens SIMATIC WinCC and SIMATIC PCS 7 | CISA",
  "source": "ics-advisories",
  "id": "5f8defed54daa2e480e78529b6832f6255a995058243904e16dc93070ff0fc6d"
}