{
  "markdown": "\nCVSS v3 6.8\nATTENTION: Public exploits are available.\nVendor: PHOENIX CONTACT\nEquipment: WLAN capable devices using the WPA2 Protocol\nVulnerabilities: Reusing a Nonce\nAFFECTED PRODUCTS\nPHOENIX CONTACT reports that these vulnerabilities affect all versions of the following WLAN capable devices using the WPA2 Protocol:\n\nBL2 BPC,\nBL2 PPC,\nFL COMSERVER WLAN 232/422/485,\nFL WLAN 110x,\nFL WLAN 210x,\nFL WLAN 510x,\nFL WLAN 230 AP 802-11,\nFL WLAN 24 AP 802-11,\nFL WLAN 24 DAP 802-11,\nFL WLAN 24 EC 802-11,\nFL WLAN EPA,\nFL WLAN SPA,\nITC 8113,\nRAD-80211-XD,\nRAD-WHG/WLAN-XD,\nTPC 6013,\nVMT 30xx,\nVMT 50xx, and\nVMT 70xx.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to operate as a “man-in-the-middle” between the device and the wireless access point.\nMITIGATION\nPHOENIX CONTACT has reported that users operating embedded devices in AP mode are not affected by these vulnerabilities. PHOENIX CONTACT is actively working on discovering how these vulnerabilities affect its products and plans to release future updates as they become available. For more information, please see the advisory at this location:\nhttps://cert.vde.com/de-de/advisories/vde-2017-003\nPHOENIX CONTACT recommends that users apply the security update provided by Microsoft at the following location for devices running Microsoft Windows:\nhttps://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2017-13080\nIf WPA-TKIP is being used for WLAN configuration, PHOENIX CONTACT recommends the user switch to AES-CCMP immediately.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nThese vulnerabilities are not remotely exploitable. High skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nREUSING A NONCE, KEY PAIR IN ENCRYPTION CWE-323\n\nMultiple products are affected by key reinstallation attacks known as KRACK. The four-way hand shake traffic in the Wi-Fi Protected Access WPA and WPA2 protocol can be manipulated to allow nonce reuse resulting in key reinstallation. This could allow an attacker to execute a “man-in-the-middle” attack, enabling the attacker within radio range to replay, decrypt, or spoof frames.\nThe following CVEs have been assigned to this group of vulnerabilities:\nCVE-2017-13077: reinstallation of the pairwise key in the four-way handshake,\nCVE-2017-13078: reinstallation of the group key in the four-way handshake, and\nCVE-2017-13080: reinstallation of the group key in the group key handshake,\nA CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\nRESEARCHER\nMathy Vanhoef of imec-DistriNet, KU Leuven discovered these vulnerabilities. PHOENIX CONTACT reported these vulnerabilities to CERT@VDE. CERT@VDE coordinated these vulnerabilities with ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Communications, Critical Manufacturing, Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-13080",
    "CVE-2017-13077",
    "CVE-2017-13078"
  ],
  "techniques": [],
  "advisory": "icsa-17-325-01",
  "title": "PHOENIX CONTACT WLAN Capable Devices using the WPA2 Protocol | CISA",
  "source": "ics-advisories",
  "id": "caaeb35f68d5000554bd81979ade61a7ed7bf320e105fac5355545d53f64923b"
}