{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: Honeywell\nEquipment: WIN-PAK\nVulnerabilities: Cross-site Request Forgery, Improper Neutralization of HTTP Headers for Scripting Syntax, Use of Obsolete Function\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities allows an attacker to perform remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WIN-PAK, a monitoring platform, are affected:\n\nWIN-PAK 4.7.2, Web and prior versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CROSS-SITE REQUEST FORGERY CWE-352\nThe affected product is vulnerable to a cross-site request forgery, which may allow an attacker to remotely execute arbitrary code.\nCVE-2020-7005 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER NEUTRALIZATION OF HTTP HEADERS FOR SCRIPTING SYNTAX CWE-644\nThe header injection vulnerability has been identified, which may allow remote code execution.\nCVE-2020-6982 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.3    USE OF OBSOLETE FUNCTION CWE-477\nThe affected product is vulnerable due to the usage of old jQuery libraries. \nCVE-2020-6978 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nHoneywell reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHoneywell recommends users with potentially affected products take the following steps to protect themselves:\n\nUpdate WIN-PAK to latest version, WIN-PAK 4.7.2 B1072.3.4, before applying the patch, which is available on the Honeywell Mywebtech portal.\nAs a best practice, Honeywell recommends users isolate systems from the Internet or create additional layers of defense to their system from the Internet by placing the affected hardware behind a firewall or into a DMZ.\nIf remote connections to the network are required, consider using a VPN or other means to ensure secure remote connections into the network where the device is located.\n\nCISA recommends users take the following defensive measures to minimize the risk of exploitation from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-6982",
    "CVE-2020-6978",
    "CVE-2020-7005"
  ],
  "techniques": [],
  "advisory": "icsa-20-056-05",
  "title": "Honeywell WIN-PAK | CISA",
  "source": "ics-advisories",
  "id": "973ad89fb165ebe447e503bf92384efebbd3b80249987cd585215a085bcc531e"
}