{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SCALANCE XM-400 and XR-500\nVulnerability: Improper Validation of Integrity Check Value\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated remote attacker to cause interruptions in the network.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SCALANCE X industrial switches are affected:\n\nXM408-4C: All versions prior to v6.5\nXM408-4C (L3 int.): All versions prior to v6.5\nXM408-8C: All versions prior to v6.5\nXM408-8C (L3 int.): All versions prior to v6.5\nXM416-4C: All versions prior to v6.5\nXM416-4C (L3 int.): All versions prior to v6.5\nXR524-8C, 1x230V: All versions prior to v6.5\nXR524-8C, 1x230V (L3 int.): All versions prior to v6.5\nXR524-8C, 2x230V: All versions prior to v6.5\nXR524-8C, 2x230V (L3 int.): All versions prior to v6.5\nXR524-8C, 24V: All versions prior to v6.5\nXR524-8C, 24V (L3 int.): All versions prior to v6.5\nXR526-8C, 1x230V: All versions prior to v6.5\nXR526-8C, 1x230V (L3 int.): All versions prior to v6.5\nXR526-8C, 2x230V: All versions prior to v6.5\nXR526-8C, 2x230V (L3 int.): All versions prior to v6.5\nXR526-8C, 24V: All versions prior to v6.5\nXR526-8C, 24V (L3 int.): All versions prior to v6.5\nXR528-6M: All versions prior to v6.5\nXR528-6M (2HR2): All versions prior to v6.5\nXR528-6M (2HR2, L3 int.): All versions prior to v6.5\nXR528-6M (L3 int.): All versions prior to v6.5\nXR552-12M: All versions prior to v6.5\nXR552-12M (2HR2): All versions prior to v6.5\nXR552-12M (2HR2): All versions prior to v6.5\nXR552-12M (2HR2, L3 int.): All versions prior to v6.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER VALIDATION OF INTEGRITY CHECK VALUE CWE-354\nThe OSPF protocol implementation in affected devices fails to verify the checksum and length fields in the OSPF LS update messages. Successful exploitation requires OSPF to be enabled on an affected device and could allow an unauthenticated remote attacker to cause network interruptions.\nCVE-2021-37182 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nFor all affected products, Siemens recommends updating to v6.5 or later.\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDisable OSPF in the layer 3 configuration menu (note OSPF is disabled by default). The vulnerability is not exploitable when OSPF is disabled.\nIf OSPF is used, set a password for the OSPF interface, and enable MD5 authentication.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-145224\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-37182"
  ],
  "techniques": [],
  "advisory": "icsa-22-167-10",
  "title": "Siemens SCALANCE XM-400 and XR-500 | CISA",
  "source": "ics-advisories",
  "id": "f5876d78a125546d561731f08128a06e2ca976a30e373bafd546094039a1e947"
}