{
  "markdown": "\nOVERVIEW\nGleb Gritsai, Ilya Karpov, and Kirill Nesterov of Positive Technologies Security Lab and independent researcher Alisa Esage Shevchenko have identified vulnerabilities in the Schneider Electric InduSoft Web Studio and InTouch Machine Edition 2014. Schneider Electric has released new patches that mitigate these vulnerabilities.\nPublic exploits that target these vulnerabilities may exist.\nAFFECTED PRODUCTS\nThe following Schneider Electric products are affected:\n\nInduSoft Web Studio, Version 7.1.3.2 and all previous versions and\nInTouch Machine Edition 2014, version 7.1.3.2 and all previous versions.\n\nIMPACT\nAn attacker who exploits these vulnerabilities may be able to execute arbitrary code.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSchneider Electric’s corporate headquarters is located in Paris, France, and maintains offices in more than 100 countries worldwide.\nThe affected products, Schneider Electric Wonderware InTouch Machine Edition and Schneider Electric InduSoft Web Studio, are embedded HMI software packages. According to Schneider Electric, these products are used in energy management operations in the Commercial Facilities, Energy, Food and Agriculture, and Information Technology sectors globally.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nUSE OF HARD-CODED CREDENTIALSCWE-798: Use of Hard-coded Credentials, http://cwe.mitre.org/data/definitions/798.html, web site last accessed March 26, 2015.\n\nSensitive information is stored in Project Files and Project Configuration Files. This information is protected using a hard-coded, clear text password.\nCVE-2015-0996NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0996, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Schneider Electric has assigned a CVSS v2 base score of 4.7; the CVSS vector string is (AV:L/AC:M/Au:N/C:C/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:M/Au:N/C:C/I:N/A:N, web site last accessed March 26, 2015.\n\nAUTHENTICATIONCWE-287: Improper Authentication, http://cwe.mitre.org/data/definitions/287.html, web site last accessed March 26, 2015.\n\nWhen connecting to server from HMI, available user names are presented to the screen allowing for potential brute force attacks.\nCVE-2015-0997NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0997, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Schneider Electric has assigned a CVSS v2 base score of 3.3; the CVSS vector string is (AV:A/AC:L/Au:N/C:P/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:A/AC:L/Au:N/C:P/I:N/A:N, web site last accessed March 26, 2015.\n\nCLEARTEXT TRANSMISSION OF SENSITIVE INFORMATIONCWE-319: Cleartext Transmission of Sensitive Information, http://cwe.mitre.org/data/definitions/319.html, web site last accessed March 26, 2015.\n\nUser credentials are sent in clear text allowing for malicious actors to access the control system.\nCVE-2015-0998NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0999, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Schneider Electric has assigned a CVSS v2 base score of 3.3; the CVSS vector string is (AV:A/AC:L/Au:N/C:P/I:N/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:A/AC:L/Au:N/C:P/I:N/A:N, web site last accessed March 26, 2015.\n\nCLEARTEXT TRANSMISSION OF SENSITIVE INFORMATIONCWE-319: Cleartext Transmission of Sensitive Information, http://cwe.mitre.org/data/definitions/319.html, web site last accessed March 26, 2015.\n\nOPC User Credentials are stored in a configuration file in cleartext.\nCVE-2015-0999NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0999, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. Schneider Electric has assigned a CVSS v2 base score of 5.2; the CVSS vector string is (AV:L/AC:L/Au:S/C:C/I:P/A:N).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:S/C:C/I:P/A:N, web site last accessed March 26, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited from an adjacent network.\nEXISTENCE OF EXPLOIT\nPublic exploits that target these vulnerabilities may exist.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nSchneider Electric has two divisions supporting this product under separate organizations. Patch availability and technical information is available at these separate divisional support units. Schneider Electric has issued separate security notices for each specific division/product support center.\nSEVD-2015-054-01 – InduSoft Web Studio \nSchneider Electric has released patches, available for download, to remediate the noted vulnerabilities.\nThe patch for InduSoft Web Studio, Version 7.1.3.4, Service Pack 3, Patch 4, is available for download using this URL:\nhttp://www.indusoft.com/dev/INDUSOFT/Release/IWS71.3.4/IWS71.3.4.zip\nSEVD-2015-054-02 - InTouch Machine Edition 2014\nThis document is intended to help provide an overview of the identified vulnerability and actions required to mitigate it. To obtain full details on the issues and assistance on how to protect your installation, please contact your local Schneider Electric representative. These organizations will be fully aware of the situation and can support you through the process.\nFor further information on vulnerabilities in Schneider Electric’s products, please visit Schneider Electric’s cybersecurity web page at:\nhttp://www2.schneider-electric.com/sites/corporate/en/support/cybersecurity/cybersecurity.page\nICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2015-0997",
    "CVE-2015-0998",
    "CVE-2015-0999",
    "CVE-2015-0996"
  ],
  "techniques": [],
  "advisory": "icsa-15-085-01",
  "title": "Schneider Electric InduSoft Web Studio and InTouch Machine Edition 2014 Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "4f658f2ed4ccc98aef03f4f994b16153ae3f3be49e28381a1ec44d1aec0bc604"
}