{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: Exploitable remotely/low attack complexity\nVendor: ABB\nEquipment: OPC Server for AC 800M\nVulnerability: Execution with Unnecessary Privileges\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a low privileged authenticated user to remotely execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of OPC Server, a run-time data reader, are affected:\n800xA, Control Software for AC 800M:\n\nOPC Server for AC 800M: Versions 5.1.0-x, 5.1.1-x, 6.0.0-1 to 6.0.0-3\n\nControl Builder Safe, 1.x and 2.0 including:\n\nOPC Server for AC 800M: Versions 5.1.1-1 and 6.0.0-1\n\nCompact Product Suite – Control and I/O:\n\nOPC Server for AC 800M: Versions 5.1.0-x, 5.1.1-x, 6.0.0-x\n\n3.2 VULNERABILITY OVERVIEW\n3.1.1    EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250\nThe affected products are vulnerable to an authenticated remote user with low privileges who could successfully insert and execute arbitrary code in the node running the AC 800M OPC Server.\nCVE-2021-22284 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nWilliam Knowles of Applied Risk reported this vulnerability to CISA.\n4. MITIGATIONS\nABB advises affected users to install the updates to address the vulnerability as follows: \n\n800xA control software for AC 800M to v6.1.0-0 or later.\n800xA, Control Software for AC 800M update to 6.0.0-4 (scheduled for release later in 2022).\n\nContact ABB for update information.\nUsers unable to install the update are advised to review the Mitigations and Workarounds section of the ABB advisory for additional advice on how to reduce the risk associated with this vulnerability.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2021-22284"
  ],
  "techniques": [],
  "advisory": "icsa-22-074-01",
  "title": "ABB OPC Server for AC 800M | CISA",
  "source": "ics-advisories",
  "id": "0838fa2bbcbb64456cf64deb8badb981634de3643d5f6c519cb213070ea72e86"
}