{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Rockwell Automation \nEquipment: Products using GoAhead Web Server \nVulnerabilities: Infinite Loop, Use after Free \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could have a high impact on the confidentiality, integrity, and availability of the vulnerable devices. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports the following products use a version of GoAhead web server vulnerable to both CVE-2019-5096 and CVE-2019-5097:  \n\n1732E-8CFGM8R/A: firmware version 1.012 \n1732E-IF4M12R/A (discontinued): firmware version 1.012 \n1732E-IR4IM12R/A: firmware version 1.012 \n1732E-IT4IM12R/A: firmware version 1.012 \n1732E-OF4M12R/A: firmware version 1.012 \n1732E-OB8M8SR/A: firmware version 1.013 \n1732E-IB8M8SOER: firmware version 1.012 \n1732E-8IOLM12R: firmware version 2.011 \n1747-AENTR: firmware version 2.002 \n1769-AENTR: firmware version 1.001 \n5069-AEN2TR: firmware version 3.011 \n1756-EN2TR/C: firmware versions up to and including 11.001 \n1756-EN2T/D: firmware versions up to and including 11.001 \n1756-EN2TSC/B (discontinued): firmware version 10.01 \n1756-EN2TSC/B: firmware version 10.01 \n1756-HIST1G/A (discontinued): firmware versions up to and including 3.054 \n1756-HIST2G/A(discontinued): firmware versions up to and including 3.054 \n1756-HIST2G/B: firmware versions up to and including 5.103 \n\nRockwell Automation reports the following products use a version of GoAhead web server vulnerable to CVE-2019-5097:  \n\nControlLogix 5580 controllers: firmware version V28 – V32 \nGuardLogix 5580 controllers: firmware version V31 – V32 \nCompactLogix 5380 controllers: firmware version V28 – V32 \nCompact GuardLogix 5380 controllers: firmware version V31 – V32 \nCompactLogix 5480 controllers: firmware version V32 \n1756- EN2T/D: firmware version 11.001 \n1756-EN2TR/C: firmware version 11.001 \n1765 – EN3TR/B: firmware version 11.001 \n1756-EN2F/C: firmware version 11.001 \n1756-EN2TP/A: firmware version 11.001. \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INFINITE LOOP CWE-835 \nA denial-of-service vulnerability exists in the GoAhead web server. To exploit this vulnerability, a malicious user could send specially crafted HTTP requests and trigger an infinite loop in the process. If exploited, the targeted device could crash. \nCVE-2019-5097 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.2 USE AFTER FREE CWE-416 \nA critical vulnerability exists in how the web server processes requests. If exploited, a malicious user could leverage this vulnerability to execute arbitrary code by sending specially crafted HTTP requests to the targeted device. \nCVE-2019-5096 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nRockwell Automation reported to CISA that the devices listed may use a version of GoAhead web server with publicly known vulnerabilities. \n4. MITIGATIONS\nRockwell Automation recommends users apply the latest version of firmware when possible: \n\n1769-AENTR: Update to 1.003 or later \n5069-AEN2TR (discontinued): Migrate to the 5069-AENTR. \n1756-EN2T/D: Update to 11.002 or later \n1756-EN2T/D: Update to 11.002 or later \n1756-EN2TR/C: Update to 11.002 or later \n1756-EN2F/C: Update to 11.002 or later \n1756-EN2TP/A: Update to 11.002 or later \n1756-HIST1G/A (discontinued): Update to series B v5.104 or C 7.100 or later \n1756-HIST2G/A (discontinued): Update to series B v5.104 or C 7.100 or later  \n1756-HIST2G/B: Update to 5.104 or later \n1756-EN2F/C: Update to 11.002 or later \nControlLogix 5580 controllers: Update to V32.016 or later \nGuardLogix 5580 controllers: Update to V32.016 or later \nCompactLogix 5380 controllers: Update to V32.016 or later \nCompact GuardLogix 5380 controllers: Update to V32.016 or later \nCompactLogix 5480: Update to V32.016 or later \n\nIf updating firmware is not possible or updated firmware is unavailable, Rockwell Automation recommends the following compensating controls to minimize vulnerability risk: \n\nDisable the web server if possible. Review the corresponding product user manual for instructions, which can be found in the Rockwell Automation literature library.  \n\nFor 1732E, upgrade to the latest firmware to disable the web server. \n\n\nConfigure firewalls to disallow network communication through HTTP/Port 80. \n\nSee the Rockwell Automation Knowledgebase article, Security Best Practices, for more recommendations to maintain security posture of an environment \nUsers should see the Rockwell Automation security advisory for more information.  \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have a low attack complexity. \n",
  "cves": [
    "CVE-2019-5096",
    "CVE-2019-5097"
  ],
  "techniques": [],
  "advisory": "icsa-23-026-06",
  "title": "Rockwell Automation products using GoAhead Web Server | CISA",
  "source": "ics-advisories",
  "id": "465b4a973357875d1df69111f909af9eadd4ce31ee262f3edb61dc3b693cee13"
}