{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Teamcenter\nVulnerability: Privilege Defined with Unsafe Actions, Authorization Bypass Through User-Controlled Key, Improper Restriction of XML External Entity Reference\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to view sensitive files, bypass authorization, or take over another account.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Teamcenter, a virtualization platform, are affected:\nTeamcenter 12.4: All versions prior to 12.4.0.8\nTeamcenter 13.0: All versions prior to 13.0.0.7\nTeamcenter 13.1: All versions prior to 13.1.0.5\nTeamcenter 13.2: All versions prior to 13.2.0.2\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PRIVILEGE DEFINED WITH UNSAFE ACTIONS CWE-267\nThe “surrogate” functionality on the user profile of the application does not perform sufficient access control, which may allow an account takeover. Any profile on the application can perform this attack and access any other user assigned tasks via the “inbox/surrogate tasks.”\nCVE-2021-40354 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:N).\n3.2.2    AUTHORIZATION BYPASS THROUGH USER-CONTROLLED KEY CWE-639\nThe affected application contains an insecure direct object reference (IDOR) vulnerability, which may allow an attacker to use user-supplied input to access objects directly.\nCVE-2021-40355 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nThe application contains an XML external entity injection (XXE) vulnerability, which may allow an attacker to view files on the application server filesystem.\nCVE-2021-40356 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nNicolas Verdier from TEHTRIS reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends updating to the latest versions at https://support.sw.siemens.com/ (login required): \n\nTeamcenter 12.4: Update to v12.4.0.8 or later\nTeamcenter 13.0: Update to v13.0.0.7 or later\nTeamcenter 13.1: Update to v13.1.0.5 or later\nTeamcenter 13.2: Update to v13.2.0.2 or later\n\nSiemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk:\n\nAvoid opening untrusted files in Teamcenter\nHarden the application’s host to prevent local access by untrusted personnel\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends to configure the environment according to the Siemens operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-987403\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-40355",
    "CVE-2021-40356",
    "CVE-2021-40354"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-08",
  "title": "Siemens Teamcenter | CISA",
  "source": "ics-advisories",
  "id": "7f24d6b8de49f281ced0c6fd8ae8ea33a30f2a4c926bb87c5c543ace8b7f359a"
}