{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Rockwell Automation\nEquipment: Arena\nVulnerabilities: Out-of-Bounds Read, Access of Uninitialized Pointer\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute arbitrary code by using a memory buffer overflow or using an uninitialized pointer in the application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Arena, a simulation software, are affected:\n\nArena: Version 16.20.00001\n\n3.2 Vulnerability Overview\n3.2.1 OUT OF BOUNDS READ CWE-125\nVersion 16.20 of Rockwell Automation's Arena software contains an out-of-bounds read vulnerability when certain malformed files are processed. An attacker with local access could utilize this to potentially leak memory or achieve arbitrary code execution.\nCVE-2023-27854 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2 ACCESS OF UNINITIALIZED POINTER CWE-824\nVersion 16.20 of Rockwell Automation's Arena software contains an uninitialized pointer when certain malformed files are processed. A local attacker who has properly prepared a malformed file may be able to point to a predetermined location in memory and execute arbitrary code.\nCVE-2023-27858 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMichael Heinzl reported these vulnerabilities to CISA.\n4. MITIGATIONS\nRockwell Automation recommends upgrading the affected product software to 16.20.01.\nRockwell Automation encourages users to implement their suggested security best practices to minimize exploitation risk of these vulnerabilities.\nFor additional information, refer to Rockwell Automation's Security Bulletin.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nOctober 26, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-27858",
    "CVE-2023-27854"
  ],
  "techniques": [],
  "advisory": "icsa-23-299-04",
  "title": "Rockwell Automation Arena | CISA",
  "source": "ics-advisories",
  "id": "5345993edaed27adc6cd353d293fcc7743ba8d0413dbdb9b63e0262e7873f58b"
}