{
  "markdown": "\nOverview\nICS-CERT originally released Advisory ICSA-12-032-01P on the US-CERT secure portal on March 02, 2012. This web page release was delayed to allow users time to download and install the update.\nICS-CERT received a report from GE Intelligent Platforms and the Zero Day Initiative (ZDI) concerning a memory corruption vulnerability in the GE Intelligent Platforms Proficy Historian Data Archiver. If exploited, this vulnerability could allow an attacker to cause the Historian Data Archiver service to crash, which may lead to arbitrary code execution. This vulnerability was reported to ZDI by independent security researcher Luigi Auriemma.\nGE Intelligent Platforms has created a patch to address the issue.\nAffected Products\nThis vulnerability affects the following GE Intelligent Platforms products:\n\nProficy Historian: Versions 4.5 and prior\nProficy HMI/SCADA–CIMPLICITY: Version 8.2 (with Proficy Historian 4.5 or prior installed)\nProficy HMI/SCADA–iFIX: Versions 5.5, 5.0, and 5.1 (with Proficy Historian 4.5 or prior installed).\n\nNote: Proficy Pulse is not affected by the vulnerability described in this advisory.\nImpact\nExploitation of this vulnerability could cause the Historian Data Archiver service to crash and potentially allow an attacker to take control of a system running the affected software. Impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBackground\nProficy Historian is a data historian that collects, archives, and distributes production information. According to GE, the Proficy Historian product is deployed across multiple industries worldwide.\nVulnerability Characterization\nVulnerability Overview\nA memory corruption vulnerability exists because of the way the Historian Data Archiver service (ihDataArchiver.exe or ihDataArchiver_x64.exe) processes incoming traffic on Port 14000/TCP. A specially crafted packet may cause the Historian Data Archiver service to crash and may allow arbitrary code execution.\nCVE-2012-0229 has been assigned to this vulnerability.\nVulnerability Details\nExploitability\nThis vulnerability is remotely exploitable.\nExistence of Exploit\nNo known exploits specifically target this vulnerability.\nDifficulty\nAn attacker with a moderate skill level would be able to exploit these vulnerabilities.\nMitigation\nGE Intelligent Platforms has released a security advisory and free product update Software Improvement Modules (SIMs) to address this vulnerability in Proficy software. GE Intelligent Platforms urges all customers to follow the recommendations in their security advisory.\nNote: A valid GE user ID and Customer Service Number are required to access the advisory and update.\nGE Intelligent Platforms recommends that customers apply product updates to Proficy Historian Versions 3.1, 3.5, 4.0, and 4.5. Proficy Historian customers using versions older than 3.1 are encouraged to upgrade to 3.1 or greater and\\ then apply the appropriate product update.\nGE Intelligent Platforms also recommends that Proficy HMI/SCADA.iFIX and Proficy HMI/SCADA . CIMPLICITY customers who have installed Proficy Historian apply these product updates as well. Alternatively, Proficy HMI/SCADA customers m\\ ay uninstall the Proficy Historian software if it is not in use.\nNote: Proficy SIMs are cumulative. All future SIMs will include these updates.\nGE has provided the following installation instructions for iFIX and CIMPLICITY SIMs.\nOption 1: Apply a product update to the Proficy Historian software.\nRefer to the information above for .Historian Installations. and apply the appropriate product update to Proficy Historian.\nOption 2: Uninstall Proficy Historian if not in use.\n\nDouble-click the Add/Remove Programs icon in the Control Panel. The Add/Remove Programs dialog box opens.\nSelect Proficy Historian, and click the Remove button.\n\nTo uninstall Historian and save the current Historian configuration and data, select Do Not Delete Archives and click Next.\nTo uninstall Historian and delete the current Historian configuration and data, select Delete Archives, and click Next.\n\n\nThe uninstall proceeds and all Historian components are removed.\n\nIn addition to installing the product updates available from GE, ICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls with properly configured rules addressing Port 14000/TCP, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents. ICS-CERT reminds organizations to \\ perform proper impact analysis and risk assessment prior to taking defensive measures.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2012-0229"
  ],
  "techniques": [],
  "advisory": "icsa-12-032-01",
  "title": "GE Proficy Historian ihDataArchiver | CISA",
  "source": "ics-advisories",
  "id": "1b80d001a2bd0079273979be30a278dcc2f06780ca410252e28ef863919b4388"
}