{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: RUGGEDCOM ROX IIB\nVulnerabilities: Improper Input Validation, NULL Pointer Dereference, Out-of-Bounds Write, Insufficient Verification of Data Authenticity, Improper Certificate Validation, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow the decryption of encrypted content, possible code execution, or cause a system crash, resulting in a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nRUGGEDCOM ROX MX5000: All versions prior to v2.14.0\nRUGGEDCOM ROX RX1400: All versions prior to v2.14.0\nRUGGEDCOM ROX RX1500: All versions prior to v2.14.0\nRUGGEDCOM ROX RX1501: All versions prior to v2.14.0\nRUGGEDCOM ROX RX1510: All versions prior to v2.14.0\nRUGGEDCOM ROX RX1511: All versions prior to v2.14.0\nRUGGEDCOM ROX RX1512: All versions prior to v2.14.0\nRUGGEDCOM ROX RX500: All versions prior to v2.14.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nA cached side-channel attack during handshakes using RSA encryption could allow for the decryption of content. This is a variant of the adaptive chosen ciphertext attack (AKA Bleichenbacher attack) and affects all Network Security Services (NSS) versions prior to NSS 3.41 \nCVE-2018-12404 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    NULL POINTER DEREFERENCE CWE-476\nIn NSS before v3.36.7 and before v3.41.1, a malformed signature can cause a crash due to a NULL dereference, resulting in a denial-of-service condition. \nCVE-2018-18508 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.2.3    OUT-OF-BOUNDS WRITE CWE-787\nWhen encrypting with a block cipher, if a call to NSC_EncryptUpdate was made with data smaller than the block size, a small out-of-bounds write could occur. This could cause heap corruption and an exploitable crash.\nCVE-2019-11745 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nIn NSS before v3.46, several cryptographic primitives had missing length checks. In cases where the application calling the library did not perform a sanity check on the inputs, exploitation of this vulnerability could result in a crash due to a buffer overflow. \nCVE-2019-17006 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.5    IMPROPER CERTIFICATE VALIDATION CWE-295\nIn NSS before v3.44, a malformed Netscape certificate sequence can cause NSS to crash, resulting in a denial-of-service condition.\nCVE-2019-17007 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.6    OUT-OF-BOUNDS READ CWE-125\nAn out-of-bounds buffer read flaw was found in the pluto daemon of libreswan from Versions 3.27 to 3.31. An unauthenticated attacker could use this flaw to crash libreswan by sending specially crafted IKev1 informational exchange packets. The daemon respawns after the crash. \nCVE-2020-1763 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens ProductCERT reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens has released the following update and recommends it be applied:\nRUGGEDCOM ROX (products listed above): Update to v2.14.0 or later version\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDisable IPsec unless the feature is required in the network environment. Note that IPsec is disabled by default.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens security advisory SSA-379803\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-17006",
    "CVE-2020-1763",
    "CVE-2019-11745",
    "CVE-2018-18508",
    "CVE-2018-12404",
    "CVE-2019-17007"
  ],
  "techniques": [],
  "advisory": "icsa-21-040-04",
  "title": "Siemens RUGGEDCOM ROX II | CISA",
  "source": "ics-advisories",
  "id": "5f046106bd797516f8cb68806483071b71cfe62b3d3a4fa2030377cade7c3b8d"
}