{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.4\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: B&R Industrial Automation GmbH\nEquipment: Automation Studio and Automation Runtime\nVulnerability: Improper Authorization\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow a remote attacker to modify the configuration of affected devices.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of B&R products are affected:\n\nAutomation Studio Versions 2.7, 3.0.71, 3.0.80, 3.0.81, 3.0.90, 4.0.x to 4.6.4, and 4.7.2\nAutomation Runtime Versions 2.96, 3.00, 3.01, 3.06, 3.07, 3.08 to 3.10, 4.00 to 4.03, 4.04 to 4.03, 4.04 to 4.63, 4.72 and above.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHORIZATION CWE-285\nThe affected products are vulnerable to a weakness in SNMP service, which allows unauthenticated users to modify the configuration via the service.\nCVE-2019-19108 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Austria\n\n3.4 RESEARCHER\nYehuda Anikster and Amir Preminger of Claroty reported this vulnerability to CISA.\n4. MITIGATIONS\nB&R reports product-technical reasons disallow the changing of SNMP credentials. To reduce risk from this vulnerability, the following Automation Studio versions disable the SNMP service by default in newly created AS projects:\n\nAS 4.6.5 (Planned release date: 2020-03-27) and higher\nAS 4.7.3 (Planned release date: 2020-04-10) and higher\nAS 4.8.2 (Planned release date: 2020-06-11) and higher\n\nB&R reports the above-mentioned dates denoted as planned are preliminary and may be subject to change. Registered users may approach their local B&R service organization in case of questions.\nB&R recommends that affected users evaluate their need for the SNMP service and disable it if possible.\nFor more information related to this vulnerability please refer to the B&R advisory.\nFor additional information and support, please contact B&R service.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-19108"
  ],
  "techniques": [],
  "advisory": "icsa-20-051-01",
  "title": "B&R Automation Studio and Automation Runtime | CISA",
  "source": "ics-advisories",
  "id": "86377688066684565da318524122db76b53aecdd3a51cf700b7a6cfe0626bc4e"
}