{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens \nEquipment: SICAM A8000\nVulnerabilities: Use of Hard-coded Credentials, Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a privileged user to enable a debug port with default credentials and access to certain log files.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SICAM A8000, a remote terminal unit, are affected:\n\nCP-8000 MASTER MODULE WITH I/O - 25/+70°C (6MF2101-0AB10-0AA0): All versions prior to v16.20\nCP-8000 MASTER MODULE WITH I/O - 40/+70°C (6MF2101-1AB10-0AA0): All versions prior to v16.20\nCP-8021 MASTER MODULE (6MF2802-1AA00): All versions prior to v16.20\nCP-8022 MASTER MODULE WITH GPRS (6MF2802-2AA00): All versions prior to v16.20\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nAn undocumented debug port uses hard-coded default credentials. If this port is enabled by a privileged user, an attacker aware of the credentials could access an administrative debug shell on the affected device.\nCVE-2021-45033 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.2.2    IMPROPER ACCESS CONTROL CWE-284\nThe web server of the affected system allows access to logfiles and diagnostic data generated by a privileged user. An unauthenticated attacker could access the files by knowing the corresponding download links.\nCVE-2021-45034 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMichael Messner of Siemens Energy reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens recommends updating to v16.20 or later.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security and follow the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about these vulnerabilities, see Siemens’ security advisory SSA-324998\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2021-45033",
    "CVE-2021-45034"
  ],
  "techniques": [],
  "advisory": "icsa-22-013-02",
  "title": "Siemens SICAM A8000 | CISA",
  "source": "ics-advisories",
  "id": "faacb66f39c5201a41987549fa3a69bc021a8eefe9f155e6a87f20215d05739d"
}