{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.1\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: MicroLogix 1400 and CompactLogix 5370 Controllers\nVulnerability: Open Redirect\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote unauthenticated attacker to input a malicious link redirecting users to a malicious website.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Rockwell Automation products are affected:\n\nMicroLogix 1400 Controllers\n\nSeries A, All Versions\nSeries B, v15.002 and earlier\n\n\nMicroLogix 1100 Controllers v14.00 and earlier\nCompactLogix 5370 L1 controllers v30.014 and earlier\nCompactLogix 5370 L2 controllers v30.014 and earlier\nCompactLogix 5370 L3 controllers (includes CompactLogix GuardLogix controllers) v30.014 and earlier\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    URL REDIRECTION TO UNTRUSTED SITE ('OPEN REDIRECT') CWE-601\nAn open redirect vulnerability could allow a remote unauthenticated attacker to input a malicious link to redirect users to a malicious site that could run or download arbitrary malware on the user’s machine.\nCVE-2019-10955 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nJosiah Bryan and Geancarlo Palavicini reported this vulnerability to NCCIC.\n4. MITIGATIONS\nRockwell Automation has released a security advisory with mitigation steps that can be found at:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1086288 (Login required)\nRockwell Automation recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nUpdate to the latest available firmware revision that addresses the associated risk.\nUse trusted software, software patches, anti-virus/anti-malware programs, and interact only with trusted websites and attachments.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. VPN is only as secure as the connected devices.\nEmploy training and awareness programs to educate users on the warning signs of a phishing or social engineering attack.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10955"
  ],
  "techniques": [],
  "advisory": "icsa-19-113-01",
  "title": "Rockwell Automation MicroLogix 1400 and CompactLogix 5370 Controllers | CISA",
  "source": "ics-advisories",
  "id": "acf9fc3e8d6723c3536a7ababf6dd5c579df1a9e8f3c9fa00ff6230ee6c1ca92"
}