{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SINAMICS Medium Voltage Products, Remote Access\nVulnerabilities: Improper Restriction of Operations Within the Bounds of a Memory Buffer, Access of Memory Location After End of Buffer, Uncontrolled Resource Consumption, Improper Initialization, Out-of-Bound Read, Heap-based Buffer Overflow, Stack-based Buffer Overflow, Improper Null Termination\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-131-04 Siemens Medium Voltage Products (Update A) that was published May 11, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain full remote access to the HMI.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following SINAMICS products with remote access enabled on SIMATIC comfort HMI Panels:\n\nSINAMICS GH150: All versions\nSINAMICS GL150 (with option X30): All versions\nSINAMICS GM150 (with option X30): All versions\nSINAMICS SH150: All versions\nSINAMICS SL150: All versions\nSINAMICS SM120: All versions\nSINAMICS SM150: All versions\nSINAMICS SM150i: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nSmartVNC has a heap allocation leak vulnerability in the server Tight encoder, which could result in a denial-of-service condition.\nCVE-2021-27383 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    ACCESS OF MEMORY LOCATION AFTER END OF BUFFER CWE-788\nSmartVNC has an out-of-bounds memory access vulnerability in the device layout handler, represented by a binary data stream on client side, which could result in code execution.\nCVE-2021-27384 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nA remote attacker could send specially crafted packets to SmartVNC device layout handler on client side, which could influence the amount of resources consumed and result in a denial-of-service (infinite loop) condition.\nCVE-2021-27385 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.4    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nSmartVNC has a heap allocation leak vulnerability in the device layout handler on client side, which could result in a denial-of-service condition.\nCVE-2021-27386 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.5    IMPROPER INITIALIZATION CWE-665\nUltraVNC Revision 1198 contains multiple memory leaks in VNC client code, which could allow an attacker to read stack memory and can be abused for information disclosure. Combined with another vulnerability, it can be used to leak stack memory and bypass ASLR.\nCVE-2019-8259 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.6    OUT-OF-BOUNDS READ CWE-125\nUltraVNC Revision 1199 has an out-of-bounds read vulnerability in VNC client RRE decoder code, caused by multiplication overflow. \nCVE-2019-8260 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.7    OUT-OF-BOUNDS READ CWE-125\nUltraVNC Revision 1199 has an out-of-bounds read vulnerability in VNC code inside client CoRRE decoder, caused by multiplication overflow.\nCVE-2019-8261 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.8    HEAP-BASED BUFFER OVERFLOW CWE-122\nUltraVNC Revision 1203 has multiple heap buffer overflow vulnerabilities in VNC client code inside Ultra decoder, which could result in code execution.\nCVE-2019-8262 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.9    STACK-BASED BUFFER OVERFLOW CWE-121\nUltraVNC Revision 1205 has a stack-based buffer overflow vulnerability in VNC client code inside ShowConnInfo routine, which could lead to a denial-of-service condition.\nCVE-2019-8263 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n4.2.10     ACCESS OF MEMORY LOCATION AFTER END OF BUFFER CWE-788\nUltraVNC Revision 1203 has an out-of-bounds access vulnerability in VNC client inside Ultra2 decoder, which could result in code execution.\nCVE-2019-8264 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.11     ACCESS OF MEMORY LOCATION AFTER END OF BUFFER CWE-788\nUltraVNC Revision 1207 has multiple out-of-bounds access vulnerabilities connected with improper usage of SETPIXELS macro in VNC client code, which could result in code execution.\nCVE-2019-8265 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.12     IMPROPER NULL TERMINATION CWE-170\nUltraVNC Revision 1211 has multiple improper null termination vulnerabilities in VNC server code, which could result in out-of-bounds data being accessed by remote users.\nCVE-2019-8275 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.13     IMPROPER INITIALIZATION CWE-665\nUltraVNC Revision 1211 contains multiple memory leaks in VNC server code, which could allow an attacker to read stack memory and can be abused for information disclosure.\nCVE-2019-8277 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.14     ACCESS OF MEMORY LOCATION AFTER END OF BUFFER CWE-788\nUltraVNC Revision 1203 has out-of-bounds access vulnerability in VNC client inside RAW decoder, which could result in code execution.\nCVE-2019-8280 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Critical Manufacturing, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update B Part 1 of 2 ---------\nOnly HMI image versions prior to v16 Update 3a are affected. Siemens recommends updating the HMI Panel, as included in the following products:\n\nSINAMICS GH150: Update to v16 Update 4 or later\nSINAMICS GL150 (with option X30): Update to v16 Update 4 or later\nSINAMICS GM150 (with option X30): Update to v16 Update 4 or later\nSINAMICS SH150: Update to v16 Update 4 or later\nSINAMICS SM120: Update to v16 Update 4 or later\nSINAMICS SL150: Update to v15 SP1 Update 6 or later\nSINAMICS SM150: Update to v15 SP1 Update 6 or later\nSINAMICS SM150i: Update to v15 SP1 Update 6 or later\n\n--------- End Update B Part 1 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict access to Port 5900/TCP to trusted IP addresses only\n\n--------- Begin Update B Part 2 of 2 ---------\n\nDisable Sm@rtServer in the SIMATIC HMI Comfort Panels system component of SINAMICS. If this is not possible, apply defense-in-depth principles. Note: Sm@rtServer is disabled by default but can be enabled on request by the system integrator.\nFollow SINAMICS MV industrial security guidelines.\nFor any questions regarding update, please contact Siemens customer service or the system integrator.\n\n--------- End Update B Part 2 of 2 ---------\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security, and follow the recommendations in the product manuals. Additional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor additional information see Siemens Security Advisory SSA-286838\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a high attack complexity.\n",
  "cves": [
    "CVE-2019-8261",
    "CVE-2019-8265",
    "CVE-2019-8277",
    "CVE-2019-8280",
    "CVE-2021-27386",
    "CVE-2019-8262",
    "CVE-2021-27385",
    "CVE-2021-27384",
    "CVE-2019-8275",
    "CVE-2019-8260",
    "CVE-2019-8263",
    "CVE-2019-8264",
    "CVE-2021-27383",
    "CVE-2019-8259"
  ],
  "techniques": [],
  "advisory": "icsa-21-131-04",
  "title": "Siemens SINAMICS Medium Voltage Products Remote Access (Update B) | CISA",
  "source": "ics-advisories",
  "id": "845de877a9639a38adf476f1fdefe2df76518cc00a3790eedd5e4df9baf62dc5"
}