{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Tecnomatix RobotExpert\nVulnerability: Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Tecnomatix RobotExpert are affected:\n\nAll versions prior to v16.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nAffected applications lack proper validation of user-supplied data when parsing CELL files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process. \nCVE-2021-25670 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nFrancis Provencher {PRL}, working with Trend Micro’s Zero Day Initiative, reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk:\n\nUpdate to V16.1 or later\nDo not open untrusted CELL files from unknown sources\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security and to follow the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor additional information, please refer to Siemens Security Advisory SSA-163226\nFor further inquiries on security vulnerabilities in Siemens products and solutions, please contact Siemens ProductCERT.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-25670"
  ],
  "techniques": [],
  "advisory": "icsa-21-103-12",
  "title": "Siemens Tecnomatix RobotExpert | CISA",
  "source": "ics-advisories",
  "id": "8c4c6bccc33476b256a9e09b11b3fe10d18c56ed4ef0081e67b03dac86c01e90"
}