{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Schneider Electric\nEquipment: Wonderware ArchestrA Logger\nVulnerabilities: Stack-Based Buffer Overflow, Uncontrolled Resource Consumption, Null Pointer Deference\nAFFECTED PRODUCTS\nSchneider Electric reports that the following versions of Wonderware ArchestrA Logger, a logging software, are affected:\n\nWonderware ArchestrA Logger, versions 2017.426.2307.1 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to execute code or cause a denial of service.\nMITIGATION\nSchneider Electric recommends that users of any Wonderware, Avantis, SimSci, or Skelta product that installs the Wonderware ArchestrA Logger version 2017.426.2307.1 or prior should apply the Wonderware ArchestrA Logger Security Patch v2017.517.2328.1 as soon as possible.\nSoftware updates can be downloaded from the Global Customer Support “Software Download” area or from the links below:\n\nWonderware ArchestrA Logger Security Patch v2017.517.2328.1 (requires login):\n\nhttps://gcsresource.invensys.com/tracking/ConfirmDownload.aspx?id=22429\n\n\n\nFor more information about this vulnerability and patch, please refer to Schneider Electric Security Bulletin LFSec00000116, which is available at the following location:\nhttp://software.schneider-electric.com/pdf/security-bulletin/lfsec00000116/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nThe stack-based buffer overflow vulnerability has been identified, which may allow a remote attacker to execute arbitrary code in the context of a highly privileged account.\nCVE-2017-9629 has been assigned to this vulnerability. Schneider Electric has assigned a CVSS v3 base score of 9.8 to this vulnerability; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nUNCONTROLLED RESOURCE CONSUMPTION CWE-400\n\nThe uncontrolled resource consumption vulnerability could allow an attacker to exhaust the memory resources of the machine, causing a denial of service.\nCVE-2017-9627 has been assigned to this vulnerability. Schneider Electric has assigned a CVSS v3 base score of 8.6 to this vulnerability; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nNULL POINTER DEFERENCE CWE-476\n\nThe null pointer deference vulnerability could allow an attacker to crash the logger process, causing a denial of service for logging and log-viewing. Schneider Electric notes that applications which use the Wonderware ArchestrA Logger continue to run when the Wonderware ArchestrA Logger service is unavailable.\nCVE-2017-9631 has been assigned to this vulnerability. Schneider Electric has assigned a CVSS v3 base score of 7.5 to this vulnerability; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nAndrey Zhukov of USSC discovered this vulnerability and reported it to Schneider Electric. Schneider Electric then self-reported this vulnerability to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Dams, Defense Industrial Base, Energy, Food and Agriculture, Government Facilities, Nuclear Reactors, Materials, and Waste, Transportation Systems, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n",
  "cves": [
    "CVE-2017-9627",
    "CVE-2017-9631",
    "CVE-2017-9629"
  ],
  "techniques": [],
  "advisory": "icsa-17-187-04",
  "title": "Schneider Electric Wonderware ArchestrA Logger | CISA",
  "source": "ics-advisories",
  "id": "c42bf5b8bb0dda2bc076b5875a90439777b98eaefeabb30dfea3f2f3c16501b1"
}