{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIPROTEC 4, SIPROTEC Compact, and Reyrolle devices using the EN100 Ethernet communication module extension\nVulnerability: Missing Authentication for Critical Function\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-18-067-02 Siemens SIPROTEC 4, SIPROTEC Compact, and Reyrolle devices using the EN100 Ethernet communication module extension (Update A) that was published April 19, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to either upgrade or downgrade the firmware of the device, including downgrading to older versions with known vulnerabilities.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following EN100 Ethernet module products:\n\nEN100 Ethernet module IEC 61850 variant: All versions prior to V4.30,\nEN100 Ethernet module PROFINET IO variant: All versions,\nEN100 Ethernet module Modbus TCP variant: All versions,\n\n--------- Begin Update B Part 1 of 2 ---------\n\nEN100 Ethernet module DNP3 variant: All versions prior to v1.04, and\nEN100 Ethernet module IEC 104 variant: All versions prior to v1.22\n\n--------- End Update B Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1 MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nSuccessful exploitation of this vulnerability could allow an attacker to either upgrade or downgrade the firmware of the device, including downgrading to older versions with known vulnerabilities.\nCVE-2018-4838 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N)).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n\n4.4 RESEARCHER\nIlya Karpov and Dmitry Sklyarov from Positive Technologies reported this vulnerability to Siemens.\n5. MITIGATIONS\nSiemens has provided the following updates for mitigations:\n\nEN100 Ethernet module DNP3 variant (All versions prior to v1.04): Update to v1.04 and configure maintenance password, which can be located here: https://support.industry.siemens.com/cs/us/en/ view/109745821\nEN100 Ethernet module IEC 61850 variant (All versions prior to v4.30): Update to v4.30, which can be located here: https://support.industry.siemens.com/cs/us/en/view/109745821\n\n--------- Begin Update B Part 2 of 2 ---------\n\nEN100 Ethernet module IEC 104 variant: Update to v1.22, which can be located here: https://support.industry.siemens.com/cs/document/109745821\n\n--------- End Update B Part 2 of 2 ---------\nFor all other affected products, Siemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk. As a general security measure Siemens strongly recommends to protect network access with appropriate mechanisms (e.g., firewalls, segmentation, VPN). It is advised to configure the environment according to Siemens’ operational guidelines in order to run the devices in a protected IT environment.\nRecommended security guidelines to Secure Substations and Defense-in-Depth can be found at: https://www.siemens.com/gridsecurity\nFor further inquiries on vulnerabilities in Siemens products and solutions, please contact the Siemens ProductCERT: https://www.siemens.com/cert/advisories\nFor more information on this vulnerability and associated software updates, please see Siemens security notification SSA-845879 on their website: https://cert-portal.siemens.com/productcert/pdf/ssa-845879.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-4838"
  ],
  "techniques": [],
  "advisory": "icsa-18-067-02",
  "title": "Siemens SIPROTEC 4, SIPROTEC Compact, and Reyrolle Devices using the EN100 Ethernet Communication Module Extension (Update B) | CISA",
  "source": "ics-advisories",
  "id": "f1fec34a1aa30263a7aad533dedfa64b1bec3e5d6ba37bc6afc5d40913b8b1d0"
}