{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Softing\nEquipment: OPC-UA C++ SDK\nVulnerability: Improper Restriction of Operations within the Bounds of a Memory Buffer\n\n2. RISK EVALUATION\nA remote attacker may be able to crash the device, resulting in a denial-of-service condition. This vulnerability exists in exported functions of the library, and exploits may have different consequences depending on how the library functions have been used.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSofting reports the vulnerability affects functions in the following software library, which may be used in other products: \n\nOPC UA C++ SDK (Software Development Kit) Versions from 5.59 to 5.64\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe exported library functions don't properly validate received extension objects, which may allow an attacker to crash the software by sending a variety of specially crafted packets to access several unexpected memory locations. \nCVE-2021-32994 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nEran Jacob of OTORIO reported this vulnerability to CISA.\n4. MITIGATIONS\nSofting has released version 5.65 to address this vulnerability and has notified known users of the release. As this vulnerability only affects the publisher and subscriber protocol, Softing highly recommends customers using this protocol to upgrade to the latest version or disable the functionality. Please download the latest software package from the Softing website. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2021-32994"
  ],
  "techniques": [],
  "advisory": "icsa-21-168-02",
  "title": "Softing OPC-UA C++ SDK | CISA",
  "source": "ics-advisories",
  "id": "8dc002a5e2fb6070a20ba76b4805b1643ae6723d2d3f6b727aedad34eae99982"
}