{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: JanTek\nEquipment: JTC-200\nVulnerabilities: Cross-site Request Forgery, Improper Authentication\nAFFECTED PRODUCTS\nThe following versions of JTC-200, a TCP/IP converter, are affected:\n\nJTC-200 all versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow for remote code execution on the device with elevated privileges.\nMITIGATION\nJanTek will not be developing mitigations for the vulnerabilities affecting JTC-200. JanTek will be developing a JTC-300 model scheduled for release near the end of 2017.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nCROSS-SITE REQUEST FORGERY (CSRF) CWE-352\n\nAn attacker could perform actions with the same permissions as a victim user, provided the victim has an active session and is induced to trigger the malicious request.\nCVE-2016-5789 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n\nIMPROPER AUTHENTICATION CWE-287\n\nThe improper authentication could provide undocumented Busybox Linux shell accessible over Telnet service without any authentication.\nCVE-2016-5791 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nKarn Ganeshan reported the vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing\nCountries/Areas Deployed: Europe and Asia\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2016-5791",
    "CVE-2016-5789"
  ],
  "techniques": [],
  "advisory": "icsa-17-283-02",
  "title": "JanTek JTC-200 | CISA",
  "source": "ics-advisories",
  "id": "deb326a50a376b42f63f58bbf55372b56aebbe4ade817b13180a3e4d9c710cbb"
}