{
  "markdown": "\nOVERVIEW\nThis updated advisory is a follow-up to the updated advisory titled ICSA-16-082-01 Siemens APOGEE Insight Incorrect File Permissions Vulnerability that was published March 22, 2016, on the NCCIC/ICS-CERT web site.\n--------- Begin Update A Part 1 of 3 --------\nSiemens has identified an incorrect file permissions vulnerability in APOGEE Insight. China Electronic Technology Cyber Security Co., Ltd. and Hunan Testing Institute of Product and Commodity Supervision reported this issue directly to Siemens. Siemens has released a new version to mitigate this vulnerability.\n--------- End Update A Part 1 of 3 ----------\nAFFECTED PRODUCTS\n--------- Begin Update A Part 2 of 3 --------\nSiemens reports that the vulnerability affects the following product:\n\nAPOGEE Insight: All versions prior to 3.15\n\n--------- End Update A Part 2 of 3 ----------\nIMPACT\nThis vulnerability could allow authenticated users of the operating system to modify application data for the affected product.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSiemens is a multinational company headquartered in Munich, Germany.\nThe affected product, APOGEE Insight software, provides a graphical interface to manage and control buildings. According to Siemens, APOGEE Insight software is deployed across several sectors including Commercial Facilities. Siemens estimates that this product is used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nINCORRECT DEFAULT PERMISSIONSCWE-276: Incorrect Default Permissions, http://cwe.mitre.org/data/definitions/276.html, web site last accessed March 22, 2016.\n\nThe file permissions set for the APOGEE Insight application folder could allow authenticated operating system users to modify the APOGEE Insight application data if local access was obtained.\nCVE-2016-3155NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-3155, web site last accessed March 22, 2016. has been assigned to this vulnerability. A CVSS v3 base score of 3.4 has been calculated; the CVSS vector string is (CVSS:3.0/AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:L/A:N).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:L/A:N, web site last accessed March 22, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not exploitable remotely, and an attacker would need to be an authenticated user of the operating system.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit this vulnerability.\nMITIGATION\n--------- Begin Update A Part 3 of 3 --------\nSiemens has released a new APOGEE Insight version to resolve the vulnerability. Version 3.15 can be obtained by calling the local service organization. If users need assistance in identifying the local service organization, please call a local Siemens hotline center:\nhttps://w3.siemens.com/aspa_app/\nUntil the new version can be applied, Siemens has detailed instructions on how to mitigate the vulnerability by correcting file permissions. To receive these instructions, users should contact their local service organization or a local Siemens hotline center.\n--------- End Update A Part 3 of 3 ----------\nFor more information on this vulnerability and more detailed mitigation instructions, see Siemens Security Advisory SSA-151221 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nLimit access of authenticated users to only the machines that are needed.\nCompartmentalize your network.\nRestrict which programs a user can run.\nLock unattended machines.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-3155"
  ],
  "techniques": [],
  "advisory": "icsa-16-082-01a",
  "title": "Siemens APOGEE Insight Incorrect File Permissions Vulnerability (Update A) | CISA",
  "source": "ics-advisories",
  "id": "f6b1a2aafaca2576a998940d2484de64159326bb58a401f308950a920ad2ff13"
}