{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Teamcenter Active Workspace\nVulnerability: Path Traversal\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to access control violations.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Teamcenter Active Workspace, a product lifecycle management (PLM) system, are affected:\n\nTeamcenter Active Workspace v4.3: All versions prior to v4.3.10\nTeamcenter Active Workspace v5.0: All versions prior to v5.0.8\nTeamcenter Active Workspace v5.1: All versions prior to v5.1.5\nTeamcenter Active Workspace v5.2: All versions prior to v5.2.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY (‘PATH TRAVERSAL’) CWE-22\nA path traversal vulnerability in the application could allow an attacker to bypass certain restrictions, such as direct access, to access other services within the host.\nCVE-2021-40357 has been assigned to this vulnerability. A CVSS v3 base score of 4.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nTeamcenter Active Workspace v4.3: Update to v4.3.10 or later version (login required)\nTeamcenter Active Workspace v5.0: Update to v5.0.8 or later version (login required)\nTeamcenter Active Workspace v5.1: Update to v5.1.5 or later version (login required)\nTeamcenter Active Workspace v5.2: Update to v5.2.1 or later version (login required)\nHarden the application host to prevent local access by untrusted personnel.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends to configure the environment according to Siemens’ operational guidelines for industrial security, and to follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens Security Advisory SSA-413407\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-40357"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-22",
  "title": "Siemens Teamcenter Active Workspace | CISA",
  "source": "ics-advisories",
  "id": "2a38def567c6a206d0ffdca06e6658a6e6af84111e073fa3f113785d9d3594eb"
}