{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 7.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Rockwell Automation\nEquipment: ControlLogix, GuardLogix, and 1756 ControlLogix I/O Modules\nVulnerability: Unprotected Alternate Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute CIP programming and configuration commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ControlLogix, GuardLogix, and 1756 ControlLogix I/O Modules are affected:\n\nControlLogix: Version V28\nGuardLogix: Version V31\n1756-EN4TR: Version V2\n1756-EN2T, Series A/B/C (unsigned version): Version v5.007\n1756-EN2F, Series A/B (unsigned version): Version v5.007\n1756-EN2TR, Series A/B (unsigned version): Version v5.007\n1756-EN3TR, Series B (unsigned version): Version v5.007\n1756-EN2T, Series A/B/C (signed version): Version v5.027\n1756-EN2F, Series A/B (signed version): Version v5.027\n1756-EN2TR, Series A/B (signed version): Version v5.027\n1756-EN3TR, Series B (signed version): Version v5.027\n1756-EN2T, Series D: Version V10.006\n1756-EN2F, Series C: Version V10.009\n1756-EN2TR, Series C: Version V10.007\n1756-EN3TR, Series B: Version V10.007\n1756-EN2TP, Series A: Version V10.020\n\n3.2 Vulnerability Overview\n3.2.1 Unprotected Alternate Channel CWE-420\nA vulnerability exists in the affected products that allows a threat actor to bypass the Trusted Slot feature in a ControlLogix controller. If exploited on any affected module in a 1756 chassis, a threat actor could potentially execute CIP commands that modify user projects and/or device configuration on a Logix controller in the chassis.\nCVE-2024-6242 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:C/C:L/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-6242. A base score of 7.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:P/PR:L/UI:N/VC:L/VI:H/VA:H/SC:L/SI:H/SA:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSharon Brizinov of Claroty Research - Team82 reported this vulnerability to Rockwell Automation.\n4. MITIGATIONS\nRockwell Automation recommends users update the Logix controllers to the following:\n\nControlLogix 5580 (1756-L8z): Update to versions V32.016, V33.015, V34.014,V35.011 and later.\nGuardLogix 5580 (1756-L8zS): Update to versions V32.016, V33.015, V34.014,V35.011 and later.\n1756-EN4TR: Update to versions V5.001 and later.\n1756-EN2T Series D, 1756-EN2F Series C, 1756-EN2TR Series C, 1756-EN3TR Series B, and 1756-EN2TP Series A: Update to version V12.001 and later\n\nThe products 1756-EN2T Series A/B/C, 1756-EN2F Series A/B, 1756-EN2TR Series A/B, and 1756-EN3TR Series B do not have a fix available. Users can upgrade to Series D to remediate this vulnerability.\nUsers that are using the affected firmware and who are not able to upgrade to one of the corrected versions are encouraged to apply the following mitigation and security best practices, where possible:\n\nLimit the allowed CIP commands on controllers by setting the mode switch to the RUN position.\nSecurity Best Practices\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nAugust 01, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-6242"
  ],
  "techniques": [],
  "advisory": "icsa-24-214-09",
  "title": "Rockwell Automation Logix Controllers | CISA",
  "source": "ics-advisories",
  "id": "112a20fb9877867637896c54dd8a9b2775635776ef8e78f1b89956b21a240e1d"
}