{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.2\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Unified Automation GmbH\nEquipment: .NET applications\nVulnerability: Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker to read any file on the file system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following OPC UA products are affected:\n\nUnified Automation .NET based OPC UA Client/Server SDK Bundle: Versions V3.0.7 and prior (.NET 4.5, 4.0, and 3.5 Framework versions only)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe OPC UA .NET Framework can expose sensitive information to an actor who is not authorized to have access.\nCVE-2021-27434 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:L). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nEran Jacob with the Otorio Research Team reported this vulnerability to CISA.\n4. MITIGATIONS\nUnified Automation has released software (login required) to address the .NET Framework vulnerabilities. OPC Foundation recommends users deploying OPC UA .NET products built against the .NET 4.5, 4.0, and 3.5 Frameworks should contact the product supplier to determine if an update is needed. Users should also consider upgrading to a version of the product using .NET 4.5.2 Framework or later. It is recommended users avoid using the end-of-life version of the .NET Framework due to the risk of unpatched vulnerabilities.\nThis vulnerability was originally documented by Microsoft in CVE-2015-6096\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27434",
    "CVE-2015-6096"
  ],
  "techniques": [],
  "advisory": "icsa-21-133-04",
  "title": "OPC UA Products Built with the .NET Framework 4.5, 4.0, and 3.5 | CISA",
  "source": "ics-advisories",
  "id": "d721d49afcc4c6a3dd88c28886502ecebf1cce73655803d0c7f4b71c94f906eb"
}