{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low attack complexity\nVendor: AVEVA\nEquipment: Platform Common Services (PCS) Portal\nVulnerability: Uncontrolled Search Path Element\n\n2. RISK EVALUATION\nThe DLL hijacking vulnerability in the Platform Common Services (PCS) Portal, if exploited, could allow malicious code execution within the context of the PCS Portal application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the AVEVA Software Platform Common Services (PCS) Portal are affected:\n\nPCS Versions 4.5.2, 4.5.1, 4.5.0, and 4.4.6\n\nThe following products ship a vulnerable version of the PCS Portal application and are affected:\n\nAVEVA System Platform 2020 R2 P01, 2020 R2, and 2020\nAVEVA Work Tasks 2020 Update 1\nAVEVA Work Tasks 2020\nAVEVA Mobile Operator 2020\nAVEVA Manufacturing Execution System 2020\nAVEVA Batch Management 2020\nAVEVA Enterprise Data Management 2021\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nThe affected products are vulnerable to DLL hijacking through an uncontrolled search path element, which may allow an attacker control to one or more locations in the search path.\nCVE-2021-38410 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nNoam Moshe of Claroty discovered and disclosed the vulnerability to the AVEVA Software Security Response Center.\n4. MITIGATIONS\nAVEVA recommends organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation. Users of affected versions of the products should apply the corresponding security update as soon as possible.\nSecurity update PCS 4.5.3 is available for the following versions:\n\nAVEVA Mobile Operator 2020\nAVEVA Enterprise Data Management 2021\nAVEVA System Platform 2020 R2 P01\nAVEVA System Platform 2020 R2\nAVEVA Work Tasks 2020 Update 1\n\nSecurity update PCS 4.4.7 is available for the following versions:\n\nAVEVA System Platform 2020\nAVEVA Work Tasks 2020\nAVEVA Manufacturing Execution System 2020\nAVEVA Batch Management 2020\n\nFor more information on this issue, including security updates, please see Security Bulletin AVEVA-2021-008\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nReduce the attack surface by hard-coding the search path to a set of known-safe values (such as system directories), or only allow them to be specified by the administrator in a configuration file.\nReduce the attack surface by invoking other programs using fully qualified pathnames.\nReduce the attack surface by removing or restricting all environment settings before invoking other programs.\nCheck the search path before use and removing any elements that are likely to be unsafe, such as the current working directory or a temporary files directory.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-38410"
  ],
  "techniques": [],
  "advisory": "icsa-21-252-01",
  "title": "AVEVA PCS Portal | CISA",
  "source": "ics-advisories",
  "id": "278bb6765ab059964fa21772507bb2e66f36fafeb942238c3a0ae2a213788830"
}