{
  "markdown": "\nOVERVIEW\nOSIsoft has identified 56 vulnerabilities in its own PI System software. OSIsoft has produced a new version of Data Archive (Version 3.4.395.64) to mitigate these issues.\nSome of these vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nOSIsoft reports that the vulnerabilities affect the following versions:\n\nAll versions of the PI Data Archive prior to Version 3.4.395.64.\n\nIMPACT\nAn attacker who exploits these vulnerabilities could create a denial-of-service condition or allow remote code execution on the Windows OS running this software.\nVULNERABILITY CHARACTERIZATION\nThe issues were rated by OSIsoft using the Common Vulnerability Scoring System (CVSS)CVSS Calculator, https://nvd.nist.gov/cvss.cfm?adv&calculator&version=2, web site last accessed August 13, 2015. as follows:\n\n21 high (CVSS: 6.8-10),\n27 medium (CVSS: 3.4-6.7), and\n8 low (CVSS: 0-3.3).\n\nThe high-level security issues that are addressed in PI Data Archive 2015 include:\n\nCWE-20CWE-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20.html, web site last accessed August 13, 2015.: Improper Input Validation (6 issues),\nCWE-250CWE-250: Execution with Unnecessary Privileges, https://cwe.mitre.org/data/definitions/250.html, web site last accessed August 13, 2015.: Execution with Unnecessary Privileges (3 issues),\nCWE-200CWE-200: Information Exposure, https://cwe.mitre.org/data/definitions/200.html, web site last accessed August 13, 2015.: Information Exposure (1 issue),\nCWE-476CWE-400: Uncontrolled Resource Consumption ('Resource Exhaustion'), https://cwe.mitre.org/data/definitions/400.html, web site last accessed August 13, 2015.: NULL Pointer Dereference / Denial of Service (13 issues), and\nCWE-384CWE-384: Session Fixation, https://cwe.mitre.org/data/definitions/384.html, web site last accessed August 13, 2015.: Session Management (2 issues).\n\nThese security-related issues were discovered in PI Data Archive 2012 as part of OSIsoft’s SDL process.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nSome of these vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nMITIGATION\nOSIsoft recommends that users upgrade to Data Archive 3.4.395.64 released June 25, 2015.\nUsers may download the latest software version from the following web site:\nhttps://techsupport.osisoft.com/Downloads/All-Downloads/PI-Server/PI-Data-Archive/All-Installation-Kits\nUsers may download release notes for the latest software version from the following web site:\nhttps://techsupport.osisoft.com/Downloads/All-Downloads/PI-Server/PI-Data-Archive/Release-Notes\nFor more information regarding this vulnerability and the recommended mitigation plan, please see OSIsoft’s security bulletin titled “Advisory: PI Server 2015 Multiple Security Updates” at the following location:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/\nUsers may also visit the OSIsoft technical support web site: https://techsupport.osisoft.com/\nBACKGROUND\nOSIsoft is a US-based company that maintains its headquarters in San Leandro, California, with operations globally.\nAccording to OSIsoft, Data Archive is the core server technology used in the PI System for real time data storage and distribution of instrument data. The PI System uses this core server technology to manage and enhance stored instrument data for retrieval, analysis, and visualization. According to OSIsoft, PI Asset Framework is deployed in several critical infrastructure sectors. OSIsoft estimates that these products are used worldwide.\nHELPFUL DOCUMENTATION\nSeverity Matrix is as follows:\n\n\n\nLow CVSS 0-3.3\nMedium CVSS 3.4-6.7\nHigh CVSS 6.8-10\n\n\n\nNCCIC/ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-15-225-01",
  "title": "OSIsoft PI Data Archive Server Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "83f1870035419a7676b1482dc583feb50e933e84172b72a6a83b602e5eec2ce7"
}