{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nAttention: Exploitable remotely/low skill level to exploit.\nVendor: Schneider Electric Software, LLC\nEquipment: InduSoft Web Studio, InTouch Machine Edition\nVulnerability: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability during tag, alarm, or event related actions could allow remote code execution that, under high privileges, could completely compromise the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of InduSoft Web Studio and InTouch Machine Edition, an HMI, are affected:\n\nInduSoft Web Studio v8.1 and prior versions, and\nInTouch Machine Edition 2017 v8.1 and prior versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   STACK-BASED BUFFER OVERFLOW CWE-121\nA remote attacker could send a carefully crafted packet during a tag, alarm, or event related action such as read and write, which may allow remote code execution.\nCVE-2018-8840 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems, and Water and Wastewater Systems  \nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: France\n\n3.4 RESEARCHER\nTenable Research reported this vulnerability to Schneider Electric Software, LLC and Schneider Electric Software, LLC coordinated with NCCIC.\n5. MITIGATIONS\nSchneider Electric Software, LLC recommends:\n\nUsers using InduSoft Web Studio v8.1 or prior versions are affected and should upgrade and apply InduSoft Web Studio v8.1 SP1 as soon as possible.\nUsers using InTouch Machine Edition 2017 v8.1 or prior versions are affected and should upgrade and apply InTouch Machine Edition 2017 v8.1 SP1 as soon as possible.\n\nSchneider Electric Software, LLC has also released Security Bulletin LFSEC00000125 that can be found at:\nhttp://software.schneider-electric.com/pdf/security-bulletin/lfsec00000125/ \nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-8840"
  ],
  "techniques": [],
  "advisory": "icsa-18-107-01",
  "title": "Schneider Electric InduSoft Web Studio and InTouch Machine Edition | CISA",
  "source": "ics-advisories",
  "id": "e1d552f7ebcea2ea6ff829820aa1a17c5891ed73d2216f235406355e21ddc12e"
}