{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: LCDS—Leão Consultoria e Desenvolvimento de Sistemas Ltda ME\nEquipment: LAquis SCADA\nVulnerability: Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute code under the privileges of the application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LAquis SCADA are affected:\n\nLAquis SCADA versions prior to 4.3.1.870\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nAn attacker who convinces a valid user to open a specially crafted project file to exploit could execute code under the privileges of the application due to an out-of-bounds read vulnerability. \nCVE-2020-25188 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Commercial Facilities, Energy, Food and Agriculture, Transportation Systems, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: South America\nCOMPANY HEADQUARTERS LOCATION: Brazil\n\n3.4 RESEARCHER\nAn anonymous researcher working with Trend Micro’s Zero Day Initiative reported this vulnerability to CISA.\n4. MITIGATIONS\nLCDS recommends users update to Version 4.3.1.870 or later.\nCISA recommends users take the following measures to protect themselves from social engineering attacks: \nOnly use project files from trusted sources.\n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-25188"
  ],
  "techniques": [],
  "advisory": "icsa-20-287-02",
  "title": "LCDS LAquis SCADA | CISA",
  "source": "ics-advisories",
  "id": "807d9488015edbd4349ba6924a0c34de41831a454903f0ab00ebe2d2b1e62e61"
}