{
  "markdown": "\nCVSS v3 7.8\nVendor: Schneider Electric\nEquipment: SoMove software and DTM software components\nVulnerability: Uncontrolled Search Path Element\nAFFECTED PRODUCTS\nSchneider Electric reports the vulnerability affects the following SoMove software and DTM software components:\n\nSoMove software, versions prior to 2.6.2\nATV320 DTM, versions prior to 1.1.6\nATV340 DTM, versions prior to 1.2.3\nATV6xx DTM, versions prior to 1.8.0\nATV9xx DTM, versions prior to 1.3.5\nAltivarDtmLibrary, versions prior to 12.7.0\n\n\nATV32 DTM\nATV71 DTM\nATV61 DTM\nATV LIFT DTM\nATV31/312 DTM\nATV212 DTM\nATV12 DTM\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to execute arbitrary code.\nMITIGATION\nSchneider Electric has provided the following updates for the affected software packages:\n\nSoMove Software—SoMove_V2.6.3\n\nhttps://www.schneider-electric.com/en/download/document/SoMove_FDT/\n\nATV320 DTM—Schneider_Electric_Altivar_Machine_ATV320_DTM_Library_V1.1.6\n\nhttps://www.schneider-electric.com/en/download/document/ATV320_DTM_Library/\n\nATV340 DTM—Schneider_Electric_Altivar_Machine_ATV340_DTM_Library_V1.2.3\n\nhttps://www.schneider-electric.com/en/download/document/ATV340_DTM_LibraryEN/\n\nATV6XX DTM—Schneider_Electric_Altivar_Process_ATV6xx_DTM_Library_V1.8.0\n\nhttps://www.schneider-electric.com/en/download/document/ATV6xx_DTM_Library_EN/\n\nATV9XX DTM—Schneider-Electric-Altivar-Process-ATV9xx-DTM-Library-V1.3.5\n\nhttps://www.schneider-electric.com/en/download/document/ATV9xx_DTM_Library_EN/\n\nATV32 / ATV71 / ATV61 / ATV LIFT / ATV31_312 / ATV212 / ATV12 AltivarDtmLibraryV12.7.0\n\nhttps://www.schneider-electric.com/en/download/document/Altivar_DTM_Library/\nFor more information on this vulnerability and its associated patches, please see Schneider Electric’s security notification SEVD-2018-060-01 on their website:\nhttps://www.schneider-electric.com/en/download/document/SEVD-2018-060-01/\nFor further information related to cybersecurity in Schneider Electric products, please visit the company’s cybersecurity web page:\nhttp://www2.schneider-electric.com/sites/corporate/en/support/cybersecurity/cybersecurity.page\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability by protecting themselves from social engineering attacks. Specifically, users should:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. Low skill level is needed to exploit.\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nAn attacker may execute malicious DLL files that have been placed within the search path.\nCVE-2018-7239 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nADLab of Venustech reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Critical manufacturing\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2018-7239"
  ],
  "techniques": [],
  "advisory": "icsa-18-065-02",
  "title": "Schneider Electric SoMove Software and DTM Software Components | CISA",
  "source": "ics-advisories",
  "id": "caa337073ef13d0ed49135c023c6132ae37415eddef1c929b9aed5d6dc02c796"
}