{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Schneider Electric\nEquipment: GUIcon\nVulnerabilities: Out-of-bounds Write, Use After Free, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to execute arbitrary code on the host PC, leading to sensitive information disclosure or unintended user actions.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of GUIcon software are affected\n\nGUIcon: Versions 2.0 (Build 683.003) and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThis vulnerability may cause arbitrary code execution when a malicious *.gd1 configuration file is loaded into the GUIcon tool.\nCVE-2021-22807 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    USE AFTER FREE CWE-416\nThis vulnerability may cause arbitrary code execution when a malicious *.gd1 configuration file is loaded into the GUIcon tool.\nCVE-2021-22808 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    OUT-OF-BOUNDS READ CWE-125\nThis vulnerability may cause arbitrary code execution when a malicious *.gd1 configuration file is loaded into the GUIcon tool.\nCVE-2021-22809 has been assigned to this vulnerability. A CVSS v3 base score of 4.4 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nMichael Heinzl reported these vulnerabilities to CISA.\n4. MITIGATIONS\nThe GUIcon software tool was discontinued in June 2020 and is no longer supported. Users should immediately apply the following mitigation to reduce the risk of exploit:\n\nThe only known method for an attacker to exploit these vulnerabilities is to create a malicious GUIcon *.gd1 configuration file and then trick a user into opening it with the GUIcon software. The mitigation for these vulnerabilities is to ensure any GUIcon *.gd1 file loaded into the tool is from a trusted source.\nFor more information about these issues, please refer to the original Schneider Electric publication SEVD-2021-313-07\n\nSchneider Electric strongly recommends the following industry cybersecurity best practices:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls to prevent unauthorized personnel from accessing industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in the “Program” mode.\nNever connect programming software to any network other than the network intended for that device.\nScan all methods of mobile data exchange with the isolated network, such as CDs, USB drives, etc., before use in the terminals or any node connected to these networks.\nNever allow mobile devices that have connected to any other network besides the intended network to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and systems and ensure they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs). Recognize that VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand that VPNs are only as secure as the connected devices.\n\nFor more information refer to the Schneider Electric Recommended Cybersecurity Best Practices document.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-22807",
    "CVE-2021-22808",
    "CVE-2021-22809"
  ],
  "techniques": [],
  "advisory": "icsa-21-313-02",
  "title": "Schneider Electric GUIcon | CISA",
  "source": "ics-advisories",
  "id": "b0ff75e082b92848da1486c4adde165d91278054eaf62e1865ecee9f789b92af"
}