{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.3\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: IIoT Monitor\n\n--------- Begin Update A Part 1 of 2 --------\n\nVulnerabilities: Path Traversal, Unrestricted Upload of File with Dangerous Type, XXE, Cryptographic Issues\n\n--------- End Update A Part 1 of 2 --------\n2.    UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-008-02 Schneider Electric IIoT Monitor that was published January 08, 2019, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to access files available to system users, arbitrarily upload and execute malicious files, and embed incorrect documents into the system output to expose restricted information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of IIoT Monitor, a monitoring platform, are affected:\n\nIIoT Monitor Versions 3.1.38 and prior.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nA path traversal vulnerability exists, which may allow access to files available to SYSTEM user.\nCVE-2018-7835 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.2    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nAn unrestricted upload of a file with dangerous type vulnerability exists in the IIoT Monitor software that could allow the uploading and execution of malicious files.\nCVE-2018-7836 has been assigned to this vulnerability. A CVSS v3 base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:N).\n4.2.3   IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE ('XXE') CWE-611\nThere is an XXE vulnerability in the IIoT Monitor software that may allow the software to resolve documents outside of the intended sphere of control, causing the software to embed incorrect documents into its output and expose restricted information.\nCVE-2018-7837 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- Begin Update A Part 2 of 2 --------\n4.2.4    CRYPTOGRAPHIC ISSUES CWE-310\nThere is a hardcoded cryptographic key that may affect the confidentiality of the device.\nCVE-2018-7839 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- End Update A Part 2 of 2 --------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Transportation Services\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n4.4 RESEARCHER\nTrend Micro’s Zero Day Initiative working with rgod reported these vulnerabilities to NCCIC.\n5. MITIGATIONS\nSchneider Electric recommends that affected users contact Schneider Electric customer support at https://www.schneider-electric.com/en/work/support/contacts.jsp for assistance in migrating to the latest software to resolve the issues.\nSchneider Electric has also released a security notification that can be found at:\nhttps://www.schneider-electric.com/en/download/document/SEVD-2018-354-03/\nSchneider Electric strongly recommends implementing industry cybersecurity best practices, such as:\n\nLocate control and safety system networks and remote devices behind firewalls, and isolate them from the business network.\nPhysical controls should be in place so that no unauthorized person would have access to the ICS and safety controllers, peripheral equipment or the ICS and safety networks.\nAll controllers should reside in locked cabinets and never be left in the “Program” mode.\nAll programming software should be kept in locked cabinets and should never be connected to any network other than the network for the devices that it is intended.\nAll methods of mobile data exchange with the isolated network such as CDs, USB drives, etc. should be scanned before use in the terminals or any node connected to these networks.\nLaptops that have connected to any other network besides the intended network should never be allowed to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-7835",
    "CVE-2018-7837",
    "CVE-2018-7839",
    "CVE-2018-7836"
  ],
  "techniques": [],
  "advisory": "icsa-19-008-02",
  "title": "Schneider Electric IIoT Monitor (Update A) | CISA",
  "source": "ics-advisories",
  "id": "6535cbb82033f4a7ab2f3e7fc73f4caf77afe0fc60ad7b829799ccb851387f2f"
}