{
  "markdown": " Federal Aviation Administration GPS Testing \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryFederal Aviation Administration GPS Testing=========================================== Last Revised August 23, 2018 Alert Code ICSA\\-11\\-025\\-01Overview-------- The US Federal Aviation Administration (FAA) has issued two flight advisories identifying planned Global Positioning System (GPS) temporary outages and the affected areas, due Department of Defense testing. During testing, the GPS signal may be unreliable or unavailable. ICS\\-CERT is issuing this advisory as a follow up to [yesterday’s alert](/ics/alerts/ICS-ALERT-11-024-01)  to notify industrial control systems (ICS) owners and operators whose control systems employ GPS for timing reference or positioning data of possible intermittent GPS service during the testing.### FAA Advisories for GPS Testing#### CHLK GPS 11\\-06 Location: Porterville, CAFAA, “Flight Advisory GPS Testing CHLK GPS 11\\-06 January 16−23, 2011, Porterville, CA,” http://www faasafety.gov/files/notices/2011/Jan/Flight advisory porterville GPS.pdf, accessed January 24, 2011\\. Date: January 16 through January 23, 2011\\. Duration: This test has been completed.#### CSFTL GPS 11\\-01 Location: Brunswick, GAFAA, “Flight Advisory GPS Testing CSFTL GPS 11\\-01 January 20−February 11, 2011, and February 15−22, 2011, Brunswick, GA,” http://www faasafety.gov/files/notices/2011/Jan/GPS Flight Advisory CSFTL11\\-01 Rel.pdf, accessed January 24, 2011\\. Dates: January 20 through February 11, 2011; February 15 through February 22, 2011\\. Duration: Multiple test events, with each test active for 45 minutes followed by 15 minutes of off time.Impact------ During testing, “GPS will be unreliable and may be unavailable within a circle having a radius of 370NM and centered at 304906N/0802811W or the location known as 105\\.25 degrees and 52\\.1 NM from the SSI VOR at FL400; decreasing in area with a decrease in altitude to a circle with a radius of 325NM at FL250; a circle with a radius of 260NM at 10,000FT MSL and a circle with a radius of 215NM at 4,000FT AGL.” See Figure 1\\.![]() The ICS\\-CERT contacted the FAA for detailed information on the potential impact area. According to the information provided by the FAA, the effective impact range decreases significantly with decreasing altitude and the impact radius at or near ground level (sea level) will be about 20 miles. That radius precludes significant impact to land\\-based control systems. The potential impact at sea level is limited to any marine systems in the area. The ICS\\-CERT recommends that marine owners and operators should prepare for possible GPS service disruptions in that area. The ICS\\-CERT recommends that marine system operators contact the Coast Guard for assistance or more information. Contact the US Coast Guard (local notices for mariners) at: 703\\-313\\-5800\\. ICS\\-CERT recommends that organizations evaluate the impact of this GPS testing based on their environment, architecture, and GPS implementation.Background---------- GPS is widely used in control system environments, particularly as a timing reference signal for cellular based remote terminal units (RTUs), for intelligent electronic devices (IEDs) used in the energy sector, and for position detection in railroad positive train control (PTC) applications. The loss of the GPS timing reference for cellular base control systems for extended periods could have significant impact on the integrity of data passed to the supervisory control and data acquisition (SCADA) system from the affected RTUs or IEDs. Rail systems that employ GPS for PTC applications generally have backup position detection systems. Therefore, while the extended loss of the GPS position signal would reduce the precision of the system’s position detection, it should not significantly impact rail operations.Mitigation---------- In the short term, ICS owners and operators can do little to mitigate a GPS jamming (interference) situation. Equipment with jam\\-to\\-noise ratio detection that provides notification of interference would allow control systems to switch to alternate timing methods for the duration of the interference. Cellular equipment can be adapted to provide interference detection, but is not currently widely available for control system applications.Logan, Scott; J911: Fast Jammer Detection \\| GPS World, November 1, 2010, http://www.gpsworld.com/wireless/infrastructure/j911\\-fast\\-jammer\\-detection\\-10720, accessed January 25, 2011 Long term, ICS owners and operators of control systems that are reliant on GPS timing signals (i.e., cellular RTUs, IEDs) should consider including integrated backup timing systems to accommodate the temporary loss of GPS due to interference or actual failure. Organizations should follow their established internal procedures if any suspected malicious activity is observed and report the findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations that proper impact analysis and risk assessment should be performed prior to taking defensive measures. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Other-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-025-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-025-01",
  "title": "Federal Aviation Administration GPS Testing | CISA",
  "source": "ics-advisories",
  "id": "9218f871011bf34b2c907e3ede00335f2a0d215894771cb3460e7f89b7a557b3"
}