{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.6\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Ice Qube\nEquipment: Thermal Management Center\nVulnerabilities: Improper Authentication, Unprotected Storage of Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain unauthorized access to configuration files or obtain sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Thermal Management Center, an environmental software management platform, are affected:\n\nThermal Management Center, all versions prior to 4.13\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe web application does not properly authenticate users, which may allow an attacker to gain access to sensitive information.\nCVE-2017-14026 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n 3.2.2    UNPROTECTED STORAGE OF CREDENTIALS CWE-256\nPasswords are stored in plaintext in a file that is accessible without authentication.\nCVE-2017-16714 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Water\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMaxim Rupp reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nIce Qube recommends that users of affected versions upgrade to the latest version of Thermal Management Center v4.13 or newer, which can be obtained by contacting Technical Support at the following email: service@iceqube.com or by calling Technical Support at: 724-837-7600.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2017-14026",
    "CVE-2017-16714"
  ],
  "techniques": [],
  "advisory": "icsa-18-249-01",
  "title": "Ice Qube Thermal Management Center | CISA",
  "source": "ics-advisories",
  "id": "ffc047f07fff6f4fb42eb00ecf26151d4679e529d3c092c10536b67684c9a365"
}