{
  "markdown": " Honeywell HART DTM Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryHoneywell HART DTM Vulnerability================================ Last Revised August 29, 2018 Alert Code ICSA\\-15\\-029\\-01OVERVIEW-------- Alexander Bolshev of Digital Security has identified an improper input vulnerability in the CodeWrights GmbH HART Device Type Manager (DTM) library used in Honeywell’s HART DTM. CodeWrights GmbH has addressed the vulnerability with a new library, which Honeywell validated and released for the impacted products.AFFECTED PRODUCTS----------------- The following products use the vulnerable HART DMT library and are affected:* Honeywell STT25T HART 5 Transmitter Rev. 1 \\& 2,* Honeywell STT25H HART 5 Transmitter Rev. 1 \\& 3,* Honeywell STT25S HART 5 Transmitter Rev. 2,* Honeywell ST 3000 HART 5 Transmitter Rev. 1,* Honeywell ST 3000 HART 6 Transmitter Rev. 1,* Honeywell ST 3000 H6 Transmitter with Advanced Diagnostics Rev. 1,* Honeywell ST STT25H HART 5 Transmitter Rev. 1, and* Honeywell ST STT25S HART 6 Transmitter Rev. 1\\.IMPACT------ The vulnerability causes the HART DTM component to hang and cease operations until restarted. This causes a loss of Frame Application communication to all HART devices connected to this DTM. No loss of information or loss of control or view by the control system results from an attacker successfully exploiting this vulnerability. Impact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Honeywell is a US\\-based company that maintains offices worldwide. The HART devices impacted by this vulnerability are deployed globally by Honeywell Process Solutions for automation and control of industrial and manufacturing processes. These devices are used in several sectors including Chemical, Critical Manufacturing, and Energy.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### IMPROPER INPUT VALIDATIONCWE\\-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20\\.html, web site last accessed January 29, 2015\\. This vulnerability could be exploited by connecting a HART modem or similar device to the 4‑mA to 20‑mA current loop link and sending a malformed HART command response causing the DTM software to hang. CVE\\-2014\\-9191NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-9191, web site last accessed January 29, 2015\\. has been assigned to this vulnerability. A CVSS v2 base score of 1\\.8 has been assigned; the CVSS vector string is (AV:A/AC:H/Au:N/C:N/I:N/A:P).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:A/AC:H/Au:N/C:N/I:N/A:P, web site last accessed January 29, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This exploit is possible from any adjacent network between the FDT/DTM frame application and the HART transmitter on the 4\\-mA to 20\\-mA current loop.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY Crafting a working exploit for this vulnerability would be difficult. Compromised access at any point between the HART transmitter and Frame Application with DTM will allow a malicious user to unencapsulate, modify, re\\-encapsulate, and send malicious packets. This exploit requires timing the spoofed response to crash the FDT/DTM components. This increases the difficulty of a successful exploit.MITIGATION---------- Honeywell has validated and released an update of the DTM software to mitigate this vulnerability. Customers should upgrade their systems using the applicable patch below as soon as possible to minimize the risk of exploitation of this vulnerability. The patch can be downloaded using the following link:[https://www.honeywellprocess.com/library/support/Public/Downloads/Honeywell\\-Enhanced\\-DTM\\-Library\\-HART\\-V2\\.4\\.18\\.180\\.zip](https://www.honeywellprocess.com/library/support/Public/Downloads/Honeywell-Enhanced-DTM-Library-HART-V2.4.18.180.zip)  ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies.](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Honeywell-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-029-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2014-9191"
  ],
  "techniques": [],
  "advisory": "icsa-15-029-01",
  "title": "Honeywell HART DTM Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "d996a512506326c07e1b99f774e7987d614f3b6dafeea6fca18fc25e686151a1"
}