{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Sensormatic Electronics, LLC, a subsidiary of Johnson Controls, Inc.\nEquipment: victor\nVulnerability: Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized elevation of privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of victor, a video management system, are affected:\n\nvictor: Versions 5.7 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product contains an SIP component that uses a hard-coded password, which may allow a local, low-privileged user to access video information under certain circumstances.\nCVE-2019-19492 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nJohnson Controls, Inc., reported this vulnerability to CISA.\n4. MITIGATIONS\nJohnson Controls has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDisable the SIP feature in versions prior to 5.7.1\nUpgrade victor to Version 5.7.1\n\nFor more detailed mitigation and product upgrade instructions, please see Johnson Controls Product Security Advisory JCI-PSA-2021-19 v1\nFurther ICS security notices and product security guidance are located at the Johnson Controls product security website.\nUsers with additional questions may contact Johnson Controls Global Product Security.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-19492"
  ],
  "techniques": [],
  "advisory": "icsa-21-301-01",
  "title": "Sensormatic Electronics victor | CISA",
  "source": "ics-advisories",
  "id": "bfdd425f3d6b8ac00104109b57cb171a6fb1730cadd5a04d825290305c83816c"
}