{
  "markdown": " Advantech OPC Server Buffer Overflow \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryAdvantech OPC Server Buffer Overflow==================================== Last Revised October 28, 2013 Alert Code ICSA\\-11\\-279\\-01Overview-------- ICS\\-CERT originally released Advisory ICSA\\-11\\-279\\-01P on the US\\-CERT secure Portal on October 06, 2011\\. This web page release was delayed to allow users time to download and install the update. Security research and service institute Information and Communication Security Technology Center (ICST) has identified a buffer overflow vulnerability that affects multiple Advantech OPC (OLE for Process Control) Server products. This vulnerability may allow remote code execution and elevated user privileges. Advantech has produced a new software version that mitigates this vulnerability. ICST has tested the new version and confirmed that it fully resolves this vulnerability.Affected Products----------------- The following versions of OPC Server are affected:* Advantech ADAM OPC Server Versions prior to V3\\.01\\.012* Advantech Modbus RTU OPC Server Versions prior to V3\\.01\\.010* Advantech Modbus TCP OPC Server Versions prior to V3\\.01\\.010\\.Impact------ Impact to individual organizations depends on many operational factors that are unique to each organization. The buffer overflow in the Advantech ADAM OPC Server ActiveX control could allow remote attackers to execute arbitrary code and gain/elevate privileges to the currently logged in user. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.Background---------- Advantech is a Taiwanese\\-based company that manufactures and sells industrial personal computers (PCs), embedded computers, automation controllers, and software to customers in the energy, telecommunications, and transportation industries. According to Advantech, OPC Server is an interface for industrial device servers. The Advantech ADAM OPC server allows Input/Output (I/O) devices to communicate with a wide range of human\\-machine interface (HMI)/supervisory control and data acquisition (SCADA) software packages. Any software system with OPC client capabilities can access the Advantech OPC server drivers. The Advantech ADAM OPC Server is installed primarily in East Asia with a few installations in North America.Vulnerability Characterization------------------------------### Vulnerability Overview The buffer overflow in the Advantech ADAM OPC Server ActiveX control might allow remote attackers to execute arbitrary code and gain privileges as the currently logged in user.[CVE\\-2011\\-1914](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-1914)  has been assigned to this vulnerability.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable.#### Existence of Exploit No known exploits specifically target this vulnerability.#### Difficulty An attacker with a low skill level can create a denial of service; however, a more skilled attacker could execute arbitrary code.Mitigation---------- Advantech has created a patchb to mitigate this vulnerability. ICST has tested the patch to verify that the vulnerability has been corrected. The patches for the three products can be downloaded at the following location: [http://support.advantech.com.tw/support/DownloadSRDetail.aspx?SR\\_ID\\=1\\-2NMHLB](http://support.advantech.com.tw/support/DownloadSRDetail.aspx?SR_ID=1-2NMHLB)  . In addition to applying the patch developed by Advantech, ICS\\-CERT encourages asset owners to take additional defensive measures to reduce the cybersecurity risk introduced by this vulnerability.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. The Control Systems Security Program (CSSP) also provides a recommended practices section for control systems on the CSSP web page. Several recommended practices are available for reading or downloading, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Advantech-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-279-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-1914"
  ],
  "techniques": [],
  "advisory": "icsa-11-279-01",
  "title": "Advantech OPC Server Buffer Overflow | CISA",
  "source": "ics-advisories",
  "id": "004d7f8480bb58786da7bcaa08bdf6c0577cb0b4cadd2f2d96e7506807025c84"
}