{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Illumina\nEquipment: Local Run Manager (LRM)\nVulnerabilities: Path Traversal, Unrestricted Upload of File with Dangerous Type, Improper Access Control, Cleartext Transmission of Sensitive Information\n\n2. UPDATED INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-153-02 Illumina Local Run Manager that was published June 22, 2022, on the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an unauthenticated malicious actor to take control of the affected product remotely and take any action at the operating system level. An attacker could impact settings, configurations, software, or data on the affected product and interact through the affected product with the connected network..\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following devices and instruments using LRM software are affected:\nIllumina In Vitro Diagnostic (IVD) devices:\n\nNextSeq 550Dx: LRM Versions 1.3 to 3.1\nMiSeq Dx: LRM Versions 1.3 to 3.1\n\nResearcher Use Only (ROU) instruments:\n\nNextSeq 500 Instrument: LRM Versions 1.3 to 3.1\nNextSeq 550 Instrument: LRM Versions 1.3 to 3.1\nMiSeq Instrument: LRM Versions 1.3 to 3.1\niSeq 100 Instrument: LRM Versions 1.3 to 3.1\nMiniSeq Instrument: LRM Versions 1.3 to 3.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250\nLRM utilizes elevated privileges. An unauthenticated malicious actor can upload and execute code remotely at the operating system level, which can allow an attacker to change settings, configurations, software, or access sensitive data on the affected product. An attacker could also exploit this vulnerability to access APIs not intended for general use and interact through the network.\nCVE-2022-1517 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.2    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nLRM contains a directory traversal vulnerability that can allow a malicious actor to upload outside the intended directory structure.\nCVE-2022-1518 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.3    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nLRM does not restrict the types of files that can be uploaded to the affected product. A malicious actor can upload any file type, including executable code that allows for a remote code exploit.\nCVE-2022-1519 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.2.4    IMPROPER ACCESS CONTROL CWE-284\nLRM does not implement authentication or authorization by default. A malicious actor can inject, replay, modify, and/or intercept sensitive data.\nCVE-2022-1521 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.5    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nLRM version 2.4 and lower does not implement TLS encryption. A malicious actor can MITM attack sensitive data in-transit, including credentials.\nCVE-2022-1524 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nPentest, Ltd., (pentest.co.uk) reported these vulnerabilities to Illumina. Illumina reported these vulnerabilities to CISA.\n5. MITIGATIONS\nIllumina has developed a software patch to protect against the remote exploitation of these vulnerabilities and is actively working to provide a permanent software fix for current and future instruments.\nFor instruments connected to the Internet, the software patch is available for download. \n--------- Begin Update A: Part 1 of 1 ---------\nIllumnia has released the following hashes for the Local Run Manager in its latest software patch:\nFilename: LocalRunManagerSecurityPatch.msi\n\nSHA-512: 52b5cfdc462b10011027e94f184c2f0da25b0b1363fddb7fa5793938d11f976259a7f73e77c2fd157f560439ec3df70446aa561b586dc8ef94db2ed95fcce841 \nSHA-256: 595b724f1c5b4bac446001400b38b748b4ef05520b5489ea4711a2a4289e721a\nSHA-1: 25e523031b3bd818d4bba1017c534c735f650e23 \nMD5: 4552a1130947b95ac18be4335c1447f5\n\n--------- End Update A: Part 1 of 1 ---------\nFor affected products not connected to the Internet, Illumina has developed other options for the installation of the software patch. Please contact Illumina Tech Support at techsupport@illumina.com to obtain information about these options.  \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-1519",
    "CVE-2022-1518",
    "CVE-2022-1521",
    "CVE-2022-1517",
    "CVE-2022-1524"
  ],
  "techniques": [],
  "advisory": "icsa-22-153-02",
  "title": "Illumina Local Run Manager (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c73b437a10d4f173d526d83f6def756ac159ac543bc421c9d1651dc8e70f2b64"
}