{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: Siemens\nEquipment: TIM 1531 IRC\nVulnerability: Missing Authentication for Critical Function\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following TIM 1531 IRC communications modules:\n\nTIM 1531 IRC, all versions prior to v1.1\n\nIMPACT\nSuccessful exploitation may cause the device to enter a denial-of-service condition, or allow the attacker to read and manipulate data and configuration settings of the affected device.\nMITIGATION\nSiemens recommends updating to version 1.1 as soon as possible. The update can be found at the following location on the Siemens website:\nhttps://support.industry.siemens.com/cs/ww/en/view/109755374\nSiemens has identified the following specific workaround and mitigation that users can apply to reduce the risk:\n\nUsers can limit access to Port 80/TCP and Port 443/TCP in their network infrastructure (e.g., cell protection firewall or corporate firewall) to reduce the risk.\n\nSiemens recommends users protect network access with appropriate mechanisms. Siemens also advises that users follow recommendations in the product manuals and configure the operational environment according to Siemens’ Operational Guidelines for Industrial Security:\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security \nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-110922 at the following location:\nhttp://www.siemens.com/cert/advisories  \nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nINCORRECT IMPLEMENTATION OF AUTHENTICATION ALGORITHM CWE-303\n\nA remote attacker with network access to Port 80/TCP or Port 443/TCP could perform administrative operations on the device without prior authentication.\nCVE-2018-4841 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nSiemens reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Chemical, Critical Manufacturing, and Food and Agriculture\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2018-4841"
  ],
  "techniques": [],
  "advisory": "icsa-18-088-02",
  "title": "Siemens TIM 1531 IRC | CISA",
  "source": "ics-advisories",
  "id": "ea2e86dc72a6bf5d7a3af6a94fb51a23276843e816e1ca23f74885d0c2ae46fb"
}