{
  "markdown": "\nCVSS v3 9.9\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Gemalto\nEquipment: Sentinel License Manager\nVulnerability: Null Pointer Dereference, Buffer Overflows, Improper Access Control\nAFFECTED PRODUCTS\nThe following Sentinel License Manger services are affected:\n\nAll HASP SRM, Sentinel HASP, and Sentinel LDK products prior to Sentinel LDK RTE 7.55\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could lead to remote code execution or cause a denial-of-service condition, rendering the Sentinel LDK License Manager service unavailable.\nMITIGATION\nGemalto recommends users who have Sentinel LDK run-time environment (RTE) Version 2.10 through Version 7.54 update to Sentinel LDK RTE component Version 7.6, or the latest version. The update was available as of July 2017 and can be found at the following location:\nhttps://sentinelcustomer.gemalto.com/sentineldownloads/\nFor more information about these vulnerabilities, users can contact customer support at:\nhttps://supportportal.gemalto.com/csm\nOr visit the vendor’s customer portal at:\nhttp://safenet.gemalto.com/technical-support/security-updates/\nhttp://sentinel.gemalto.com/technical-support/security-updates-sm/\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nIn addition, NCCIC recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nNULL POINTER DEREFERENCE CWE-476\n\nLanguage packs (zip files) with invalid HTML files lead to NULL pointer dereferences, which could be exploited by an attacker leveraging malicious HTML files. This could lead to a denial-of-service condition.\nCVE-2017-11498 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nLanguage packs containing file names longer than 1,024 characters and malformed ASN.1 streams in input files can lead to a stack-based buffer overflow. This may allow remote code execution.\nCVE-2017-11497 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nMalformed ASN.1 streams in V2C and similar input files can be used to generate stack-based buffer overflows. This could allow remote code execution.\nCVE-2017-11496 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nXML payload with more than supported number of elements leads to buffer overflow of a variable in stack. This vulnerability can be exploited for denial of service.\nCVE-2017-12818 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nXML payload with more than supported number of elements leads to buffer overflow of a variable in stack. This vulnerability can be exploited for denial of service or arbitrary code execution.\nCVE-2017-12821 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nHEAP-BASED BUFFER OVERFLOW CWE-122\n\nMalformed HTTP request body in Admin APIs can be used to generate heap buffer overflows. This vulnerability can be exploited for denial of service.\nCVE-2017-12820 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nIMPROPER ACCESS CONTROL CWE-284\n\nLicense manager web interface is enabled as a default configuration, and even if disabled, it can be re-enabled remotely. This vulnerability can be exploited to perform above mentioned attacks remotely.\nCVE-2017-12822 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:L/A:L).\nRESEARCHER\nKaspersky Labs ICS-CERT reported these vulnerabilities to Gemalto CERT and NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Communications, Financial Services, Government Facilities, Healthcare and Public Health, Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Netherlands\n",
  "cves": [
    "CVE-2017-11498",
    "CVE-2017-11496",
    "CVE-2017-12818",
    "CVE-2017-12821",
    "CVE-2017-11497",
    "CVE-2017-12822",
    "CVE-2017-12820"
  ],
  "techniques": [],
  "advisory": "icsa-18-032-03",
  "title": "Gemalto Sentinel License Manager | CISA",
  "source": "ics-advisories",
  "id": "f3acf1449c3c9d11c556fc1b8d370e5cd10df1adb639711620df1baa4656119f"
}