{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SIMATIC Software Products\nVulnerability: Classic Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to manipulate project files, create a denial-of-service condition or remotely execute code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following SIMATIC software products:\n\nSIMATIC PCS 7 v8.2 and earlier: All versions\nSIMATIC PCS 7 v9.0: All versions prior to 9.0 SP3\nSIMATIC PDM: All versions prior to v9.2\nSIMATIC STEP 7 v5.X: All versions prior to v5.6 SP2 HF3\nSINAMICS STARTER (containing STEP 7 OEM version): All versions prior to v5.4 HF2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT (‘CLASSIC BUFFER OVERFLOW') CWE-120\nThe affected software contains a buffer overflow vulnerability while handling certain files that may allow a local attacker to trigger a denial-of-service condition or potentially lead to remote code execution.\nCVE-2021-31893 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nUri Katz from Claroty reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has released updates for the following products:\n\nSIMATIC PCS 7 v9.0: Update to v9.0 SP3 or later (To obtain SIMATIC PCS 7 v9.0 SP3 contact your local customer support)\nSIMATIC PDM: Update to v9.2 or later\nSIMATIC STEP 7 V5.X: Update to v5.6 SP2 HF3 or later\nSINAMICS STARTER (containing STEP 7 OEM version): Update to v5.4 HF2 or later\n\nSiemens has identified the following specific workarounds and mitigations customers can apply to reduce the risk:\n\nRestrict access to project files on the engineering station to trusted users\nOnly use project files from trusted sources\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens Operational Guidelines for Industrial Security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nPlease see Siemens Security Advisory ssa-641963 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-31893"
  ],
  "techniques": [],
  "advisory": "icsa-21-194-05",
  "title": "Siemens SIMATIC Software Products | CISA",
  "source": "ics-advisories",
  "id": "ef9442bb57c2bd88bb3d543f9358a320c4326a89abf3df611f38c7247f2237f8"
}