{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Distributed Data Systems\nEquipment: WebHMI\nVulnerabilities: Authentication Bypass by Primary Weakness, Unrestricted Upload of File with Dangerous Type\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an administrator account login without password authentication and remote code execution with root privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WebHMI, a SCADA system with built-in web server capability, are affected:\n\nAll versions prior to 4.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS BY PRIMARY WEAKNESS CWE-305\nThe authentication algorithm is sound, but the implemented mechanism can be bypassed as the result of a separate weakness primary to the authentication error.\nCVE-2021-43931 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nThe software allows the attacker to upload or transfer files of dangerous types that can be automatically processed within the product’s environment or lead to arbitrary code execution.\nCVE-2021-43936 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Germany, Poland, Ukraine, United States\nCOMPANY HEADQUARTERS LOCATION: Ukraine\n\n3.4 RESEARCHER\nMarcin Dudek of CERT.PL reported these vulnerabilities to CISA.\n4. MITIGATIONS\nDistributed Data Systems recommends:\n\nUpgrading the platform software to the latest release, Version 4.1\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-43931",
    "CVE-2021-43936"
  ],
  "techniques": [],
  "advisory": "icsa-21-336-03",
  "title": "Distributed Data Systems WebHMI | CISA",
  "source": "ics-advisories",
  "id": "b289ce0e380392d5118220554b7a2b2fb46f16bcfc62f16cdb2154c79141e8c7"
}