{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.3\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SICAM A8000\nVulnerability: Cross-site Scripting\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could compromise the confidentiality, integrity, and availability of the web application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SICAM A8000 RTUs are affected:\n\nSICAM WEB firmware: all versions prior to C05.30\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION (‘CROSS-SITE SCRIPTING’) CWE-79\nThe login screen does not sufficiently sanitize input, which enables an attacker to generate specially crafted log messages. If an unsuspecting user views the log messages via a web browser, these log messages might be interpreted and executed as code by the web application. This cross-site scripting (XSS) vulnerability might compromise the confidentiality, integrity, and availability of the web application.\nCVE-2020-15781 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nEmma Good from KTH Royal Institute of Technology reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends users update to the latest version, v05.30. Applying the update causes the device/module to go through a single restart cycle. Siemens also recommends users:\n\nRestrict access to Port 443/TCP\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-370042\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-15781"
  ],
  "techniques": [],
  "advisory": "icsa-20-224-08",
  "title": "Siemens SICAM A8000 RTUs | CISA",
  "source": "ics-advisories",
  "id": "abe8fec4a94e8eeae8f8d7e7e26c22fd7ee831372cdd5942bf4c5502d2ef6a48"
}