{
  "markdown": "\nOverview\nIndependent security researchers Billy Rios and Terry McCorkle have coordinated with ICS-CERT on a memory corruption vulnerability that affects Rockwell’s Automation FactoryTalk Diagnostics Viewer product.By using a specially crafted FactoryTalk Diagnostics Viewer configuration file, an attacker could possibly cause a memory corruption that allows the execution of arbitrary code.\nAccording to Rockwell Automation, this issue has been resolved in later versions of the FactoryTalk Diagnostics Viewer, starting with V2.30.00 (CPR9 SR3). ICS-CERT has not validated this update.\nAffected Products\nAccording to Rockwell Automation, these vulnerabilities affect Versions 2.10.x (SPR9 SR2) and earlier.\nImpact\nA successful exploitation of this vulnerability could result in the execution of arbitrary code.\nThe exact impact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.\nBackground\nRockwell Automation provides industrial automation control and information products worldwide, across a wide range of industries.\nThe FactoryTalk Diagnostics Viewer is part of the FactoryTalk Services Platform and collects, stores, and provides access to activity, status, warning, and error messages generated by products during installation, configuration, and operation.\nVulnerability Characterization\nVulnerability Overview\nThe memory corruption vulnerability could allow an attacker to execute arbitrary code using a specially crafted FactoryTalk Diagnostics Viewer configuration file (.ftd extension).\nVulnerability Details\nExploitability\nThis vulnerability is not remotely exploitable. The exploit can only be triggered when the specially crafted file is executed locally by a vulnerable version of FactoryTalk Diagnostics Viewer.\nExistence of Exploit\nNo known exploits specifically target this vulnerability.\nDifficulty\nCrafting a working exploit for this vulnerability requires moderate skill. Social engineering is required to convince the user to accept the malformed file, decreasing the likelihood of a successful exploit.\nMitigation\nRockwell Automation recommends that concerned customers upgrade the FactoryTalk Diagnostics Viewer to the latest version. Because FactoryTalk Diagnostics Viewer is not available as a standalone installation, customers must upgrade the FactoryTalk Services Platform product to FactoryTalk Diagnostics Viewer (CPR9 SR3) or greater.\nRockwell Automation also recommends its customers review the Rockwell Automation Software Product Compatibility Matrix to ensure they understand the dependencies and compatibilities that may arise as a result of upgrading this product.\nFor more information, refer to Rockwell Automation Security Advisory KB#448424.\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-175-01",
  "title": "Rockwell FactoryTalk Diag Viewer Memory Corruption | CISA",
  "source": "ics-advisories",
  "id": "2bb341e34a6a4bd2b263575a96bedc0a59fc97d58f242fc60b276f72a1a3c5fc"
}