{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Delta Controls\nEquipment: enteliBUS Controllers\nVulnerability: Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker on the same network to gain complete control of the device’s operating system and allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Delta Controls enteliBUS Controllers, industrial control systems, are affected:\n\nenteliBUS Manager firmware Versions 3.40 R5 build 571848 and prior\nenteliBUS Manager Touch (eBMGR-TCH) firmware Versions 3.40 R5 build 571848 and prior\nenteliBUS Controller (eBCON) firmware Versions 3.40 R5 build 571848 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT ('CLASSIC BUFFER OVERFLOW') CWE-120\nThe affected products are vulnerable to a buffer overflow condition due to the lack of input validation, which may allow an attacker to remotely execute arbitrary code.\nCVE-2019-9569 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Government Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Canada\n\n3.4 RESEARCHER\nDouglas McKee @fulmetalpackets and contributing researcher Mark Bereza @ROPsicle of McAfee Advanced Threat Research reported this vulnerability to Delta Controls.\n4. MITIGATIONS\nDelta Controls recommends users upgrade from enteliBUS 3.40 firmware to Version 3.40 R6 build 612850. Delta Controls also states it is important buildings are updated to the 3.40 R6 release to mitigate risk. The firmware is only accessible by Delta Controls registered partners and is not available for public download. To acquire the firmware update, contact a Delta Controls distributor or Delta Controls directly.\nIn addition to upgrading enteliBUS, Delta Controls recommends the following actions to secure building sites:\n\nDo not leave building controllers exposed to the Internet.\n\nIf remote connections to the network are required, use a virtual private network (VPN).\nSecure networks using Tempered Networks products (available through Delta Controls).\n\n\nRegularly review and validate the list of users authorized to access sites and controllers.\nEnsure personnel with access to the system are knowledgeable about and are trained to use Delta Controls products and networks.\nFollow security industry recommended practices for securing sites.\n\nFor more information on the vulnerability and more detailed mitigation instructions, please see Delta Controls Security Bulletin “SecB0001: enteliBUS 3.40 Controllers Remote Code Execution Vulnerability.” (Login required; only accessible by Delta Controls registered partners and not available for public download.)\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-9569"
  ],
  "techniques": [],
  "advisory": "icsa-19-239-01",
  "title": "Delta Controls enteliBUS Controllers | CISA",
  "source": "ics-advisories",
  "id": "c9ab5f0ce8f629e2e7e64c3d80f8a8aa1b52d9c9c997aec4007a20b0b68277c9"
}