{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Mitsubishi Electric Corporation \nEquipment: MELFA SD/SQ series and F-series Robot Controllers \nVulnerability: Active Debug Code \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain unauthorized access to a robot controller. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports this vulnerability affects the following Robot Controllers: \n\nMELFA SD/SQ Series: firmware version S7x and prior \nMELFA SD/SQ Series: firmware version R7x and prior \nMELFA F-Series: firmware version S7x and prior \nMELFA F-Series: firmware version R7x and prior \n\nNote: The affected firmware version depends on the model name; see Mitsubishi Electric’s publication for the specific model names and controller types. \n3.2 VULNERABILITY OVERVIEW\n3.2.1 ACTIVE DEBUG CODE CWE-489 \nAn authentication bypass vulnerability due to active debug code exists in Mitsubishi Electric MELFA SD/SQ series and F-series controllers for industrial robots. An attacker could gain unauthorized access to a robot controller by performing an unauthorized telnet login. \nCVE-2022-33323 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan \n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA. \n4. MITIGATIONS\nMitsubishi Electric released new firmware versions to address the issue. The fixed firmware version depends on the model name. Users should contact Mitsubishi Electric to obtain the latest firmware version: \n\nMELFA SD/SQ Series: Update to firmware version S7y or later \nMELFA SD/SQ Series: Update to firmware version R7y or later \nMELFA F-Series: Update to firmware version S7y or later \nMELFA F-Series: Update to firmware version R7y or later \n\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risk of an attacker exploiting this vulnerability: \n\nUse a firewall or virtual private network (VPN), etc. to prevent unauthorized access when internet access is required. \nUse affected products within a local area network (LAN) and block access from untrusted networks and hosts through firewalls. \n\nFor specific update instructions and additional details, see the Mitsubishi Electric advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.  \n",
  "cves": [
    "CVE-2022-33323"
  ],
  "techniques": [],
  "advisory": "icsa-23-026-05",
  "title": "Mitsubishi Electric MELFA SD/SQ series and F-series Robot Controllers | CISA",
  "source": "ics-advisories",
  "id": "ad33f22b092be09a2fe73dabbf52f4d77340f4ee4ab84db7c267e4387ae9c7ca"
}