{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Trane\nEquipment: Building Automation Controllers (Tracer SC)\nVulnerability: Cross-site Scripting\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to redirect a user to a malicious webpage and steal the user’s cookie.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Trane building automation products, a device used to coordinate building controls, is affected:\n\nTracer SC: Firmware v3.8 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CROSS-SITE SCRIPTING CWE-79\nThe affected product’s web application does not properly neutralize the input during webpage generation, which  could allow an attacker to inject code in the input forms.\nCVE-2021-42534 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nChizuru Toyama of TXOne IoT/ICS Security Research Labs of Trend Micro reported this vulnerability to CISA.\n4. MITIGATIONS\nTrane has identified the following specific mitigations for the affected products:\n\nUsers upgrade Tracer SC controllers running firmware v3.8 and prior,  to firmware  v4.4 SP7 or higher. Users should contact a regional Trane office to install updated firmware or request additional information and reference Trane service database number HUB-207592.\nTracer SC is no longer actively developed, tested, or sold. Tracer SC will be considered end-of-life on December 31, 2022. Trane recommends users identify a migration plan to replace the Tracer SC controller with  the Tracer SC+ controller, which can function as a drop-in replacement for Tracer SC, providing significant security upgrades.\n\nIn addition to the specific recommendations above, Trane recommends the following best practices as an additional protection against this and other controller vulnerabilities:\n\nRestrict physical controller access to trained and trusted personnel.\nIsolate Tracer controls from other network devices using virtual local area networks (VLAN), and from the Internet using a firewall with no exposed inbound ports.\nUse secure remote access solutions such as Trane Connect Remote Access.\nEnsure user credentials are not shared and follow best practices for appropriate complexity (e.g., strong passwords).\nHave a well-documented process and owner to ensure regular software/firmware updates and to keep systems up to date.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-42534"
  ],
  "techniques": [],
  "advisory": "icsa-21-292-02",
  "title": "Trane HVAC Systems Controls | CISA",
  "source": "ics-advisories",
  "id": "550d78674d33ee1f61c3ba0a2c8ee7c8af176500a6d518a33e4f106209523569"
}