{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: LOGO! Web Server\nVulnerability: Classic Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of LOGO! Web Server are affected:\n\nLOGO! 8 BM (incl. SIPLUS variants):\n\nVersions between 1.81.01 and 1.81.03\nVersion 1.82.01\nVersion 1.82.02\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    BUFFER COPY WITHOUT CHECKING SIZE OF INPUT ('CLASSIC BUFFER OVERFLOW') CWE-120\nA buffer overflow vulnerability in the Web Server functionality of the device allows an unauthenticated attacker to send specially crafted HTTP requests, which may cause memory corruption and result in remote code execution.\nCVE-2020-7593 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nAlexander Perez-Palma and Dave McDaniel from Cisco Talos and Emanuel Almeida from Cisco Systems reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends affected users update to the following versions:\nLOGO! 8 BM (incl.SIPLUS varriants):\n\nVersions between 1.81.01 and 1.81.03: Update to v1.81.04\nVersion 1.82.01: Update to v1.82.03\nVersion 1.82.02: Update to v1.82.04\n\nSiemens recommends applying defense-in-depth concepts, including the protection concept outlined in the system manual.\nSiemens recommends following their general security recommendations. As a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-573753.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-7593"
  ],
  "techniques": [],
  "advisory": "icsa-20-196-08",
  "title": "Siemens LOGO! Web Server | CISA",
  "source": "ics-advisories",
  "id": "7c785cf8cdb21fe21cdec25ab2780581fb26a98d6a493f55c3c665de6d04cdf0"
}