{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: Rockwell Automation\nEquipment: FactoryTalk Services Platform\nVulnerability: Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could use a token to log into the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports that the following products are affected:\n\nFactoryTalk Services Platform: v2.74\n\n3.2 Vulnerability Overview\n3.2.1 Improper Authentication CWE-287\nDue to inadequate code logic, a previously unauthenticated threat actor could potentially obtain a local Windows OS user token through the FactoryTalk Services Platform web service and then use the token to log in into FactoryTalk Services Platform. This vulnerability can only be exploited if the authorized user did not previously log in into the FactoryTalk Services Platform web service.\nCVE-2023-46290 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported this vulnerability to CISA.\n4. MITIGATIONS\nRockwell Automation encourages users of the affected software to update to V2.80 or later, if possible. Additionally, they encourage customers to implement their suggested security best practices to minimize the risk of vulnerability.\nFor more information see Rockwell Automation's security advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nThis vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nOctober 26, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-46290"
  ],
  "techniques": [],
  "advisory": "icsa-23-299-06",
  "title": "Rockwell Automation FactoryTalk Services Platform | CISA",
  "source": "ics-advisories",
  "id": "aec42c9e1d1df29cff1e95d543793ac44969e8e66ea3a3ef130066be5126f0f2"
}