{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Hitachi Energy \nEquipment: Gateway Station (GWS) \nVulnerabilities: NULL Pointer Dereference, Infinite Loop \n\n \n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause affected modules to stop working. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi Energy reports these vulnerabilities affect open-source software (OpenLDAP and OpenSSL) used by the following Gateway Station (GWS) versions:  \n\nGWS 2.0.0.0  \nGWS 2.1.0.0  \nGWS 2.2.0.0  \nGWS 2.3.0.0  \nGWS 2.4.0.0  \nGWS 3.0.0.0  \nGWS 3.1.0.0 \nGWS 3.2.0.0 and earlier \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 NULL POINTER DEREFERENCE CWE-476 \nA NULL pointer dereference was found in affected versions of OpenLDAP. An unauthenticated attacker could remotely crash the slapd process by sending a specially crafted request, causing a denial-of-service condition on the user authentication function.  \nNote: Local authentication will continue to work; the authentication service is not installed by default. \nCVE-2020-25692 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.2.2 INFINITE LOOP CWE-835 \nA vulnerability exists in the OpenSSL’s BN_mod_sqrt() function, which computes a modular square root containing a bug that can cause it to loop forever for non-prime moduli. Internally, this function is used when parsing certificates containing elliptic curve public keys in compressed form or explicit elliptic curve parameters with a base point encoded in compressed form. Successful exploitation may cause a denial-of-service condition. \nCVE-2022-0778 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA. \n4. MITIGATIONS\nHitachi Energy has created an update to address the reported vulnerabilities and recommends users update to at least GWS version 3.3.0.0  \nFor CVE-2020-25692, the vulnerability impacts GWS if the authentication service is installed. It is not installed by default but is required during the installation process of GWS, or installed manually later. Authentication Service (previously ABB Authentication Service) is only needed when GWS users are authenticated using centralized SDM600 user account management. \nHitachi Energy recommends the following general mitigation factors and security practices: \n\nConfigure firewalls to protect process control networks from attacks originating from outside the network  \nPhysically protect process control systems from direct access by unauthorized personnel  \nAvoid directly connecting control systems to the internet \nSeparate process control networks from other networks using a firewall system with a minimal number of ports exposed  \nProcess control systems should not be used for internet surfing, instant messaging, or receiving emails  \nPortable computers and removable storage media should be carefully scanned for viruses before connecting to a control system  \nEnforce proper password policies and processes \n\nFor more information, see Hitachi security advisory 8DBD000118. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2022-0778",
    "CVE-2020-25692"
  ],
  "techniques": [],
  "advisory": "icsa-23-059-01",
  "title": "Hitachi Energy Gateway Station | CISA",
  "source": "ics-advisories",
  "id": "1c3273fc95c5853bcd30b80574d8d4b0d9be9529c990b1245bcb9ba3517af3f8"
}