{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SCALANCE and RUGGEDCOM Devices\nVulnerability: Stack-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-068-03 Siemens SCALANCE and RUGGEDCOM Devices that was published March 9, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a reboot. Under specific circumstances, an attacker could also achieve remote code execution of the affected devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n--------- Begin Update A Part 1 of 2 --------\n\nRUGGEDCOM RM1224: All versions from v4.3 and prior to v4.6\nSCALANCE M-800: All versions from v4.3 and prior to v4.6\nSCALANCE S615: All versions from v4.3 and prior to v4.6\nSCALANCE XR-300WG: All versions prior to v4.1\nSCALANCE XB-200: All versions prior to v4.1\nSCALANCE XC-200: All versions prior to v4.1\nSCALANCE XF-200BA: All versions prior to v4.1\nSCALANCE XP-200: All versions prior to v4.1\n\n--------- End Update A Part 1 of 2 --------\n\nSCALANCE SC-600 Family: All versions from v2.0 and prior to v2.1.3\nSCALANCE XM400: All versions prior to v6.2\nSCALANCE XR500: All versions prior to v6.2\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nAffected devices contain a stack-based buffer overflow vulnerability in the handling of Spanning Tree Protocol (STP) Bridge Protocol Data Unit (BPDU) frames that could allow a remote attacker to trigger a denial-of-service condition or potential remote code execution. Successful exploitation requires the passive listening feature of the device to be active.\nCVE-2021-25667 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends applying updates where applicable:\n\nSCALANCE SC-600 Family: Update to v2.1.3 or later\nSCALANCE X300WG: Update to v4.1 or later\nSCALANCE XM400: Update to v6.2 or later\nSCALANCE XR500: Update to v6.2 or later\n\n--------- Begin Update A Part 2 of 2 --------\n\nSCALANCE XB-200: Update to v4.1 or later\nSCALANCE XC-200: Update to v4.1 or later\nSCALANCE XF-200BA: Update to v4.1 or later\nSCALANCE XP-200: Update to v4.1 or later\nRUGGEDCOM RM1224: Update to v6.4 or later\nSCALANCE M-800: Update to v6.4 or later\nSCALANCE S615: Update to v6.4 or later\n\n--------- End Update A Part 2 of 2 --------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDeactivate the STP passive listening feature of the vulnerable devices.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-979775\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-25667"
  ],
  "techniques": [],
  "advisory": "icsa-21-068-03",
  "title": "Siemens SCALANCE and RUGGEDCOM Devices (Update A) | CISA",
  "source": "ics-advisories",
  "id": "ac345979b3dbd72a827d19a6205c41518d80bf9e98ff546f9ae9ce4e8df2512a"
}