{
  "markdown": "\nCVSS v3 7.2\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Schneider Electric\nEquipment: StruxureOn Gateway\nVulnerability: Unrestricted Upload of File with Dangerous Type\nAFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following versions of StruxureOn Gateway, a software management platform:\n\nStruxureOn Gateway, all versions prior to 1.2\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a remote attacker to upload a malicious file to any directory on the device, which could lead to remote code execution.\nMITIGATION\nSchneider Electric has released a new version of the software located at:\nhttps://struxureon.com/download-and-set-up-struxureon-gateway/\nFor more information on these vulnerabilities and associated patch, please see Schneider Electric’s security notification SEVD-2018-039-01 on their website:\nhttps://www.schneider-electric.com/en/download/document/SEVD-2018-039-01/\nSchneider Electric reports that, in addition to upgrading to version 1.2, users should ensure they change the default passwords as this vulnerability requires authenticated access.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nUNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\n\nUploading a zip file with modified metadata may allow remote code execution.\nCVE-2017-9970 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nSchneider Electric reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2017-9970"
  ],
  "techniques": [],
  "advisory": "icsa-18-046-04",
  "title": "Schneider Electric StruxureOn Gateway | CISA",
  "source": "ics-advisories",
  "id": "2b8a93f835877bcc4065fce4b024368edb367171167904a742735b2dbf9d4375"
}