{
  "markdown": " Phoenix Contact ProConOS and MULTIPROG \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryPhoenix Contact ProConOS and MULTIPROG====================================== Last Revised June 21, 2022 Alert Code ICSA\\-22\\-172\\-041\\. EXECUTIVE SUMMARY---------------------* **CVSS v3 9\\.8*** **ATTENTION:**  Exploitable remotely/low attack complexity* **Vendor:**  Phoenix Contact* **Equipment:**  ProConOS/ProConOS eCLR and MULTIPROG* **Vulnerability:**  Insufficient Verification of Data Authenticity CISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.2\\. RISK EVALUATION------------------- Successful exploitation of this vulnerability could allow an attacker to upload arbitrary malicious code after gaining access to the communication to products utilizing ProConOS/ProConOS eCLR or MULTIPROG.3\\. TECHNICAL DETAILS---------------------### 3\\.1 AFFECTED PRODUCTS The following versions of ProConOS, a software development kit, are affected:* ProConOS: All versions* ProConOS eCLR: All versions* MULTIPROG: All versions### 3\\.2 VULNERABILITY OVERVIEW#### 3\\.2\\.1 [INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE\\-345](https://cwe.mitre.org/data/definitions/345.html) The affected product lacks an integrity check in the SDK, which could allow an attacker to upload logic with arbitrary malicious code.[CVE\\-2022\\-31801](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2022-31801)  has been assigned to this vulnerability. A CVSS v3 base score of 9\\.8 has been calculated; the CVSS vector string is ( [AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)  ).### 3\\.3 BACKGROUND* **CRITICAL INFRASTRUCTURE SECTORS:**  Multiple Sectors* **COUNTRIES/AREAS DEPLOYED:**  Worldwide* **COMPANY HEADQUARTERS LOCATION:**  Germany### 3\\.4 RESEARCHER Daniel dos Santos and Jos Wetzels of Forescout Technologies reported this vulnerability to CISA.4\\. MITIGATIONS--------------- Phoenix Contact has provided the following mitigations and workarounds:* Industrial controllers based on ProConOS/ProConOS eCLR are typically developed and designed for use in closed industrial networks using a defense\\-in\\-depth approach and focusing on network segmentation. In such an approach, the production plant is protected against attacks (especially from the outside) by a multi\\-level perimeter, including firewalls, as well as dividing the plant into OT zones. This concept is supported by organizational measures in the production plant as part of a security management system. To accomplish such security, measures are required at all levels.* Manufacturers using ProConOS/ProConOS eCLR in automation devices are advised to check implementation and publish an advisory according to their product.* Users of automation devices utilizing ProConOS/ProConOS eCLR in their automation systems may check if their application requires additional security measures, such as adequate defense\\-in\\-depth networking architecture, the use of virtual private networks (VPNs) for remote access, or the use of firewalls for network segmentation or controller isolation. Users should check manufacturer security advisories for more adequate information according to their dedicated device.* Users should ensure logic is always transferred or stored in protected environments. This is valid for data in transmission as well as data in rest.* Users should ensure connections between the engineering tools and the controller are located in a locally protected environment or protected by VPN for remote access.* Do not send project data as a file via email or other transfer mechanisms without additional integrity and authenticity checks. Save project data in protected environments only.* Generic information and recommendations for security measures to protect network\\-capable devices can be found in the [Application Note](https://dam-mdc.phoenixcontact.com/asset/156443151564/0a870ae433c19148b80bd760f3a1c1f2/107913_en_03.pdf)  . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure they are [not accessible from the Internet](https://www.cisa.gov/uscert/ics/alerts/ICS-ALERT-10-301-01)  .* Locate control system networks and remote devices behind firewalls and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for [control systems security recommended practices](https://www.cisa.gov/uscert/ics/recommended-practices)  on the [ICS webpage on cisa.gov/ics](https://cisa.gov/ics)  Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](https://www.cisa.gov/uscert/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . Additional mitigation guidance and recommended practices are publicly available on the [ICS webpage on cisa.gov/ics](https://cisa.gov/ics)  in the Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](https://www.cisa.gov/uscert/ics/tips/ICS-TIP-12-146-01B)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents. No known public exploits specifically target this vulnerability. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Siemens-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-22-172-04)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2022-31801"
  ],
  "techniques": [],
  "advisory": "icsa-22-172-04",
  "title": "Phoenix Contact ProConOS and MULTIPROG | CISA",
  "source": "ics-advisories",
  "id": "fecc57924a93a81a043c3ac6f46f3effe0cb1b32787877c4c3e2984e69ec46ea"
}