{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.6\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SCALANCE Products\nVulnerabilities: Improper Adherence to Coding Standards\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-227-03 Siemens SCALANCE Products that was published August 15, 2019, to the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to a denial of service or could allow an authenticated local user with physical access to the device to execute arbitrary commands on the device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens SCALANCE products are affected by these vulnerabilities: \n\nSCALANCE SC-600: v2.0\nSCALANCE XB-200: v4.1 (only affected by CVE-2019-10927)\nSCALANCE XC-200: v4.1 (only affected by CVE-2019-10927)\nSCALANCE XF-200BA: v4.1 (only affected by CVE-2019-10927)\nSCALANCE XP-200: v4.1 (only affected by CVE-2019-10927)\nSCALANCE XR-300WG: v4.1 (only affected by CVE-2019-10927)\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER ADHERENCE TO CODING STANDARDS CWE-710\nAn authenticated attacker with network access to Port 22/TCP of an affected device may cause a denial-of-service condition.\nThis security vulnerability could be exploited by an authenticated attacker with network access to the affected device. No user interaction is required to exploit this vulnerability. The vulnerability impacts the availability of the affected device.\nCVE-2019-10927 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n4.2.2     IMPROPER ADHERENCE TO CODING STANDARDS CWE-710\nAn authenticated attacker with access to Port 22/TCP as well as physical access to an affected device may trigger the device to allow execution of arbitrary commands.\nThe security vulnerability could be exploited by an authenticated attacker with physical access to the affected device. No user interaction is required to exploit this vulnerability. The vulnerability impacts the confidentiality, integrity, and availability of the affected device.\nCVE-2019-10928 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been assigned; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens currently has an update for the following product:\n\nSCALANCE SC-600: Update to v2.0.1\n\n--------- Begin Update A Part 1 of 1 ---------\n\nSCALANCE XB-200: Update to v4.2\nSCALANCE XC-200: Update to v4.2\nSCALANCE XF-200BA: Update to v4.2\nSCALANCE XP-200: Update to v4.2\nSCALANCE XR-300WG: Update to v4.2\n\n--------- End Update A Part 1 of 1 ---------\nSiemens has identified the following specific workarounds and mitigations that customers can apply to reduce risk: \n\nRestrict access to Port 22/TCP (use the built-in firewall for SCALANCE SC-600); \nRestrict physical access to the device.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security, and following the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor further inquiries on security vulnerabilities in Siemens products and solutions, please contact the Siemens ProductCERT: https://www.siemens.com/cert/advisories\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens security advisory SSA-671286 at the following location: http://www.siemens.com/cert/advisories\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2019-10927",
    "CVE-2019-10928"
  ],
  "techniques": [],
  "advisory": "icsa-19-227-03",
  "title": "Siemens SCALANCE Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c4a55b926c9eac50fc193f51118c5769fc032771d9f3287803f23a888ae01ec3"
}