{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.3 \nATTENTION: low attack complexity \nVendor: CODESYS, GmbH \nEquipment: CODESYS Development System \nVulnerability: Improper Restriction of Excessive Authentication Attempts. \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could provide a local attacker with account information. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nCODESYS reports this vulnerability affects the following versions of CODESYS Development System: \n\nCODESYS Development System: versions prior to 3.5.19.20 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345 \nA missing brute-force protection in CODESYS Development System prior to 3.5.19.20 could allow a local attacker to have unlimited attempts of guessing the password within an import dialog. \nCVE-2023-3669 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nA user reported this vulnerability. CERT@VDE coordinated the vulnerability. \n4. MITIGATIONS\nCODESYS recommends users update the CODESYS Development System to version 3.5.19.20. \nThe CODESYS Development System can be downloaded and installed directly with the CODESYS Installer or be downloaded from the CODESYS Store. \nAlternatively, users may find further information on obtaining the software update in the CODESYS Update area. \nFor more information, please see the advisory CERT@VDE published for CODESYS at: \nhttps://cert.vde.com/en-us/advisories/vde-2023-023 \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. \nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. \nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. \nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2023-3669"
  ],
  "techniques": [],
  "advisory": "icsa-23-236-04",
  "title": "CODESYS Development System | CISA",
  "source": "ics-advisories",
  "id": "7cbb5392157a65252f1adb67c93d3888dad12c5664734627d059610f5eb68a28"
}