{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: Air Conditioning Systems\nVulnerabilities: Use of a Broken or Risky Cryptographic Algorithm, Exposure of Sensitive Information to an Unauthorized Actor, Channel Accessible by Non-Endpoint\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to disclose or tamper data in communication between the air conditioning system and the external computers or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe firmware on the following Mitsubishi Electric products is affected:\n\nG-150AD: Versions 3.21 and prior\nAG-150A-A: Versions 3.21 and prior\nAG-150A-J: Versions 3.21 and prior\nGB-50AD: Versions 3.21 and prior\nGB-50ADA-A: Versions 3.21 and prior\nGB-50ADA-J: Versions 3.21 and prior\nEB-50GU-A: Versions. 7.10 and prior\nEB-50GU-J: Versions 7.10 and prior\nAE-200J: Versions 7.97 and prior\nAE-200A: Versions 7.97 and prior\nAE-200E: Versions 7.97 and prior\nAE-50J: Versions 7.97 and prior\nAE-50A: Versions 7.97 and prior\nAE-50E: Versions 7.97 and prior\nEW-50J: Versions 7.97 and prior\nEW-50A: Versions 7.97 and prior\nEW-50E: Versions 7.97 and prior\nTE-200A: Versions 7.97 and prior\nTE-50A: Versions 7.97 and prior\nTW-50A: Versions 7.97 and prior\n\nSee Mitsubishi Electric’s security bulletin for specific correspondence between affected products and vulnerabilities.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nUse of a broken or risky cryptographic algorithm allows a remote unauthenticated attacker to cause a disclosure of an encrypted message from the air conditioning systems by sniffing encrypted communications.\nCVE-2022-24296 has been assigned to this vulnerability. A CVSS v3 base score of 3.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.2.2    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe DES and Triple DES ciphers, as used in the TLS, SSH, and IPSec protocols and other protocols and products, have a birthday bound of approximately 4 billion blocks. This which makes it easier for remote attackers to obtain cleartext data via a birthday attack against a long duration encrypted session, as demonstrated by an HTTPS session using Triple DES in CBC mode (a.k.a. a “Sweet32” attack).\nCVE-2016-2183 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThe RC4 algorithm, as used in the TLS protocol and SSL protocol, has many single-byte biases that make it easier for remote attackers to conduct plaintext-recovery attacks via statistical analysis of ciphertext in a large number of sessions using the same plaintext.\nCVE-2013-2566 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.4    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThis vulnerability makes it easier for remote attackers to conduct plaintext-recovery attacks against the initial bytes of a stream by sniffing network traffic that relies on keys affected by the Invariance Weakness. An attacker can then use a brute-force approach involving LSB values (a.k.a. the “Bar Mitzvah” issue).\nCVE-2015-2808 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.5    CHANNEL ACCESSIBLE BY NON-ENDPOINT CWE-300\nThe TLS protocol and the SSL Protocol 3.0 and earlier do not properly associate renegotiation handshakes with an existing connection in some third-party products. This allows machine-in-the-middle attackers to insert data into sessions protected by TLS or SSL by sending an unauthenticated request processed retroactively by a server in a post-renegotiation context.\nCVE-2009-3555 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi recommends updating the following air conditioning system’s firmware to the latest versions:\n\nG-150AD: Replace the air conditioning systems to AE-200J, AE-50J or EW-50J Version 7.98 or later\nAG-150A-A: Replace the air conditioning systems to AE-200A, AE-50A or EW-50A Version 7.98 or later\nAG-150A-J: Replace the air conditioning systems to AE-200E, AE-50E or EW-50E Version 7.98 or later\nGB-50AD: Replace the air conditioning systems to AE-200J, AE-50J or EW-50J Version 7.98 or later\nGB-50ADA-A: Replace the air conditioning systems to AE-200A, AE-50A or EW-50A Version 7.98 or later\nGB-50ADA-J: Replace the air conditioning systems to AE-200E, AE-50E or EW-50E Version 7.98 or later\nEB-50GU-A: Update to Version 7.11 or later\nEB-50GU-J: Update to Version 7.11 or later\nAE-200J: Update to Version 7.98 or later\nAE-200A: Update to Version 7.98 or later\nAE-200E: Update to Version 7.98 or later\nAE-50J: Update to Version 7.98 or later\nAE-50A: Update to Version 7.98 or later\nAE-50E: Update to Version 7.98 or later\nEW-50J: Update to Version 7.98 or later\nEW-50A: Update to Version 7.98 or later\nEW-50E: Update to Version 7.98 or later\nTE-200A: Update to Version 7.98 or later\nTE-50A: Update to Version 7.98 or later\nTW-50A: Update to Version 7.98 or later\n\nTo minimize the risk of these vulnerabilities being exploited, please make sure air conditioning systems are properly configured as recommended by Mitsubishi Electric. Mitsubishi Electric recommends taking the following mitigation measures:\n\nRestrict the access to air conditioning systems from untrusted networks and hosts.\nUse an anti-virus software and update the OS and the web browser to the latest version on your computer to connect your air conditioning system.\n\nSee Mitsubishi Electric’s security bulletin for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a high attack complexity.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a high attack complexity.\n",
  "cves": [
    "CVE-2013-2566",
    "CVE-2022-24296",
    "CVE-2009-3555",
    "CVE-2016-2183",
    "CVE-2015-2808"
  ],
  "techniques": [],
  "advisory": "icsa-22-160-01",
  "title": "Mitsubishi Electric Air Conditioning Systems | CISA",
  "source": "ics-advisories",
  "id": "e5f239fd451ee3681d90f198b087ea166c1651b9d4356c60560e83bd349c77f3"
}