{
  "markdown": "\nCVSS v3 7.2\nATTENTION: Remotely exploitable/Low skill level to exploit.\nVendor: Schweitzer Engineering Laboratories, Inc. (SEL)\nEquipment: SEL-3620, SEL-3622\nVulnerability: Improper Access Control\nAFFECTED PRODUCTS\nThe following versions of SEL-3620 and SEL-3622, an Ethernet Security Gateway, are affected:\n\nSecurity Gateway Versions R202 and,\nR203, R203-V1, R203-V2 and,\nR204, R204-V1.\n\nIMPACT\nThis behavior could result in unauthorized communications through the SEL-3620 and SEL-3622 to configured NAT port forwarding destinations.\nMITIGATION\nSEL has determined that, when NAT port forwarding is not used, all routed traffic is filtered properly through the firewall access control lists. If NAT port forwarding is required, SEL recommends that users of affected products contact their SEL Sales Representative or Customer Service Representative to obtain a no-cost firmware upgrade CD-ROM packet including upgrade instructions.\nContact can be made at the following location:\nhttps://selinc.com/support/?categories.Sales\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER ACCESS CONTROL CWE-284 \n\nThe device does not properly enforce access control while configured for NAT port forwarding, which may allow for unauthorized communications to downstream devices.   \nCVE-2017-7928 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:N).\nRESEARCHER\nJason Holcomb with Revolutionary Security discovered the vulnerability and has tested the patch.\nBACKGROUND\nCritical Infrastructure Sector: Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Pullman, Washington\n",
  "cves": [
    "CVE-2017-7928"
  ],
  "techniques": [],
  "advisory": "icsa-17-192-06",
  "title": "Schweitzer Engineering Laboratories, Inc. SEL-3620 and SEL-3622 | CISA",
  "source": "ics-advisories",
  "id": "8289139f524881379d20362e60fe920ff0a73b90b86d6baf2c00f0e053681861"
}