{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Yokogawa\nEquipment: CENTUM\nVulnerabilities: Improper Authentication, Path Traversal\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-224-01 Yokogawa CENTUM that was published August 11, 2020, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote unauthenticated attacker to send tampered communication packets or create/overwrite any file and run any commands.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nYokogawa reports that the vulnerability affects the following CENTUM distributed control system products:\n--------- Begin Update A Part 1 of 2 --------- \n\nExaopc (R3.72.00 - R3.78.00)\n\n--------- End Update A Part 1 of 2 --------- \n\nCENTUM CS 3000 versions R3.08.10 - R3.09.50 (Including CENTUM CS 3000 Entry Class)\nCENTUM VP versions R4.01.00 - R6.07.00 (Including CENTUM VP Entry Class)\nB/M9000CS versions R5.04.01 - R5.05.01\nB/M9000 VP versions R6.01.01 - R8.03.01\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHENTICATION CWE-287\nThis vulnerability may allow a remote unauthenticated attacker to send tampered communication packets. \nCVE-2020-5608 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n4.2.2    PATH TRAVERSAL CWE-22\nThis vulnerability may allow a remote attacker to create or overwrite any file, run any commands. \nCVE-2020-5609 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nNataliya Tlyapova, Ivan Kurnakov, and Positive Technologies reported these vulnerabilities to Yokogawa.\n5. MITIGATIONS\nYokogawa recommends the following mitigations:\n--------- Begin Update A Part 2 of 2 --------- \n\nExaopc R3.72.00 - R3.78.00: Update to R3.78.10 or later.\n\n--------- End Update A Part 2 of 2 --------- \n\nFor CENTUM CS 3000 (including CENTUM CS 3000 Entry Class) R3.08.10 – R3.09.50 and CENTUM VP (including CENTUM VP Entry Class) R4.01.00 – R4.03.00, no patch will be available because these products are already end of support. Yokogawa recommends that affected customers upgrade to the latest revision of CENTUM VP.\nFor CENTUM VP (including CENTUM VP Entry Class) R5.01.00 – R5.04.20, apply patch R5.04.D1\nFor CENTUM VP (including CENTUM VP Entry Class) R6.01.00 – R6.07.00, apply patch R6.07.11\nFor B/M9000CS R5.04.01 – R5.05.01 and B/M9000 VP R6.01.01 – R8.03.01, Yokogawa reports that this product is not affected by the vulnerabilities but is affected by the existence of CENTUM CS 3000 installed on the same PC. If CENTUM CS 3000 is installed, update B/M90000CS to suitable revision. If CENTUM VP is installed on the same PC, update to B/M90000 VP to suitable revision.\n\nFor questions related to this report, please contact Yokogawa support.\nMore details can also be found in Yokogawa’s security advisory report number YSAR-20-0001\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-5608",
    "CVE-2020-5609"
  ],
  "techniques": [],
  "advisory": "icsa-20-224-01",
  "title": "Yokogawa CENTUM (Update A) | CISA",
  "source": "ics-advisories",
  "id": "94bdccddfd40b4ba8a6aebd9f1e31b3dc272abc86d080809ec161b023b89ff8b"
}