{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: SIMATIC S7-1500 CPU family\nVulnerability: Resource Exhaustion\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-042-11 Siemens SIMATIC S7-1500 that was published February 11, 2020, to the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nThis vulnerability could allow a remote attacker to conduct denial-of-service attacks.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SIMATIC are affected:\n\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions v2.5 or higher and lower than v20.8\n\n--------- End Update A Part 1 of 2 ---------\n\nSIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants): All versions v2.5 or higher and lower than v2.8\nSIMATIC S7-1500 Software Controller: All versions v2.5 or higher and lower than v20.8\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION (‘RESOURCE EXHAUSTION’) CWE-400\nAffected devices contain a vulnerability that allows an unauthenticated attacker to trigger a denial-of-service condition. The vulnerability can be triggered if specially crafted UDP packets are sent to the device.\nCVE-2019-19281 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\nSiemens has released updates for several affected products and recommends specific workarounds and mitigations that customers can apply to reduce the risk:\n\nRestrict network access to affected devices.\nFor SIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants), Siemens recommends users update to v20.8 (v2x.8 corresponds to v2.8 of the S7-1500 CPU firmware).\n\n--------- End Update A Part 2 of 2 ---------\n\nFor SIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants), Siemens recommends users update to v2.8\nFor SIMATIC S7-1500 Software Controller, Siemens recommends users update to v20.8 (v2x.8 corresponds to v2.8 of the S7-1500 CPU firmware).\n\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-750824\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-19281"
  ],
  "techniques": [],
  "advisory": "icsa-20-042-11",
  "title": "Siemens SIMATIC S7-1500 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "511f8c86b2abc744114ec4d72b4a1fef0f5195855ecc0e6356f95ffcf1c48dc6"
}