{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.6\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: Stratix 5400/5410/5700/8000/8300, ArmorStratix 5700\nVulnerabilities: Resource Management Errors, Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in a denial-of-service condition or time synchronization issues across the network via reloading the device, a buffer overflow, or memory exhaustion.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n\nAllen-Bradley Stratix 5400: All versions 15.2(6)E0a and prior\nAllen-Bradley Stratix 5410: All versions 15.2(6)E0a and prior\nAllen-Bradley Stratix 5700: All versions 15.2(6)E0a and prior\nAllen-Bradley ArmorStratix 5700: All versions 15.2(6)E0a and prior\nAllen-Bradley Stratix 8000: All versions 15.2(6)E0a and prior\nAllen-Bradley Stratix 8300: All versions prior to 15.2(4)EA7\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    RESOURCE MANAGEMENT ERRORS CWE-399\nSending a specially crafted open shortest path first version 3 (OSPFv3) packet could allow an unauthenticated, adjacent attacker to cause an affected device to reload, resulting in a denial-of-service condition.\nCVE-2018-0466 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.2    RESOURCE MANAGEMENT ERRORS CWE-399\nSending a malformed HTTP packet in the web framework of Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause a buffer overflow condition on an affected device, resulting in a denial-of-service condition.\nCVE-2018-0470 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.3    RESOURCE MANAGEMENT ERRORS CWE-399\nSending a custom precision time protocol (PTP) packet to or through an affected device could allow an unauthenticated remote attacker to cause a denial-of-service condition of PTP, which may result in time synchronization issues across the network.\nCVE-2018-0473 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    IMPROPER INPUT VALIDATION CWE-20\nSending a malicious IPv6 packet to or through the affected device could allow an unauthenticated, remote attacker to cause the device to reload, resulting in a denial-of-service condition.\nCVE-2018-0467 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.2.5    RESOURCE MANAGEMENT ERRORS CWE-399\nSending a high rate of Cisco discovery protocol packets to an affected device could allow an unauthenticated, adjacent attacker to exhaust memory on an affected device, resulting in a denial-of-service condition.\nCVE-2018-15373 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nRockwell Automation reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nRockwell automation recommends users upgrade to the following versions or later:\nFRN 15.2(6)E2a:\n\nAllen-Bradley Stratix 5400\nAllen-Bradley Stratix 5410\nAllen-Bradley Stratix 5700\nAllen-Bradley ArmorStratix 5700\nAllen-Bradley Stratix 8000\n\nFRN 15.2(4)EA7:\n\nAllen-Bradley Stratix 8300\n\nUpdates can be found and downloaded from the following page:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?famID=15\nRockwell Automation recommends users apply the following general guidelines:\n\nUtilize proper network infrastructure controls, such as firewalls, to help ensure that requests from unauthorized sources are blocked and the controls are isolated from the business network.\nConsult the product documentation for specific features, such as access control lists and deep pack inspection, which may be used to block unauthorized changes, etc.\nBlock all traffic to EtherNet/IP, or other CIP protocol-based devices, from outside the manufacturing zone by blocking or restricting access to TCP and UDP Port 2222 and Port 44818 using proper network infrastructure controls, such as firewalls, UTM devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation Products, see Knowledgebase Article ID 898270 (Login required).\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nFor additional information, see Rockwell Automation’s security advisory, which can be found at the following link:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1082687 (Login required)\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-0466",
    "CVE-2018-0467",
    "CVE-2018-0473",
    "CVE-2018-0470",
    "CVE-2018-15373"
  ],
  "techniques": [],
  "advisory": "icsa-19-094-03",
  "title": "Rockwell Automation Stratix 5400/5410/5700/8000/8300 and ArmorStratix 5700 | CISA",
  "source": "ics-advisories",
  "id": "f34b09268a31192f0ee1983840f71aa04da3e9a311af85fa9da670e27476461a"
}