{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.2\nATTENTION: Exploitable remotely\nVendor: Intel\nEquipment: Intel 2G Modem\nVulnerability: Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this buffer overflow vulnerability may allow remote code execution.\nThe vulnerability affects Intel 2G modem products where the earthquake tsunami warning system (ETWS) feature is enabled in modem firmware. Devices equipped with an affected modem, when connected to a rogue 2G base station where non-compliant 3GPP software may be operational, are potentially at risk.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products use the vulnerable Intel modem with 2G capability and ETWS enabled:\n\nIntel XMM71xx\nIntel XMM72xx\nIntel XMM73xx\nIntel XMM74xx\nSofia 3G\nSofia 3G-R\nSofia 3G-R W\n\nVersions that support 2G and the ETWS feature delivered to system manufactures prior to the disclosure of CVE-2018-3624 may be affected.\n3.2 VULNERABILITY OVERVIEW\n3.2.1 BUFFER COPY WITHOUT CHECKING SIZE OF INPUT ('CLASSIC BUFFER OVERFLOW') CWE-120\nBuffer overflow in ETWS processing module allows a remote attacker to potentially execute arbitrary code via an adjacent network.\nCVE-2018-3624 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:L).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Communication, Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n\n3.4 RESEARCHER\nDr. Ralph Phillip Weinmann and Dr. Nico Golde from Comsecuris reported this vulnerability to Intel, and Intel reported the vulnerability to NCCIC.\n4. MITIGATIONS\nIntel is making firmware updates available to device manufacturers that protect systems from this vulnerability. End users should check with their device manufacturers and apply any available updates as soon as practical.\nIntel has released the following security advisory:\nhttps://security-center.intel.com/advisory.aspx?intelid=INTEL-SA-00116&languageid=en-fr\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-3624"
  ],
  "techniques": [],
  "advisory": "icsa-18-114-02",
  "title": "Intel 2G Modem | CISA",
  "source": "ics-advisories",
  "id": "1bed0165c3ab6b6f5ef482504adb6f65b652d173fba35bf4345eb5f3d3381512"
}