{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: AVEVA Software, LLC (AVEVA)\nEquipment: InduSoft Web Studio and InTouch Machine Edition\nVulnerabilities: Stack-based buffer overflow\n\n2. RISK EVALUATION\nThe listed products are vulnerable only if the TCP/IP Server Task is enabled. A remote attacker could send a carefully crafted packet during a tag, alarm, or event related action such as read and write, which may allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of InduSoft Web Studio and InTouch Machine Edition, an HMI, are affected:\n\nInduSoft Web Studio v8.1 and v8.1SP1, and\nInTouch Machine Edition v2017 8.1 and v2017 8.1 SP1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nA remote user could send a carefully crafted packet to exploit a stack-based buffer overflow vulnerability during tag, alarm, or event related actions such as read and write, with potential for code to be executed. \nCVE-2018-10620 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United Kingdom\n\n3.4 RESEARCHER\nTenable Research reported this vulnerability to AVEVA and AVEVA reported it to NCCIC.\n4. MITIGATIONS\nUsers of InduSoft Web Studio v8.1 SP1 are affected and should apply InduSoft Web Studio Hotfix 81.1.00.08 as soon as possible. Users of InduSoft Web Studio v8.1 are also affected and should first upgrade to InduSoft Web Studio v8.1 SP1 and then apply the hotfix. \nUsers of InTouch Machine Edition 2017 v8.1 SP1 are affected and should apply InTouch Machine Edition Hotfix 81.1.00.08 as soon as possible. Users of InTouch Machine Edition 2017 v8.1 are also affected and should first upgrade to InTouch Machine Edition 2017 v8.1 SP1 and then apply the hotfix. \nSoftware security updates:\n\nhttp://www.indusoft.com/File-Management?Command=Core_Download&EntryId=2074\nhttps://softwaresupportsp.schneider-electric.com/#/producthub/details?id=5063 (login required)\n\nTo identify which version of InduSoft Web Studio or InTouch Machine Edition you have installed:\n\nWindows Desktop or Server operating system: Navigate to Windows Programs and Features, locate the “InduSoft Web Studio” or “InTouch Machine Edition” entries to review the displayed installed version.\nOn a Windows Embedded operating system: navigate to the Bin folder in the installation location of InduSoft Web Studio or InTouch Machine Edition and open the file “CEView.ini”. The installed version can be observed from the “version=*.*.*” attribute within the file.\n\nAVEVA’s security bulletin LFSEC00000128 is available at the following location:\nhttps://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityBulletin_LFSec128(002).pdf \nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-10620"
  ],
  "techniques": [],
  "advisory": "icsa-18-200-01",
  "title": "AVEVA InduSoft Web Studio and InTouch Machine Edition | CISA",
  "source": "ics-advisories",
  "id": "e8e3bf1b9aa88c7e679e5825d0fa6b1f94c5c3976a229765b6811d2041383aca"
}