{
  "markdown": "\n​​As of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global). \n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SIMATIC PCS, WinCC\nVulnerability: Insecure Default Initialization of Resource\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-22-132-06 Siemens SIMATIC WinCC (Update A) that was published May 12, 2022, to the ICS webpage at cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow authenticated attackers to escape the kiosk mode.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATIC PCS 7 v9.0: All versions\nSIMATIC PCS 7 v9.1: All versions\nSIMATIC WinCC Runtime Professional v16: All versions\n\n--------- Begin Update A Part 1 of 2 ---------\n\nSIMATIC WinCC Runtime Professional v17: All versions prior to v17 Upd4\n\n--------- End Update A Part 1 of 2 ---------\n\nSIMATIC WinCC v7.4: All versions\nSIMATIC WinCC v7.5: All versions prior to 7.5 SP2 Update 8 \n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INSECURE DEFAULT INITIALIZATION OF RESOURCE CWE-1188\nAn authenticated attacker could escape the WinCC kiosk mode by opening the printer dialog in the affected application if no printer is installed.\nCVE-2022-24287 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens recommends updating their software to the latest version:\n\nSIMATIC PCS 7 v9.0: No fix currently planned\nSIMATIC PCS 7 v9.1: Update to v7.5 SP2 Update 8 or later (No fix currently available)\nSIMATIC WinCC Runtime Professional v16: No fix currently planned\n\n--------- Begin Update A Part 2 of 2 ---------\n\nSIMATIC WinCC Runtime Professional v17: Update to v17 Upd4 or later\n\n--------- End Update A Part 2 of 2 ---------\n\nSIMATIC WinCC v7.4: No fix currently planned\nSIMATIC WinCC v7.5: Update to v7.5 SP2 Update 8 or later \n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nAt least one default printer (but not a file-based printer, as e.g., PDF/XPS printer) should be installed on the affected system\nNo file-based printer (e.g. PDF/XPS printers) should be installed on the affected system\nHarden the application’s host to prevent local access by untrusted personnel\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-363107\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-24287"
  ],
  "techniques": [],
  "advisory": "icsa-22-132-06",
  "title": "Siemens SIMATIC WinCC (Update A) | CISA",
  "source": "ics-advisories",
  "id": "5f3b38d3f532c01fdafdb1574aaa45adb6d98ca7fa6e9a1191094705226404df"
}