{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Red Lion\nEquipment: Sixnet RTU\nVulnerabilities: Authentication Bypass using an Alternative Path or Channel, Exposed Dangerous Method or Function\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthenticated attacker to execute commands with high privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Red Lion products are affected:\n\nST-IPm-8460: Firmware 6.0.202 and later\nST-IPm-6350: Firmware version 4.9.114 and later\nVT-mIPm-135-D: Firmware version 4.9.114 and later\nVT-mIPm-245-D: Firmware version 4.9.114 and later\nVT-IPm2m-213-D: Firmware version 4.9.114 and later\nVT-IPm2m-113-D: Firmware version 4.9.114 and later\n\n3.2 Vulnerability Overview\n3.2.1 AUTHENTICATION BYPASS USING AN ALTERNATIVE PATH OR CHANNEL CWE-288\nRed Lion SixTRAK and VersaTRAK Series RTUs with authenticated users enabled (UDR-A) any Sixnet UDR message will meet an authentication challenge over UDP/IP. When the same message is received over TCP/IP the RTU will simply accept the message with no authentication challenge.\nCVE-2023-42770 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.2 EXPOSED DANGEROUS METHOD OR FUNCTION CWE-749\nWhen user authentication is not enabled the shell can execute commands with the highest privileges. Red Lion SixTRAK and VersaTRAK Series RTUs with authenticated users enabled (UDR-A) any Sixnet UDR message will meet an authentication challenge over UDP/IP. When the same message comes over TCP/IP the RTU will simply accept the message with no authentication challenge.\nCVE-2023-40151 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nNitsan Litov of Claroty Research - Team82 reported these vulnerabilities to CISA.\n4. MITIGATIONS\nRed Lion recommends users apply the latest patches to their products.\nRed Lion recommends users apply additional mitigations to help reduce the risk:\n\nEnable user authentication, see Red Lion instructions.\n\nBlocking all or most Sixnet UDR messages over TCP/IP will eliminate authentication bypass. Sixnet UDR messages over TCP/IP will be ignored.\nTo block all Sixnet UDR messages over TCP/IP install Patch1_tcp_udr_all_blocked.tar.gz.\n\nST-IPm-8460 – Install 8313_patch1_tcp_udr_all_blocked.tar.gz\nST-IPm-6350/VT-mIPm-245-D/VT-mIPm-135-D/VT-IPm2m-213-D/VT-IPm2m-113-D – Install 855_patch1_tcp_udr_all_blocked.tar.gz\n\nTo block all Sixnet UDR messages except I/O commands over TCP/IP and UDP/IP install Patch2_io_open.tar.gz.\n\nST-IPm-8460 – Install 8313_patch2_io_open.tar.gz\nST-IPm-6350/VT-mIPm-245-D/VT-mIPm-135-D/VT-IPm2m-213-D/VT-IPm2m-113-D – Install 855_patch2_io_open.tar.gz\n\nTo Block all Sixnet UDR messages over TCP/IP:\n\nEnable iptables rules to block TCP/IP traffic.\nIn the Sixnet I/O Tool Kit go to Configuration>Configuration Station/Module>\"Ports\" tab>Security.\nSelect the \"Load the this file with each station load\" radio button to load a custom rc.firewall configuration file. The rules below will allow all other traffic except Sixnet UDR over TCP/IP. Please Note: Two rules that are added in by default were removed because they will block all traffic going into the interface.\n\nRemove these rules from the default rc.firewall file:\n\niptables -P INPUT DROP (Drops everything coming in)\niptables -P FORWARD DROP (Drops everything in FORWARD chain)\n\nAdd one DROP rule which will drop all TCP/IP packet coming on UDR port 1594 by typing the following commands:\n\ninsmodip_tables (Initialization)\ninsmodiptable_filter (Initialization)\ninsmodip_conntrack (Initialization)\ninsmodiptable_nat (Initialization)\niptables -F INPUT (Flushes INPUT chain)\niptables -F OUTPUT (Flushes OUTPUT chain)\niptables -F FORWARD (Flushes FORWARD chain)\niptables -Z (Zero counters)\niptables -P OUTPUT ACCEPT (Drops everything coming in, everything in FORWARD chain, and accepts everything going out)\niptables -A INPUT -p tcp --dport 1594 -j DROP (Allows local traffic and blocks all TCP traffic coming from 1594)\n\nFor installation instructions see Red Lion's support page.\nFor more information, please refer to Red Lion’s security bulletin.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nNovember 16, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-42770",
    "CVE-2023-40151"
  ],
  "techniques": [],
  "advisory": "icsa-23-320-01",
  "title": "Red Lion Sixnet RTUs | CISA",
  "source": "ics-advisories",
  "id": "490b36f11300ebd1bea83f97c6c0f0c6c9d79eb52f953d419a5e48449c538218"
}