{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.7\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: Spectrum Power\nVulnerability: Cross-site Scripting\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-190-04 Siemens Spectrum Power that was published July 9, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to inject arbitrary code in a specially crafted HTTP request and monitor information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the following versions of Siemens Spectrum Power are affected:\n\nSpectrum Power 3 (Corporate User Interface): versions v3.11 and prior\nSpectrum Power 4 (Corporate User Interface): version v4.75\n\n--------- Begin Update A Part 1 of 1 --------\n\nSpectrum Power 5 (Corporate User Interface): all versions prior to v5.50 and prior\n\n--------- End Update A Part 1 of 1 --------\n\nSpectrum Power 7 (Corporate User Interface): versions v2.20 and prior\n\n4.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe web server could allow cross-site scripting (XSS) attacks if unsuspecting users are tricked into accessing a malicious link.\nUser interaction is required for a successful exploitation. The user does not need to be logged into the web interface for the exploitation to succeed.\nCVE-2019-10933 has been assigned to this vulnerability. A CVSS v3 base score of 4.7 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:N/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nIsmail Mert AY AK of Biznet Bilisim Sistemleri Danismanlik reported this vulnerability to NCCIC.\n5. MITIGATIONS\nSiemens recommends installing the software update to address the vulnerability. Please contact Siemens Energy Customer Support Center at: support.energy@siemens.com or the local Siemens representative.\nSiemens has identified the following specific workarounds and mitigations that users can apply to reduce the risk:\n\nDo not allow Internet access for Spectrum Power UI clients.\nUsers should be trained to avoid clicking on unknown links.\n\nSiemens strongly recommends applying the provided security updates using the corresponding tooling and documented procedures made available with the product. If supported by the product, an automated means to apply the security updates across multiple product instances may be used. Siemens strongly recommends prior validation of any security update before applied and supervision by trained staff of the update process in the target environment.\nAs a general security measure Siemens strongly recommends protecting network access with appropriate mechanisms (e.g. firewalls, segmentation, VPN). It is advised to configure the environment according to the Siemens operational guidelines in order to run the devices in a protected IT environment.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens security advisory SSA-747162 at the following location: http://www.siemens.com/cert/advisories\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10933"
  ],
  "techniques": [],
  "advisory": "icsa-19-190-04",
  "title": "Siemens Spectrum Power (Update A) | CISA",
  "source": "ics-advisories",
  "id": "d0ce447d747a28b06a1461d850b774497af0f56c332f761e53c7c0110be505c9"
}