{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Schneider Electric\nEquipment: InduSoft Web Studio, InTouch Machine Edition\nVulnerability: Stack-based Buffer Overflow\nAFFECTED PRODUCTS\nThe following versions of InduSoft Web Studio and InTouch Machine Edition, an HMI, are affected:\n\nInduSoft Web Studio v8.0 SP2 Patch 1 and prior versions, and\nInTouch Machine Edition v8.0 SP2 Patch 1 and prior versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a remote un-authenticated attacker to remotely execute code with high privileges.\nMITIGATION\nSchneider Electric recommends:\n\nUsers using InduSoft Web Studio v8.0 SP2 Patch 1 or prior versions are affected and should upgrade and apply InduSoft Web Studio v8.1 as soon as possible.\nUsers using InTouch Machine Edition v8.0 SP2 Patch 1 or prior versions are affected and should upgrade and apply InTouch Machine Edition 2017 v8.1 as soon as possible.\n\nSchneider Electric has also released Security Bulletin LFSEC00000124 that can be found at:\nhttp://software.schneider-electric.com/pdf/security-bulletin/lfsec00000124/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nThe stack-based buffer overflow vulnerability has been identified, which may allow remote code execution with high privileges.\nCVE-2017-14024 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nAaron Portnoy, formerly of Exodus Intelligence, reported the vulnerability to Schneider Electric.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Energy, Transportation Systems, and Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2017-14024"
  ],
  "techniques": [],
  "advisory": "icsa-17-313-02",
  "title": "Schneider Electric InduSoft Web Studio and InTouch Machine Edition | CISA",
  "source": "ics-advisories",
  "id": "e7382c545bf284de7ca986f5fadb48669348f5653162b433cd9232eb13def009"
}