{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SIMATIC, SINUMERIK\nVulnerabilities: Missing Encryption of Sensitive Data\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-222-05 Siemens Industrial Products Intel CPU (Update F) that was published September 13, 2022, to the ICS webpage on www.cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to unauthorized access to sensitive data, privilege escalation, and configuration change.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Siemens products are affected:\n\nSIMATIC Drive Controller Family: All versions\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions\nSIMATIC Field PG M5: All versions\nSIMATIC Field PG M6: All versions\nSIMATIC IPC127E: All versions\nSIMATIC IPC427E: All versions\nSIMATIC IPC477E: All versions\nSIMATIC IPC477E Pro: All versions\nSIMATIC IPC527GE: All versions\nSIMATIC IPC547G: All versions\nSIMATIC IPC627E: All versions\nSIMATIC IPC647E: All versions\nSIMATIC IPC677E: All versions\nSIMATIC IPC847E: All BIOS versions prior to v25.02.10\nSIMATIC ITP1000: All versions\nSIMATIC S7-1500 CPU 1518-4 PN/DP MFP (MLFB: 6ES7518-4AX00-1AC0, 6AG1518-4AX00-4AC0, incl. SIPLUS variant): All versions\nSIMATIC S7-1500 CPU 1518F-4 PN-DP MFP (MLFB: 6ES7518-4FX00-1AC0): All versions\nSINUMERIK 828D HW PPU.4: All versions\nSINUMERIK MC MCU 1720: All versions\nSINUMERIK ONE / SINUMERIK 840D sl Handheld Terminal HT 10: All versions\nSINUMERIK ONE PPU 1740: All versions\nSINUMERIK ONE NCU 1740: All versions prior to v05.00.00.00\nSIMATIC IPC127E: All versions prior to v21.01.07\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): All versions prior to v0209_0105\nSIMATIC IPC427E: All versions prior to v21.01.16\nSIMATIC IPC477E: All versions prior to v21.01.16\nSIMATIC IPC477E Pro: All versions prior to v21.01.16\nSIMATIC ITP1000: All versions\nSIMATIC Field PG M6: All versions\nSIMATIC IPC347G: All versions prior to v01.04.00\nSIMATIC IPC3000 SMART V3: All versions prior to v01.04.00\n\n--------- Begin Update G Part 1 of 2 ---------\n\nSINUMERIK 828D HW PPU.4: All versions prior to v08.00.00.00\nSINUMERIK MC MCU 1720: All versions prior to v05.00.00.00\nSINUMERIK ONE / SINUMERIK 840D sl Handheld Terminal HT 10: All versions prior to v08.00.00.00\nSINUMERIK ONE PPU 1740: All versions prior to v06.00.00.00\n\n--------- End Update G Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nA race condition in the firmware for some Intel processors may allow a privileged user to enable escalation of privilege via local access.\nCVE-2020-8670 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:H).\n4.2.2    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nImproper buffer restrictions in a subsystem in the Intel CSME versions prior to 11.8.86, 11.12.86, 11.22.86, 12.0.81, 13.0.47, 13.30.17, 14.1.53, 14.5.32, and 15.0.22 may allow a privileged user to enable escalation of privilege via local access.\nCVE-2020-8703 has been assigned to this vulnerability. A CVSS v3 base score of 5.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:H/A:N).\n4.2.3    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nA race condition in a subsystem in the Intel LMS versions prior to 2039.1.0.0 may allow a privileged user to enable escalation of privilege via local access.\nCVE-2020-8704 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.4    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nImproper initialization in the firmware for some Intel processors may allow a privileged user to enable escalation of privilege via local access.\nCVE-2020-12357 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:H).\n4.2.5    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nAn out-of-bounds write in the firmware for some Intel processors may allow a privileged user to cause a denial-of-service condition via local access.\nCVE-2020-12358 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:C/C:L/I:N/A:H).\n4.2.6    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nAn out-of-bounds read in the firmware for some Intel processors may allow an authenticated user to enable an escalation of privilege via local access.\nCVE-2020-12360 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.2.7    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nImproper input validation in the firmware for some Intel processors may allow an authenticated user to potentially enable a denial of service via local access.\nCVE-2020-24486 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n4.2.8    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nOut-of-bounds read in a subsystem in the Intel CSME versions prior to 12.0.81, 13.0.47, 13.30.17, 14.1.53, and 14.5.32 may allow a privileged user to enable information disclosure via local access.\nCVE-2020-24506 has been assigned to this vulnerability. A CVSS v3 base score of 4.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n4.2.9    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nImproper initialization in a subsystem in the Intel CSME versions prior 11.8.86, 11.12.86, 11.22.86, 12.0.81, 13.0.47, 13.30.17, 14.1.53, 14.5.32, 13.50.11, and 15.0.22 may allow a privileged user to enable information disclosure via local access.\nCVE-2020-24507 has been assigned to this vulnerability. A CVSS v3 base score of 6.0 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:C/C:H/I:N/A:N).\n4.2.10   MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nImproper isolation of shared resources in some Intel processors may allow an authenticated user to enable information disclosure via local access.\nCVE-2020-24511 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.2.11    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nAn observable timing discrepancy in some Intel processors may allow an authenticated user to enable information disclosure via local access.\nCVE-2020-24512 has been assigned to this vulnerability. A CVSS v3 base score of 2.8 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:L/I:N/A:N).\n4.2.12    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nA domain-bypass transient execution vulnerability in some Intel Atom processors may allow an authenticated user to enable information disclosure via local access.\nCVE-2020-24513 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens recommends updating to the latest software version:\n\nSIMATIC IPC627E: Update BIOS to v25.02.10\nSIMATIC IPC647E: Update BIOS to v25.02.10\nSIMATIC IPC677E: Update BIOS to v25.02.10\nSIMATIC IPC847E: Update BIOS to v25.02.10\nSINUMERIK One NCU 1740: Update BIOS to v05.00.00.00 or later (Obtained through a Siemens account manager)\nSIMATIC IPC127E: Update BIOS to v21.01.07 or later\nSIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants): Update BIOS to v0209_0105 or later\nSIMATIC IPC427E: Update BIOS to v21.01.16 or later\nSIMATIC IPC477E: Update BIOS to v21.01.16 or later\nSIMATIC IPC477E Pro: Update BIOS to v21.01.16 or later \nSIMATIC ITP1000: Update BIOS to v23.01.10 or later\nSIMATIC Field PG M6: Update BIOS to v21.01.07 or later\nSIMATIC IPC347G: Update BIOS to v01.04.00 or later\nSIMATIC IPC3000 SMART V3: Update BIOS to v01.04.00 or later\n\n--------- Begin Update G Part 2 of 2 ---------\n\nSINUMERIK 828D HW PPU.4: Update BIOS to v08.00.00.00 or later (obtained through a Siemens account manager.)\nSINUMERIK MC MCU 1720: Update BIOS to v05.00.00.00 or later (obtained through a Siemens account manager.)\nSINUMERIK ONE / SINUMERIK 840D sl Handheld Terminal HT 10: Update BIOS to v08.00.00.00 or later (obtained through a Siemens account manager.)\nSINUMERIK ONE PPU 1740: Update BIOS to v06.00.00.00 or later (obtained through a Siemens account manager.)\n\n--------- End Update G Part 2 of 2 ---------\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to the Siemens operational guidelines for industrial security and follow the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-309571\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-12358",
    "CVE-2020-12357",
    "CVE-2020-8704",
    "CVE-2020-24513",
    "CVE-2020-8703",
    "CVE-2020-24511",
    "CVE-2020-24506",
    "CVE-2020-12360",
    "CVE-2020-24486",
    "CVE-2020-8670",
    "CVE-2020-24507",
    "CVE-2020-24512"
  ],
  "techniques": [],
  "advisory": "icsa-21-222-05",
  "title": "Siemens Industrial Products Intel CPUs (Update G) | CISA",
  "source": "ics-advisories",
  "id": "7019706a59e6ae22f7786cb0a15f9eb6332344ec13affdeff2b860b201228f41"
}