{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SiPass Integrated\nVulnerabilities: Exposure of Resource to Wrong Sphere\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthenticated remote attacker to access or modify several internal application resources.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens SiPass integrated, an access control system, are affected:\n\nSiPass Integrated v2.64: All versions\nSiPass Integrated v2.80: All versions\nSiPass Integrated v2.85: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXPOSURE OF RESOURCE TO WRONG SPHERE CWE-668\nAffected applications insufficiently limit the access to the internal message broker system. This could allow an unauthenticated remote attacker to subscribe to arbitrary message queues.\nCVE-2021-44522 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    EXPOSURE OF RESOURCE TO WRONG SPHERE CWE-668\nAffected applications insufficiently limit the access to the internal activity feed database. This could allow an unauthenticated remote attacker to read, modify or delete activity feed entries.\nCVE-2021-44523 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.3    EXPOSURE OF RESOURCE TO WRONG SPHERE CWE-668\nAffected applications insufficiently limit the access to the internal user authentication service. This could allow an unauthenticated remote attacker to trigger several actions on behalf of valid user accounts.\nCVE-2021-44524 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends upgrading to the newest software version:\n\nSiPass Integrated v2.64: Update to v2.76 SP2\nSiPass Integrated v2.80: Download and execute SiPass integrated Component Manager\nSiPass Integrated v2.85: Download and execute SiPass integrated Component Manager\n\nSiemens has not identified any additional specific workarounds or mitigations.\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to the Siemens operational guidelines for industrial security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-160202\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-44524",
    "CVE-2021-44522",
    "CVE-2021-44523"
  ],
  "techniques": [],
  "advisory": "icsa-21-350-19",
  "title": "Siemens SiPass Integrated | CISA",
  "source": "ics-advisories",
  "id": "b0897746d4369813073853bf73614dc3f80bef48d70485198b81d70a1130a0b4"
}