{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity  \nVendor: Rockwell Automation  \nEquipment: ThinManager ThinServer \nVulnerabilities: Path Traversal, Heap-Based Buffer Overflow \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to potentially perform remote code execution on the target system/device or crash the software. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Rockwell Automation ThinManager ThinServer, a thin client and remote desktop protocol (RDP) server management software, are affected: \n\nThinManager ThinServer: Versions 6.x – 10.x \nThinManager ThinServer: Versions 11.0.0 – 11.0.5 \nThinManager ThinServer: Versions 11.1.0 – 11.1.5 \nThinManager ThinServer: Versions 11.2.0 – 11.2.6 \nThinManager ThinServer: Versions 12.0.0 – 12.0.4 \nThinManager ThinServer: Versions 12.1.0 – 12.1.5 \nThinManager ThinServer: Versions 13.0.0 – 13.0.1 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22 \nIn affected versions, a path traversal exists when processing a message. An unauthenticated remote attacker could potentially exploit this vulnerability to upload arbitrary files to any directory on the disk drive where ThinServer.exe is installed. The attacker could overwrite existing executable files with attacker-controlled, malicious contents, potentially causing remote code execution. \nCVE-2023-27855 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). \n3.2.2 IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22 \nIn affected versions, a path traversal exists when processing a type 8 message. An unauthenticated remote attacker could exploit this vulnerability to download arbitrary files on the disk drive where ThinServer.exe is installed. \nCVE-2023-27856 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). \n3.2.3 HEAP-BASED BUFFER OVERFLOW CWE-122 \nIn affected versions, a heap-based buffer over-read condition occurs when the message field indicates more data than is present. An unauthenticated remote attacker could exploit this vulnerability to crash ThinServer.exe due to a read access violation. \nCVE-2023-27857 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing  \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States  \n\n3.4 RESEARCHER\nTenable Network Security reported these vulnerabilities to Rockwell Automation\n4. MITIGATIONS\nRockwell Automation encourages users to implement the risk mitigations provided below. Users should also combine these mitigations with the general security guidelines, if possible. \nRockwell Automation has released the following updates for the affected versions: \n\nVersions 6.x – 10.x: These versions are retired. Users should update to a supported version. \nVersions 11.0.0 – 11.0.5: Update to v11.0.6 \nVersions 11.1.0 – 11.1.5: Update to v11.1.6 \nVersions 11.2.0 – 11.2.6: Update to v11.2.7 \nVersions 12.0.0 – 12.0.4: Update to v12.0.5 \nVersions 12.1.0 – 12.1.5: Update to v12.1.6 \nVersions 13.0.0 – 13.0.1: Update to v13.0.2 \n\nIf users are unable to update to the patched version, the following mitigations should be put in place to reduce exploitation of this vulnerability: \n\nLimit remote access of port 2031/TCP to known thin clients and ThinManager servers. \n\nFor additional security best practices, see Rockwell Automation’s Knowledgebase article, QA43240 Security Best Practices. \nFor more information, see Rockwell Automation’s Security Advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.  \n",
  "cves": [
    "CVE-2023-27856",
    "CVE-2023-27855",
    "CVE-2023-27857"
  ],
  "techniques": [],
  "advisory": "icsa-23-080-06",
  "title": "Rockwell Automation ThinManager | CISA",
  "source": "ics-advisories",
  "id": "ecb6de7392c8b94b11765f68b14b69a319f6db3c13e2788a2ef160ee3bec4251"
}