{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Datalogic\nEquipment: AV7000 Linear Barcode Scanner\nVulnerability: Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to bypass authentication through issues in the HTTP authentication process.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AV7000, a linear barcode scanner, are affected:\n\nAll versions prior to 4.6.0.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nThe affected product is vulnerable to authentication bypass, which may allow an attacker to remotely execute arbitrary code. \nCVE-2019-13526 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Italy\n\n3.4 RESEARCHER\nTri Quach and Blake Johnson of Amazon’s Customer Fulfillment Technology Security (CFTS) group reported this vulnerability to CISA.\n4. MITIGATIONS\nDatalogic reports a new version of the firmware was released to mitigate the reported vulnerability. Affected users may obtain the latest version by contacting a Datalogic service representative or by calling Datalogic at +1 800 227 2633.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13526"
  ],
  "techniques": [],
  "advisory": "icsa-19-239-02",
  "title": "Datalogic AV7000 Linear Barcode Scanner | CISA",
  "source": "ics-advisories",
  "id": "81801bd4fde3bf11abd27191bcc8af9e37a2a12bf1eace96ba28dff8c50aa2df"
}