{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: AVEVA Software, LLC (AVEVA)\nEquipment: InduSoft Web Studio and InTouch Edge HMI (formerly InTouch Machine Edition)\nVulnerabilities: Missing Authentication for Critical Function, Resource Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to execute an arbitrary process using a specially crafted database connection configuration file.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of AVEVA products are affected:\n\nInduSoft Web Studio prior to Version 8.1 SP3, and\nInTouch Edge HMI (formerly InTouch Machine Edition) prior to Version 2017 Update\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306Code is executed under the program runtime privileges, which could lead to the compromise of the machine.CVE-2019-6543 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).3.2.2    IMPROPER CONTROL OF RESOURCE IDENTIFIERS ('RESOURCE INJECTION') CWE-99An unauthenticated remote user could use a specially crafted database connection configuration file to execute an arbitrary process on the server machine.CVE-2019-6545has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS:  Chemical, Commercial Facilities, Critical Manufacturing, Energy, Food and Agriculture, Transportation Systems, and Water and Wastewater\nCOUNTRIES/AREAS DEPLOYED:  Worldwide\nCOMPANY HEADQUARTERS LOCATION:  United Kingdom\n\n3.4 RESEARCHER\nAVEVA, working with Tenable Research, reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nAVEVA recommends affected users upgrade to the latest version of affected products. The following security updates address the vulnerabilities outlined in this advisory. Software updates can be downloaded from the Global Customer Support “Software Download” area or from the links below: The latest version of InduSoft Web Studio can be found at: http://download.indusoft.com/81.3.0/IWS81.3.0.zipThe latest version of InTouch Edge HMI can be found at (login required):  https://softwaresupportsp.schneider-electric.com/#/producthub/details?id=52354For information on how to reach AVEVA support for a specific product, please refer to these links: AVEVA Software Global Customer Support and InduSoft Support.For the latest security information and security updates, please visit AVEVA’s Security Central (login required) and InduSoft Security Updates.AVEVA has published Security Bulletin LFSEC00000133 on their website at the following location:  https://sw.aveva.com/hubfs/assets-2018/pdf/security-bulletin/SecurityBulletin_LFSec133.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6543",
    "CVE-2019-6545"
  ],
  "techniques": [],
  "advisory": "icsa-19-036-01",
  "title": "AVEVA InduSoft Web Studio and InTouch Edge HMI | CISA",
  "source": "ics-advisories",
  "id": "740ecc5f37a8723d4bf2804abb93d1635f69d922fd08bac92bdd8364454d0e50"
}