{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: WECON Technology Co., Ltd (WECON)\nEquipment: LeviStudioU\n\n--------- Begin Update C Part 1 of 3 ---------\n\nVulnerabilities: Stack-based Buffer Overflow, Improper Restriction of XML External Entity Reference, Heap-based Buffer Overflow\n\n--------- End Update C Part 1 of 3 ---------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-238-03 WECON LeviStudioU (Update B) that was published October 29, 2020, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute code under the privileges of the application and obtain sensitive information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of LeviStudioU are reported to be affected:\n\nLeviStudioU: Release Build 2019-09-21 and prior. If you have questions about the affected products, please contact WECON.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nMultiple buffer overflow vulnerabilities exist when processing project files. Opening a specially crafted project file could allow an attacker to exploit and execute code under the privileges of the application.\nCVE-2020-16243 has been assigned to these vulnerabilities. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nAn XXE vulnerability exists when processing parameter entities, which may allow file disclosure. \nCVE-2020-25186 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n--------- Begin Update C Part 2 of 3 ---------\n4.2.3    HEAP-BASED BUFFER OVERFLOW CWE-122\nA heap-based buffer overflow vulnerability exists when processing project files. Opening a specially crafted project file could allow an attacker to exploit and execute code under the privileges of the application.\nCVE-2020-25199 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n--------- End Update C Part 2 of 3 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: China\n\n4.4 RESEARCHER\n--------- Begin Update C Part 3 of 3 ---------\nNatnael Samson and Mehmet D. INCE @mdisec from T0.Group, Tran Van Khang - khangkito of VinCSS (member of Vingroup) working with Trend Micro’s Zero Day Initiative, and Peter Cheng from Elex Cybersecurity Inc. reported these vulnerabilities to CISA. \n--------- End Update C Part 3 of 3 ---------\n5. MITIGATIONS\nWECON is aware of the issue and is currently developing a solution. For more information, contact WECON online or by phone: 0086-591-87868869-894\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nOnly use project files from trusted sources.\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. \n",
  "cves": [
    "CVE-2020-25199",
    "CVE-2020-16243",
    "CVE-2020-25186"
  ],
  "techniques": [],
  "advisory": "icsa-20-238-03",
  "title": "WECON LeviStudioU (Update C) | CISA",
  "source": "ics-advisories",
  "id": "78a38b94b5d7391b4551ac806918d02cbb5e268d05ec9c99a535c9cc98e71080"
}