{
  "markdown": "\nCVSS v3 8.8\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on February 16, 2017, and is being released to the ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following versions of FactoryTalk Activation, a component of FactoryTalk Services Platform, are affected:\n\nFactoryTalk Activation Service, Version 4.00.02 and prior versions.\n\nFactoryTalk Activation is used in the following Rockwell Automation products:\n\nArena,\nEmonitor,\nFactoryTalk AssetCentre,\nFactoryTalk Batch,\nFactoryTalk EnergyMetrix,\nFactoryTalk eProcedure,\nFactoryTalk Gateway,\nFactoryTalk Historian Site Edition (SE),\nFactoryTalk Historian Classic,\nFactoryTalk Information Server,\nFactoryTalk Metrics,\nFactoryTalk Transaction Manager,\nFactoryTalk VantagePoint,\nFactoryTalk View Machine Edition (ME),\nFactoryTalk View Site Edition (SE),\nFactoryTalk ViewPoint,\nRSFieldBus,\nRSLinx Classic,\nRSLogix 500,\nRSLogix 5000,\nRSLogix 5,\nRSLogix Emulate 5000,\nRSNetWorx,\nRSView32,\nSoftLogix 5800,\nStudio 5000 Architect,\nStudio 5000 Logix Designer,\nStudio 5000 View Designer, and\nStudio 5000 Logix Emulate.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an authenticated, but nonprivileged, local user to link to or run a malicious executable.\nMITIGATION\nRockwell Automation has released a new version of FactoryTalk Activation, Version 4.01, which addresses the identified vulnerability. Rockwell Automation recommends upgrading to the latest version of FactoryTalk Activation, Version 4.01 or later, which is available at the following location:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductFindDownloads.aspx?crumb=112&mode=3&refSoft=1&versions=54269%20\nIf unable to upgrade to the latest version, users should read Knowledgebase Article KB939382, which describes how to identify whether the service path contains spaces (i.e., is vulnerable); how to manually address this vulnerability through a registry edit; and the article describes the process of doing such edits.\nRockwell Automation’s Knowledgebase Article KB939382 is available at the following location:\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/939382\nRockwell Automation recommends, where feasible, the precautions and risk mitigation strategies to this type of attack, like those listed below.\n\nFollow industry best-practices to harden PCs and servers, including antivirus/anti-malware and application whitelisting solutions. These recommendations are published in Knowledgebase Article KB546987, which is available at the following location:\n\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/546987\n\nUse trusted software, software patches, antivirus/anti-malware programs, and interact only with trusted web sites and attachments.\nEmploy training and awareness programs to educate users on the warning signs of a phishing or social engineering attack.\n\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nUNQUOTED SEARCH PATH OR ELEMENT CWE-428\n\nWithout quotation marks, any whitespace in the file path remains ambiguous, which may allow an attacker to link to or run a malicious executable. This may allow an authorized, but not privileged local user to execute arbitrary code with elevated privileges on the system.\nCVE-2017-6015 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\nRESEARCHER\nRockwell Automation reported the vulnerability.\nBACKGROUND\nCritical Infrastructure Sectors: Chemical, Critical Manufacturing, Food and Agriculture, Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Milwaukee, Wisconsin\n",
  "cves": [
    "CVE-2017-6015"
  ],
  "techniques": [],
  "advisory": "icsa-17-047-02",
  "title": "Rockwell Automation FactoryTalk Activation | CISA",
  "source": "ics-advisories",
  "id": "b9e7eb8b0f3a10a67651977ae3a89a76f0f05f9df26850eae92dd199301876cd"
}