{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Secomea\nEquipment: GateManager\nVulnerabilities: Improper Neutralization of Null Byte or NUL Character, Off-by-one Error, Use of Hard-coded Credentials, Use of Password Hash with Insufficient Computational Effort\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to gain remote code execution on the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of GateManager, a VPN server, are affected:\n\nAll versions prior to 9.2c\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF NULL BYTE OR NUL CHARACTER CWE-158\nAn attacker can send a negative value and overwrite arbitrary data. \nCVE-2020-14500 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). \n3.2.2    OFF-BY-ONE ERROR CWE-193\nThe affected product is vulnerable to an off-by-one error, which may allow an attacker to remotely execute arbitrary code or cause a denial-of-service condition. \nCVE-2020-14508 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product contains a hard-coded credential for telnet, allowing an unprivileged attacker to execute commands as root. \nCVE-2020-14510 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    USE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORT CWE-916\nThe affected product uses a weak hash type, which may allow an attacker to view user passwords. \nCVE-2020-14512 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Denmark\n\n3.4 RESEARCHER\nSharon Brizinov and Tal Keren of Claroty reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSecomea has released a new version to mitigate the reported vulnerabilities. The most up-to-date release at the time of this CISA advisory can be found on the Secomea website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2020-14512",
    "CVE-2020-14508",
    "CVE-2020-14510",
    "CVE-2020-14500"
  ],
  "techniques": [],
  "advisory": "icsa-20-210-01",
  "title": "Secomea GateManager | CISA",
  "source": "ics-advisories",
  "id": "bb08226e5675c8b9c1327e3c085cc1132cbb95920a267748f0fe0adca23c6268"
}