{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.4\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SICAM PQ Analyzer\nVulnerability: Unquoted Search Path or Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to achieve persistence on the system or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SICAM PQ Analyzer power quality system software are affected:\n\nAll versions prior to v3.18\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nA service is started by an unquoted registry entry. As there are spaces in this path, attackers with write privilege to those directories could plant executables that will run in place of the legitimate process. Attackers could achieve persistence on the system (“backdoors”) or cause a denial-of-service condition.\nCVE-2021-45460 has been assigned to this vulnerability. A CVSS v3 base score of 3.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:N/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\n4. MITIGATIONS\nSiemens has released an update for the SICAM PQ Analyzer and recommends users update to Version 3.18 or later.\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nMake sure these executables do not exist, cannot be created, or cannot be executed (e.g., by Group Policy Software Restriction):\n\nC:\\Program.*\nC:\\Program Files.*\nC:\\Program Files (x86)\\Siemens.*\nC:\\Program Files (x86)\\Siemens Energy\\SICAM\\PQ.*\n\n\nPlease note that blocking of e.g., “C:\\Program.exe” is not sufficient, as the attacker could plant “C:\\Program.com”, “C:\\Program.msi” or an executable with any other extension there.\n\nSiemens recommends operators check whether appropriate resilient protection measures are in place. The risk of cyber incidents impacting the grid’s reliability can thus be minimized by virtue of the grid design.\nSiemens strongly recommends applying the provided security updates using the corresponding tooling and documented procedures made available with the product. If supported by the product, an automated means to apply the security updates across multiple product instances may be used. Siemens strongly recommends prior validation of any security update before being applied, and supervision by trained staff of the update process in the target environment.\nAs a general security measure Siemens strongly recommends protecting network access with appropriate mechanisms (e.g., firewalls, segmentation, VPN). It is advised users configure the environment according to Siemens operational guidelines to run the devices in a protected IT environment. \nFor additional information, please refer to Siemens Security Advisory SSA-173318\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-45460"
  ],
  "techniques": [],
  "advisory": "icsa-22-013-06",
  "title": "Siemens SICAM PQ Analyzer | CISA",
  "source": "ics-advisories",
  "id": "cc6bf33171c00653cc01a59984aed5fe868f5498a80c13c70907dedebb9a95e6"
}