{
  "markdown": " Hospira LifeCare PCA Infusion System Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryHospira LifeCare PCA Infusion System Vulnerabilities==================================================== Last Revised August 23, 2018 Alert Code ICSA\\-15\\-125\\-01OVERVIEW-------- Independent researcher Billy Rios has identified an improper authorization vulnerability and an insufficient verification of data authenticity vulnerability in Hospira’s LifeCare PCA Infusion System, which NCCIC/ICS\\-CERT has been coordinating with Hospira since May 2014\\. This advisory is being issued to provide notice of public disclosures of the identified vulnerabilities in the LifeCare PCA Infusion System. Hospira has developed a new version that mitigates these vulnerabilities, which is undergoing U.S. Food and Drug Administration (FDA) review. The release date for the new version has not been determined. These vulnerabilities could be exploited remotely.AFFECTED PRODUCTS----------------- The following Hospira products are affected:* LifeCare PCA Infusion System, Version 5\\.0 and prior versions.IMPACT------ Exploitation of the improper authorization vulnerability may allow unauthenticated users to access the LifeCare PCA Infusion pump with root privileges by default. Exploitation of the insufficient verification of data authenticity vulnerability may allow an attacker to remotely push unauthorized modifications to the LifeCare PCA Infusion pump impacting medication libraries and pump configuration. While drug libraries, software updates, and pump configurations can be modified, according to Hospira, it is not possible to remotely operate the LifeCare PCA Infusion pump. Operation of the LifeCare PCA Infusion pump requires a clinician to be present at the pump to manually program the pump with a specified dosage before medication can be administered. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.BACKGROUND---------- Hospira is a US\\-based company that maintains offices in several countries around the world. The affected product, the LifeCare PCA Infusion System, is an intravenous pump that delivers medication to patients. The affected products are deployed across the Healthcare and Public Health Sector. Hospira estimates that these products are used worldwide.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### IMPROPER AUTHORIZATIONCWE\\-285: Improper Authorization, http://cwe.mitre.org/data/definitions/285\\.html, web site last accessed May 05, 2015\\. The LifeCare PCA Infusion pump’s communication module gives unauthenticated users root privileges on Port 23/TELNET by default. An unauthorized user may be able to issue commands to modify the configuration of the pump. CVE\\-2015\\-3459NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-3459, web site last accessed May 05, 2015\\. has been assigned to this vulnerability. A CVSS v2 base score of 10\\.0 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:C/I:C/A:C, web site last accessed May 05, 2015\\.### INSUFFICIENT VERIFICATION OF DATA AUTHENTICITYCWE\\-345: Insufficient Verification of Data Authenticity, http://cwe.mitre.org/data/definitions/345\\.html, web site last accessed May 05, 2015\\. The LifeCare PCA Infusion pump could have drug libraries, software updates, and configuration changes uploaded to it from an unauthorized source. The LifeCare PCA Infusion pump listens on the following ports: Port 23/TELNET, Port 80/HTTP, Port 443/HTTPS, and Port 5000/UPNP. CVE\\-2014\\-5406NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2014\\-5406, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7\\.6 has been assigned; the CVSS vector string is (AV:N/AC:H/Au:N/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:H/Au:N/C:C/I:C/A:C, web site last accessed May 05, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY These vulnerabilities could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target these vulnerabilities.#### DIFFICULTY An attacker with low skill would be able to exploit one of these vulnerabilities; the other vulnerability would require high skill to exploit.MITIGATION---------- ICS\\-CERT has been working with Hospira since May 2014 to address the vulnerabilities in the LifeCare PCA Infusion System. Hospira has developed a new version of the PCS Infusion System, Version 7\\.0 that addresses the identified vulnerabilities. According to Hospira, Version 7\\.0 has Port 20/FTP and Port 23/TELNET closed by default to prevent unauthorized access. Existing PCA Infusion Systems running Version 5\\.0 can be upgraded to Version 7\\.0 when it becomes available. Hospira’s Version 7\\.0 is being reviewed by the FDA prior to its release. The release date for Version 7\\.0 of the LifeCare PCA Infusion System has not been determined. For additional information about Hospira’s new release, contact Hospira’s technical support at 1‑800\\-241\\-4002\\. ICS\\-CERT encourages asset owners to take defensive measures to protect against this and other cybersecurity risks.* Ensure that unused ports are closed, to include Port 20/FTP and Port 23/TELNET.* Maintain layered physical and logical security to implement [defense\\-in\\-depth security practices](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  for environments operating medical devices.* Isolate the LifeCare PCA Infusion pump from the Internet and untrusted systems; however, if connectivity is required, use a Virtual Private Network (VPN) solution and implement network monitoring.* When remote access is required, use secure methods, such as VPNs, recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.* Produce an MD5 checksum of key files to identify any unauthorized changes.* Use good design practices that include network segmentation. Use DMZs with properly configured firewalls to selectively control traffic and monitor traffic passed between zones and systems to identify anomalous activity. Use the static nature of these isolated environments to look for anomalous activities. ICS\\-CERT also provides a section for security recommended practices on the ICS\\-CERT web page at: [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Hospira-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-125-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2015-3459",
    "CVE-2014-5406"
  ],
  "techniques": [],
  "advisory": "icsa-15-125-01",
  "title": "Hospira LifeCare PCA Infusion System Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "32cc7dfe468e21335f246174efbabb0fb4545670e68ca71aad91144d81140f88"
}