{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Hitachi Energy\nEquipment: RTU500 Series\nVulnerability: Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to send a specially crafted Modbus TCP packet in a high rate, causing a stack overflow, which could result in a reboot of the product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Hitachi Energy’s RTU500 firmware are affected:\n\nRTU500 series CMU Firmware version 12.0.1–12.0.13\nRTU500 series CMU Firmware version 12.2.1–12.2.11\nRTU500 series CMU Firmware version 12.4.1–12.4.11\nRTU500 series CMU Firmware version 12.6.1–12.6.7\nRTU500 series CMU Firmware version 12.7.1–12.7.3\nRTU500 series CMU Firmware version 13.2.1–13.2.4\nRTU500 series CMU Firmware version 13.3.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThis vulnerability exists in the HCI Modbus TCP function in affected product versions. If the HCI Modbus TCP is enabled and configured, an attacker could exploit the vulnerability by sending a specially crafted message to the RTU500 in a high rate, causing the targeted RTU500 CMU to reboot. There is a lack of flood control, which if exploited, could cause an internal stack overflow in the HCI Modbus TCP function.\nCVE-2022-2081 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi Energy reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi Energy recommends updating to the following firmware versions:\n\nUpdate to RTU500 series CMU Firmware version 12.0.14.0 or higher.\nUpdate to RTU500 series CMU Firmware version 12.2.12.0 or higher.\nUpdate to RTU500 series CMU Firmware version 12.4.12.0 or higher.\nUpdate to RTU500 series CMU Firmware version 12.6.8.0 or higher.\nUpdate to RTU500 series CMU Firmware version 12.7.4.0 or higher.\nUpdate to RTU500 series CMU Firmware version 13.2.5.0 or higher.\nUpdate to RTU500 series CMU Firmware version 13.3.2.0 or higher.\n\nUsers should see Hitachi Energy advisory 8DBD000111 for additional mitigation and update information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-2081"
  ],
  "techniques": [],
  "advisory": "icsa-22-235-07",
  "title": "Hitachi Energy RTU500 | CISA",
  "source": "ics-advisories",
  "id": "1623e607fa7a42f76c0bcd347cc73be6465ef37050aa9d7c8c737d92a35da3d9"
}