{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: FactoryTalk Services Platform\nVulnerability: Heap-based Buffer Overflow\n\n2. REPOSTED INFORMATION\nThis advisory was originally posted to the HSIN ICS-CERT library on November 27, 2018, and is being released to the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to diminish communications or cause a complete denial of service to the device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of FactoryTalk Services Platform, a services-oriented architecture platform, are affected:\n\nFactoryTalk Services Platform, v2.90 and earlier.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122A remote unauthenticated attacker could send numerous crafted packets to service ports resulting in memory consumption that could lead to a partial or complete denial-of-service condition to the affected services.CVE-2018-18981 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Food and Agriculture, Transportation Systems, andWater and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nAndrey Zhukov reported this vulnerability to NCCIC.\n5. MITIGATIONS\nRockwell Automation recommends that affected users update to the latest version of the application. The latest version can be found at the following link:https://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?Keyword=FTSP&crumb=112For more information see Rockwell Automation security advisory 1074747.Rockwell Automation recommends the following practices to secure this and other control systems devices:\n\nRun all software as user, not as an administrator, to minimize the impact of malicious code on the infected system.\nEmploy training and awareness programs to educate users on the warning signs of a phishing or social engineering attack.\nRefer to 546987—Rockwell Automation Customer Hardening Guidelines for the latest published guidelines for PC hardening and software security.\nUse of Microsoft AppLocker or other similar whitelisting application can help mitigate risk. Information on using AppLocker with Rockwell Automation products is available here (login required): https://rockwellautomation.custhelp.com/app/answers/detail/a_id/546989\nEnsure that the least-privilege user principle is followed, and user/service account access to shared resources (such as a database) is only granted with a minimum amount of rights as needed.\nUse trusted software, software patches, and anti-virus/anti-malware programs.\nMinimize network exposure for all control system devices and/or systems, and confirm that they are not accessible from the Internet.\nLocate control system networks and devices behind firewalls, and isolate them from the enterprise network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices they are installed in.\n\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web site. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT web site in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-18981"
  ],
  "techniques": [],
  "advisory": "icsa-18-331-02",
  "title": "Rockwell Automation FactoryTalk Services Platform | CISA",
  "source": "ics-advisories",
  "id": "5786b0f803e2108e6dd8a74bb9b258c4e95b5f8ace50ec1270846241db58e1e5"
}