{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: Solid Edge\nVulnerabilities: Out-of-bounds Write, Improper Restriction of XML External Entity Reference, Out-of-bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-103-06 Siemens Solid Edge File Parsing that was published April 13, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could lead to a crash, arbitrary code execution, or data extraction on the target host system.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 2 ---------\nThe following versions of Siemens Solid Edge, a portfolio of software tools, are affected:\n\nSolid Edge SE2020: All versions before SE2020MP13\nSolid Edge SE2020: All version before SE2020MP14 (only affected by CVE-2020-26997, CVE-2021-25678, CVE-2021-27382)\nSolid Edge SE2021: All versions before SE2021MP4\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS WRITE CWE-787\nAffected applications lack proper validation of user-supplied data when parsing DFT files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-28385 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.2    UNTRUSTED POINTER DEREFERENCE CWE-822\nAffected applications lack proper validation of user-supplied data when parsing PAR files. This could lead to pointer dereferences of a value obtained from untrusted source. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2020-26997 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.3    OUT-OF-BOUNDS WRITE CWE-787\nAffected applications lack proper validation of user-supplied data when parsing PAR files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-25678 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.4    OUT-OF-BOUNDS WRITE CWE-787\nAffected applications lack proper validation of user-supplied data when parsing PAR files. This could result in an out-of-bounds write past the end of an allocated structure. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-27380 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.5    STACK-BASED BUFFER OVERFLOW CWE-121\nAffected applications lack proper validation of user-supplied data when parsing of PAR files. This could result in a stack-based buffer overflow. An attacker could leverage this vulnerability to execute code in the context of the current process.\nCVE-2021-27382 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H.\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nFrancis Provencher {PRL} and rgod, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 --------- \nSiemens has released updates, which are recommended to be applied when possible:\n\nSolid Edge SE2020 versions before SE2020MP13: Update to SE2020MP13 or later (login required)\nSolid Edge SE2020 versions before SE2020MP14: Update to SE2020MP14 or later (login required)\nSolid Edge SE2021 versions before SE2021MP4: Update to SE2021MP4 or later (login required)\n\n--------- End Update A Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nAvoid opening untrusted files from unknown sources in Solid Edge,\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens operational guidelines for industrial security, and follow the recommendations in the product manual.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information about this issue, please see Siemens security advisory SSA-574442\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-28385",
    "CVE-2020-26997",
    "CVE-2021-27382",
    "CVE-2021-27380",
    "CVE-2021-25678"
  ],
  "techniques": [],
  "advisory": "icsa-21-103-06",
  "title": "Siemens Solid Edge File Parsing (Update A) | CISA",
  "source": "ics-advisories",
  "id": "688cd4af74c39a4454c78b3a950d15b0595b8e0c3f10f685087ffdf4e0532c1a"
}