{
  "markdown": " Innominate mGuard VPN Vulnerability \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryInnominate mGuard VPN Vulnerability=================================== Last Revised August 27, 2015 Alert Code ICSA\\-15\\-239\\-03OVERVIEW-------- Innominate mGuard has self identified a denial\\-of\\-service (DoS) vulnerability in the Innominate mGuard device. Inominate has produced a patch to mitigate this vulnerability. This vulnerability could be exploited remotely.AFFECTED PRODUCTS----------------- The following mGuard versions are affected:* Innominate mGuard firmware, Version 8\\.0\\.0 to Version8\\.1\\.6\\.IMPACT------ Successful exploitation of this vulnerability could result in a DoS condition. Impact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.BACKGROUND---------- Innominate is a German\\-based company that sells products worldwide through its international partners. The affected products, the mGuard family of products, are industrial security routers. They can be found in many critical infrastructure sectors, including Communications, Critical Manufacturing, and Healthcare and Public Health.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW**DOS OF VPN DAEMON**  CWE\\-272: Least Privilege Violation https://cwe.mitre.org/data/definitions/272\\.html, web site last accessed August 27, 2015\\. It is possible to cause a temporary DoS condition on the VPN daemon on the VPN waiting side if the VPN initiating peer has the option “IPsec compression” enabled. CVE\\-2015\\-3966NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2015\\-3966, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v2 base score of 7\\.8 has been assigned; the CVSS vector string is (AV:N/AC:L/Au:N/C:N/I:N/A:C).CVSS Calculator http://nvd.nist.gov/cvss.cfm?version\\=2\\&vector\\=AV:N/AC:L/Au:N/C:N/I:N/A:C web site last accessed August 27, 2015\\.### VULNERABILITY DETAILS#### EXPLOITABILITY This vulnerability could be exploited remotely.#### EXISTENCE OF EXPLOIT No known public exploits specifically target this vulnerability.#### DIFFICULTY An attacker with a low skill would be able to exploit this vulnerability.MITIGATION---------- Innominate has released firmware patches for the affected versions, Versions 8\\.0\\.0 through 8\\.1\\.6 that mitigate the vulnerability in the mGuard firmware. Innominate recommends that customers using firmware versions older than Version 7, which are no longer being maintained, should upgrade to mGuard firmware Version 8\\.1\\.7\\. Innominate also recommends that customers limit access to the administrative interfaces to a minimum via firewall rules. For additional information on the vulnerability, Innominate’s security advisory is available on its web site at: http://www.innominate.com/data/downloads/software/innominate\\_security\\_advisory\\_20150714\\_001\\_en.pdf Innominate’s firmware updates are available on its web site at: http://www.innominate.com/en/downloads/updates. ICS\\-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should: Minimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet. Locate control system networks and remote devices behind firewalls, and isolate them from the business network. When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. ICS\\-CERT also provides a section for control systems security recommended practices on the ICS\\-CERT web page at: http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS\\-CERT web site (http://ics\\-cert.us\\-cert.gov/). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Innominate-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-15-239-03)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2015-3966"
  ],
  "techniques": [],
  "advisory": "icsa-15-239-03",
  "title": "Innominate mGuard VPN Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "56513a3a2567e0a8ac17243ea61b29f6e4c3cbfd4e9696c9f4619dce1048ca7f"
}