{
  "markdown": " Sunway Force Control \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisorySunway Force Control==================== Last Revised January 02, 2019 Alert Code ICSA\\-11\\-167\\-01Overview-------- ICS\\-CERT has received a report from Security researcher Dillon Beresford of [NSS Labs](http://www.nsslabs.com/)  concerning vulnerabililities affecting Sunway ForceControl and pNetPower SCADA/HMI applications. The reported vulnerabilities are [heap\\-based buffer overflows](http://cwe.mitre.org/data/definitions/122.html)  that could result in a denial of service or the execution of arbitrary code. ICS\\-CERT has coordinated with the researcher, China National Vulnerability Database (CNVD), and Sunway to ensure full remediation of the reported vulnerabilities. Sunway has issued two patches that address both vulnerabilities. CNVD has confirmed the effectiveness of the patches issued by Sunway. Neither ICS\\-CERT nor the researcher has validated these patches. Sunway has issued a security bulletin describing their response.Affected Products----------------- According to the researcher, these vulnerabilities affect Sunway ForceControl 6\\.1 (SP1, SP2, and SP3\\) and pNetPower Version 6\\.Impact------ Successful exploitation of these vulnerabilities could allow an attacker to perform a remote denial of service or to remotely execute arbitrary code against the ForceControl and pNetPower server applications. This action can result in adverse application conditions and ultimately impact the production environment on which the SCADA system is used. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.Background---------- Beijing\\-based Sunway ForceControl Technology Co. provides SCADA HMI applications for a variety of industries. Sunway’s products are deployed primarily in China. According to the [Sunway website](http://www.sunwayland.com.cn/)  , the products are also deployed in Europe, the Americas, Asia, and Africa. Sunway products are deployed across a wide variety of industries including petroleum, petrochemical, defense, railways, coal, energy, pharmaceutical, telecommunications, water, manufacturing, and others.Vulnerability Characterization------------------------------### Vulnerability Overview The following two vulnerabilities have been identified:1. The heap\\-based buffer overflow affecting ForceControl 6\\.1 WebServer can be exploited if an attacker makes a request to the httpsvr.exe process with a specially crafted HTTP URL. Successful exploitation results in a denial of service and the possible execution of arbitrary code.2. The heap\\-based buffer overflow affecting pNetPower AngelServer can be exploited if an attacker sends specially crafted UDP packets to the AngelServer.exe process. Successful exploitation results in a denial of service and the possible execution of arbitrary code.### Vulnerability Details#### Exploitability Remote exploitability of this vulnerability could be possible.#### Existence of Exploit No known exploits specifically target this vulnerability.#### Difficulty Consistent exploit code is unlikely. An attacker would require at least an intermediate skill level to exploit this vulnerability.Mitigation---------- Sunway has developed patches for both vulnerabilities, available at the Sunway website:1. For patching the ForceControl 6\\.1 WebServer URL request heap buffer overflow File Version: 6\\.0\\.5\\.3 KB File Size: 27KB Published: May 20, 2011 Download Address: [http://www.eforcecon.com/download\\_view.asp?Nid\\=3594](http://www.eforcecon.com/download_view.asp?Nid=3594)  Validated by : CNVD2. For patching the pNetPower 6\\.1 AngelServer UDP packet heap buffer overflow File Version: 6\\.0\\.11\\.3 File Size: 32KB Published: May 20, 2011 Download Address: [http://www.eforcecon.com/download\\_view.asp?Nid\\=3595](http://www.eforcecon.com/download_view.asp?Nid=3595)  Validated by : CNVD ICS\\-CERT encourages asset owners to minimize network exposure for all control system devices. Critical devices should not directly face the Internet. Locate control system networks and remote devices behind firewalls and isolate them from the business network. When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. The Control Systems Security Program (CSSP) also provides [a section for control system security recommended practices](/ics/recommended-practices)  on the CSSP web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Sunway-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-167-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-167-01",
  "title": "Sunway Force Control | CISA",
  "source": "ics-advisories",
  "id": "48e63babfe83213cebbd58aa67e6115cb8e25afdc5315567df57c4aff5b48977"
}