{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC Controller Web Servers\nVulnerability: Uncaught Exception\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the web server of the following SIMATIC controllers:\n\nSIMATIC ET 200SP Open Controller (incl. SIPLUS variants): Version 20.8\nSIMATIC S7-1500 Software Controller: Version 20.8\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCAUGHT EXCEPTION CWE-248\nAn attacker can send a specially crafted HTTP request to the products web server, which may cause a denial-of-service condition.\nCVE-2020-15796 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends updating to the latest version:\n\nSIMATIC ET 200SP Open Controller (incl. SIPLUS variants): Update to v21.8\nSIMATIC S7-1500 Software Controller: Update to v21.8\n\nSiemens notes that if the PC Station web server does not restart automatically, a Windows reboot is required. This can be done while the control system is running as the PLC control functionality is not affected.\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for industrial security and follow the recommendations in the product manuals.\nFor more information, please see Siemens Security Advisory SSA-700697\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-15796"
  ],
  "techniques": [],
  "advisory": "icsa-20-343-09",
  "title": "Siemens SIMATIC Controller Web Servers | CISA",
  "source": "ics-advisories",
  "id": "817ac01f4248c453372f2d8f2129de59ba77d46f084dee61c1f981af13bbb09f"
}