{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Advantech\nEquipment: iView\nVulnerabilities: SQL Injection, Path Traversal, Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to disclose information, escalate privileges to Administrator, perform an arbitrary file read, and remotely execute commands.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Advantech iView, a device management application, are affected:\n\niView versions prior to v5.7.03.6112\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe affected product is vulnerable to a SQL injection, which may allow an unauthorized attacker to disclose information.\nCVE-2021-22654 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThe affected product is vulnerable to a SQL injection, which may allow an attacker to escalate privileges to ‘Administrator’.\nCVE-2021-22658 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe affected product is vulnerable to directory traversal, which may allow an attacker to read sensitive files.\nCVE-2021-22656 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.4    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nAccess to the affected product’s configuration is missing authentication, which may allow an unauthorized attacker to change the configuration and obtain code execution.\nCVE-2021-22652 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nAnonymous and rgod, working with Trend Micro’s Zero Day Initiative, and William Vu of Rapid7 reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAdvantech has released Version 5.7.03.6112 of iView to address these reported vulnerabilities. Users can download the latest version of iView.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-22652",
    "CVE-2021-22656",
    "CVE-2021-22658",
    "CVE-2021-22654"
  ],
  "techniques": [],
  "advisory": "icsa-21-040-02",
  "title": "Advantech iView | CISA",
  "source": "ics-advisories",
  "id": "5f92409410544882ebbbdc7a181f43c79138a8f74613c1cf5260f53629116441"
}