{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Dahua Technology Co., Ltd\nEquipment: Digital Video Recorders and IP Cameras\nVulnerabilities: Use of Password Hash Instead of Password for Authentication, Password in Configuration File\nAFFECTED PRODUCTS\nThe following Dahua Technology Co., Ltd (Dahua) network cameras are affected:\n\nDH-IPC-HDBW23A0RN-ZS,\nDH-IPC-HDBW13A0SN,\nDH-IPC-HDW1XXX,\nDH-IPC-HDW2XXX,\nDH-IPC-HDW4XXX,\nDH-IPC-HFW1XXX,\nDH-IPC-HFW2XXX,\nDH-IPC-HFW4XXX,\nDH-SD6CXX,\nDH-NVR1XXX,\nDH-HCVR4XXX, and\nDH-HCVR5XXX.\n\nThe following Dahua Digital Video Recorders (DVRs) are affected:\n\nDHI-HCVR51A04HE-S3,\nDHI-HCVR51A08HE-S3, and\nDHI-HCVR58A32S-S2.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow the attacker to obtain user credentials, including password hashes, and use these credentials to bypass authentication.\nMITIGATION\nDahua has released updated firmware to mitigate these vulnerabilities.\nUpdated software can be obtained from Dahua technical support or an authorized Dahua distributor.\nIn addition, Dahua released the following security notifications for users:\n\nCyber Vulnerability Affecting Certain Dahua IP Cameras and Recorders (March 6)\nCybersecurity Statement – March 6, 2017\nCybersecurity Vulnerability Update – March 8, 2017\nCyber Vulnerability Affecting Certain Dahua IP Cameras and Recorders (April 3)\n\nDahua’s original notification specifies 11 affected models, but after initial testing, Dahua has identified additional series and models in the following security notification:\n\nSecurity Notification DHCC-201703-01\n\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nChange default passwords immediately.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nVULNERABILITY OVERVIEW\n\nUSE OF PASSWORD HASH INSTEAD OF PASSWORD FOR AUTHENTICATION CWE-836\n\nThe use of password hash instead of password for authentication vulnerability was identified, which could allow a malicious user to bypass authentication without obtaining the actual password.\nCVE-2017-7927 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n\nPASSWORD IN CONFIGURATION FILE CWE-260\n\nThe password in configuration file vulnerability was identified, which could lead to a malicious user assuming the identity of a privileged user and gaining access to sensitive information.\nCVE-2017-7925 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nResearcher Bashis disclosed these vulnerabilities without coordination with ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sector(s): Commercial Facilities, Critical Manufacturing, Financial, Government Facilities, and Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: China\n",
  "cves": [
    "CVE-2017-7925",
    "CVE-2017-7927"
  ],
  "techniques": [],
  "advisory": "icsa-17-124-02",
  "title": "Dahua Technology Co., Ltd Digital Video Recorders and IP Cameras | CISA",
  "source": "ics-advisories",
  "id": "f713b3f5a1bebbc9a3c65ce5c530e283d0bf868c753cebc1418ac547b03058d8"
}