{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens and Milestone\nEquipment: Siveillance Video Open Network Bridge (ONVIF)\nVulnerability: Use of Hard-coded Cryptographic Key\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an authenticated remote attacker to retrieve and decrypt all user credentials stored on the ONVIF server.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Milestone XProtect Open Network Bridge and Siemens Siveillance Video Open Network Bridge, are affected:\n\n2020 R3\n2020 R2\n2020 R1\n2019 R3\n2019 R2\n2019 R1\n2018 R3\n2018 R2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nAffected Open Network Bridges store user credentials for the authentication between ONVIF clients and the ONVIF server using a hard-coded key, which could allow an authenticated remote attacker to retrieve and decrypt all credentials stored on the ONVIF server. \nCVE-2021-27392 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMilestone PSIRT reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens has released hotfixes for the following versions of ONVIF and recommends applying the hotfix using the latest available installer for Open Network Bridge.\n\n2020 R3\n2020 R2\n2020 R1\n2019 R3\n2019 R2\n2019 R1\n2018 R3\n2018 R2\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDisable the Open Network Bridge (ONVIF), if not in use.  By default, the Open Network Bridge is disabled.\n\nAs a general security measure Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices to run the devices in a protected IT environment.\nPlease see Siemens Security Advisory SSA-853866 and the Milestone XProtect advisory for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-27392"
  ],
  "techniques": [],
  "advisory": "icsa-21-103-15",
  "title": "Siemens and Milestone Siveillance Video Open Network Bridge | CISA",
  "source": "ics-advisories",
  "id": "21c2ca86b7465d7d985f729cccacc9053a78b68952356798362f501a5135b442"
}