{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Sierra Wireless\nEquipment: AirVantage\nVulnerabilities: Improper Authentication, Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to configure devices and to receive sensitive device information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Sierra Wireless AirVantage, a cloud management platform, are affected:\n\nAirVantage Platform\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER AUTHENTICATION CWE-287\nThe AirVantage platform is vulnerable to an unauthorized attacker registering previously unregistered devices on the AirVantage platform if the user had not disabled the AirVantage Management Service on the devices. This could enable an attacker to configure, manage, and execute AT commands on an unsuspecting user’s devices.\nCVE-2023-31279 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:H).\n3.2.2 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe AirVantage online Warranty Checker tool had an exposure of sensitive information vulnerability that could allow an attacker to perform bulk enumeration of IMEI and Serial Numbers and could use this information to perform exploits. \nCVE-2023-31280 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Canada\n\n3.4 RESEARCHER\nRoni Gavrilov of Otorio reported these issues to Sierra Wireless.\n4. MITIGATIONS\nSierra Wireless has updated the AirVantage Warranty Checker so it does not return the IMEI and Serial Number in addition to the warranty status when the Serial Number or IMEI is used to look up warranty status, preventing the disclosure of additional information not necessary to confirm the warranty status.\nSierra Wireless encourages users to register their devices on the AirVantage platform to enable remote management capabilities for those devices, preventing the possibility of unauthorized device activation or to disable the AirVantage Management Service on devices if management via the AirVantage platform will not be used, eliminating any risk of unauthorized device access.\nSierra Wireless encourages anyone with a security concern related to Sierra Wireless products to directly contact Sierra Wireless.\nFor more information, see Sierra Wireless’s security bulletins here.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2023-31279",
    "CVE-2023-31280"
  ],
  "techniques": [],
  "advisory": "icsa-23-131-07",
  "title": "Sierra Wireless AirVantage | CISA",
  "source": "ics-advisories",
  "id": "261bdb7f38ab779605accb685d7eeb602c5d329cf81096fe49adbefb25cb7f35"
}