{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Honeywell \nEquipment: equIP series IP cameras\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in denial-of-service conditions. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHoneywell reports the vulnerability affects the equIP series IP camera products listed fully in the following Honeywell security notification: \n\nSecurity Notification SN 2019-09-13 01 \n\nThis notification can be found at the following location:\nhttps://www.security.honeywell.com/resources/eol-and-security-notices\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20 \nA vulnerability exists in the affected products where a specially crafted HTTP packet request could result in a denial of service.\nCVE-2019-18228 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy, Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nHoneywell reported this vulnerability to CISA.\n4. MITIGATIONS\nHoneywell has released firmware update packages for all affected products listed above. The package can be downloaded from:\nhttps://mywebtech.honeywell.com/Home\nHoneywell recommends that users with potentially affected products take the following steps to protect themselves:\n\nUpdate firmware of vulnerable devices per this security notification;\nIsolate their system from the Internet or create additional layers of defense to their system from the Internet by placing the affected hardware behind a firewall or into a DMZ; and\nIf remote connections to the network are required, consider using a VPN or other means to ensure secure remote connections into the network where the device is located.\n\nMore information on this issue can be found in Honeywell Security Notification SN 2019-09-13 01\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2019-18228"
  ],
  "techniques": [],
  "advisory": "icsa-19-304-02",
  "title": "Honeywell equIP Series IP Cameras | CISA",
  "source": "ics-advisories",
  "id": "4d84f1ee429773088589f1c01970bca188ad0231cf2d4db525c3e50f5f87511a"
}