{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Schneider Electric\nEquipment: IGSS (Interactive Graphical SCADA System)\nVulnerabilities: Path Traversal, Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in unauthorized access to sensitive data and functions.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of IGSS are affected:\n\nVersions 14 and prior using the service IGSSupdate\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER LIMITATION OF A PATHNAME TO A RESTRICTED DIRECTORY ('PATH TRAVERSAL') CWE-22\nThe affected product could allow a remote unauthenticated attacker to read arbitrary files on the device.\nCVE-2020-7478 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe affected product could allow a local user to execute processes that otherwise require escalation privileges when sending local network commands to the IGSS update service.\nCVE-2020-7479 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nsl4v, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSchneider Electric has provided IGSS14 Version 14.0.0.20009 to address these vulnerabilities. Users are recommended to update to IGSS Version 14.\nAlternatively, the following workarounds and mitigations can be applied to reduce risk:\n\nDisable the IGSS Update service when it is not required installing updates using the service.\nKeep the infrastructure offline and do not allow Windows login and network access for untrusted people and sources.\n\nFor more information, see the Schneider Electric security notification. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\nEnsure the least-privilege user principle is followed.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-7478",
    "CVE-2020-7479"
  ],
  "techniques": [],
  "advisory": "icsa-20-084-02",
  "title": "Schneider Electric IGSS SCADA Software | CISA",
  "source": "ics-advisories",
  "id": "db54041bf0a07c8f62c06166a0a90974069f37ea8fe1c06e63051ef0fd08d4ba"
}