{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Yokogawa\nEquipment: STARDOM Controllers\n\n--------- Begin Update A Part 1 of 5 --------\n\nVulnerabilities: Use of Hard-coded Credentials, Session Fixation, Insufficiently Protected Credentials, Resource Exhaustion\n\n--------- End Update A Part 1 of 5 --------\n2. UPDATE INFORMATION\n  This updated advisory is a follow-up to the original advisory titled ICSA-18-151-03 Yokogawa STARDOM Controllers that was published May 31, 2018, on the NCCIC/ICS-CERT website.\n          3. RISK EVALUATION\n--------- Begin Update A Part 2 of 5 --------\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain access to the affected device, cause a denial of service, or gain unauthorized access, which could result in remote arbitrary code execution.\n--------- End Update A Part 2 of 5 --------\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nYokogawa reports the vulnerability affects the following STARDOM Controller products:\n\nFCJ (R4.02 and prior),\nFCN-100 (R4.02 and prior),\nFCN-RTU (R4.02 and prior),\nFCN-500 (R4.02 and prior),\n\n--------- Begin Update A Part 3 of 5 --------\n\nFCJ (R4.10 and prior),\nFCN-100 (R4.10 and prior),\nFCN-RTU (R4.10 and prior), and\nFCN-500 (R4.10 and prior).\n\n--------- End Update A Part 3 of 5 --------\n4.2 VULNERABILITY OVERVIEW\n4.2.1 USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected controllers utilize hard-coded credentials that could allow an attacker to gain unauthorized administrative access to the device, which could result in remote code execution.\nCVE-2018-10592 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n--------- Begin Update A Part 4 of 5 --------\n4.2.2     INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nThe web application improperly protects credentials which could allow an attacker to obtain credentials for remote access to controllers. \nCVE-2018-17900 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L).\n4.2.3    SESSION FIXATION CWE-384\nThe application utilizes multiple methods of session management which could result in a denial of service to the remote management functions.\nCVE-2018-17902 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n4.2.4    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected controllers utilize hard-coded credentials which may allow an attacker gain unauthorized access to the maintenance functions and obtain or modify information. This attack can be executed only during maintenance work.\nCVE-2018-17896 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:L).\n4.2.5    UNCONTROLLED RESOURCE CONSUMPTION ('RESOURCE EXHAUSTION') CWE-400\nThe controller application fails to prevent memory exhaustion by unauthorized requests. This could allow an attacker to cause the controller to become unstable. \nCVE-2018-17898 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n--------- End Update A Part 4 of 5 --------\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, and Food and Agriculture\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Japan\n\n4.4 RESEARCHER\nVDLab of Venustech and Dongfang Electric Corporation (DEC) reported this vulnerability to NCCIC.\n5. MITIGATIONS\n--------- Begin Update A Part 5 of 5 --------\nYokogawa has recommended users upgrade the FCN/FCJ software to Version R4.20 or later and reports that some vulnerabilities are remediated in that version. Yokogawa has determined the fix for the memory exhaustion vulnerability is provided by that revision. For the remaining vulnerabilities of insufficiently protected credentials, session fixation, and use of hard-coded credentials, Yokogawa recommends users employ the packet filter function in FCN and recommend restricting communication to only the appropriate source. Furthermore, Yokogawa recommends users take measures with the network so communication data cannot be captured by untrusted third parties. Yokogawa strongly suggests all users introduce appropriate security measures not only for the vulnerabilities identified, but to the overall system. \nYokogawa recommends users with questions related to this report (or on obtaining the updates) please utilize the product inquiry contact details at the following location: \nhttp://stardom.biz/\nYokogawa’s Security Advisory Report, YSAR-18-0004: Vulnerability of hardcoded password in STARDOM controllers, and YSAR-18-0007: Vulnerabilities in STARDOM controllers and other Yokogawa security reports are available at the following URL:\nhttps://www.yokogawa.com/library/resources/white-papers/yokogawa-security-advisory-report-list/\nAdditionally, for questions related to these reports, please contact the following:\nhttps://contact.yokogawa.com/cs/gw?c-id=000498\n--------- End Update A Part 5 of 5 --------\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize and restrict remote device access where remote access is not required.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-10592",
    "CVE-2018-17902",
    "CVE-2018-17896",
    "CVE-2018-17900",
    "CVE-2018-17898"
  ],
  "techniques": [],
  "advisory": "icsa-18-151-03",
  "title": "Yokogawa STARDOM Controllers (Update A) | CISA",
  "source": "ics-advisories",
  "id": "9e8316ae231e5759572f4642d0f0da61502bae408047abac27351c1cddc349b5"
}