{
  "markdown": " Mitsubishi Electric MELSEC iQ\\-R, Q, L Series and MELIPC Series (Update C) \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryMitsubishi Electric MELSEC iQ\\-R, Q, L Series and MELIPC Series (Update C)========================================================================== Last Revised June 04, 2024 Alert Code ICSA\\-22\\-172\\-01 Related topics: , [Industrial Control System Vulnerabilities](/topics/industrial-control-systems/industrial-control-system-vulnerabilities) 1\\. EXECUTIVE SUMMARY---------------------* **CVSS v3 7\\.5*** **ATTENTION**  : Exploitable remotely/low attack complexity* **Vendor**  : Mitsubishi Electric* **Equipment**  : MELSEC iQ\\-R, Q, and L Series CPU Module; MELIPC Series CPU* **Vulnerability**  : Improper Resource Locking2\\. RISK EVALUATION------------------- Successful exploitation of this vulnerability could result in a denial\\-of\\-service condition for Ethernet communication. A system restart would be required to restore functionality.3\\. TECHNICAL DETAILS---------------------### 3\\.1 AFFECTED PRODUCTS The following Mitsubishi Electric products are affected:* MELSEC iQ\\-R Series R12CCPU\\-V CPU Firmware: Version 16 and prior* MELSEC Q Series Q03UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q04UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q06UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q10UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q13UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q20UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q26UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q50UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q100UDECPU: Versions with the first 5 digits of serial number 24061 and prior* MELSEC Q Series Q03UDVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q04UDVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q06UDVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q13UDVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q26UDVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q04UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q06UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q13UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q26UDPVCPU: Versions with the first 5 digits of serial number 24051 and prior* MELSEC Q Series Q12DCCPU\\-V: Versions with the first 5 digits of serial number 25061 and prior* MELSEC Q Series Q24DHCCPU\\-V(G): Versions with the first 5 digits of serial number 25061 and prior* MELSEC Q Series Q24DHCCPU\\-LS: Versions with the first 5 digits of serial number 25061 and prior* MELSEC Q Series Q26DHCCPU\\-LS: Versions with the first 5 digits of serial number 25061 and prior* MELSEC L Series L02CPU(\\-P): Versions with the first 5 digits of serial number 24051 and prior* MELSEC L Series L06CPU(\\-P): Versions with the first 5 digits of serial number 24051 and prior* MELSEC L Series L26CPU(\\-P): Versions with the first 5 digits of serial number 24051 and prior* MELSEC L Series L26CPU\\-(P)BT: Versions with the first 5 digits of serial number 24051 and prior* MELIPC Series MI5122\\-VW CPU Firmware: Version 05 and prior### 3\\.2 Vulnerability Overview#### **3\\.2\\.1** [**IMPROPER RESOURCE LOCKING CWE\\-413**](https://cwe.mitre.org/data/definitions/413.html) The affected product is vulnerable to a stack\\-based buffer overflow, which may allow an attacker to remotely execute arbitrary code.[CVE\\-2022\\-24946](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2022-24946)  has been assigned to this vulnerability. A CVSS v3 base score of 7\\.5 has been assigned; the CVSS vector string is ( [AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H)  ).### 3\\.3 BACKGROUND* **CRITICAL INFRASTRUCTURE SECTORS:**  Critical Manufacturing* **COUNTRIES/AREAS DEPLOYED:**  Worldwide* **COMPANY HEADQUARTERS LOCATION:**  Japan### 3\\.4 RESEARCHER Mitsubishi Electric reported this vulnerability to CISA.4\\. MITIGATIONS--------------- Mitsubishi has fixed the vulnerability in the following products:* MELSEC iQ\\-R Series R12CCPU\\-V CPU: Firmware Version 17 and later* MELSEC Q Series Q03UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q04UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q06UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q10UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q13UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q20UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q26UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q50UDECPU: Versions with the first 5 digits of serial No. 24062 and later* MELSEC Q Series Q100UDECPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q03UDVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q04UDVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q06UDVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q13UDVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q26UDVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q04UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q06UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q13UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q26UDPVCPU: Versions with the first 5 digits of serial No. 24052 and later* MELSEC Q Series Q12DCCPU\\-V: Versions with the first 5 digits of serial No. 25062 and later* MELSEC Q Series Q24DHCCPU\\-V(G): Versions with the first 5 digits of serial No. 25062 and later* MELSEC Q Series Q24DHCCPU\\-LS: Versions with the first 5 digits of serial No. 25062 and later* MELSEC Q Series Q26DHCCPU\\-LS: Versions with the first 5 digits of serial No. 25062 and later* MELSEC L Series L02CPU(\\-P): Versions with the first 5 digits of serial No. 24052 and later* MELSEC L Series L06CPU(\\-P): Versions with the first 5 digits of serial No. 24052 and later* MELSEC L Series L26CPU(\\-P): Versions with the first 5 digits of serial No. 24052 and later* MELSEC L Series L26CPU\\-(P)BT: Versions with the first 5 digits of serial No. 24052 and later* MELIPC Series MI5122\\-VW CPU: Firmware Version 06 and later Mitsubishi Electric recommends customers apply the following countermeasures: MELSEC iQ\\-R Series:* Customers using the MELSEC iQ\\-R Series firmware versions 08 and prior will be unable to update to the fixed version. Take the mitigation measures that are common to all affected products found later in the advisory.* Customers using the MELSEC iQ\\-R Series firmware versions 09 and later are recommended to download and install the [updated firmware](https://www.mitsubishielectric.com/fa/download/index.html)  . Please refer to the MELSEC iQ\\-R Module Configuration Manual \"Appendix 2 Firmware Update Function\" for instructions on how to update the firmware. MELSEC Q Series:* Customers using the MELSEC Q Series will be unable to update to the respective fixed versions. Mitsubishi Electric recommends customers consider migrating to the MELSEC iQ\\-R Series. Take the mitigation measures that are common to all affected products found later in the advisory. MELSEC L Series:* Customers using the MELSEC L Series will be unable to update to the respective fixed versions. Mitsubishi Electric recommends customers consider migrating to the MELSEC iQ\\-R Series. Take the mitigation measures that are common to all affected products found later in the advisory. MELIPC Series:* Customers using the MELIPC Series will be unable to update to the fixed version. Take the mitigation measures that are common to all affected products found later in the advisory. Mitsubishi Electric recommends the following mitigation measures as being common to all affected products:* Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.* Use within a LAN and block access from untrusted networks and hosts through firewalls. For additional information, such as how to check device or firmware versions, see the [Mitsubishi Electric security advisory](https://www.mitsubishielectric.com/en/psirt/vulnerability/pdf/2022-007_en.pdf)  . Please contact Mitsubishi Electric [customer support](https://www.mitsubishielectric.com/fa/support/index.html)  for more information on how to update specific hardware. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:* Minimize network exposure for all control system devices and/or systems, ensuring they are [not accessible from the internet](https://www.cisa.gov/uscert/ics/alerts/ICS-ALERT-10-301-01)  . CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for [control systems security recommended practices](https://www.cisa.gov/resources-tools/resources/ics-recommended-practices)  on the ICS webpage on [cisa.gov/ics](https://www.cisa.gov/topics/industrial-control-systems)  . Several CISA products detailing cyber defense best practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](https://us-cert.cisa.gov/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . CISA encourages organizations to implement recommended cybersecurity strategies for [proactive defense of ICS assets](https://www.cisa.gov/sites/default/files/publications/Cybersecurity_Best_Practices_for_Industrial_Control_Systems.pdf)  . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at [cisa.gov/ics](https://www.cisa.gov/topics/industrial-control-systems)  in the technical information paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](https://www.cisa.gov/uscert/ics/tips/ICS-TIP-12-146-01B)  . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploits specifically target this vulnerability.5\\. UPDATE HISTORY------------------* June 14, 2022: Initial Publication* August 16, 2022: Update A \\- Additional affected products added (R12CCPU\\-V, Q12DCCPU\\-V, Q24DHCCPU\\-V (G), Q24/26DHCCPU\\-LS, MI5122\\-VW); additional mitigations added (R12CCPU\\-V, Q03UDECPU, Q04/06/10/13/20/26/50/100UDEHCPU, MI5122\\-VW)* July 27, 2023: Update B \\- Additional mitigations added (Q12DCCPU\\-V, Q24DHCCPU\\-V (G), Q24/26DHCCPU\\-LS).* May 30, 2024: Update C \\- Product specific update information added to Mitigations section. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Mitsubishi Electric### Tags Topics , [Industrial Control System Vulnerabilities](/topics/industrial-control-systems/industrial-control-system-vulnerabilities)  Sector[Critical Manufacturing Sector](/topics/critical-infrastructure-security-and-resilience/critical-infrastructure-sectors/critical-manufacturing-sector) -------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-22-172-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2022-24946"
  ],
  "techniques": [],
  "advisory": "icsa-22-172-01",
  "title": "Mitsubishi Electric MELSEC iQ-R, Q, L Series and MELIPC Series (Update C) | CISA",
  "source": "ics-advisories",
  "id": "634aa6c501ae830075f479dee4b04a1e3bf182df01bc3ab8ef3a51f2ef5e6973"
}