{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity \nVendor: GE Digital \nEquipment: Proficy Historian \nVulnerabilities: Authentication Bypass using an Alternate Path or Channel, Unrestricted Upload of File with Dangerous Type, Improper Access Control, Weak Encoding for Password \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device after access, cause a buffer overflow condition, and allow remote code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nGE Digital reports these vulnerabilities affect the following Proficy Historian product: \n\nProficy Historian v7.0 and higher versions \n\nNot Affected: Other GE software offerings including GE Digital and Proficy Products not listed above. \n3.2 VULNERABILITY OVERVIEW\n3.2.1 AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nEven if the authentication fails for local service authentication, the requested command could still execute regardless of authentication status. \nCVE-2022-46732 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). \n3.2.2 UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434 \nAn unauthorized user could alter or write files with full control over the path and content of the file. \nCVE-2022-46660 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). \n3.2.3 IMPROPER ACCESS CONTROL CWE-284\nAn unauthorized user could be able to read any file on the system, potentially exposing sensitive information. \nCVE-2022-43494 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). \n3.2.4 IMPROPER ACCESS CONTROL CWE-284 \nAn unauthorized user could possibly delete any file on the system. \nCVE-2022-46331 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). \n3.2.5 WEAK ENCODING FOR PASSWORD CWE-261 \nAn unauthorized user with network access and the decryption key could decrypt sensitive data, such as usernames and passwords. \nCVE-2022-38469 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Industries \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nUri Katz of Claroty Research reported these vulnerabilities to GE. \n4. MITIGATIONS\nGE Digital released Proficy Historian 2023 to mitigate these vulnerabilities.  SIMs have also been released for all affected versions. \nUsers can find out more about the vulnerabilities, how to obtain, and install the updates by visiting this notification document from GE Digital.  \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2022-46732",
    "CVE-2022-46331",
    "CVE-2022-43494",
    "CVE-2022-46660",
    "CVE-2022-38469"
  ],
  "techniques": [],
  "advisory": "icsa-23-017-01",
  "title": "GE Digital Proficy Historian | CISA",
  "source": "ics-advisories",
  "id": "86183880d37f58cb22d8bdc4aa13dab57fe396b7a66e48332d59b19aad60ed49"
}