{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Korenix\nEquipment: JetNet\nVulnerabilities: Use of Hard-coded Cryptographic Key, Use of Hard-coded Credentials\nAFFECTED PRODUCTS\nThe following versions of JetNet, an Ethernet switch, are affected:\n\nJetNet5018G version 1.4,\nJetNet5310G version 1.4a,\nJetNet5428G-2G-2FX version 1.4,\nJetNet5628G-R version 1.4,\nJetNet5628G version 1.4,\nJetNet5728G-24P version 1.4,\nJetNet5828G version 1.1d,\nJetNet6710G-HVDC version 1.1e, and\nJetNet6710G version 1.1\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to gain remote access to the device to run arbitrary code and perform man-in-the-middle attacks.\nMITIGATION\nKorenix has produced new firmware that removes the undocumented hard-coded credentials from supported systems. The new firmware is available for download at:\nhttp://www.korenix.com/upload/doc/FW_JetNet5310G_V2.0.rar\nKorenix recommends that affected users use the software support certificate replacement feature to change certificates on affected devices.\nUsers can find customer support links for Korenix at: http://www.korenix-usa.com/contact-us.php\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nUSE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\n\nAn attacker may gain access to hard-coded certificates and private keys allowing the attacker to perform man-in-the-middle attacks.\nCVE-2017-14021 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nUSE OF HARD-CODED CREDENTIALS CWE-798\n\nThe software uses undocumented hard-coded credentials that may allow an attacker to gain remote access.\nCVE-2017-14027 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nMandar Jadhav of the Qualys Vulnerability Signature/Research Team reported these vulnerabilities to ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, and Transportation Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Walnut, California\n",
  "cves": [
    "CVE-2017-14027",
    "CVE-2017-14021"
  ],
  "techniques": [],
  "advisory": "icsa-17-299-01",
  "title": "Korenix JetNet | CISA",
  "source": "ics-advisories",
  "id": "13cb1417c2147e9de17c56f3cd2515f2a86e83850733b3b59d74701019c9957c"
}