{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.3\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: Mitsubishi Electric, Factory Automation Engineering products\nVulnerability: Unquoted Search Path or Element\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-212-04 Mitsubishi Electric Factory Automation Engineering Products (Update J) that was published March 2, 2023, to the ICS webpage on cisa.gov/ics. \n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to obtain unauthorized information, modify information, and cause a denial-of-service condition.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products and versions are affected:\n\nC Controller Interface Module Utility, Versions 2.00 and prior\nCC-Link IE Control Network Data Collector, Version 1.00A\nCC-Link IE Field Network Data Collector, Version 1.00A\nCC-Link IE TSN Data Collector, Version 1.00A\nCPU Module Logging Configuration Tool, Versions 1.100E and prior\nCW Configurator, Versions 1.010L and prior\nData Transfer, Versions 3.42U and prior\nEZSocket, version 5.1 and prior\nFR Configurator SW3, all versions\nFR Configurator2: Versions 1.26C and prior\nGT Designer2 Classic, all versions\nGT Designer3 Version1 (GOT1000), Versions 1.241B and prior\nGT Designer3 Version1 (GOT2000), Versions 1.241B and prior\nGT SoftGOT1000 Version3, Versions 3.200J and prior\nGT SoftGOT2000 Version1, Versions 1.241B and prior\nGX Developer, Versions 8.504A and prior\nGX LogViewer, Versions 1.100E and prior\nGX Works2, Versions 1.601B and prior\nGX Works3, Versions 1.063R and prior\nM_CommDTM-IO-Link, Versions 1.03D and prior\nMELFA-Works: Version 4.4 and prior\nMELSEC WinCPU Setting Utility, all versions\nMELSOFT Complete Clean Up Tool, Versions 1.06G and prior\nMELSOFT EM Software Development Kit, Versions 1.015R and prior\nMELSOFT iQ AppPortal, 1.17T and prior\nMELSOFT Navigator, Versions 2.74C and prior\nMI Configurator, Version 1.004E and prior\nMotion Control Setting, Versions 1.005F and prior\nMotorizer, Versions 1.005F and prior\nMR Configurator2, Version 1.125F and prior\nMT Works2, Version 1.167Z and prior\nMTConnect Data Collector, Version 1.1.4.0 and prior\nMX Component, Version 4.20W and prior\nMX MESInterface, Versions 1.21X and prior\nMX MESInterface-R, Versions 1.12N and prior\nMX Sheet, Version 2.15R and prior\nNetwork Interface Board CC IE Control Utility, Versions 1.29F and prior\nNetwork Interface Board CC IE Field Utility, Versions 1.16S and prior\nNetwork Interface Board CC-Link Ver.2 Utility, Versions 1.23Z and prior\nNetwork Interface Board MNETH Utility, Versions 34L and prior\nPosition Board Utility 2: Versions 3.20 and prior\nPX Developer, version 1.53F and prior\nRT ToolBox2: Version 3.73B and prior\nRT ToolBox3: Version 1.82L and prior\nSetting/Monitoring tools for the C Controller module (SW3PVC-CCPU), Version 3.13P and prior\nSetting/Monitoring tools for the C Controller module (SW4PVC-CCPU), Version 4.12N and prior\nSLMP Data Collector, Version 1.04E and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nMultiple Mitsubishi Electric Factory Automation engineering software products have a malicious code execution vulnerability. A malicious attacker could use this vulnerability to obtain information, modify information, and cause a denial-of-service condition.\nCVE-2020-14521 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan \n\n4.4 RESEARCHER\nMashav Sapir of Claroty reported this vulnerability to CISA.\n5. MITIGATIONS\nMitsubishi Electric recommends the following mitigations:\n--------- Begin Update K Part 1 of 1 --------- \nRefer to the Mitsubishi Electric website for details on available patches and countermeasures.\n--------- End Update K Part 1 of 1 --------- \nDownload the latest version of each software product and update it. \nRefer to the manual for help to update affected products.\nFor users of a product that has not released a fixed version or who cannot immediately update the product, Mitsubishi Electric recommends taking the following mitigation measures to minimize risk:\n\nIf a “File Name Warning” message is displayed when starting Windows, take appropriate measures according to the instructions in the message (such as changing a file name) and then install or operate the products.\nOperate the products under an account that does not have administrator privileges.\nInstall an antivirus software in computers using the products.\nRestrict network exposure for all control system devices or systems to the minimum necessary and ensure they are not accessible from untrusted networks and hosts.\nLocate control system networks and remote devices behind firewalls and isolate them from the network.\nUse virtual private network (VPN) when remote access is required.\n\nAdditional information about the vulnerabilities or Mitsubishi Electric's compensating control is available by contacting a Mitsubishi Electric representative. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2020-14521"
  ],
  "techniques": [],
  "advisory": "icsa-20-212-04",
  "title": "Mitsubishi Electric Factory Automation Engineering Products (Update K) | CISA",
  "source": "ics-advisories",
  "id": "a8e0f7b9c1f22e8df820647b0434d5c004795d4ee6f52c10c1163a280247dc35"
}