{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.2\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens\nEquipment: SCALANCE X switches\nVulnerability: Protection Mechanism Failure\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-20-042-07 Siemens SCALANCE X Switches (Update B) that was published April 13, 2021, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to perform administrative actions.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of SCALANCE X Switches, used to connect industrial components, are affected:\n\nSCALANCE X-200 switch family (including SIPLUS NET variants): All versions prior to Version 5.2.4\nSCALANCE X-200IRT switch family (including SIPLUS NET variants): All versions prior to v5.5.0\nSCALANCE X-300 switch family (including X408 and SIPLUS NET variants): All versions prior to Version 4.1.3\n\n--------- Begin Update C Part 1 of 2 ---------\n\nSCALANCE X-200RNA switch family: All versions prior to v3.2.7\n\n--------- End Update C Part 1 of 2 ---------\n\nSCALANCE S602: All versions prior to 4.1\nSCALANCE S612: All versions prior to 4.1\nSCALANCE S623: All versions prior to 4.1\nSCALANCE S627-2M: All versions prior to 4.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    PROTECTION MECHANISM FAILURE CWE-693\nThe device does not send the X-Frame-Option header in the administrative web interface, which makes it vulnerable to click-jacking attacks.\nCVE-2019-13924 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:L/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has released updates, which are recommended to be applied when possible:\n\nSCALANCE X-200 switch family (including SIPLUS NET variants): Version 5.2.4\nSCALANCE X-200IRT switch family (including SIPLUS NET variants): Version 5.5.0\nSCALANCE X-300 switch family (including X408 and SIRPLUS NET variants): Version 4.1.3\nSCALANCE S602: Update to 4.1 (Update is only available via Siemens Support contact)\n\nUpgrade hardware to successor product from SC-600 family and apply patches when available\n\n\nSCALANCE S612: Update to 4.1 (Update is only available via Siemens Support contact)\n\nUpgrade hardware to successor product from SC-600 family and apply patches when available\n\n\nSCALANCE S623: Update to 4.1 (Update is only available via Siemens Support contact)\n\nUpgrade hardware to successor product from SC-600 family and apply patches when available\n\n\nSCALANCE S627-2M: Update to 4.1 (Update is only available via Siemens Support contact)\n\nUpgrade hardware to successor product from SC-600 family and apply patches when available\n\n\n\n--------- Begin Update C Part 2 of 2 ---------\n\nSCALANCE X-200RNA switch family: Update to v3.2.7 or later\n\n--------- End Update C Part 2 of 2 ---------\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nOnly access links from trusted sources in the browser you use to configure the SCALANCE X switches.\n\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information see Siemens security advisory SSA-951513\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nNot click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability\n",
  "cves": [
    "CVE-2019-13924"
  ],
  "techniques": [],
  "advisory": "icsa-20-042-07",
  "title": "Siemens SCALANCE X Switches (Update C) | CISA",
  "source": "ics-advisories",
  "id": "0abca7849065051367b537a26334ab37aa37d22a2d9d0ebf79afb92ceea9694b"
}