{
  "markdown": "\nCVSS v3 7.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Advantech\nEquipment: WebAccess\nVulnerabilities: SQL Injection, Out-of-Bounds Access, Multiple Buffer Overflows, Externally Controlled Format String, Improper Authentication, Incorrect Permission Assignment for Critical Resource, Incorrect Privilege Assignment, Uncontrolled Search Path Element.\nAFFECTED PRODUCTS\nThe following versions of WebAccess, an HMI platform, are affected:\n\nWebAccess versions prior to V8.2_20170817\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow remote code execution or unauthorized access and could cause the device that the attacker is accessing to crash.\nMITIGATION\nAdvantech has released a new version of WebAccess to address the reported vulnerabilities. Users can download WebAccess Version V8.2_20170817 at the following location (registration required):\nhttp://www.advantech.com/industrial-automation/webaccess\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND 'SQL INJECTION' CWE-89\n\nBy submitting a specially crafted parameter, it is possible to inject arbitrary SQL statements that could allow an attacker to obtain sensitive information.\nCVE-2017-12710 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\n\nResearchers have identified multiple vulnerabilities that allow invalid locations to be referenced for the memory buffer, which may allow an attacker to execute arbitrary code or cause the system to crash.\nCVE-2017-12708 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nResearchers have identified multiple vulnerabilities where there is a lack of proper validation of the length of user-supplied data prior to copying it to a stack-based buffer, which could allow an attacker to execute arbitrary code under the context of the process.\nCVE-2017-12706 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n\nHEAP-BASED BUFFER OVERFLOW CWE-122\n\nResearchers have identified multiple vulnerabilities where there is a lack of proper validation of the length of user-supplied data prior to copying it to the heap-based buffer, which could allow an attacker to execute arbitrary code under the context of the process.\nCVE-2017-12704 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n\nUSE OF EXTERNALLY-CONTROLLED FORMAT STRING CWE-134\n\nString format specifiers based on user provided input are not properly validated, which could allow an attacker to execute arbitrary code.\nCVE-2017-12702 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n\nIMPROPER AUTHENTICATION CWE-287\n\nSpecially crafted requests allow a possible authentication bypass that could allow remote code execution.\nCVE-2017-12698 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n\nINCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\n\nMultiple files and folders with ACLs that affect other users are allowed to be modified by non-administrator accounts.\nCVE-2017-12713 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n\nINCORRECT PRIVILEGE ASSIGNMENT CWE-266\n\nA built-in user account has been granted a sensitive privilege that may allow a user to elevate to administrative privileges.\nCVE-2017-12711 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nA maliciously crafted dll file placed earlier in the search path may allow an attacker to execute code within the context of the application.\nCVE-2017-12717 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:L).\nRESEARCHERS\nIndependent researcher Fritz Sands, independent researcher rgod, Tenable Network Security, and an anonymous researcher, all working with Trend Micro’s Zero Day Initiative, and Haojun Hou and DongWang from ADLab of Venustech identified these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Critical Manufacturing, Energy, Water and Wastewater\nCountries/Areas Deployed: East Asia, United States, Europe\nCompany Headquarters Location: Taiwan\n",
  "cves": [
    "CVE-2017-12708",
    "CVE-2017-12713",
    "CVE-2017-12698",
    "CVE-2017-12704",
    "CVE-2017-12717",
    "CVE-2017-12702",
    "CVE-2017-12711",
    "CVE-2017-12710",
    "CVE-2017-12706"
  ],
  "techniques": [],
  "advisory": "icsa-17-241-02",
  "title": "Advantech WebAccess | CISA",
  "source": "ics-advisories",
  "id": "d772821dfcb193216b3f4b678b5607a1070c0d209862b34d9207af4b1fd4d251"
}