{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: OSIsoft\nEquipment: PI System\nVulnerabilities: Uncontrolled Search Path Element, Improper Verification of Cryptographic Signature, Incorrect Default Permissions, Uncaught Exception, Null Pointer Dereference, Improper Input Validation, Cross-site Scripting, Insertion of Sensitive Information into Log File\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-133-02 OSIsoft PI System that was published May 12, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to access unauthorized information, delete or modify local processes, and crash the affected device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of PI System are affected:\nCVE-2020-10610, CVE-2020-10608, CVE-2020-10606:\n\nApplications using PI Asset Framework (AF) Client versions prior to and including PI AF Client 2018 SP3 Patch 1, Version 2.10.7.283\nApplications using PI Software Development Kit (SDK) versions prior to and including PI SDK 2018 SP1, Version 1.4.7.602\nPI API for Windows Integrated Security versions prior to and including 2.0.2.5,\nPI API versions prior to and including 1.6.8.26\nPI Buffer Subsystem versions prior to and including 4.8.0.18\nPI Connector for BACnet, versions prior to and including 1.2.0.6\nPI Connector for CygNet, versions prior to and including 1.4.0.17\nPI Connector for DC Systems RTscada, versions prior to and including 1.2.0.42\nPI Connector for Ethernet/IP, versions prior to and including 1.1.0.10\nPI Connector for HART-IP, versions prior to and including 1.3.0.1\nPI Connector for Ping, versions prior to and including 1.0.0.54\nPI Connector for Wonderware Historian, versions prior to and including 1.5.0.88\nPI Connector Relay, versions prior to and including 2.5.19.0\nPI Data Archive versions prior to and including PI Data Archive 2018 SP3, Version 3.4.430.460\nPI Data Collection Manager, versions prior to and including 2.5.19.0\nPI Integrator for Business Analytics versions prior to and including 2018 R2 SP1, Version 2.2.0.183\nPI Interface Configuration Utility (ICU) versions prior to and including 1.5.0.7\nPI to OCS versions prior to and including 1.1.36.0\n\n--------- Begin Update A Part 1 of 2 ---------\n\nPI Connector for IEC 60870-5-104, versions prior to and including 1.2.2.79\nPI Connector for OPC-UA, versions prior to and including 1.3.0.130\nPI Connector for Siemens Simatic PCS 7, versions prior to and including 1.2.1.71\nPI Connector for UFL, versions prior to and including 1.3.1.135\n\n--------- End Update A Part 1 of 2 ---------\nCVE-2020-10604, CVE-2020-10602: \n\nPI Data Archive 2018 and 2018 SP2 only\n\nCVE-2020-10600: \n\nPI Data Archive 2018 SP2 and prior versions\n\nCVE-2019-10768:\n\nPI Vision 2019 and prior\nPI Manual Logger 2017 R2 Patch 1 and prior\nRtReports Version 4.1 and prior\n\nCVE-2020-10600, CVE-2020-10614, CVE-2019-18244: \n\nPI Vision 2019 and prior versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED SEARCH PATH ELEMENT CWE-427\nA local attacker can modify a search path and plant a binary to exploit the affected PI System software to take control of the local computer at Windows system privilege level, resulting in unauthorized information disclosure, deletion, or modification.\nCVE-2020-10610 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    IMPROPER VERIFICATION OF CRYPTOGRAPHIC SIGNATURE CWE-347\nA local attacker can plant a binary and bypass a code integrity check for loading PI System libraries. This exploitation can target another local user of PI System software on the computer to escalate privilege and result in unauthorized information disclosure, deletion, or modification.\nCVE-2020-10608 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    INCORRECT DEFAULT PERMISSIONS CWE-276\nA local attacker can exploit incorrect permissions set by affected PI System software. This exploitation can result in unauthorized information disclosure, deletion, or modification if the local computer also processes PI System data from other users, such as from a shared workstation or terminal server deployment.\nCVE-2020-10606 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.4    UNCAUGHT EXCEPTION CWE-248\nA remote, unauthenticated attacker could crash PI Network Manager service through specially crafted requests. This can result in blocking connections and queries to PI Data Archive.\nCVE-2020-10604 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.5    NULL POINTER DEREFERENCE CWE-476\nAn authenticated remote attacker could crash PI Network Manager due to a race condition. This can result in blocking connections and queries to PI Data Archive.\nCVE-2020-10602 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n4.2.6    NULL POINTER DEREFERENCE CWE-476\nAn authenticated remote attacker could crash PI Archive Subsystem when the subsystem is working under memory pressure. This can result in blocking queries to PI Data Archive.\nCVE-2020-10600 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:L/A:H).\n4.2.7    IMPROPER INPUT VALIDATION CWE-20\nAn authenticated remote attacker could add or modify internal object properties, resulting in undefined behavior.\nCVE-2019-10768 and CVE-2019-11358 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.8    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nAn authenticated remote attacker could use specially crafted URLs to send a victim using PI Vision mobile to a vulnerable webpage due to a known issue in a third-party component.\nCVE-2020-10643 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n4.2.9    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nAn authenticated remote attacker with write access to PI Vision databases could inject code into a display. Unauthorized information disclosure, deletion, or modification is possible if a victim views the infected display.\nCVE-2020-10614 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:L/A:H).\n4.2.10    INSERTION OF SENSITIVE INFORMATION INTO LOG FILE CWE-532\nA local attacker could view sensitive information in log files when service accounts are customized during installation or upgrade of PI Vision. The update fixes a previously reported issue.\nCVE-2019-18244 has been assigned to this vulnerability. A CVSS v3 base score of 5.1 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nWilliam Knowles, Senior Security Consultant at Applied Risk, working with OSIsoft, reported vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 --------- \nOSIsoft provides the following security updates to mitigate the reported vulnerabilities:\nOSIsoft reports further action should be taken after applying the security updates. Remove PI Asset Framework (AF) Client .NET 3.5 after verifying OSIsoft products that include the PI AF Client, such as PI ProcessBook, PI DataLink and other PI System desktop applications have been upgraded to 2015 (as well as later versions) in order to eliminate exposure to CVE-2020-10608. \nFor PI System servers and interface nodes that are normally unattended, limit console and remote desktop logon access to authorized administrators.\nIndividual updates for core PI System components are available. Additionally, the following OSIsoft product installation kits have been re-released to automatically deliver the updated components:  \nClient\n\nPI DataLink\nPI OLEDB Enterprise\nPI OLEDB Provider\nPI ProcessBook\nPI System Management Tools\n\nServer\n\nPB Migration Utility\nPI Event Frames Generator\nPI Interface Configuration Utility\nPI OPC DA Server\nPI Vision\nPI to OCS\nRtReports \n\nConnectors\n\nPI Connector for BACnet\nPI Connector for DC Systems Rtscada\nPI Connector for Ethernet IP       \nPI Connector for IEC 60870-5-104\nPI Connector for OPC UA\nPI Connector for Ping\nPI Connector for SIMATIC PCS 7\nPI Connector for Wonderware Historian\n\nOSIsoft reports not all products have been rebundled to include the affected update. \nContact OSIsoft support for guidance on products missing that use affected components that are missing from the currently available releases.\n--------- End Update A Part 2 of 2 ---------\nCVE-2020-10610—Manage permissions on HKLM\\Software\\PISystem and HKLM\\WOW6432Node\\Software\\PISystem registry keys to block a high impact exploit path. See OSIsoft customer portal knowledge article PI System Registry Security Recommendations for details on setting registry permissions.\nCVE-2019-18244—Provision and use domain Group Managed Service Accounts or use the default NetworkService account to run PI Vision AppPools. There is no exposure to this vulnerability when using either of these account types. To limit exposure in case standard domain account is used to run PI Vision AppPools, remove the password entry from the setup log files immediately.\nOSIsoft reports the following measures can be used to lower likelihood of exploitation:\nCVE-2020-10610, CVE-2020-10608, CVE-2020-10606—Migrate standard users to PI Vision and browser-based access to PI System data.\nCVE-2020-10608—Restrict network connections from PI client workstations to trusted AF servers (TCP Port 5457).\nCVE-2020-10606—Disable unused PI Buffering services from PI client workstations (PI Buffer Subsystem, PI Buffer Server).\nCVE-2019-10768, CVE-2020-10600, CVE-2020-10614—Limit write access to PI Vision displays to trusted users.\nThe following measures can be used to lower the potential impact of exploitation:\nCVE-2020-10610 and CVE-2020-10608—Deploy application whitelisting solutions with enforcement for approved DLLs:\n\nWindows AppLocker\nWindows Defender Application Control\nCVE-2020-10610 and CVE-2020-10608—Monitor HKLM\\Software\\PISystem and HKLM\\WOW6432Node\\Software\\PISystem registry keys as well as ProgramData\\PISystem folder for unauthorized changes.\nSee OSIsoft customer portal knowledge article Monitoring PISystem Registry.\n\nFor a list of PI System firewall port requirements, see knowledge base article KB01162 - Firewall Port Requirements.\nCVE-2020-10604, CVE-2020-10602, CVE-2020-10600—Fully configure Windows authentication for the PI System and disable legacy authentication methods. For a starting point on PI System security best practices, see knowledge base article KB00833 - Seven best practices for securing your PI Server.\nFor more information and workaround details for these vulnerabilities, please refer to OSIsoft’s Security Bulletin (registration required): OSIsoft Updates PI System and Common Components.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-10610",
    "CVE-2019-10768",
    "CVE-2020-10604",
    "CVE-2020-10643",
    "CVE-2020-10600",
    "CVE-2019-11358",
    "CVE-2020-10606",
    "CVE-2020-10608",
    "CVE-2019-18244",
    "CVE-2020-10602",
    "CVE-2020-10614"
  ],
  "techniques": [],
  "advisory": "icsa-20-133-02",
  "title": "OSIsoft PI System (Update A) | CISA",
  "source": "ics-advisories",
  "id": "c934bf5109455a8133cd1dc26e9497daecea5ae59b18173620d3d926b927d487"
}