{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Nortek\nEquipment: Linear eMerge E3 Series\nVulnerability: Command Injection\nAFFECTED PRODUCTS\nThe following Linear eMerge, an access control interface, versions are affected:\n\nLinear eMerge E3 series Versions V0.32-07e and prior.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a remote attacker to execute malicious code on the system with elevated privileges, allowing for full control of the server.\nMITIGATION\nNortek recommends that affected users upgrade by following the process outlined on Page 47 of the E3 User Programming Guide.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \nVULNERABILITY OVERVIEW\n\nIMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\n\nA remote attacker may be able to execute arbitrary code on a target machine with elevated privileges.\nCVE-2018-5439 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nRESEARCHER\n\nEvgeny Ermakov and Sergey Gordeychik reported the vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sector: Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Italy\n",
  "cves": [
    "CVE-2018-5439"
  ],
  "techniques": [],
  "advisory": "icsa-18-046-01",
  "title": "Nortek Linear eMerge E3 Series | CISA",
  "source": "ics-advisories",
  "id": "f69d8c2b0847ca6f7eb67ee4dde404b8158a1029f8764dd9ee9b8e805335123b"
}