{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Mitsubishi Electric \nEquipment: MELSEC iQ-R Series \nVulnerability: Improper Input Validation \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote unauthenticated attacker to cause a denial-of-service condition on a target product by sending specially crafted packets. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Mitsubishi Electric MELSEC iQ-R Series products are affected: \n\nRJ71EN71: Firmware version “65” and prior \nR04/08/16/32/120ENCPU: Network part firmware version “65” and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER INPUT VALIDATION CWE-20 \nMELSEC iQ-R Series RJ71EN71 products with firmware versions prior to “65” and R04/08/16/32/120ENCPU products with Network firmware versions prior to “65” are vulnerable to improper input validation. A remote unauthenticated user could cause a denial-of-service condition on a target product by sending specially crafted packets. A system reset is required to recover from a denial-of-service condition. \nCVE-2022-40265 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Japan \n\n3.4 RESEARCHER\nMitsubishi Electric reported this vulnerability to CISA. \n4. MITIGATIONS\nMitsubishi Electric has fixed the vulnerability in the following MELSEC iQ-R Series products: \n\nRJ71EN71: Update firmware version to “66” or later. \nR04/08/16/32/120ENCPU: Update network part firmware version to “66” or later. \n\nUsers should refer to the following product manual for instructions to update firmware: \n\nMELSEC iQ-R Module Configuration Manual “Firmware Update Function.” \n\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risk of an unauthenticated user exploiting this vulnerability: \n\nUse a firewall, virtual private network (VPN), etc. to prevent unauthorized access when internet access is required. \nUse the product within a local area network (LAN)  \nBlock access from untrusted networks and hosts through firewalls. \nUse the IP filter function to restrict the accessible IP addresses. \n\nNote: For using the IP filter function, users should see MELSEC iQ-R Ethernet User’s Manual (Application) Security “IP filter” \nUsers can refer to the Mitsubishi Electric advisory for further details.  \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2022-40265"
  ],
  "techniques": [],
  "advisory": "icsa-22-335-01",
  "title": "Mitsubishi Electric MELSEC iQ-R Series | CISA",
  "source": "ics-advisories",
  "id": "6ee896f21bf1fbe0a5f778ad7f4f5e73ba903a16600eb4b9622c686e1dd36ee0"
}