{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable from the same local network segment (OSI Layer 2)\nVendor: Siemens\nEquipment: SCALANCE X switches, RUGGEDCOM Win, RFID 181-EIP, and SIMATIC RF182C\nVulnerability: Heap-based Buffer Overflow \n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-18-165-01 Siemens SCALANCE X Switches, RUGGEDCOM WiMAX, RFID 181-EIP, and SIMATIC RF182C (Update B) that was published June 11, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nBy sending a specially crafted DHCP response to a client’s DHCP request, an unprivileged remote attacker could execute arbitrary code.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports the vulnerability affects the following products:\n\nRFID 181-EIP: All versions\nRUGGEDCOM Win: v4.4, v4.5, v5.0, and v5.1\nSCALANCE X-200 switch family (incl. SIPLUS NET variants): All versions prior to v5.2.3\nSCALANCE X-200 IRT switch family (incl. SIPLUS NET variants): All versions prior to v5.4.1\nSCALANCE X-200RNA: All versions prior to v3.2.6\nSCALANCE X-300 switch family (incl. SIPLUS NET variants): All versions prior to v4.1.3 \nSCALANCE X408: All versions prior to v4.1.3\nSCALANCE X414: All versions\nSIMATIC RF182C: All versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nUnprivileged remote attackers located in the same local network segment (OSI Layer 2) could gain remote code execution on the affected products by sending a specially crafted DHCP response to a client’s DHCP request. \nCVE-2018-4833  has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, and Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nDr. Ang Cui and Joseph Pantoga from Red Balloon Security reported this vulnerability to Siemens Product CERT. Artem Zinenko from Kaspersky identified that SIPLUS should also be mentioned.\n5. MITIGATIONS\nSiemens has provided updates for the following products to fix the vulnerability:\n\nRUGGEDCOM Win: Update to v5.2\nSCALANCE X-200: Update to v5.2.3\nSCALANCE X-200 IRT: Update to v5.4.1\nSCALANCE X-200RNA: Update to v3.2.6\nSCALANCE X-300 & SCALANCE X408: Update to v4.1.3\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nUse static IP addresses instead of DHCP\nApply cell protection concept.\nApply Defense-in-Depth.\n\n--------- Begin Update D Part 1 of 1 ---------\n\nFor SIMATIC RF182C and RFID 181EIP: Migrate to a successor product within the SIMATIC RF18xC/CI family, v1.3 or later version. For details refer to the phase-out announcement.\n\n--------- End Update D Part 1 of 1 ---------\nAs a general security measure, Siemens strongly recommends users protect network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends users configure the environment according to Siemens’ operational guidelines for Industrial Security, and follow the recommendations in the product manuals.\nAdditional information on Industrial Security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and associated software updates, please see Siemens security advisory SSA-181018 \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-4833"
  ],
  "techniques": [],
  "advisory": "icsa-18-165-01",
  "title": "Siemens SCALANCE X Switches, RUGGEDCOM WiMAX, RFID 181-EIP, and SIMATIC RF182C (Update D) | CISA",
  "source": "ics-advisories",
  "id": "0934fb9183a8a30ecb320a53da0314c5c8c1f36df3d07636d79e505a04be84c8"
}