{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\n\n--------- Begin Update A Part 1 of 5 ---------\n\nVendor: AVEVA and Schneider Electric\nEquipment: AVEVA’s Vijeo Citect and Citect SCADA; Schneider Electric’s Power SCADA Operation\n\n--------- End Update A Part 1 of 5 ---------\n\nVulnerability: Stack-based Buffer Overflow\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled “ICSA-19-290-01 AVEVA Vijeo Citect and Citect SCADA” that was published October 17, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\n--------- Begin Update B Part 2 of 5 ---------\nThe IEC870IP driver for AVEVA’s Vijeo Citect and Citect SCADA and Schneider Electric’s Power SCADA Operation has a buffer overflow vulnerability that could result in a server-side crash.\n--------- End Update B Part 2 of 5 ---------\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update B Part 3 of 5 ---------\nThe following versions of the IEC870IP driver used in AVEVA’s Vijeo Citect and Citect SCADA and Schneider Electric’s Power SCADA Operation are affected:\n\nIEC870IP driver v4.14.02 and prior\n\n--------- End Update B Part 3 of 5 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\n--------- Begin Update B Part 4 of 5 ---------\nThe IEC870IP driver for AVEVA’s Vijeo Citect, Citect SCADA, and Schneider Electric’s Power SCADA Operation has a buffer overflow that could result in a server-side crash. This vulnerability impacts only the IEC870IP driver and not the core Vijeo Citect, Citect SCADA, or Power SCADA Operation software.\n--------- End Update B Part 4 of 5 ---------\nCVE-2019-13537 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n4.4 RESEARCHER\nVAPT Team, C3i Center, IIT Kanpur, India reported this vulnerability to AVEVA.\n5. MITIGATIONS\nVijeo Citect and Citect SCADA users using the IEC870IP driver v4.14.02 and prior are affected and should upgrade to the IEC870IP driver v4.15.00 (sign in required) as soon as possible.\nFor addition information please see AVEVA Security Bulletin LFSEC00000139.\nFor information on how to reach AVEVA support, please refer to this link (sign in required): AVEVA Software Global Customer Support.\n--------- Begin Update B Part 5 of 5 ---------\nPower SCADA Operation users of the IEC870IP driver v4.14.02 and prior are affected and should upgrade to the IEC870IP driver v4.15.00 as soon as possible.\nFor additional information please see Schneider Electric’s security notification SEVD-2019-344-04.\nFor further information related to cybersecurity in Schneider Electric’s products, please visit the company’s cybersecurity webpage at: Schneider Electric Cybersecurity.\n--------- End Update B Part 5 of 5 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13537"
  ],
  "techniques": [],
  "advisory": "icsa-19-290-01",
  "title": "AVEVA Vijeo Citect and Citect SCADA (Update A) | CISA",
  "source": "ics-advisories",
  "id": "13721a3dc85b8a3062a448cfaed2e4229d8c2790b6a0ec7d8b226d82978996b5"
}