{
  "markdown": " ABB Panel Builder 800 \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryABB Panel Builder 800===================== Last Revised July 17, 2018 Alert Code ICSA\\-18\\-198\\-011\\. EXECUTIVE SUMMARY---------------------* **CVSS v3 7\\.0*** **Vendor:**  ABB* **Equipment:**  Panel Builder 800* **Vulnerability:**  Improper Input Validation2\\. RISK EVALUATION------------------- An attacker could exploit the vulnerability by tricking a user to open a specially crafted file, allowing the attacker to insert and run arbitrary code. This vulnerability requires user interaction, and the exploit is only triggered when a local user runs the affected product and loads the specially crafted file.3\\. TECHNICAL DETAILS---------------------### 3\\.1 AFFECTED PRODUCTS The following versions of Panel Builder 800, an engineering tool for the process panels included in the product suite Panel 800, are affected:* Panel Builder 800, all versions.### 3\\.2 VULNERABILITY OVERVIEW#### 3\\.2\\.1 [IMPROPER INPUT VALIDATION CWE\\-20](https://cwe.mitre.org/data/definitions/20.html) An improper input validation vulnerability has been identified, which may allow an attacker to insert and run arbitrary code on a computer where the affected product is used.[CVE\\-2018\\-10616](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2018-10616)  has been assigned to this vulnerability. A CVSS v3 base score of 7\\.0 has been calculated; the CVSS vector string is ( [AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H)  ).### 3\\.3 BACKGROUND* **CRITICAL INFRASTRUCTURE SECTORS:**  Chemical, Critical Manufacturing, Energy, Dams, Water and Wastewater, and Food and Agriculture* **COUNTRIES/AREAS DEPLOYED:**  Worldwide* **COMPANY HEADQUARTERS LOCATION:**  Switzerland### 3\\.4 RESEARCHER Michael DePlante of Leahy Center and Michael Flanders of Trend Micro, both working with Trend Micro’s Zero Day Initiative, reported this vulnerability to ABB. ABB reported it to NCCIC.4\\. MITIGATIONS--------------- ABB is currently investigating this vulnerability and recommends users follow these suggestions until a corrected version is available. Recommended security practices and firewall configurations can help protect a process control network from attacks that originate from outside the network. Such practices include:* Conduct or reinforce cybersecurity awareness training for users of Panel Builder 800:\t+ Describing general cybersecurity best practice recommendations for industrial control systems,\t+ Informing that it is possible to infect Panel Builder files with malware,\t+ Describing the importance of being careful with files that are received unexpectedly and/or from unexpected sources.* Carefully inspecting any files transferred between computers, including scanning them with up\\-to\\-date antivirus software, so that only the legitimate files are being transferred.* User account management, appropriate authentication and permission management using the principle of least privilege. Please see the following cybersecurity advisory on the ABB website for more information:[http://search\\-ext.abb.com/library/Download.aspx?DocumentID\\=3BSE092089\\&Action\\=Launch](http://search-ext.abb.com/library/Download.aspx?DocumentID=3BSE092089&Action=Launch)  NCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure that they are [not accessible from the Internet](/ics/alerts/ICS-ALERT-10-301-01)  .* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. NCCIC also provides a section for [control systems security recommended practices](/ics/content/recommended-practices)  on the ICS\\-CERT web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . Additional mitigation guidance and recommended practices are publicly available on the [ICS\\-CERT website](/ics/)  in the Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents. No known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* ABB-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-18-198-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2018-10616"
  ],
  "techniques": [],
  "advisory": "icsa-18-198-01",
  "title": "ABB Panel Builder 800 | CISA",
  "source": "ics-advisories",
  "id": "e62a5868eca64388f29c4ec1ecb7bcbd52ea454e2ef8d63115d40d91f0602cd4"
}