{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.7\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Motorola Solutions\nEquipment: Vigilant Fixed LPR Coms Box (BCAV1F2-C600)\nVulnerabilities: Authentication Bypass Using an Alternate Path or Channel, Cleartext Storage in a File or on Disk, Use of Hard-coded Credentials, Insufficiently Protected Credentials, Missing Encryption of Sensitive Data, Authentication Bypass by Capture-replay\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to tamper with the device, access sensitive information and credentials, or perform a replay attack.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Motorola Vigilant License Plate Readers are affected:\n\nVigilant Fixed LPR Coms Box (BCAV1F2-C600): Versions 3.1.171.9 and prior\n\n3.2 Vulnerability Overview\n3.2.1 AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nThe affected product is vulnerable to an attacker modifying the bootloader by using custom arguments to bypass authentication and gain access to the file system and obtain password hashes.\nCVE-2024-38279 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-38279. A base score of 5.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:P/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.2.2 CLEARTEXT STORAGE IN A FILE OR ON DISK CWE-313\nAn unauthorized user is able to gain access to sensitive data, including credentials, by physically retrieving the hard disk of the product as the data is stored in clear text.\nCVE-2024-38280 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-38280. A base score of 7.0 has been calculated; the CVSS vector string is (CVSS4.0/AV:P/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.3 USE OF HARD-CODED CREDENTIALS CWE-798\nAn attacker can access the maintenance console using hard coded credentials for a hidden wireless network on the device.\nCVE-2024-38281 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-38281. A base score of 8.6 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.4 INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nUtilizing default credentials, an attacker is able to log into the camera's operating system which could allow changes to be made to the operations or shutdown the camera requiring a physical reboot of the system.\nCVE-2024-38282 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-38282. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.5 MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nSensitive customer information is stored in the device without encryption.\nCVE-2024-38283 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-38283. A base score of 5.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:P/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.2.6 AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nTransmitted data is logged between the device and the backend service. An attacker could use these logs to perform a replay attack to replicate calls.\nCVE-2024-38284 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-38284. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.7 INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nLogs storing credentials are insufficiently protected and can be decoded through the use of open source tools.\nCVE-2024-38285 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-38285. A base score of 7.0 has been calculated; the CVSS vector string is (CVSS4.0/AV:P/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Emergency Services\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nThe Michigan State Police Michigan Cyber Command Center (MC3) reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMotorola Solutions recommends the following for each identified vulnerability:\nCVE-2024-38279:\n\nUse secure boot implementation with an edit-resistant GRUB partition.\nAdditional mitigation consists in limiting the physical access to the device by following the best practices for device mounting.\n\nEdit-resistant grub partition has been remediated for all vulnerable systems. Motorola Solutionswill release a secure boot implementation in Fall 2024. All customers will receive the updatethrough OTA (over the air) mechanisms. No further actions are required by customers.\nCVE-2024-38280:\n\nApply encryption to all Criminal Justice Information (CJI) data.\nApply full disk encryption with LUKS encryption standards and add password protectionto the GRUB Bootloader.\nPerform column-level encryption for sensitive data in the database.\n\nAll devices shipped after May 10, 2024 are already using full disk encryption. All devices thatare not able to have full disk encryption applied have had all CJI data encrypted. No furtheractions are required by customers.\nCVE-2024-38281:\n\nRemove the hard-coded credential to access the wireless access point and disable theaccess point if not needed.\nSet a unique SSID and password if the access point is needed.\n\nMotorola Solutions has already remediated this vulnerability for all vulnerable systems. No further actions are required by customers.\nCVE-2024-38282:\n\nRemove the hard coded credentials.\nUse a unique CJIS compliant password per device.\n\nMotorola Solutions has already remediated this vulnerability for all vulnerable systems. No further actions are required by customers.\nCVE-2024-38283:\n\nRemove the hotlist data from the device.\n\nMotorola Solutions has already remediated this vulnerability for all vulnerable systems. Nofurther actions are required by customers.\nCVE-2024-38284:\n\nDelete the log files.\nInstall updated software not logging the credentialed web request.\n\nMotorola Solutions has already remediated this vulnerability for all vulnerable systems. No further actions are required by customers.\nCVE-2024-38285:\n\nDelete the log files.\n\nMotorola Solutions has already remediated this vulnerability for all vulnerable systems. No further actions are required by customers.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJune 13, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-38280",
    "CVE-2024-38279",
    "CVE-2024-38285",
    "CVE-2024-38281",
    "CVE-2024-38284",
    "CVE-2024-38283",
    "CVE-2024-38282"
  ],
  "techniques": [],
  "advisory": "icsa-24-165-19",
  "title": "Motorola Solutions Vigilant License Plate Readers | CISA",
  "source": "ics-advisories",
  "id": "a2dc3289dcc361599c14064a9df604ba942cd0190a932223ce2e70866897201d"
}