{
  "markdown": "\nCVSS v3 8.1\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: NXP Semiconductors\nEquipment: MQX RTOS\nVulnerabilities: Classic Buffer Overflow, Out-of-Bounds Read\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-285-04 NXP Semiconductors MQX RTOS that was published October 12, 2017, on the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following versions of MQX Real-Time Operating System (RTOS) are used in NXP’s ColdFire microcontrollers, Kinetis microcontrollers, i.MX processors, and Vybrid processors, which are affected by the vulnerabilities listed below.\nVersions susceptible to Classic Buffer Overflow Vulnerability:\n\nMQX RTOS, Version 5.0 and prior versions, and\n\nVersions susceptible to Out-of-Bounds Read Vulnerability:\n\nMQX RTOS, Version 4.1 and prior versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow a remote attacker to cause a buffer overflow condition that may, in turn, cause remote code execution or out-of-bounds read conditions, resulting in a denial of service.\nMITIGATION\n--------- Begin Update A Part 1 of 1 --------\nNXP released MQX, Version 5.1 on January 31, 2018, which addresses both vulnerabilities.\n\nFor MQX users running versions older than 5.1, NXP has produced an update that can be obtained at the following location:\n\nhttp://www.nxp.com/mqxv5\n\nFor MQX users running Version 5.0, NXP recommends users update to version 5.1 or the latest version. Existing licensees will be contacted about the update. Users can also contact NXP directly via email at MQXsales@NXP.com to get additional information as needed. \nFor MQX users running Version 4.2 and prior versions, NXP recommends that users obtain a patch or update to Version 5.1, which does not contain the out-of-bounds read vulnerability. Please contact NXP via email at MQXsales@NXP.com to get additional information as needed.\n\n--------- End Update A Part 1 of 1 --------\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nBUFFER COPY WITHOUT CHECKING SIZE OF INPUT ('CLASSIC BUFFER OVERFLOW') CWE-120\n\nThe Real-Time TCP/IP Communications Suite (RTCS) in MQX’s DHCP client fails to sanitize all inputs, which may allow maliciously crafted DHCP packets to cause memory to be overwritten, allowing remote code execution.\nCVE-2017-12718 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nOUT-OF-BOUNDS READ CWE-125\n\nThe DNS client for MQX fails to bounds check DNS response parameters, which may allow maliciously crafted DNS packets to cause memory to be read out-of-bounds, resulting in a denial of service.\nCVE-2017-12722 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\nRESEARCHER\nScott Gayou identified and coordinated these vulnerabilities with NXP, CERT/CC, and NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Communications, Critical Manufacturing, Healthcare and Public Health, and Transportation\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Eindhoven, Netherlands\n",
  "cves": [
    "CVE-2017-12722",
    "CVE-2017-12718"
  ],
  "techniques": [],
  "advisory": "icsa-17-285-04a",
  "title": "NXP Semiconductors MQX RTOS (Update A) | CISA",
  "source": "ics-advisories",
  "id": "85de5f05f6e73b27326d7c03d09b111bfe8d080590eee1b0facde353c47f43f1"
}