{
  "markdown": "\nCVSS v3 10.0\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Rockwell Automation\nEquipment: Stratix 5900\nVulnerabilities: Improper Input Validation, Resource Management Errors, Improper Authentication, Path Traversal.\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on April 4, 2017, and is being released to the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nRockwell Automation reports that these vulnerabilities affect the following Stratix 5900 Services Routers:\n\nStratix 5900, All Versions prior to 15.6.3.\n\nIMPACT\nAn attacker who exploits these vulnerabilities may be able to perform man-in-the-middle attacks, create denial of service conditions, or remotely execute arbitrary code.\nMITIGATION\nRockwell Automation has provided a new firmware version, Version 15.6.3, to mitigate these vulnerabilities.\nRockwell Automation encourages users of the affected versions to update to the latest available software versions addressing the associated risk, and including improvements to further harden the software and enhance its resilience against similar malicious attacks. Users can find the latest firmware version by searching for their device at the following web site:\nhttp://compatibility.rockwellautomation.com/Pages/MultiProductDownload.aspx?famID=15\nAdditional precautions and risk mitigation strategies specific to these types of attacks are recommended in the Rockwell Automation security release. When possible, multiple strategies should be implemented simultaneously.\nhttps://rockwellautomation.custhelp.com/app/answers/detail/a_id/1041191\nPlease also refer to Cisco’s security advisories (linked below) for additional workarounds and details for these vulnerabilities.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION CWE-20\n\nCisco IOS and IOS XE Software DNS Forwarder Denial of Service Vulnerability.\nCVE-2016-6380 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:L/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS and IOS XE Software AAA Login Denial of Service Vulnerability.\nCVE-2016-6393 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:L/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS and IOS XE Software H.323 Message Validation Denial of Service Vulnerability.\nCVE-2016-6384 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS and IOS XE Software Internet Key Exchange Version 1 Fragmentation Denial of Service Vulnerability.\nCVE-2016-6381 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS and IOS XE Software Multicast Routing Denial of Service Vulnerabilities.\nCVE-2016-6382 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nINFORMATION EXPOSURE CWE-200\n\nIKEv1 Information Disclosure Vulnerability in Multiple Cisco Products.\nCVE-2016-6415 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N).\n\nINPUT VALIDATION CWE-20 \n\nCisco Products IPv6 Neighbor Discovery Crafted Packet Denial of Service Vulnerability.\nCVE-2016-1409 has been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:L).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS and IOS XE and Cisco Unified Communications Manager Software Session Initiation Protocol Memory Leak Vulnerability.\nCVE-2016-1350 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS and IOS XE Software Internet Key Exchange Version 2 Fragmentation Denial of Service Vulnerability.\nCVE-2016-1344 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nINTEGER OVERFLOW OR WRAPAROUND CWE 190\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nIMPROPER INPUT VALIDATION CWE-20\nPATH TRAVERSAL CWE-22\nPERMISSIONS, PRIVILEGES, AND ACCESS CONTROLS CWE-264\nIMPROPER AUTHENTICATION CWE-287\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nMultiple Vulnerabilities in ntpd Affecting Cisco Products - October 2015.\nCVE-2015-7691, CVE-2015-7692, CVE-2015-7701, CVE-2015-7702, CVE-2015-7703, CVE-2015-7704, CVE-2015-7705, CVE-2015-7848, CVE-2015-7849, CVE-2015-7850, CVE-2015-7851, CVE-2015-7852, CVE-2015-7853, CVE-2015-7854, CVE-2015-7855, and CVE-2015-7871 have been assigned to these vulnerabilities. A CVSS v3 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:L/A:L).\n\nIMPROPER AUTHENTICATION CWE-287\n\nMultiple Vulnerabilities in ntpd (April 2015) Affecting Cisco Products.\nCVE-2015-1798  and CVE-2015-1799 have been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:L/A:N).\n\nINPUT VALIDATION CWE 20\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software and IOS XE Software Internet Key Exchange Version 2 Denial of Service Vulnerabilities.\nCVE-2015-0642  and CVE-2015-0643 have been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software and IOS XE Software TCP Packet Memory Leak Vulnerability.\nCVE-2015-0646 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nIMPROPER INPUT VALIDATION CWE-20\nCRYPTOGRAPHIC ISSUES CWE 310\n\nMultiple Vulnerabilities in OpenSSL (March 2015) Affecting Cisco Products.\nCVE-2015-0207, CVE-2015-0209, CVE-2015-0285, CVE-2015-0287, CVE-2015-0288, CVE-2015-0289, CVE-2015-0290, CVE-2015-0291, CVE-2015-0292, CVE-2015-0293, and CVE-2015-1787 have been assigned to these vulnerabilities. A CVSS v3 base score of 4.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:N/A:N).\n\nCRYPTOGRAPHIC ISSUES CWE 310\n\nSSL Padding Oracle On Downgraded Legacy Encryption (POODLE) Vulnerability.\nCVE-2014-3566 has been assigned to this vulnerability. A CVSS v3 base score of 4.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:N/A:N).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software DHCP Version 6 Denial of Service Vulnerability.\nCVE-2014-3359 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software Metadata Vulnerabilities.\nCVE-2014-3355 and CVE-2014-3356 have been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nIMPROPER INPUT VALIDATION CWE-20\n\nCisco IOS Software Network Address Translation Denial of Service Vulnerability.\nCVE-2014-3361 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software RSVP Vulnerability.\nCVE-2014-3354 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nNUMERIC ERRORS CWE 189\n\nCisco IOS Software Session Initiation Protocol Denial of Service Vulnerability.\nCVE-2014-3360 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software IPsec Denial of Service Vulnerability.\nCVE-2014-3299 has been assigned to this vulnerability. A CVSS v3 base score of 7.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H).\n\nCRYPTOGRAPHIC ISSUES CWE-310\nRACE CONDITION CWE-362\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nRESOURCE MANAGEMENT ERRORS CWE-399\nNULL POINTER DEREFERENCE CWE-476\n\nMultiple Vulnerabilities in OpenSSL Affecting Cisco Products.\nCVE-2010-5298, CVE-2014-0076, CVE-2014-0195, CVE-2014-0198, CVE-2014-0221, CVE-2014-0224, and CVE-2014-3470 have been assigned to these vulnerabilities. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n\nIMPROPER INPUT VALIDATION CWE-20\n\nCisco IOS Software Crafted IPv6 Packet Denial of Service Vulnerability.\nCVE-2014-2113 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software Internet Key Exchange Version 2 Denial of Service Vulnerability.\nCVE-2014-2108 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nIMPROPER INPUT VALIDATION CWE-20\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software Network Address Translation Vulnerabilities.\nCVE-2014-2109 and CVE-2014-2111 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nIMPROPER INPUT VALIDATION CWE-20\n\nCisco IOS Software Session Initiation Protocol Denial of Service Vulnerability.\nCVE-2014-2106 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\n\nRESOURCE MANAGEMENT ERRORS CWE 399\n\nCisco IOS Software SSL VPN Denial of Service Vulnerability.\nCVE-2014-2112 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H).\nRESEARCHER\nCisco Systems, Inc. reported these vulnerabilities to Rockwell Automation.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Systems\nArea Deployed: Worldwide\nCompany Headquarters Location: United States\n",
  "cves": [
    "CVE-2015-7851",
    "CVE-2015-0642",
    "CVE-2016-6393",
    "CVE-2015-0646",
    "CVE-2015-7852",
    "CVE-2015-7871",
    "CVE-2015-7692",
    "CVE-2014-3566",
    "CVE-2015-7849",
    "CVE-2014-2111",
    "CVE-2014-0198",
    "CVE-2016-1344",
    "CVE-2015-0289",
    "CVE-2015-7702",
    "CVE-2010-5298",
    "CVE-2014-3299",
    "CVE-2014-3470",
    "CVE-2016-1409",
    "CVE-2016-6380",
    "CVE-2014-0221",
    "CVE-2015-1787",
    "CVE-2014-3356",
    "CVE-2015-7691",
    "CVE-2015-7705",
    "CVE-2015-7853",
    "CVE-2015-0291",
    "CVE-2014-3355",
    "CVE-2016-6382",
    "CVE-2015-0292",
    "CVE-2015-0288",
    "CVE-2016-6384",
    "CVE-2015-0293",
    "CVE-2015-0643",
    "CVE-2014-3359",
    "CVE-2015-7701",
    "CVE-2015-0207",
    "CVE-2015-0209",
    "CVE-2014-2109",
    "CVE-2014-3354",
    "CVE-2014-0076",
    "CVE-2015-7703",
    "CVE-2016-6415",
    "CVE-2014-3361",
    "CVE-2015-7850",
    "CVE-2015-1798",
    "CVE-2014-3360",
    "CVE-2015-7855",
    "CVE-2015-7848",
    "CVE-2014-2108",
    "CVE-2015-7704",
    "CVE-2015-0287",
    "CVE-2014-0195",
    "CVE-2014-2106",
    "CVE-2014-2112",
    "CVE-2014-0224",
    "CVE-2015-0290",
    "CVE-2016-1350",
    "CVE-2015-0285",
    "CVE-2015-7854",
    "CVE-2014-2113",
    "CVE-2016-6381",
    "CVE-2015-1799"
  ],
  "techniques": [],
  "advisory": "icsa-17-094-04",
  "title": "Rockwell Automation Stratix 5900 | CISA",
  "source": "ics-advisories",
  "id": "19d59aa5c91e50fbbe179f3c18515aebb83163ceff2d87487174aa98bb43e6c5"
}