{
  "markdown": "\nOVERVIEW\nIndependent researcher Zhou Yu has identified denial-of-service and unquoted service path privilege escalation vulnerabilities in Moxa’s DACenter application. Moxa has produced a patch to mitigate these vulnerabilities. Zhou Yu has tested the patch to validate that it resolves the vulnerabilities.\nThese vulnerabilities could be exploited remotely.\nAFFECTED PRODUCTS\nMoxa reports that the vulnerability affects the following versions of DACenter:\n\nVersions 1.4 and older.\n\nIMPACT\nThe vulnerabilities may render the DACenter application unavailable and also allow an authorized but nonprivileged local user to execute arbitrary code with privileges on the system.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nMoxa is a Taiwan-based company that maintains offices in several countries around the world, including the US, UK, India, Germany, France, China, Russia, and Brazil.\nThe affected product, DACenter, provides a standard OPC interface that interacts with Moxa Active OPC Server for real-time data collection. According to Moxa, DACenter is deployed across several sectors including Commercial Facilities, Critical Manufacturing, Energy, Water and Wastewater Systems, and others. Moxa estimates that this product is used primarily in the United States and Europe with a small percentage in Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nRESOURCE EXHAUSTIONCWE-400: Uncontrolled Resource Consumption ('Resource Exhaustion'), https://cwe.mitre.org/data/definitions/400.html, web site last accessed December 13, 2016.\n\nA specially crafted project file may cause the program to crash.\nCVE-2016-9354NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9354, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H, web site last accessed December 13, 2016.\n\nUNQUOTED SEARCH PATH OR ELEMENTCWE-428: Unquoted Search Path or Element, https://cwe.mitre.org/data/definitions/428.html, web site last accessed December 13, 2016.\n\nThe application may suffer from an unquoted search path issue.\nCVE-2016-9356NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9356, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H, web site last accessed December 13, 2016.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nMoxa recommends replacing existing DACenter installations with the new software MX-AOPC UA suite. DACenter is nearing end-of-life by the end of 2016, and no further updates will be issued.\nFor existing DACenter installations, Moxa recommends contacting the Moxa Technical Support team or visiting the Moxa technical support web page at:\nhttp://www.moxa.com/support\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-9356",
    "CVE-2016-9354"
  ],
  "techniques": [],
  "advisory": "icsa-16-348-02",
  "title": "Moxa DACenter Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "45374c84bf02a61be9ad023291e4b045a8beec2247f82fb2a03e267200f54d0a"
}