{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity \nVendor: Delta Electronics \nEquipment: DIAScreen \nVulnerabilities: Stack-based Buffer Overflow, Improper Restriction of Operations within the Bounds of a Memory Buffer, Out-of-bounds Write \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DIAScreen, a software configuration tool for Delta devices, are affected: \n\nDIAScreen: versions 1.2.1.23 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 STACK-BASED BUFFER OVERFLOW CWE-121 \nDelta Electronics DIAScreen versions 1.2.1.23 and prior are vulnerable to a stack-based buffer overflow, which could allow an attacker to remotely execute arbitrary code. \nCVE-2023-0250 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.2 IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119 \nDelta Electronics DIAScreen versions 1.2.1.23 and prior are vulnerable to a buffer overflow through improper restrictions of operations within memory, which could allow an attacker to remotely execute arbitrary code. \nCVE-2023-0251 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.3 OUT-OF-BOUNDS WRITE CWE-787 \nDelta Electronics DIAScreen versions 1.2.1.23 and prior are vulnerable to an out-of-bounds write, which could allow an attacker to remotely execute arbitrary code. \nCVE-2023-0249 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Taiwan \n\n3.4 RESEARCHER\nNatnael Samson (@NattiSamson) and YuLin Sung, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA. \n4. MITIGATIONS\nDelta Electronics released version 1.3.0 of DIAScreen (login required) and recommends users install this update on all affected systems. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.  \n",
  "cves": [
    "CVE-2023-0251",
    "CVE-2023-0249",
    "CVE-2023-0250"
  ],
  "techniques": [],
  "advisory": "icsa-23-033-01",
  "title": "Delta Electronics DIAScreen | CISA",
  "source": "ics-advisories",
  "id": "83b5c2a0149958f3362b8ad65bc1c776c0c01ab040037463e5c70c3a93c63643"
}