{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Eaton\nEquipment: HMiSoft VU3 (HMIVU3 runtime not impacted)\nVulnerabilities: Stack-based Buffer Overflow, Out-of-bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device being accessed and may allow remote code execution or information disclosure.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of HMiSoft VU3, a HMI Operator Interface, are affected:\n\nHMiSoft VU3 Version 3.00.23 and prior, however, the HMIVU runtimes are not impacted by these issues.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nA specially crafted input file could cause a buffer overflow when loaded by the affected product.\nCVE-2020-10639 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    OUT-OF-BOUNDS READ CWE-125\nA specially crafted input file could trigger an out-of-bounds read when loaded by the affected product.\nCVE-2020-10637 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nNatnael Samson (@NattiSamson) working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nEaton ceased manufacturing the HMiVU on December 31, 2018, and marked the HMiVU software as end of life. As a result, Eaton no longer provides technical support, security fixes, or other fixes for the HMiVU software. To better serve users and provide ongoing replacement solutions, HMiVU was replaced with the XV100 and XV300 lines of operator interface products. It is strongly recommended HMiVU users contact Eaton for technical support and migration assistance to the XV solution.\nNOTE: Eaton has discontinued the HMiVU product and has asked users to upgrade.\nFor assistance with transitioning to XV, please work directly with the following contacts:\n\nAn Eaton sales contact\nEaton’s Technical Resource Center at 1-877-ETN-CARE (386-2273), Option 2, then Option 5\n\nInformation regarding the XV Product offering can be found via the following:\n\nwww.eaton.com/OI\nEaton Catalog—Volume 7, Tab 05\n\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not open untrusted files with industrial control systems devices.\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-10639",
    "CVE-2020-10637"
  ],
  "techniques": [],
  "advisory": "icsa-20-105-01",
  "title": "Eaton HMiSoft VU3 | CISA",
  "source": "ics-advisories",
  "id": "8972ba81e61b6141b66a37f208d6a06e72f15b701570ff04943367bbc3b8499c"
}