{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low attack complexity\nVendor: Siemens\nEquipment: SIMATIC Software Products\nVulnerability: Incorrect Permission Assignment for Critical Resource\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-194-06 Siemens SIMATIC Software Products (Update A) that was published July 13, 2021, to the ICS webpage on cisa.gov/ics\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to manipulate parameters or the behavior of devices configured by the affected software products.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports this vulnerability affects the following SIMATIC software products:\n\nSIMATIC PCS 7 V8.2 and earlier: All versions\n\n--------- Begin Update B Part 1 of 2 ---------\n\nSIMATIC PCS 7 V9.X: All versions prior to V9.1 SP2\nSIMATIC PDM: All versions prior to V9.2 SP2\n\n--------- End Update B Part 1 of 2 ---------\n\nSIMATIC STEP 7 V5.X: All versions prior to v5.7\nSINAMICS STARTER (containing STEP 7 OEM version): All versions prior to 5.4 SP2 HF1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nAn attacker could change the content of certain metafiles and subsequently manipulate parameters or the behavior of devices that would be later configured by the affected software.\nCVE-2021-31894 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:H/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n5. MITIGATIONS\nSiemens has released updates for the following product:\n--------- Begin Update B Part 2 of 2 ---------\n\nSIMATIC PCS 7 V9.X: Update to V9.1 SP2 or later\nSIMATIC PDM: Update to V9.2 SP2 or later\nSIMATIC STEP 7 v5.X: Update to V5.7 or later\n\n--------- End Update B Part 2 of 2 ---------\n\nSINAMICS STARTER (containing STEP 7 OEM version): Update to v5.4 SP2 HF1 or later.\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nRestrict access to engineering stations to trusted users only\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens Operational Guidelines for Industrial Security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nPlease see Siemens Security Advisory ssa-661034 for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-31894"
  ],
  "techniques": [],
  "advisory": "icsa-21-194-06",
  "title": "Siemens SIMATIC Software Products (Update B) | CISA",
  "source": "ics-advisories",
  "id": "db85b077169821fe7fc3245cfc74b11495b1d6a3ff1c1559061ad43ff71f2386"
}