{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nVendor: Rockwell Automation \nEquipment: FactoryTalk Alarm and Events Server \nVulnerability: Improper Access Control \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in a denial-of-service condition causing the server to be unavailable. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports this vulnerability affects the following FactoryTalk Alarm and Events Server:  \n\nFactoryTalk Alarm and Events Server: All versions \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER ACCESS CONTROL CWE-284 \nAn unauthenticated attacker with network access to a victim's Rockwell Automation FactoryTalk Alarm and Events service could open a connection, causing the service to fault and become unavailable. The affected port could be used as a server ping port and uses messages structured with XML. \nCVE-2022-38744 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Food and Agriculture, Water and Wastewater Systems \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nKaspersky Labs reported this vulnerability to Rockwell Automation. \n4. MITIGATIONS\nRockwell Automation recommends users of the affected software set up IPsec to mitigate this issue as detailed in the deploying FactoryTalk software with IPsec Knowledgebase article. Customers are also directed towards general risk mitigation strategies provided in the Recommended Security Guidelines Knowledgebase Article. \nFor more information, users should see Rockwell Automation’s Security advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable remotely. This vulnerability has a low attack complexity. \n",
  "cves": [
    "CVE-2022-38744"
  ],
  "techniques": [],
  "advisory": "icsa-22-300-01",
  "title": "Rockwell Automation FactoryTalk Alarm and Events Server | CISA",
  "source": "ics-advisories",
  "id": "9444787f5346edb66458d8cc6adbdd299325d909f110fe957ac8b247e9898b9a"
}