{
  "markdown": "\nCVSS v3 8.2\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: PHOENIX CONTACT\nEquipment: FL COMSERVER, FL COM SERVER, and PSI-MODEM/ETH\nVulnerability: Cross-site Scripting\nAFFECTED PRODUCTS\nThe following models running firmware versions prior to 1.99, 2.20, or 2.40 of FL COMSERVER, FL COM SERVER, and PSI-MODEM/ETH, industrial networking equipment, are affected:\n\nFL COMSERVER BASIC 232/422/485,\nFL COMSERVER UNI 232/422/485,\nFL COMSERVER BAS 232/422/485-T,\nFL COMSERVER UNI 232/422/485-T,\nFL COM SERVER RS232,\nFL COM SERVER RS485, and\nPSI-MODEM/ETH.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow a remote attacker to change configuration variables on the device.\nMITIGATION\nPHOENIX CONTACT has released new firmware versions for the affected devices. The latest download links can be found at:\nhttps://cert.vde.com/de-de/advisories/vde-2017-004\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\n\nThe cross-site scripting vulnerability has been identified, which may allow remote code execution.\nCVE-2017-16723 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:N/I:L/A:H).\nRESEARCHER\nMaxim Rupp reported the vulnerability to ICS-CERT. CERT@VDE coordinated the disclosure with Mr. Rupp and ICS-CERT.\nBACKGROUND\nCritical Infrastructure Sectors: Communications, Critical Manufacturing, Information Technology\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-16723"
  ],
  "techniques": [],
  "advisory": "icsa-17-341-03",
  "title": "PHOENIX CONTACT FL COMSERVER, FL COM SERVER, and PSI-MODEM/ETH | CISA",
  "source": "ics-advisories",
  "id": "ef2eacbfe73d1c1936799dd4e7806584f38dc3f04d495de15fc9a5e5a709de5c"
}