{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Nucleus RTOS based APOGEE and TALON Products\nVulnerabilities: Type Confusion, Improper Validation of Specified Quantity in Input, Out-of-bounds Read, Improper Restriction of Operations within the Bounds of a Memory Buffer, Improper Null Termination, Buffer Access with Incorrect Length Value, Integer Underflow, Improper Handling of Inconsistent Structural Elements\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-315-07 Siemens Nucleus RTOS-based APOGEE and TALON Products (Update B) that was published April 14, 2022, on the ICS webpage at cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow denial-of-service conditions, remote code execution, information leaks, and out-of-bounds reads and writes.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Nucleus RTOS based APOGEE and TALON Products, direct digital control (DDC) devices, are affected:\n\nAPOGEE MBC (PPC) (BACnet): All versions\nAPOGEE MBC (PPC) (P2 Ethernet): All versions\nAPOGEE MEC (PPC) (BACnet): All versions\nAPOGEE MEC (PPC) (P2 Ethernet): All versions\n\n--------- Begin Update C Part 1 of 2 ---------\n\nAPOGEE PXC Compact (BACnet): All versions prior to v3.5.4\nAPOGEE PXC Compact (P2 Ethernet): All versions prior to v2.8.19\nAPOGEE PXC Modular (BACnet): All versions prior to v3.5.4\nAPOGEE PXC Modular (P2 Ethernet): All versions prior to v2.8.19\nDesigo PXC00-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC00-U: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC001-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC12-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC22-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC22.1-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC36.1-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC50-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC64-U: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC100-E.D: Versions 2.3 and later and prior to v6.30.016 \nDesigo PXC128-U: Versions 2.3 and later and prior to v6.30.016\nDesigo PXC200-E.D: Versions 2.3 and later and prior to v6.30.016\nDesigo PXM20-E: Versions 2.3 and later and prior to v6.30.016\nTALON TC Compact (BACnet): All versions prior to v3.5.4\nTALON TC Modular (BACnet): All versions prior to v3.5.4\n\n--------- End Update C Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nICMP echo packets with fake IP options allow sending ICMP echo reply messages to arbitrary hosts on the network.\nCVE-2021-31344 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n4.2.2    IMPROPER VALIDATION OF SPECIFIED QUANTITY IN INPUT CWE-1284\nThe total length of an UDP payload (set in the IP header) is unchecked. This may lead to various side effects, including information leaks, depending on a user-defined application that runs on top of the UDP protocol.\nCVE-2021-31345 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.3    IMPROPER VALIDATION OF SPECIFIED QUANTITY IN INPUT CWE-1284\nThe total length of an ICMP payload (set in the IP header) is unchecked. This may lead to various side effects, including information leaks and denial-of-service conditions, depending on the network buffer organization in memory.\nCVE-2021-31346 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:H).\n4.2.4    OUT-OF-BOUNDS READ CWE-125\nWhen processing a DHCP OFFER message, the DHCP client application does not validate the length of the Vendor option(s), leading to denial-of-service conditions.\nCVE-2021-31881 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:H).\n4.2.5    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS CWE-119\nThe DHCP client application does not validate the length of the Domain Name Server IP option(s) (0x06) when processing DHCP ACK packets. This may lead to denial-of-service conditions.\nCVE-2021-31882 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.6    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS CWE-119\nWhen processing a DHCP ACK message, the DHCP client application does not validate the length of the Vendor option(s), leading to denial-of-service conditions.\nCVE-2021-31883 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:H).\n4.2.7    IMPROPER NULL TERMINATION CWE-170\nThe DHCP client application assumes the data supplied with the “Hostname” DHCP option is NULL terminated. In cases when global hostname variable is not defined, this may lead to out-of-bound reads, writes, and denial-of-service conditions.\nCVE-2021-31884 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.8    BUFFER ACCESS WITH INCORRECT LENGTH VALUE CWE-805\nTFTP server application allows for reading the contents of the TFTP memory buffer via sending malformed TFTP commands.\nCVE-2021-31885 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.9    IMPROPER NULL TERMINATION CWE-170\nFTP server does not properly validate the length of the “USER” command, leading to stack-based buffer overflows. This may result in denial-of-service conditions and remote code execution.\nCVE-2021-31886 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.10    IMPROPER NULL TERMINATION CWE-170\nFTP server does not properly validate the length of the “PWD/XPWD” command, leading to stack-based buffer overflows. This may result in denial-of-service conditions and remote code execution.\nCVE-2021-31887 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.11    IMPROPER NULL TERMINATION CWE-170\nFTP server does not properly validate the length of the “MKD/XMKD” command, leading to stack-based buffer overflows. This may result in denial-of-service conditions and remote code execution.\nCVE-2021-31888 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.12    INTEGER UNDERFLOW (WRAP OR WRAPAROUND) CWE-191\nMalformed TCP packets with a corrupted SACK option leads to denial-of-service conditions.\nCVE-2021-31889 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.13    IMPROPER HANDLING OF INCONSISTENT STRUCTURAL ELEMENTS CWE-240\nThe total length of an TCP payload (set in the IP header) is unchecked. This may lead to various side effects, including denial-of-service conditions, depending on the network buffer organization in memory.\nCVE-2021-31890 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update C Part 2 of 2 ---------\nSiemens recommends the following specific workarounds and mitigations users can apply to reduce the risk:\n\nDesigo products: update to v6.30.016 or later\nAPOGEE PXC Compact (P2 Ethernet) and APOGEE PXC Modular (P2 Ethernet): update to v2.8.19 or later. Contact a Siemens office for support.\nTALON TC Compact (BACnet), TALON TC Modular (BACnet), APOGEE PXC Compact (BACnet), and APOGEE PXC Modular (BACnet): update to v3.5.4 or later. Contact a Siemens office for support.\n\n--------- End Update C Part 2 of 2 ---------\n\nCVE-2021-31881, CVE-2021-31882, CVE-2021-31883, CVE-2021-31884: Disable the DHCP client and use static IP address configuration instead (Note the DHCP client is disabled by default on APOGEE/TALON and Desigo products).\nCVE-2021-31885, CVE-2021-31886, CVE-2021-31887, CVE-2021-31888: Disable the FTP service (Note the FTP service is disabled by default on Desigo products).\n\nAs a general security measure Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices to run the devices in a protected IT environment.\nFor more information see Siemens Security Advisory SSA-114589\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-31884",
    "CVE-2021-31885",
    "CVE-2021-31888",
    "CVE-2021-31345",
    "CVE-2021-31886",
    "CVE-2021-31344",
    "CVE-2021-31882",
    "CVE-2021-31881",
    "CVE-2021-31889",
    "CVE-2021-31887",
    "CVE-2021-31890",
    "CVE-2021-31883",
    "CVE-2021-31346"
  ],
  "techniques": [],
  "advisory": "icsa-21-315-07",
  "title": "Siemens Nucleus RTOS-based APOGEE and TALON Products (Update C) | CISA",
  "source": "ics-advisories",
  "id": "984cc424cfd809be4dad7f1e9eda1df0f5ef354ad877264dde6458d7dd66c5ce"
}