{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.6\n\nATTENTION: Low skill level to exploit\nVendor: Telecrane\nEquipment: F25 Series\nVulnerability: Authentication Bypass by Capture-Replay\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow unauthorized users to view commands, replay commands, control the device, or stop the device from running.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Telecrane remote controls are affected:\n\nF25 Series all versions prior to 00.0A\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nThese devices use fixed codes that are reproducible by sniffing and re-transmission. This can lead to unauthorized replay of a command, spoofing of an arbitrary message, or keeping the controlled load in a permanent “stop” state.\nCVE-2018-17935 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nJonathan Andersson, Philippe Z Lin, Akira Urano, Marco Balduzzi, Federico Maggi, Stephen Hilt, and Rainer Vosseler working with Trend Micro’s Zero Day Initiative reported this vulnerability to NCCIC.\n4. MITIGATIONS\nTelecrane recommends upgrading to the latest firmware. Firmware version 00.0A resolves this vulnerability and can be obtained through the product distributor.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-17935"
  ],
  "techniques": [],
  "advisory": "icsa-18-296-03",
  "title": "Telecrane F25 Series | CISA",
  "source": "ics-advisories",
  "id": "020bd2b67fe5e920b280010bc41e7a888e2f227cb46040bec4f1338ea1024929"
}