{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nATTENTION: Low attack complexity\nVendor: Honeywell\nEquipment: Trend Controls IQ Series that utilize Inter-Controller (IC) protocol\nVulnerability: Cleartext Transmission of Sensitive Information\n\nCISA is aware of a public report, known as “OT:ICEFALL” that details vulnerabilities found in multiple operational technology (OT) vendors. CISA is issuing this advisory to provide notice of the reported vulnerabilities and identify baseline mitigations for reducing risks to these and other cybersecurity attacks.\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the loss of authentication information in cleartext by sniffing network traffic.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Trend Controls IQ Series IC, an industrial communication controller, are affected:\n\nIQ Series Controllers that utilize Inter-Controller (IC) protocol: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nSeveral Trend Controls IQ Series building automation controllers utilize an Inter-Controller (IC) protocol that uses a 4-digit authentication PIN transmitted in plaintext, allowing usernames and passwords to be transmitted in plaintext when utilizing unsupported legacy versions of the controller. This may allow an attacker with local OT network access to obtain these credentials.\nCVE-2022-30312 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDaniel dos Santos and Jos Wetzels from Forescout Technologies reported this vulnerability to CISA.\n4. MITIGATIONS\nHoneywell recommends users with affected products and unsupported products take the following steps:\n\nProcure and utilize currently supported hardware through reputable supply channels.\nApply product updates as available.\nFollow guidance in the product security manual to ensure isolation of network segments upon which building automation controllers reside.\nEnsure adequate security controls are in place between OT and IT network segments.\nDisable unnecessary accounts and services.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nLog and monitor network traffic for suspicious activity.\n\nFor IQ4 Series controllers, ensure the latest available firmware version is utilized. The latest firmware may be obtained from a dealer or the Trend Partner Network (login required).\nFollow the Security Best Practice for Trend Products included with product documentation. Additional copies may be obtained from a dealer or the Trend Partner Network (login required).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-30312"
  ],
  "techniques": [],
  "advisory": "icsa-22-242-08",
  "title": "Honeywell Trend Controls Inter-Controller Protocol | CISA",
  "source": "ics-advisories",
  "id": "80956464cc2df0a721e99c8a3ffe46ac042f150dfc868a032157bf6ce685eac2"
}