{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Desigo CC Family\nVulnerability: Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to perform remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Siemens danger management station products are affected:\n\nCerberus DMS v4.0: All versions\nCerberus DMS v4.1: All versions\nCerberus DMS v4.2: All versions\nCerberus DMS v5.0: All versions prior to v5.0 QU1\nDesigo CC Compact v4.0: All versions\nDesigo CC Compact v4.1: All versions\nDesigo CC Compact v4.2: All versions\nDesigo CC Compact v5.0: All versions prior to v5.0 QU1\nDesigo CC v4.0: All versions\nDesigo CC v4.1: All versions\nDesigo CC v4.2: All versions\nDesigo CC v5.0: All versions prior to v5.0 QU1\n\t \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    DESERIALIZATION OF UNTRUSTED DATA CWE-502\nThe application deserializes untrusted data without sufficient validations, which could result in an arbitrary deserialization. This could allow an unauthenticated attacker to execute code in the affected system. The CCOM communication component used for Windows App / Click-Once and IE Web /XBAP client connectivity are affected by this vulnerability.\nCVE-2021-37181 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Government Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nMarkus Wulftange from Code White GmbH reported this vulnerability to Siemens.\n4. MITIGATIONS\nSiemens recommends applying updates where applicable to the following products:\n\nCerberus DMS v4.0: Apply Patch 1520637\nCerberus DMS v4.1: Apply Patch 1417968\nCerberus DMS v4.2: Update to v4.2 QU1 and Apply Patch 1417967\nCerberus DMS v5.0: Update to v5.0 QU1 or later version\nDesigo CC Compact v4.0: Apply Patch 1520637\nDesigo CC Compact v4.1: Apply Patch 1417968\nDesigo CC Compact v4.2: Apply Patch Update to v4.2 QU1 and Apply Patch 1417967\nDesigo CC Compact v5.0: Update to v5.0 QU1 or later version\nDesigo CC v4.0: Apply Patch 1520637\nDesigo CC v4.1: Apply Patch 1417968\nDesigo CC v4.2: Update to v4.2 QU1 and Apply Patch 1417967\nDesigo CC v5.0: Update to v5.0 QU1 or later version\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nIf a user is using a software version equal or older than v3.x, no patches will be released. Siemens recommends upgrading to v5.0 QU1 (or any newer version that will be released in the future). \nIf a patch or Quality Update is not feasible, and if the user can stop the use of Windows App and IE XBAP Web Client, then disable the Web Application and Web Client from SMC. As a result of this disabling, Windows App and IE XBAP Web Client will stop working and the vulnerability will not be exploitable.\nIf users are unable to apply the above two mitigations, restrict Desigo CC to dedicated local networks, disabling Internet access by blocking the CCOM Port for inbound and outbound communication. This will allow the use of Windows App and IE XBAP Client within a defined network space, such as local network only. This action requires approval from the user as it will not remove the vulnerability but reduce the exposure. The vulnerability can be exploited in case the attacker can access the protected network first.\n\nAs a general security measure, Siemens strongly recommends protecting network access to affected products with appropriate mechanisms. It is advised to follow recommended security practices in order to run the devices in a protected IT environment.\nFor additional information, please refer to Siemens Security Advisory SSA-453715\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2021-37181"
  ],
  "techniques": [],
  "advisory": "icsa-21-257-17",
  "title": "Siemens Desigo CC Family | CISA",
  "source": "ics-advisories",
  "id": "608fe76eadf802e5fd462d1d00750627f9c46c24c44569233c9dce1e8970a2d6"
}