{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: Mendix\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to change the user’s password bypassing password validations within a Mendix application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Mendix, a high productivity app platform, are affected:\n\nMendix Applications using Mendix 7: All versions prior to v7.23.31\nMendix Applications using Mendix 8: All versions prior to v8.18.18\nMendix Applications using Mendix 9: All versions prior to v9.14.0\nMendix Applications using Mendix 9 (V9.6): All versions prior to v9.6.12\nMendix Applications using Mendix 9 (V9.12): All versions prior to v9.12.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nIn case of access to an active user session of a Mendix application built with an affected version, it’s possible to change a user’s password via bypassing password validations. This could allow an attacker to set weak passwords.\nCVE-2022-31257 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends updating to the latest version of its software and redeploying applications:\n\nMendix Applications using Mendix 7: Update Mendix Project to v7.23.31 or later\nMendix Applications using Mendix 8: Update Mendix Project to v8.18.18 or later\nMendix Applications using Mendix 9: Update Mendix Project to v9.14 or later\nMendix Applications using Mendix 9 (v9.6): Update Mendix Project to v9.6.12 or later (preferably to the latest v9.12 version).\nMendix Applications using Mendix 9 (v9.12): Update Mendix Project to v9.12.2 or later\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ Operational Guidelines for Industrial Security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage.\nFor more information see Siemens Security Advisory SSA-433782.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2022-31257"
  ],
  "techniques": [],
  "advisory": "icsa-22-195-13",
  "title": "Siemens Mendix | CISA",
  "source": "ics-advisories",
  "id": "06391bf9aed163996a79be40093aface1f7c5c90c721509b9cb97dbe07386bd1"
}