{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Rockwell Automation\nEquipment: Allen-Bradley MicroLogix 1100\nVulnerability: Improper Handling of Length Parameter Inconsistency\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in denial-of-service conditions.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nRockwell Automation reports the vulnerability affects the following Allen-Bradley MicroLogix 1100 Programmable Logic Controller:\n\nAllen-Bradley MicroLogix 1100 revision number 1.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER HANDLING OF LENGTH PARAMETER INCONSISTENCY CWE-130\nA vulnerability exists with the processing of ICMP packets with an invalid IPv4 length in the MicroLogix 1100. This vulnerability could allow a remote, unauthenticated attacker to send malformed packets and cause the controller to enter 8H Hard Fault. This event would lead to denial-of-service conditions. To recover from the condition, the controller must be power cycled and the project redownloaded.\nCVE-2020-6111 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nCisco Talos team reported this vulnerability to Rockwell Automation.\n4. MITIGATIONS\nRockwell Automation recommends users of MicroLogix 1100 migrate to MicroLogix 1400 and apply firmware v21.006 or later.\nPlease see Rockwell Automation’s publication number, PN1548, for more information.\nRockwell Automation recommends the following network-based vulnerability mitigations for embedded products:\n\nUtilize proper network infrastructure controls, such as firewalls, to help ensure traffic from unauthorized sources is blocked.\nConsult the product documentation for specific features, such as a hardware key mode setting, to which may be used to block unauthorized changes, etc.\nBlock all traffic to EtherNet/IP or other CIP protocol-based devices from outside the manufacturing zone by blocking or restricting access to TCP and UDP Port 2222 and Port 44818 using proper network infrastructure controls, such as firewalls, UTM devices, or other security appliances. For more information on TCP/UDP ports used by Rockwell Automation products, see Knowledgebase Article ID BF7490\n\nRockwell Automation also recommends the following general mitigations:\n\nMinimize network exposure for all control system devices and/or systems and ensure they are not accessible from the Internet. For further information about the risks of unprotected Internet accessible control systems, please see Knowledgebase Article ID PN715\nLocate control system networks and devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize a VPN is only as secure as the connected devices.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-6111"
  ],
  "techniques": [],
  "advisory": "icsa-21-047-02",
  "title": "Rockwell Automation Allen-Bradley Micrologix 1100 | CISA",
  "source": "ics-advisories",
  "id": "a98c0f30df918452edf8f95ed530fc6ea68cd7e45a5a1946e8f17120fce0482c"
}