{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: MB connect line\nEquipment: mymbCONNECT24, mbCONNECT24\nVulnerabilities: SQL Injection, Cross-site Request Forgery, Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to gain unauthorized access to arbitrary information or allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products and versions are affected:\n\nmymbCONNECT24 v2.6.1 and prior\nmbCONNECT24 v2.6.1 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThere is a blind SQL injection vulnerability in the knximport component that allows logged in attackers access to arbitrary information. \nCVE-2020-24569 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:L).\n3.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN SQL COMMAND ('SQL INJECTION') CWE-89\nThere is a blind SQL injection vulnerability in the lancompenent component that allows logged in attackers to access arbitrary information. \nCVE-2020-24568 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:L).\n3.2.3    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nThere is a SSRF and CSRF vulnerability in the com_mb24proxy module that allows an attacker to steal session information from logged in users with a specifically crafted link. \nCVE-2020-24570 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nAn attacker could use an outdated and unused third-party software bundled with the software to gain Remote Code Execution via an exploit chain.\nNo CVE has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nAlik Koldobsky, Ofir Manzur, Hay Mizrachi, Nikolay Sokolik, and Haviv Vaizman from OTORIO reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMB connect line recommends users update mymbCONNECT24 and mbCONNECT24 to Version 2.6.2 or higher.\nAdditional details can be found on the MB connect line website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-24570",
    "CVE-2020-24568",
    "CVE-2020-24569"
  ],
  "techniques": [],
  "advisory": "icsa-20-273-01",
  "title": "MB Connect line mbCONNECT24, mymbCONNECT24 | CISA",
  "source": "ics-advisories",
  "id": "ffa85ec437057380e9c1cf770ff2c2226a6610ccc5a131ab4e7078d0675a757c"
}