{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.3\nVendor: Multiple Trailer and Brake Manufacturers\nEquipment: Power Line Communications Bus / PLC4TRUCKS / J2497\nVulnerability: Exposure of Sensitive Information Through Sent Data\n\n2. RISK EVALUATION\nThe National Motor Freight Traffic Association (NMFTA) and Assured Information Security (AIS) have released research detailing a vulnerability within trailer Power Line Communications (PLC) signals. Their research indicates it is possible to read PLC signals using active antennas reliably at 6 feet and up to 8 feet away, subject to environmental conditions. The researchers expect to be able to push this reception distance further with receiver improvements. The impact of this issue depends heavily on what information is being sent by ECUs on the trailer PLC bus. Typical trailer traffic is only ABS fault messages and will thus have minimal loss of confidentiality. CISA is publishing this advisory to bring awareness to trailer and brake manufacturers who may be seeking to leverage PLC for sensitive information: e.g., air weigh axles or key exchange in setting up high-speed wireless links in future tractor-trailer interfaces.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nAll trailer power line communications are affected. \n3.2 VULNERABILITY OVERVIEW\n3.2.1    EXPOSURE OF SENSITIVE INFORMATION THROUGH SENT DATA CWE-201\nPLC bus traffic can be sniffed reliably via an active antenna up to 6 feet away. Further distances are also possible, subject to environmental conditions and receiver improvements. \nCVE-2020-14514 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\n\n3.4 RESEARCHER\nNational Motor Freight Traffic Association (NMFTA) researcher Ben Gardiner, NMFTA motor freight carriers, and Assured Information Security researchers Dan Salloum, Chris Poore, and Eric Thayer reported this vulnerability to CISA.\n4. MITIGATIONS\nNo current mitigations have been developed alongside this research. Future designs can mitigate this issue by reducing radiated emissions using shorter lengths of PLC buses and reduced transmit voltage. The goal of this advisory is to bring awareness of the issue to the transportation systems sector.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nAssess expected confidentiality of PLC traffic that is present on trailers.\n\nTheoretical examples to consider:\n\nAir weigh systems on trailer PLC could expose business intelligence\nTrailer brake controllers configured to stream values could expose business intelligence\nTrailer telematics systems which use PLC, while rare, could be exposing network information that should remain confidential\n\n\n\n\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-14514"
  ],
  "techniques": [],
  "advisory": "icsa-20-219-01",
  "title": "Trailer Power Line Communications | CISA",
  "source": "ics-advisories",
  "id": "37c6a16e6c2aba507f422019cfe86dff4fc40fb977c362cb349f347bce127e8d"
}