{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: ABB\nEquipment: Symphony Plus SPIET800 and PNI800\nVulnerabilities: Incomplete Internal State Distinction, Improper Handling of Unexpected Data Type, Uncontrolled Resource Consumption\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could cause the affect device to become unresponsive, resulting in a denial-of-service condition and requiring a manual reboot.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Symphony Plus network interface modules are affected:\n\nSPIET800: Firmware Version A_B or prior\nPNI800: Firmware Version A_B or prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCOMPLETE INTERNAL STATE DISTINCTION CWE-372\nThe affected product is vulnerable to errors in handling out-of-order packets, which may cause the device to stop responding to any Ethernet-based requests. The resulting denial-of-service condition will not self-resolve, requiring a reboot to restore normal operation.\nCVE-2021-22285 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    IMPROPER HANDLING OF UNEXPECTED DATA TYPE CWE-241\nThe affected product is vulnerable to specially formatted IET protocol packets that may cause the device to become unresponsive. The resulting denial-of-service condition will not self-resolve, requiring a reboot to restore normal operation.\nCVE-2021-22286 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe affected product is vulnerable to certain types of unexpected traffic that may cause the device to become unresponsive. The resulting denial-of-service condition will not self-resolve, requiring a reboot to restore normal operation.\nCVE-2021-22288 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nLance Lamont from Verve Industrial Protection, and Ron Brash from Verve Industrial Protection/aDolus Technology, Inc., reported these vulnerabilities to CISA.\n4. MITIGATIONS\nABB recommends the following mitigations and workarounds.\n\nSPIET800: Update to Version A_C or later (planned Q2 2022)\nPIN80: Update to Version B_0 or later (planned Q2 2022)\n\nABB advises users to review their installations to determine if they are using an impacted product as listed above.\nPlease see ABB Symphony Plus advisory and ABB Cybersecurity alerts portal for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-22288",
    "CVE-2021-22285",
    "CVE-2021-22286"
  ],
  "techniques": [],
  "advisory": "icsa-22-097-02",
  "title": "ABB SPIET800 and PNI800 | CISA",
  "source": "ics-advisories",
  "id": "003a8a67c334d168d4418f9d5636d2556bd1bf9570ed624a3a2e03e120dc8bef"
}