{
  "markdown": "\nOVERVIEW\nEmerson has identified an open SSH port vulnerability in the DeltaV Wireless I/O Card. Emerson has produced a firmware patch that disables the SSH port.\nThis vulnerability could be exploited remotely.\nAFFECTED PRODUCTS\nEmerson reports that the vulnerability affects the following products:\n\nSE4801T0X Redundant Wireless I/O Card V13.3, and\nSE4801T1X Simplex Wireless I/O Card V13.3\n\nNote: The DeltaV system is not susceptible to this vulnerability except for the products and versions listed above.\nIMPACT\nAn attacker may be able to use this open port to access the file system of devices using the affected product.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation.\nBACKGROUND\nEmerson is a US-based company that maintains offices in several countries around the world, including the US, UK, Netherlands, Italy, India, Germany, France, Czech Republic, China, and Australia.\nThe affected products, DeltaV Wireless I/O Cards, are used to connect workstations and servers in the DeltaV network. According to Emerson, DeltaV Wireless I/O Cards are deployed across several sectors including Chemical and Energy. Emerson estimates that these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nMISSING AUTHENTICATION FOR CRITICAL FUNCTIONCWE-306: Missing Authentication for Critical Function, https://cwe.mitre.org/data/definitions/306.html, web site last accessed November 29, 2016.\nDeltaV Wireless I/O Cards (WIOC) running the firmware available in the DeltaV system, release v13.3, have the SSH (Secure Shell) functionality enabled unnecessarily.\nCVE-2016-9347NVD, https://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2016-9347, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 5.0 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L, web site last accessed November 29, 2016.\n\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability could be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nCrafting a working exploit for this vulnerability would be difficult.\nMITIGATION\nEmerson released the solution for this vulnerability in their Guardian Support Knowledge Base Article NK-1500-0152 dated September 30, 2016 (hotfix bundle ‘DeltaV_133_WIOC_02_CSS’). The provided fix disables the SSH port that is always available in the WIOC running v13.3 original firmware.\nIn order to limit exposure to these and other vulnerabilities, Emerson recommends that users deploy and configure DeltaV systems and related components as described in the following documents:\n\nDeltaV Security Manual\n\nhttp://www2.emersonprocess.com/siteadmincenter/PM%20DeltaV%20Documents/Manuals/CS_DeltaV_Security_Manual-TOC%20only.pdf\n\nEmerson’s Wireless Security Whitepaper\n\nhttp://www2.emersonprocess.com/siteadmincenter/PM%20Central%20Web%20Documents/Emerson%20Wireless%20Security.pdf\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2016-9347"
  ],
  "techniques": [],
  "advisory": "icsa-16-334-03",
  "title": "Emerson DeltaV Wireless I/O Card Open SSH Port Vulnerability | CISA",
  "source": "ics-advisories",
  "id": "ccb2458470b87bd20a43ef6f324786c358bbd605dd9f8d330259283176ca92ae"
}