{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: Multiple Air Conditioning Systems\nVulnerability: Improper Restriction of XML External Entity Reference\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to disclose some of the data in the air conditioning system or cause a denial-of-service condition.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports this vulnerability affects the following air conditioning systems:\n\nAir Conditioning System/Centralized Controllers:\n\nG-50A: Versions 3.35 and prior\nGB-50A: Versions 3.35 and prior\nGB-24A: Versions 9.11 and prior\nAG-150A-A: Versions 3.20 and prior\nAG-150A-J: Versions 3.20 and prior\nGB-50ADA-A: Versions 3.20 and prior\nGB-50ADA-J: Versions 3.20 and prior\nEB-50GU-A: Versions 7.09 and prior\nEB-50GU-J: Versions 7.09 and prior\nAE-200A: Versions 7.93 and prior\nAE-200E: Versions 7.93 and prior\nAE-50A: Versions 7.93 and prior\nAE-50E: Versions 7.93 and prior\nEW-50A: Versions 7.93 and prior\nEW-50E: Versions 7.93 and prior\nTE-200A: Versions 7.93 and prior\nTE-50A: Versions 7.93 and prior\nTW-50A: Versions 7.93 and prior\nCMS-RMD-J: Versions 1.30 and prior\n\n\nAir Conditioning System/Expansion Controllers:\n\nPAC-YG50ECA: Versions 2.20 and prior\n\n\nAir Conditioning System/BM adapter:\n\nBAC-HD150: Versions 2.21 and prior\n\n\n\nTo learn how to determine the version number of equipment, please see publication number 2021-005 from Mitsubishi Electric.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nThe affected product does not properly restrict XML external entity references.\nCVE-2021-20595 has been assigned to this vulnerability. A CVSS v3 base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nHoward McGreehan of Aon's Cyber Solutions reported this vulnerability to Mitsubishi Electric.\n4. MITIGATIONS\nMitsubishi Electric has created the following versions to address the issue, and recommends users update to one of the following versions below or newer:\n\nAir Conditioning System/Centralized Controllers:\n\nG-50A: Version 3.37 or later\nGB-50A: Version 3.37 or later\nGB-24A: Version 9.12 or later\nAG-150A-A: Version 3.21 or later\nAG-150A-J: Version 3.21 or later\nGB-50ADA-A: Version 3.21 or later\nGB-50ADA-J: Version 3.21 or later\nEB-50GU-A: Version 7.10 or later\nEB-50GU-J: Version 7.10 or later\nAE-200A: Version 7.95 or later\nAE-200E: Version 7.95 or later\nAE-50A: Version 7.95 or later\nAE-50E: Version 7.95 or later\nEW-50A: Version 7.95 or later\nEW-50E: Version 7.95 or later\nTE-200A: Version 7.95 or later\nTE-50A: Version 7.95 or later\nTW-50A: Version 7.95 or later\nCMS-RMD-J: Version 1.40 or later\n\n\nAir Conditioning System/Expansion Controllers:\n\nPAC-YG50ECA: Version 2.21 or later\n\n\nAir Conditioning System/BM adapter:\n\nBAC-HD150: Version 2.22 or later\n\n\n\nMitsubishi Electric recommends taking the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\nUse a VPN router, etc. when you connect air conditioning systems to the Internet.\nUse anti-virus software on computers connected to air conditioning systems.\nRestrict the access to air conditioning systems from untrusted networks and hosts.\n\nPlease refer to the Mitsubishi Electric website for additional details about this issue.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-20595"
  ],
  "techniques": [],
  "advisory": "icsa-21-182-05",
  "title": "Mitsubishi Electric Air Conditioning Systems | CISA",
  "source": "ics-advisories",
  "id": "cd26e083671e84565ac1052c2403409f083624b02629c058dafdd5e6570390b0"
}