{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: ABB\nEquipment: Device Library Wizard\nVulnerability: Insecure Storage of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a low-level user to escalate privileges and fully compromise the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products of Device Library Wizard are affected:\n\nDevice Library Wizard: Versions 6.0.X, 6.0.3.1, and 6.0.3.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSECURE STORAGE OF SENSITIVE INFORMATION CWE-922\nThe software writes sensitive system information to an unprotected file, and a low-privileged user could read confidential data from such a file. This could allow the user to take control of the product\nCVE-2020-8482 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Dams, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nWilliam Knowles of Applied Risk reported this vulnerability to ABB.\n4. MITIGATIONS\nABB recommends users apply one of the following updates:\n\nDevice Library Wizard Version 6.0.3.2 RU1\nDevice Library Wizard Version 6.0.3.3\nDevice Library Wizard Version 6.1.X and later\n\nABB recommends disabling interactive logon for the service account (both local and remote).\nFor more information please refer to ABB’s Cybersecurity Advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should: \n\nFollow the principle of least privilege.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-8482"
  ],
  "techniques": [],
  "advisory": "icsa-20-175-03",
  "title": "ABB Device Library Wizard | CISA",
  "source": "ics-advisories",
  "id": "7ca6a29c06632cd62e22bb6477461a68b1ba93e796168e1a0ce800374bd71887"
}