{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.8\nATTENTION: Exploitable remotely/low skill level to exploit/public exploits are available.\nVendor: Siemens\nEquipment: SCALANCE, SIMATIC, RUGGEDCOM, and SINAMICS Products\nVulnerabilities: Security Features\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSA-17-318-01 Siemens SCALANCE, SIMATIC, RUGGEDCOM, and SINAMICS Products (Update D) that was published April 24, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could potentially allow an attacker within the radio range of the wireless network to decrypt, replay, or inject forged network packets into the wireless communication.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nSiemens reports that the key reinstallation attacks (KRACK) potentially affect the following Siemens industrial products:\n\nRUGGEDCOM RS9xxW: All versions,\nRUGGEDCOM RX1400 with WLAN interface: All versions prior to v2.11.2,\nSCALANCE W-700 (IEEE 802.11a/b/g): All versions,\n\n--------- Begin Update E Part 1 of 2 ---------\nSCALANCE W-700 (IEEE 802.11n): All versions prior to v6.2.1\n--------- End Update E Part 1 of 2 ---------\n\nSCALANCE W-700 (IEEE 802.11n): All versions prior to v6.2.1,\nSCALANCE W1750D: All versions prior to v6.5.1.5-4.3.1.8,\nSCALANCE WLC711: All versions prior to v9.21.19.003,\nSCALANCE WLC712: All versions prior to v9.21.19.003,\nSIMATIC ET200 PRO IM154-6 PN IWLAN: All versions,\nSIMATIC IWLAN-PB/LINK: All versions,\nSIMATIC Mobile Panel 277(F) IWLAN: All versions,\nSINAMICS v20 Smart Access Module: All versions,\nSIMATIC RF350M: All versions with Summit Client Utility prior to v22.3.5.16, and\nSIMATIC RF650M: All versions with Summit Client Utility prior to v22.3.5.16\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) allows reinstallation of the pairwise key in the four-way handshake.\nCVE-2017-13077 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N).\n4.2.2 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) allows reinstallation of the group temporal key (GTK) during the four-way handshake, allowing an attacker within radio range to replay frames from access points to clients.\nCVE-2017-13078 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N).\n4.2.3 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) that supports IEEE 802.11w allows reinstallation of the integrity group temporal key (IGTK) during the four-way handshake, allowing an attacker within radio range to spoof frames from access points to clients.\nCVE-2017-13079 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:N).\n4.2.4 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) allows reinstallation of the group temporal key (GTK) during the group key handshake, allowing an attacker within radio range to replay frames from access points to clients.\nCVE-2017-13080 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N).\n4.2.5 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) that supports IEEE 802.11w allows reinstallation of the integrity group temporal key (IGTK) during the group key handshake, allowing an attacker within radio range to spoof frames from access points to clients.\nCVE-2017-13081 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N).\n4.2.6 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) that supports IEEE 802.11r allows reinstallation of the pairwise transient key (PTK) temporal key (TK) during the fast BSS transmission (FT) handshake, allowing an attacker within radio range to replay, decrypt, or spoof frames.\nCVE-2017-13082 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.7 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) allows reinstallation of the station-to-station-link (STSL) transient key (STK) during the PeerKey handshake, allowing an attacker within radio range to replay, decrypt, or spoof frames.\nCVE-2017-13084 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.8 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) allows reinstallation of the tunneled direct-link setup (TDLS) peer key (TPK) during the TDLS handshake, allowing an attacker within radio range to replay, decrypt, or spoof frames.\nCVE-2017-13086 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.9 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) that support 802.11v allows reinstallation of the group temporal key (GTK) when processing a wireless network management (WNM) sleep mode response frame, allowing an attacker within radio range to replay frames from access points to clients.\nCVE-2017-13087 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N).\n4.2.10 SECURITY FEATURES CWE-254\nWi-Fi protected access (WPA and WPA2) that support 802.11v allows reinstallation of the integrity group temporal key (IGTK) when processing a wireless network management (WNM) sleep mode response frame, allowing an attacker within radio range to replay frames from access points to clients.\nCVE-2017-13088 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Chemical, Energy, Food and Agriculture, Healthcare and Public Health, Transportation Systems, and Water and Wastewater Systems\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n\n4.4 RESEARCHER\nMathy Vanhoef, of the Katholieke Universiteit Leuven in Belgium, discovered these vulnerabilities.\n5. MITIGATIONS\nSiemens has provided the following updates to address the vulnerabilities in the affected products:\n\nRUGGEDCOM ROX II for RX1400 with WLAN interface: Install v2.11.2:\n\nContact the RUGGEDCOM support team at:\nhttps://support.industry.siemens.com/my/WW/en/requests#createRequest\n--------- Begin Update E Part 2 of 2 ---------\n\nSCALANCE W-700 (IEEE 802.11n): Install v6.2.1 or newer\n\nhttps://support.industry.siemens.com/cs/us/en/ps/21965/dl \n--------- End Update E Part 2 of 2 ---------\n\nSCALANCE W-700 (IEEE 802.11n): Install v6.2.1:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109752596\n\nSCALANCE W1750D: Install v6.5.1.5-4.3.1.8:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109756771\n\nSCALANCE WLC711 and SCALANCE WLC712: Install v9.21.19.003:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109755170\n\nSIMATIC RF350M and SIMATIC RF650M: update to v22.3.5.16:\n\nhttps://support.industry.siemens.com/cs/ww/en/view/109752556\nSCALANCE W1750D devices are not vulnerable in the default configuration. Only users who enable the “Mesh” or “WiFi uplink” functionality are affected by the vulnerabilities. Disabling these functionalities will completely mitigate the vulnerabilities.\nSCALANCE WLC711 and WLC712 can deactivate IEEE 802.11r, “MeshConnect,” and “Client Bridge Mode” to reduce the risk, provided these modes have been activated and are not required for the operation of the wireless environment. All three functions are turned off by default.\nSCALANCE W-700 standalone Access Points, RUGGEDCOM RX1400 and RS9xxW, are not vulnerable if operated in Access Point mode.\nSCALANCE W-700 standalone devices, SIMATIC Mobile Panel 277F IWLAN, and SIMATIC ET200 WLAN, are not affected if the iPCF, iPCF-MC, or iPCF-HT features are enabled.\nFor the remaining affected products or if the mitigations outlined previously cannot be implemented, Siemens recommends the following mitigations in the meantime:\n\nEnsure multiple layers of security. Do not depend on the security of WPA2 alone.\nUse WPA2-CCMP (AES) instead of WPA2-TKIP or WPA-GCMP, if supported by the WLAN clients, to reduce the risk of potential attacks.\nApply defense-in-depth.\n\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisories SSA-901333 and SSA-418456 at the following location:\nhttp://www.siemens.com/cert/en/cert-security-advisories.htm\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nThese vulnerabilities have been publicly disclosed. These vulnerabilities are exploitable from an adjacent network. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2017-13082",
    "CVE-2017-13086",
    "CVE-2017-13077",
    "CVE-2017-13088",
    "CVE-2017-13079",
    "CVE-2017-13078",
    "CVE-2017-13084",
    "CVE-2017-13081",
    "CVE-2017-13080",
    "CVE-2017-13087"
  ],
  "techniques": [],
  "advisory": "icsa-17-318-01",
  "title": "Siemens SCALANCE, SIMATIC, RUGGEDCOM, and SINAMICS Products (Update E) | CISA",
  "source": "ics-advisories",
  "id": "2eae29e570be79fa0110b248d0ddde398ecbf5db7da34849d9119317d6be7700"
}