{
  "markdown": "\nOVERVIEW\n--------- Begin Update B Part 1 of 3 --------\nThis updated advisory is a follow-up to the updated advisory titled ICSA-12-018-01A Schneider Electric Quantum Ethernet Module Hard-Coded Credentials that was published on June 04, 2013, on the ICS-CERT Web site. It is also a follow-up to the original alert titled ICS‑ALERT-11-346-01 Schneider Electric Quantum Ethernet Module Credentials that was published December 12, 2011, on the ICS-CERT Web page. This advisory corrects and expands on the details in the specified alert and subsequent advisory updates.\n--------- End Update B Part 1 of 3 --------\nOn December 12, 2011, independent security researcher Rubén Santamarta publicly announced information regarding hard-coded credentials in the Schneider Electric Quantum Ethernet Module. The credentials publicized grant access to the Telnet port, Windriver Debug port, and the FTP service. Prior to publication, Mr. Santamarta coordinated these vulnerabilities with ICS‑CERT.\n--------- Begin Update B Part 2 of 3 --------\nICS-CERT has coordinated with Schneider Electric, and they have produced patches and firmware upgrades for Quantum and other affected products.\n-------- End Update B Part 2 of 3 --------\nAFFECTED PRODUCTS\nThe following products and versions are affected:\nQuantum\n\n140NOE77101 Firmware V4.9 and all previous versions,\n140NOE77111 Firmware V5.0 and all previous versions,\n140NOE77100 Firmware V3.4 and all previous versions,\n140NOE77110 Firmware V3.3 and all previous versions,\n140CPU65150 Firmware V3.5 and all previous versions,\n140CPU65160 Firmware V3.5 and all previous versions,\n140CPU65260 Firmware V3.5 and all previous versions,\n140NOC77100 Firmware V1.01 and all previous versions, and\n140NOC77101 Firmware V1.01 and all previous versions.\n\nAny available conformal-coated versions of the above part numbers.\nPremium\n\nTSXETY4103 Firmware V5.0 and all previous versions,\nTSXETY5103 Firmware V5.0 and all previous versions,\nTSXP571634M Firmware V4.9 and all previous versions,\nTSXP572634M Firmware V4.9 and all previous versions,\nTSXP573634M Firmware V4.9 and all previous versions,\nTSXP574634M Firmware V3.5 and all previous versions,\nTSXP575634M Firmware V3.5 and all previous versions,\nTSXP576634M Firmware V3.5 and all previous versions, and\nTSXETC101 Firmware V1.01 and all previous versions.\n\nAny available conformal-coated versions of the above part numbers.\nM340\n\nBMXNOE0100 Firmware V2.3 and all previous versions,\nBMXNOE0110 Firmware V4.65 and all previous versions, and\nBMXNOC0401 Firmware V1.01 and all previous versions.\n\nThe following products are affected by the FTP Service vulnerabilities only (not affected by Telnet or Windriver Debug vulnerabilities):\n\nSTBNIC2212 Firmware V2.10 and all previous versions,\nSTBNIP2311 Firmware V3.01 and all previous versions,\nSTBNIP2212 Firmware V2.73 and all previous versions,\nBMXP342020 Firmware V2.2 and all previous versions, and\nBMXP342030 Firmware V2.2 and all previous versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow an attacker to gain elevated privileges, to load a modified firmware, or to perform other malicious activities on the system.\nImpact to individual organizations depends on many factors that are unique to each organization. ICS‑CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nSchneider Electric is a manufacturer and integrator of energy management and industrial automation systems, equipment, and software. The affected Schneider Electric systems are found primarily in energy, manufacturing, and infrastructure applications. Schneider Electric reports operations in over 100 countries worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nHARD-CODED CREDENTIALS\n\nMr. Santamarta’s report revealed multiple hard-coded credentials that enable access to the following services:\n\nTelnet port—May allow remote attackers the ability to view the operation of the module’s firmware, cause a denial of service, modify the memory of the module, and execute arbitrary code.\nWindriver Debug port—Used for development; may allow remote attackers to view the operation of the module’s firmware, cause a denial of service, modify the memory of the module, and execute arbitrary code.\nFTP service—May allow an attacker to modify the module website, download and run custom firmware, and modify the HTTP passwords.\n\nCVE-2011-4859NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2011-4859, Web site last accessed June 04, 2013. has been assigned to this vulnerability group. A CVSS V2 base score of 10 has also been assigned.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities are remotely exploitable.\nEXISTENCE OF EXPLOIT\nPublic exploits are known to target these vulnerabilities.\nDIFFICULTY\nAn attacker with a low skill level could exploit these vulnerabilities.\nMITIGATION\n--------- Begin Update B Part 3 of 3 --------\nSchneider Electric has created firmware upgrades that resolve the Telnet and Windriver debug port vulnerabilities for all affected products by removing the Telnet and Windriver services from these modules. According to Schneider Electric, removing these services will not affect the capacities/functionalities of the product or impact the performance of customer installations. Telnet and Windriver debug services were installed only for advanced troubleshooting use and were never intended for customer use.\nSchneider Electric has posted firmware upgrades on their Web site, http://www.schneider-electric.com/download/ww/en/results/3541958-SoftwareFirmware/. Users should ensure they are using the minimum versions referenced below:\nQuantum\n\n140NOE77101 Exec V5.01 or greater for Unity Users,\n140NOE77111 Exec V5.11 or greater,\n140NOE77101 Exec. V4.9 or greater for Concept Users,\n140NOE77111 Exec. V5.5 or greater for Concept Users,\n140CPU65150 Exec V3.8 or greater,\n140CPU65160 Exec V3.8 or greater,\n140CPU65260 Exec V3.8 or greater, and\n140NOC77101 Exec V1.03 or greater.\n\nPremium\n\nTSXETY4103 Exec V5.2 or greater,\nTSXETY5103 Exec V5.5 or greater,\nTSXP571634 Exec V5.2 or greater,\nTSXP572634 Exec V5.2 or greater,\nTSXP573634 Exec V5.2 or greater,\nTSXP574634 Exec V3.8 or greater,\nTSXP575634 Exec V3.8 or greater,\nTSXP576634 Exec V3.8 or greater, and\nTSXETC101 Exec V2.01 or greater.\n\nM340\n\nBMXNOE0100 Exec V2.50 or greater,\nBMXNOE0110 Exec v5.3 or greater, and\nBMXNOC0401 Exec V2.01 or greater.\n\nSchneider has also released a firmware upgrade to address the FTP service vulnerability referenced above. It is available on selected Quantum programmable logic controller modules. This upgrade includes a new feature that allows the user to enable or disable both the FTP and HTTP services on the modules. Disabling these services will mitigate the vulnerability mentioned above. The following products support the HTTP and FTP service enable and disable feature:\n\n140NOE77101 Firmware Version 06.00 or greater, and\n140NOE77111 Firmware Version: 06.00 or greater.\n\n--------- End Update B Part 3 of 3 --------\nOrganizations need to evaluate the impact of removing these services prior to applying this fix. ICS‑CERT will provide additional information as mitigations become available for other identified vulnerabilities.\nICS‑CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices. Critical devices should not directly face the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices.\n\nThe Control Systems Security Program (CSSP) also provides a section for control systems security recommended practices on the CSSP web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS‑CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS‑CERT for tracking and correlation against other incidents.\nIn addition, ICS‑CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in e-mail messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/sites/default/files/publications/emailscams_0905.pdf , Web site last accessed June 04, 2013. for more information on avoiding e-mail scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, Web site last accessed June 04, 2013. for more information on social engineering attacks.\n\n\n",
  "cves": [
    "CVE-2011-4859"
  ],
  "techniques": [],
  "advisory": "icsa-12-018-01b",
  "title": "Schneider Electric Quantum Ethernet Module Hard-Coded Credentials (Update B) | CISA",
  "source": "ics-advisories",
  "id": "7075180c872c33172218f3495f7a21936efc704f76cf9d7fb2aa3af9d8b39d18"
}