{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.2\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric Corporation\nEquipment: MELSOFT MaiLab\nVulnerability: Improper Verification of Cryptographic Signature\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a remote attacker to cause a denial-of-service condition in the target product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMitsubishi Electric reports that the following versions of MELSOFT MaiLab, a data science tool for manufacturing improvement, are affected:\n\nMELSOFT MaiLab SW1DND-MAILAB-M: versions 1.00A to 1.05F\nMELSOFT MaiLab SW1DND-MAILABPR-M: versions 1.00A to 1.05F\n\n3.2 Vulnerability Overview\n3.2.1 Improper Verification of Cryptographic Signature CWE-347\nA denial-of-service vulnerability exists in the OpenSSL library used in MELSOFT MaiLab due to improper verification of cryptographic signature resulting from improper implementation of the POLY1305 message authentication code (MAC).\nCVE-2023-4807 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\nA CVSS v4 score has also been calculated for CVE-2023-4807. A base score of 8.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:H/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends users install the fixed version (ver.1.06G or later) and update the software. For information about how to install the fixed version, please contact your local Mitsubishi Electric representative.\nMitsubishi Electric recommends that users take the following mitigations to minimize the risk of exploiting this vulnerability:\n\nWhen internet access is required, use a firewall or a virtual private network (VPN) to prevent unauthorized access.\nUse the products within a control system, and protect the network and devices in the control system with a firewall to block access from untrusted networks and hosts.\nRestrict physical access to the PC on which the product is installed and the network to which the PC is connected to prevent unauthorized access.\nDo not click on web links in emails or other messages from untrusted sources. Also, do not open attachments from untrusted emails.\n\nFor specific update instructions and additional details see the Mitsubishi Electric advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity.\n5. UPDATE HISTORY\n\nJuly 18, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-4807"
  ],
  "techniques": [],
  "advisory": "icsa-24-200-01",
  "title": "Mitsubishi Electric MELSOFT MaiLab | CISA",
  "source": "ics-advisories",
  "id": "e2da68c8133a76d757a5c9643b44acb72de1917eb5b45decf699c0581fa23192"
}