{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 8.5\nATTENTION: Low attack complexity\nVendor: Fuji Electric\nEquipment: Monitouch V-SFT\nVulnerabilities: Out-of-Bounds Write, Stack-Based Buffer Overflow, Type Confusion\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Fuji Electric's Monitouch V-SFT, a screen configuration software, are affected:\n\nMonitouch V-SFT: Versions prior to 6.2.3.0\n\n3.2 Vulnerability Overview\n3.2.1 OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to an out-of-bounds write because of a type confusion, which could result in arbitrary code execution.\nCVE-2024-5271 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-5271. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.2 STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow, which could allow an attacker to execute arbitrary code.\nCVE-2024-34171 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-34171. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.3 ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nThe affected product is vulnerable to a type confusion, which could cause a crash or code execution.\nCVE-2024-5597 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2024-5597. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nkimiy, working with Trend Micro Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nFuji Electric recommends users update the product to Monitouch V-SFT v6.2.3.0.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nMay 30, 2024: Initial Publication\nUpdate A: Added Type confusion vulnerability\n\n",
  "cves": [
    "CVE-2024-5271",
    "CVE-2024-34171",
    "CVE-2024-5597"
  ],
  "techniques": [],
  "advisory": "icsa-24-151-02",
  "title": "Fuji Electric Monitouch V-SFT (Update A) | CISA",
  "source": "ics-advisories",
  "id": "e0912c8ecda330c5f92461a35e6398dcbd4b87f32a9b1e0eb190af4f781bba73"
}