{
  "markdown": "\nCVSS v3 7.0\nATTENTION: Locally exploitable/high skill level to exploit.\nVendor: Schneider Electric\nEquipment: IGSS SCADA Software\nVulnerability: Security Misconfiguration\nAFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following IGSS SCADA Software products:\n\nIGSS SCADA Software V12 and all previous versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could cause the device the attacker is accessing to crash or execute arbitrary code.\nMITIGATION\nSchneider Electric has provided IGSS SCADA Software V13 to address this vulnerability. Users are recommended to update to V13 using the following link.\nhttp://igss.schneider-electric.com/products/igss/download/licensed-versions.aspx\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nSECURITY MISCONFIGURATION CWE-815\n\nMemory protection settings such as address space layout randomization (ASLR) and data execution prevention (DEP) are not properly implemented.\nCVE-2017-9967 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:C/C:L/I:H/A:L).\nRESEARCHER\nIvan Sanchez of Nullcode reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2017-9967"
  ],
  "techniques": [],
  "advisory": "icsa-18-044-02",
  "title": "Schneider Electric IGSS SCADA Software | CISA",
  "source": "ics-advisories",
  "id": "b43aee9e68da38dbe53e0e7d90eb2dd234580cdcc59ced8f87a7ecef1d588faf"
}