{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: GOT2000 series, GOT SIMPLE series, GT SoftGOT2000\nVulnerability: Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow the system’s operations to be adversely affected.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Mitsubishi Electric human-machine interface (HMI) products are affected:\n\nGOT2000 series\n\nGT27 model: All versions\nGT25 model: All versions\nGT23 model: All versions\nGT21 model: All versions\n\n\nGOT SIMPLE series\n\nGS21 model: All versions\n\n\nGT SoftGOT2000: All versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe affected product is vulnerable to an information tampering vulnerability, which may allow an attacker to send a malicious packet to rewrite the device value and adversely affect the system’s operation.\nCVE-2021-20601 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nParul Sindhwad and Dr. Faruk Kazi of COE-CNDS Lab, VJTI, Mumbai, India, reported this vulnerability to Mitsubishi Electric.\n4. MITIGATIONS\nMitsubishi Electric recommends users take measures such as installing a firewall to protect the GOT and system from unauthorized access from external equipment via the network.\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting this vulnerability:\n\nUse a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required.\nUse the products within a LAN and block access from untrusted networks and hosts.\nInstall antivirus software on user computers with access to the product and the system.\nUse the IP filter function to restrict the accessible IP addresses.\n\nFor more information, please contact the local Mitsubishi Electric representative or refer to the Mitsubishi Electric support website.\nFor specific update instructions and additional details, see the Mitsubishi Electric advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-20601"
  ],
  "techniques": [
    "T2000"
  ],
  "advisory": "icsa-21-320-02",
  "title": "Mitsubishi Electric GOT products | CISA",
  "source": "ics-advisories",
  "id": "b915927e699083c816f293b49fcd0bf65a7febcf73bad93e1235b8ec7762d654"
}