{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 5.3\n\nATTENTION: Low skill level to exploit\nVendor: Omron\nEquipment: CX-Supervisor\nVulnerabilities: Stack-based Buffer Overflow, Use After Free, Access of Uninitialized Pointer, Double Free, Out-of-bounds Write, Untrusted Pointer Dereference, Heap-based Buffer Overflow.\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-072-01 Omron CX-Supervisor that was published March 13, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of CX-Supervisor are affected:\n--------- Begin Update A Part 1 of 2 --------\n\nCX-Supervisor: Versions 3.40 and prior\n\n--------- End Update A Part 1 of 2 ----------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STACK-BASED BUFFER OVERFLOW CWE-121Parsing malformed project files may cause a stack-based buffer overflow.CVE-2018-7513 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).4.2.2    USE AFTER FREE CWE-416Use after free vulnerabilities can be exploited when CX Supervisor parses a specially crafted project file.CVE-2018-7521 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).4.2.3    ACCESS OF UNINITIALIZED POINTER CWE-824Access of uninitialized pointer vulnerabilities can be exploited when CX Supervisor indirectly calls an initialized pointer when parsing malformed packets.CVE-2018-7515 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).4.2.4    DOUBLE FREE CWE-415Parsing malformed project files may cause a double free vulnerability.CVE-2018-7523 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).4.2.5    OUT-OF-BOUNDS WRITE CWE-787Parsing malformed project files may cause an out of bounds vulnerability.CVE-2018-7517 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).4.2.6    UNTRUSTED POINTER DEREFERENCE CWE-822Processing a malformed packet by a certain executable may cause an untrusted pointer dereference vulnerability.CVE-2018-7525 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).4.2.7    HEAP-BASED BUFFER OVERFLOW CWE-122Parsing malformed project files may cause a heap-based buffer overflow.CVE-2018-7519 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\n--------- Begin Update A Part 2 of 2 --------\nEsteban Ruiz (mr_me) of Source Incite and rgod working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\n--------- End Update A Part 2 of 2 ----------\n5. MITIGATIONS\nOmron has released Version 3.4.1 of CX-Supervisor to address the reported vulnerabilities. Users can download the latest version of CX-Supervisor at the following location:https://www.myomron.com/index.php?action=kb&article=1707NCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web site. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT web site in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-7513",
    "CVE-2018-7517",
    "CVE-2018-7521",
    "CVE-2018-7523",
    "CVE-2018-7525",
    "CVE-2018-7519",
    "CVE-2018-7515"
  ],
  "techniques": [],
  "advisory": "icsa-18-072-01",
  "title": "Omron CX-Supervisor (Update A) | CISA",
  "source": "ics-advisories",
  "id": "d870fde5dab5596338a88f16a92004633425d0ac1f81759a31f3128bd9552fb4"
}