{
  "markdown": "\nCVSS v3 9.1\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Detcon\nEquipment: SiteWatch Gateway\nVulnerabilities: Improper Authentication, Plaintext Storage of a Password\nAFFECTED PRODUCTS\nThe following versions of Detcon SiteWatch Gateway, an Ethernet Notification System, are affected:\n\nAll SiteWatch Gateway versions are affected.\nDetcon reports Cellular versions not impacted.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities may allow remote code execution. An attacker who exploits these vulnerabilities may be able to change settings on the affected product or obtain user passwords.\nMITIGATION\nDetcon no longer sells or maintains the SiteWatch Gateway product. They have attempted to send a notification to all SiteWatch users.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nIMPROPER AUTHENTICATION CWE-287\n\nAn attacker can edit settings on the device using a specially crafted URL.\nCVE-2017-6049 has been assigned to this vulnerability. A CVSS v3 base score of 9.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N).\n\nPLAINTEXT STORAGE OF A PASSWORD CWE-256\n\nPasswords are presented in plaintext in a file that is accessible without authentication.\nCVE-2017-6047 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\nRESEARCHER\nIndependent researcher Maxim Rupp reported the vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sectors: Commercial Facilities, Critical Manufacturing, Energy, Water and Wastewater Systems\nCountries/Areas Deployed: United States, Europe, Asia\nCompany Headquarters Location: The Woodlands, Texas\n",
  "cves": [
    "CVE-2017-6047",
    "CVE-2017-6049"
  ],
  "techniques": [],
  "advisory": "icsa-17-136-01",
  "title": "Detcon SiteWatch Gateway | CISA",
  "source": "ics-advisories",
  "id": "40122ad7bf5f5ee209fe8ad5c9d450382fd6f1c12cec534be29b9e0ad8cc2367"
}