{
  "markdown": " AzeoTech DAQFactory Stack Overflow \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryAzeoTech DAQFactory Stack Overflow================================== Last Revised September 06, 2018 Alert Code ICSA\\-11\\-264\\-01Overview-------- This advisory is a follow\\-up to the alert titled “ [ICS\\-ALERT\\-11\\-256\\-02—AzeoTech DAQFactory Stack Overflow](/ics/alerts/ICS-ALERT-11-256-02)  ” that was published September 13, 2011, on the ICS\\-CERT web page. ICS\\-CERT is aware of a public report of one stack overflow vulnerability with proof\\-of\\-concept (POC) exploit code affecting AzeoTech DAQFactory, a SCADA/HMI Product. According to the report, the vulnerability is exploitable via a service running on Port 20034/UDP. The report was released without coordinating with either the vendor or ICS\\-CERT. ICS\\-CERT has coordinated with AzeoTech, which has produced an upgrade that resolves the vulnerability. ICS\\-CERT has not validated the upgrade. Attribution for the vulnerability discovery is not provided in this advisory because no prior coordination occurred with the vendor, ICS\\-CERT, or other coordinating body. ICS\\-CERT encourages researchers to coordinate vulnerability details before public release. The public release of vulnerability details prior to the development of proper mitigations may put industrial control systems (ICSs) and the public at avoidable risk.Affected Products----------------- According to AzeoTech, only DAQFactory Version 5\\.85 is affected by this vulnerability.Impact------ This stack overflow vulnerability could allow an attacker to cause a denial of service or remotely execute code on the targeted system. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.Background---------- DAQFactory is a supervisory control and data acquisition (SCADA) and human\\-machine interface (HMI) software used in multiple industries including water, power, and manufacturing. DAQFactory installations are primarily located in the United States and Europe.Vulnerability Characterization------------------------------### Vulnerability Overview DAQFactory listens on Port 20034/UDP by default. An attacker can send specially crafted traffic to this port to cause a stack overflow, which may allow remote code execution.[MITRE](http://cve.mitre.org/cve)  has assigned number CVE\\-2011\\-3492 to this vulnerability in the Common Vulnerabilities and Exposures (CVE) database.### Vulnerability Details#### Exploitability This vulnerability is remotely exploitable.#### Existence of Exploit Public exploits are known to target this vulnerability.#### Difficulty An attacker with a low skill level can create the denial of service; however, only a more skilled attacker could exploit this vulnerability to execute arbitrary code.Mitigation---------- According to AzeoTech, the vulnerable feature has been completely removed in the next version (Version 5\\.86\\). The feature was undocumented, and AzeoTech does not believe it was being used by any of their customers. Therefore, its removal should not adversely affect any DAQFactory users. AzeoTech provides the following instructions to upgrade to Version 5\\.86: Existing customers can download and install the DAQFactory trial from the website (http://www.AzeoTech.com/downloads.php) over their existing installation at no charge. The user’s license is maintained. Because this is the standard update path for DAQFactory, most customers will be familiar with the process. ICS\\-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.* Minimize network exposure for all control system devices. Critical devices should not directly face the Internet.* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods such as Virtual Private Networks (VPNs), recognizing that VPN is only as secure as the connected devices. The Control Systems Security Program (CSSP) also provides [a section for control system security recommended practices](/ics/recommended-practices)  on the CSSP web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* AzeoTech-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-264-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2011-3492"
  ],
  "techniques": [],
  "advisory": "icsa-11-264-01",
  "title": "AzeoTech DAQFactory Stack Overflow | CISA",
  "source": "ics-advisories",
  "id": "6be3382ead0bbed90ecbbdb1c7f4b91e479b5f40ed4f50e26079e634ca011da9"
}