{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Omron\nEquipment: CX-Position\nVulnerabilities: Stack-based Buffer Overflow, Improper Restriction of Operations Within the Bounds of a Memory Buffer, Use After Free, Out-of-bounds Write\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities when parsing an NCI file could allow code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CX-Position, a position control software, are affected:\n\nCX-Position Versions 2.5.3 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to multiple stack-based buffer overflow conditions while parsing a specific project file, which may allow an attacker to locally execute arbitrary code.\nCVE-2022-26419 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe affected product is vulnerable to memory corruption while processing a specific project file, which may allow an attacker to execute arbitrary code.\nCVE-2022-25959 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.3    USE AFTER FREE CWE-416\nThe affected product is vulnerable to a use after free memory condition while processing a specific project file, which may allow an attacker to execute arbitrary code.\nCVE-2022-26417 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.2.4    OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to an out-of-bounds write while processing a specific project file, which may allow an attacker to execute arbitrary code.\nCVE-2022-26022 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nxina1i, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nOmron has provided Version 2.5.4, which is only available to paying users who use the “Auto Update” function. Please contact Omron technical Support or an Omron representative for specific update information.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. \n",
  "cves": [
    "CVE-2022-26419",
    "CVE-2022-25959",
    "CVE-2022-26022",
    "CVE-2022-26417"
  ],
  "techniques": [],
  "advisory": "icsa-22-088-02",
  "title": "Omron CX-Position | CISA",
  "source": "ics-advisories",
  "id": "af06fada0458cd7b9384ceaf145372dfb4000bf9835e7b7f162bc506ae364556"
}