{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: 3S-Smart Software Solutions GmbH\nEquipment: CODESYS Web Server\nVulnerability: Stack-based Buffer Overflow\nAFFECTED PRODUCTS\nAll Microsoft Windows (also WinCE) based CODESYS web servers running stand-alone Version 2.3, or as part of the CODESYS runtime system running prior to Version V1.1.9.19, are affected.\nIMPACT\nSuccessful exploitation of this vulnerability could cause the device the attacker is accessing to crash, resulting in a buffer overflow condition that may allow remote code execution.\nMITIGATION\nThis vulnerability will be fixed by patch V.1.1.9.19 for the CODESYS V2.3 web server for Windows. This will be part of the CODESYS setup V2.3.9.56. The release of this security patch was made available on January 30, 2018.\nCurrently, 3S-Smart Software Solutions GmbH has not identified any workarounds for this vulnerability.\nIn general, 3S-Smart Software Solutions GmbH recommends the following defensive measures to reduce the risk of exploitation of this vulnerability:\n\nUse controllers and devices only in a protected environment to minimize network exposure and ensure they are not accessible from outside.\nUse firewalls to protect and separate the control system network from other networks.\nUse VPN (Virtual Private Networks) tunnels if remote access is required.\nProtect both development and control systems from unauthorized access (e.g., by means of the operating system).\nProtect both development and control system by using up-to-date virus detecting solutions.\n\nFor additional information regarding the CODESYS products, or about the described vulnerability, please contact the 3S-Smart Software Solutions support team at this location:\nhttps://www.codesys.com/support-training/codesys-support.html\nFor additional information find the CODESYS Security update at the following location:\nhttps://customers.codesys.com/fileadmin/data/customers/security/2018/Advisory2018-01_LCDS-282.pdf\nFor more information and general recommendations for protecting machines and manufacturing facilities, see the CODESYS Security whitepaper available at this location:\nhttps://customers.codesys.com/fileadmin/data/customers/security/CODESYS-Security-Whitepaper.pdf\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nA crafted request may cause a buffer overflow and could therefore execute arbitrary code on the web server or lead to a denial-of-service condition due to a crash in the web server.\nCVE-2018-5440 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nRESEARCHER\nZhu WenZhe of Istury IOT security lab reported this vulnerability to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Critical Manufacturing, Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Kempten, Germany\n",
  "cves": [
    "CVE-2018-5440"
  ],
  "techniques": [],
  "advisory": "icsa-18-032-02",
  "title": "3S-Smart Software Solutions GmbH CODESYS Web Server | CISA",
  "source": "ics-advisories",
  "id": "e3de8e68d64dd57459fc24713c82f379c0f8116d62ce2c6b0a056edbb1ac8d9e"
}