{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.3\n\nATTENTION: Low skill level to exploit\nVendor: Panasonic\nEquipment: Control FPWIN Pro\nVulnerabilities: Heap-based Buffer Overflow, Type Confusion\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device and allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Control FPWIN Pro, a PLC programming software, are affected:\n\nFPWIN Pro Version 7.3.0.0 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nAttacker-created project files loaded by an authenticated user can cause heap-based buffer overflows, which may lead to remote code execution. \nCVE-2019-6530 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.2    ACCESS OF RESOURCE USING INCOMPATIBLE TYPE ('TYPE CONFUSION') CWE-843\nAttacker-created project files loaded by an authenticated user can trigger incompatible type errors because the resource does not have expected properties. This may lead to remote code execution. \nCVE-2019-6532 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Critical Manufacturing, and Food and Agriculture\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\n9sg Security Team working with Trend Micro’s Zero Day Initiative reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nPanasonic recommends users upgrade to FPWIN Pro Version 7.3.1.0 or newer, which can be downloaded at the following link:\nhttps://www.panasonic-electric-works.com/eu/plc-software-control-fpwin-pro.htm\nFor more information about these issues or other vulnerabilities in Panasonic products, please contact the Panasonic Product Security Incident Response Team:\nhttps://www.panasonic.com/global/corporate/product-security/sec/psirt.html\nNCCIC recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6532",
    "CVE-2019-6530"
  ],
  "techniques": [],
  "advisory": "icsa-19-157-02",
  "title": "Panasonic Control FPWIN Pro | CISA",
  "source": "ics-advisories",
  "id": "200e6dfe9ba630d1d49a1b3ad70c25df945dbba08aec65cf678bb2c8984097a3"
}