{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.5\nATTENTION: Low attack complexity\nVendor: Rockwell Automation\nEquipment: ISaGRAF\nVulnerability: Improper Restriction of XML External Entity Reference\n\n2.UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-22-088-01 Rockwell Automation ISaGRAF that was published March 29, 2022, to the ICS webpage at www.cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to pass local file data to a remote web server, leading to loss of confidentiality.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Rockwell Automation software products are affected:\n\nConnected Component Workbench: v12.00 and prior\n\n--------- Begin Update A Part 1 of 2 ---------\n\nISaGRAF Workbench: All versions prior to v6.6.10\n\n--------- End Update A Part 1 of 2 ---------\n\nISaGRAF Workbench: v6.6.9 and prior\nSafety Instrumented Systems Workstation: v1.1 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nWhen opening a malicious solution file provided by an attacker, the application suffers from an XML external entity vulnerability due to an unsafe call within a dynamic link library file. An attacker could exploit this to pass data from local files to a remote web server, leading to a loss of confidentiality.\nCVE-2022-1018 has been assigned to this vulnerability. A CVSS v3 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nkimiya of Trend Micro’s Zero Day Initiative reported this vulnerability to CISA.\n5. MITIGATIONS\nRockwell Automation encourages users to update to the available software revisions below:\n\nConnected Component Workbench: Update to v13.00\n\n--------- Begin Update A Part 2 of 2 ---------\n\nISaGRAF Workbench: Update to 6.6.10\n\n--------- End Update A Part 2 of 2 ---------\n\nISaGRAF Workbench: For now, use mitigations listed until a patch is released. More mitigation actions are planned.\nSafety Instrumented Systems Workstation: Update to v1.2\n\nIf an upgrade is not possible or available, users should apply the following mitigations:\n\nRun Connected Components Workbench as a User, not as an Administrator, to minimize the impact of malicious code on the infected system.\nDo not open untrusted files with Connected Component Workbench, ISaGRAF, SISW. Employ training and awareness programs to educate users on the warning signs of a phishing or social engineering attack.\nUse Microsoft AppLocker or other similar allow list application to help mitigate risk. Information on using AppLocker with Rockwell Automation products is available at KnowledgeBase Article QA17329\nEnsure the least-privilege user principle is followed, and user/service account access to shared resources (such as a database) is only granted with a minimum number of rights as needed.\n\nFor more information see Rockwell Automation’s security advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-1018"
  ],
  "techniques": [],
  "advisory": "icsa-22-088-01",
  "title": "Rockwell Automation ISaGRAF (Update A) | CISA",
  "source": "ics-advisories",
  "id": "6dcfcd855ef45bcd7addca214f967b0fd82fa5d08392eead2ca63532b22b4bb6"
}