{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity \nVendor: GE \nEquipment: CIMPLICITY \nVulnerabilities: Access of Uninitialized Pointer, Heap-based Buffer Overflow, Untrusted Pointer Dereference, Out-of-bounds Write \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device being accessed or allow arbitrary code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CIMPLICITY, an HMI/SCADA software, are affected: \n\nCIMPLICITY: Versions 2022 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 ACCESS OF UNINITIALIZED POINTER CWE-824 \nThe affected product is vulnerable when data from a faulting address controls code flow starting at gmmiObj!CGmmiRootOptionTable, which could allow an attacker to execute arbitrary code. \nCVE-2022-3084 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.2 ACCESS OF UNINITIALIZED POINTER CWE-824 \nThe affected product is vulnerable when data from a faulting address controls code flow starting at gmmiObj!CGmmiOptionContainer, which could allow an attacker to execute arbitrary code. \nCVE-2022-2952 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.3 HEAP-BASED BUFFER OVERFLOW CWE-122 \nThe affected product is vulnerable to a heap-based buffer overflow, which could allow an attacker to execute arbitrary code. \nCVE-2022-2948 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.4 UNTRUSTED POINTER DEREFERENCE CWE-822 \nThe affected product is vulnerable when data from faulting address controls code flow starting at gmmiObj!CGmmiOptionContainer, which could allow an attacker to execute arbitrary code. \nCVE-2022-2002 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.2.5 OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to an out-of-bounds write, which could allow an attacker to execute arbitrary code. \nCVE-2022-3092 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nKimiya working with Trend micro Zero Day Initiative reported these vulnerabilities to CISA. \n4. MITIGATIONS\nGE recommends users refer to the CIMPLICITY Secure Deployment Guide (login required) for mitigations to the reported vulnerabilities. Specific sections to reference include Section 3.5 Projects and Section 4.2 CimView. \nFor more information about this issue, see the GE Digital Product Security Advisory (login required). \nFor further questions, users should contact GE. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \n\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. \nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. \nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. \nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. \n",
  "cves": [
    "CVE-2022-2952",
    "CVE-2022-3084",
    "CVE-2022-3092",
    "CVE-2022-2002",
    "CVE-2022-2948"
  ],
  "techniques": [],
  "advisory": "icsa-22-326-04",
  "title": "GE CIMPLICITY | CISA",
  "source": "ics-advisories",
  "id": "c3eee6c4d1e3656be9ff2a2fea22017ee0ef86e218dfe4f5e40bea6534189bc9"
}