{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: Low skill level to exploit\nVendor: Siemens\nEquipment: SIMATIC RTLS Locating Manager\nVulnerabilities: Incorrect Default Permissions, Unquoted Search Path or Element\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a privileged local user to escalate privileges.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSiemens reports that the vulnerabilities affect the following versions of SIMATIC RTLS Locating Manager: \n\nSIMATIC RTLS Locating Manager, all versions prior to v2.10.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT DEFAULT PERMISSIONS CWE-276\nThe start-stop scripts for the services of the affected application could allow a local attacker to include arbitrary commands that are executed when services are started or stopped interactively by system administrators. \nCVE-2020-10049 has been assigned to this vulnerability. A CVSS v3 base score of 7.9 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:N).\n3.2.2    INCORRECT DEFAULT PERMISSIONS CWE-276\nThe directory of service executables of the affected application could allow a local attacker to include arbitrary commands that are executed with SYSTEM privileges when the system restarts. \nCVE-2020-10050 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:N).\n3.2.3    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nMultiple services of the affected application are executed with SYSTEM privileges while the call path is not quoted. This could allow a local attacker to inject arbitrary commands that are executed instead of the legitimate service. \nCVE-2020-10051 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Transportation Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSiemens recommends that users apply the update of the SIMATIC RTLS Locating Manager: v2.10.2\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nApply security hardening of the Windows Server, where the RTLS Locating Manager is installed on, in accordance with your corporate security policies or up-to-date hardening guidelines.\nEnsure that only trusted persons have access to the system and avoid the configuration of additional local accounts on the server.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for Industrial Security, and following the recommendations in the product manuals.\nFollow this link for additional information on Industrial Security by Siemens.\nFor more information on these vulnerabilities and the associated mitigations, please see Siemens security advisory SSA-251935\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-10051",
    "CVE-2020-10050",
    "CVE-2020-10049"
  ],
  "techniques": [],
  "advisory": "icsa-20-252-01",
  "title": "Siemens SIMATIC RTLS Locating Manager | CISA",
  "source": "ics-advisories",
  "id": "ad62514741b9335739a96381bd6a20b2345f791c654de4cfcca424ff02423ead"
}