{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Schneider Electric\nEquipment: SoMachine Basic\nVulnerability: Improper Restriction of XML External Entity Reference\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may result in disclosure and retrieval of arbitrary data on the affected node via out-of-band (OOB) attack.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nSchneider Electric reports this vulnerability affects the following SoMachine Basic: \n\nSoMachine Basic, all versions prior to v1.6 SP1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nSchneider Electric SoMachine Basic prior to v1.6 SP1 suffers from an XML External Entity (XXE) vulnerability using the DTD parameter entities technique resulting in disclosure and retrieval of arbitrary data on the affected node via out-of-band (OOB) attack. This vulnerability is triggered when input passed to the xml parser is not sanitized while parsing the xml project/template file. \nCVE-2018-7783 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing; Dams; Defense Industrial Base; Energy; Food and Agriculture; Government Facilities; Nuclear Reactors, Materials, and Waste; Transportation Systems; Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: France\n\n3.4 RESEARCHER\nGjoko Krstikj of Applied Risk reported this vulnerability to Schneider Electric.\n4. MITIGATIONS\nSchneider Electric has replaced SoMachine Basic with EcoStruxure Machine Expert – Basic. The following steps are recommended for mitigation of this issue:\nSTEP 1: Update software and firmware \n\nOn the engineering workstation, update to EcoStruxure Machine Expert – Basic v1.1 SP1 or above. \nOn Modicon M100/M200/M221 Logic controllers, update to latest firmware version. \n\nSTEP 2: Update projects in EcoStruxure Machine Expert – Basic\n\nUpgrade the functional level of the application to minimum Version 10.2\nActivate the application protection for both read and write in the project properties. \n\nSTEP 3: Transfer applications. \n\nTransfer applications to Modicon M100/M200/M221 logic controllers. EcoStruxure Machine Expert – Basic will perform an integrity check when transferring the application and will display a warning pop-up to the user if the application has been altered during transfer.\n\nPlease see Schneider Electric’s publication SEVD-2018-142-01 for more information.\nSchneider Electric also recommends the following general security practices:\n\nLocate control and safety system networks and remote devices behind firewalls and isolate them from the business network.\nInstall physical controls so no unauthorized personnel can access your industrial control and safety systems, components, peripheral equipment, and networks.\nPlace all controllers in locked cabinets and never leave them in the “Program” mode.\nNever connect programming software to any network other than the network for the devices it is intended for.\nScan all methods of mobile data exchange with the isolated network such as CDs, USB drives, etc. before use in the terminals or any node connected to these networks.\nNever allow mobile devices that have connected to any other network besides the intended network to connect to the safety or control networks without proper sanitation.\nMinimize network exposure for all control system devices and systems and ensure they are not accessible from the Internet.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs). Recognize VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand VPNs are only as secure as the connected devices.\nFor more information refer to the Schneider Electric Recommended Cybersecurity Best Practices document.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2018-7783"
  ],
  "techniques": [],
  "advisory": "icsa-21-103-01",
  "title": "Schneider Electric SoMachine Basic | CISA",
  "source": "ics-advisories",
  "id": "221eba11f2a86022bda96cddd56508faeed3445b268ead806d884084e8a2c461"
}