{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Honeywell \nEquipment: OneWireless Wireless Device Manager (WDM) \nVulnerabilities: Command Injection, Use of Insufficiently Random Values, Missing Authentication for Critical Function \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could disclose sensitive information, allow privilege escalation, or allow remote code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHoneywell reports these vulnerabilities affect the following versions of OneWireless WDM:  \n\nAll versions up to R322.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 COMMAND INJECTION CWE-77 \nWhile a backup is in progress, malicious users could enter a system command along with a backup configuration, which could result in the execution of unwanted commands.  \nCVE-2022-46361 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). \n3.2.2 USE OF INSUFFICIENTLY RANDOM VALUES CWE-330 \nThis vulnerability exists due to an insufficiently secure random number used for generating keys, which is used for signing tokens. \nCVE-2022-43485 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N). \n3.2.3 MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306 \nAn unauthenticated API could allow an attacker to obtain the information about network resources. \nCVE-2022-4240 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nThe UK's National Cyber Security Centre (NCSC) reported these vulnerabilities to Honeywell. \n4. MITIGATIONS\nHoneywell recommends users upgrade OneWireless WDM to release R322.2. Download information includes the following: \n\nProduct: OneWireless \nVersion: 322.2 \nFor instructions on this process:\n\nGo to the Honeywell Website and sign in.\nSelect “Support” at the top of the web page\nSelect “Product Documents & Downloads.”\nIn the given search box, search for: “OneWireless R322.2” or, after logging in, select the hyperlink: “OneWireless R322.2.” \n\n\n\nHoneywell advises users to ensure OneWireless security best practices are followed on the network to which the OneWireless WDM is attached to ensure access is limited to authorized users only. Users should ensure the backup files are maintained in a network location or physical drive with access limited to authorized users only and should not share them.\nThe recommended network installation guidelines are available in the Honeywell guide, \"Network-Planning-and-Installation-Guide-OWDOC-X253-en-322.\" For access, users should visit the Honeywell website and sign in, select “Support” at the top of the web page, then select “Product Documents & Downloads.” In the given search box, search for: “Network-Planning-and-Installation-Guide-OWDOC-X253-en-322” or, after logging in, select the hyperlink: Network-Planning-and-Installation-Guide-OWDOC-X253-en-322. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nEnsure the least-privilege user principle is followed.  \nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have a low attack complexity. \n",
  "cves": [
    "CVE-2022-43485",
    "CVE-2022-4240",
    "CVE-2022-46361"
  ],
  "techniques": [],
  "advisory": "icsa-23-075-06",
  "title": "Honeywell OneWireless Wireless Device Manager | CISA",
  "source": "ics-advisories",
  "id": "92cdafbbb3abdba358b15632ee4e8a17a4c489d518c5b02426ef265eac2edfe8"
}