{
  "markdown": " Rockwell Automation Stratix Services Router \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryRockwell Automation Stratix Services Router=========================================== Last Revised April 25, 2018 Alert Code ICSA\\-18\\-107\\-031\\. EXECUTIVE SUMMARY---------------------* **CVSS v3 9\\.8*** **ATTENTION**  : Exploitable remotely/low skill level to exploit.* **Vendor**  : Rockwell Automation* **Equipment**  : Allen\\-Bradley Stratix 5900 Services Router* **Vulnerabilities**  : Improper Input Validation, Improper Restriction of Operations within the Bounds of a Memory Buffer, Use of Externally\\-Controlled Format String.2\\. RISK EVALUATION------------------- Successful exploitation of these vulnerabilities could result in loss of availability, confidentiality, and/or integrity caused by memory exhaustion, module restart, information corruption, and/or information exposure.3\\. TECHNICAL DETAILS---------------------### 3\\.1 AFFECTED PRODUCTS The following versions of Allen\\-Bradley Stratix Services Router use a vulnerable version of Cisco IOS or IOS XE:* Allen\\-Bradley Stratix 5900 Services Router, version 15\\.6\\.3M1 and earlier.### 3\\.2 VULNERABILITY OVERVIEW### 3\\.2\\.1 [IMPROPER INPUT VALIDATION CWE\\-20](https://cwe.mitre.org/data/definitions/20.html) A vulnerability in the Internet Key Exchange Version 2 (IKEv2\\) module of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated remote attacker to cause a memory leak or a reload of an affected device that leads to a denial of service (DoS) condition. The vulnerability is due to incorrect processing of certain IKEv2 packets. An attacker could exploit this vulnerability by sending crafted IKEv2 packets to an affected device to be processed. A successful exploit could cause an affected device to continuously consume memory and eventually reload, resulting in a DoS condition.[CVE\\-2018\\-0158](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2018-0158)  has been assigned to this vulnerability. A CVSS v3 base score of 8\\.6 has been calculated; the CVSS vector string is ( [AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H)  ).### 3\\.2\\.2 [IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE\\-119](https://cwe.mitre.org/data/definitions/119.html) A vulnerability in the quality of service (QoS) subsystem of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated remote attacker to cause a DoS condition or execute arbitrary code with elevated privileges. The vulnerability is due to incorrect bounds checking of certain values in packets that are destined for UDP port 18999 of an affected device. An attacker could exploit this vulnerability by sending malicious packets to an affected device. When the packets are processed, an exploitable buffer overflow condition may occur. A successful exploit could allow the attacker to execute arbitrary code on the affected device with elevated privileges. The attacker could also leverage this vulnerability to cause the device to reload, causing a temporary DoS condition while the device is reloading. The malicious packets must be destined to and processed by an affected device. Traffic transiting a device will not trigger the vulnerability.[CVE\\-2018\\-0151](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2018-0151)  has been assigned to this vulnerability. A CVSS v3 base score of 9\\.8 has been calculated; the CVSS vector string is ( [AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)  ).### 3\\.2\\.3 [IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE\\-119](https://cwe.mitre.org/data/definitions/119.html) A buffer overflow vulnerability in the LLDP subsystem of Cisco IOS Software, Cisco IOS XE Software, and Cisco IOS XR Software could allow an adjacent, unauthenticated attacker to cause a DoS condition or execute arbitrary code with elevated privileges.[CVE\\-2018\\-0167](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2018-0167)  has been assigned to this vulnerability. A CVSS v3 base score of 8\\.8 has been calculated; the CVSS vector string is ( [AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)  ).### 3\\.2\\.4 [USE OF EXTERNALLY\\-CONTROLLED FORMAT STRING CWE\\-134](https://cwe.mitre.org/data/definitions/134.html) A format string vulnerability in the LLDP subsystem of Cisco IOS Software and Cisco IOS XE Software could allow an adjacent, unauthenticated attacker to cause a DoS condition or execute arbitrary code with elevated privileges.[CVE\\-2018\\-0175](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2018-0175)  has been assigned to this vulnerability. A CVSS v3 base score of 8\\.8 has been calculated; the CVSS vector string is ( [AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)  ).### 3\\.3 BACKGROUND* **Critical Infrastructure Sectors:**  Critical Manufacturing, Energy, Water and Wastewater Systems* **Countries/Areas Deployed:**  Worldwide* **Company Headquarters Location:**  Wisconsin, USA### 3\\.4 RESEARCHER Rockwell Automation reported these vulnerabilities to NCCIC from the semi\\-annual Cisco IOS and IOS XE Software Security Advisory Bundled Publication.4\\. MITIGATIONS--------------- Rockwell Automation has released knowledge base article 1073313 which can be found at the following location:<https://rockwellautomation.custhelp.com/app/answers/detail/a_id/1073313/> (login required) Cisco has released Snort Rules 46110 and 46111 to help address CVE\\-2018\\-0158 and CVE\\-2018\\-0151\\. See new rules at:[https://www.cisco.com/web/software/286271056/117258/sf\\-rules\\-2018\\-03\\-29\\-new.html](https://www.cisco.com/web/software/286271056/117258/sf-rules-2018-03-29-new.html)  CVE\\-2018\\-0151: Users who do not use the Adaptive QoS for DMVPN feature can deny all traffic destined to UDP port 18999 on an affected device by using a Control Plane Policing (CoPP) policy. If the Adaptive QoS for DMVPN feature is later configured, the device must be upgraded to an unaffected release of Cisco IOS Software or Cisco IOS XE Software and the CoPP policy must be removed. CVE\\-2018\\-0167 and CVE\\-2018\\-0175 have no specific mitigations in place. See the following Cisco Vulnerability advisory for more details:[https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco\\-sa\\-20180328\\-lldp](https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-lldp)  Rockwell Automation also recommends that users implement the following general security guidelines:* Help minimize network exposure for all control system devices and/or systems, and confirm that they are not accessible from the Internet.* Locate control system networks and devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. NCCIC also provides a section for [control systems security recommended practices](/ics/content/recommended-practices)  on the ICS\\-CERT web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . Additional mitigation guidance and recommended practices are publicly available in the ICS\\-CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the [ICS\\-CERT website.](/ics/)  Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents. No known public exploits specifically target these vulnerabilities This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Rockwell Automation-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-18-107-03)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2018-0175",
    "CVE-2018-0151",
    "CVE-2018-0158",
    "CVE-2018-0167"
  ],
  "techniques": [],
  "advisory": "icsa-18-107-03",
  "title": "Rockwell Automation Stratix Services Router | CISA",
  "source": "ics-advisories",
  "id": "4b21088133019a6c046134c23892ad55dae3f641c5431b1501729c414e168678"
}