{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Mitsubishi Electric\nEquipment: GOT2000 Series\nVulnerabilities: Improper Restriction of Operations within the Bounds of a Memory Buffer, Session Fixation, NULL Pointer Dereference, Improper Access Control, Argument Injection, Resource Management Errors\n\t \n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow a remote attacker to cause a denial-of-service condition or remote code execution.\n3. TECHNICAL DETAILS\n\n\n3.1 AFFECTED PRODUCTS\nThe following models of GOT2000 CoreOS Version -Y and earlier are affected:\n\nGT27 model\nGT25 model\nGT23 model\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe vulnerability could allow a malicious attacker to crash the device, which could lead to remote code execution.\nCVE-2020-5595 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    SESSION FIXATION CWE-384\nThe vulnerability could allow a malicious attacker to cause a denial-of-service of TCP connection.\nCVE-2020-5596 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    NULL POINTER DEREFERENCE CWE-476\nThe vulnerability could allow a malicious attacker to cause a denial-of-service condition and crash the device.\nCVE-2020-5597 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    IMPROPER ACCESS CONTROL CWE-284\nThe vulnerability could allow a malicious attacker authentication to access sensitive resources, cause a denial-of-service condition, and crash the device.\nCVE-2020-5598 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.5    IMPROPER NEUTRALIZATION OF ARGUMENT DELIMITERS IN A COMMAND ('ARGUMENT INJECTION') CWE-88\nThe vulnerability could allow an attacker to cause a denial-of-service condition.\nCVE-2020-5599 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n3.2.6    RESOURCE MANAGEMENT ERRORS CWE-399\nThe vulnerability could allow an attacker to obtain sensitive information.\nCVE-2020-5600 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Multiple\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric PSIRT reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi recommends users follow the steps below to update CoreOS to the latest version:\n\nInstall the MELSOFT GT Designer3 (2000) Version 1.240A or later on your personal computer.\nStart the MELSOFT GT Designer3 and copy CoreOS of Version -Z or later to SD card.\nInsert the SD card removed from the personal computer to the target products and update to the latest version of CoreOS.\n\nPlease contact your local Mitsubishi sales office about MELSOFT GT Designer3 (2000).\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-5595",
    "CVE-2020-5599",
    "CVE-2020-5596",
    "CVE-2020-5600",
    "CVE-2020-5598",
    "CVE-2020-5597"
  ],
  "techniques": [],
  "advisory": "icsa-20-189-02",
  "title": "Mitsubishi Electric GOT2000 Series | CISA",
  "source": "ics-advisories",
  "id": "b11affd79dfd4c7d3cc4c786f017f809d866ecef7ca221db5a239bbeb5d8afbf"
}