{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/Low attack complexity\nVendor: Hitachi Energy\nEquipment: DMS600 \nVulnerability: Reliance on Uncontrolled Component\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerabilities could allow an attacker to gain unauthorized access to information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Hitachi Energy product, integrated with MicroSCADA X, is affected: \n\nDMS600: Version 4.5 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 RELIANCE ON UNCONTROLLED COMPONENT CWE-1357 \nA vulnerability exists when Hitachi Energy MicroSCADA X DMS600 v4.5 uses an affected version of PostgreSQL. While modifying certain SQL array values, missing bounds checks let authenticated database users write arbitrary bytes to a wide area of server memory. Successful exploitation of this vulnerability could allow attackers to gain access to the data, causing confidentiality and integrity issues. \nCVE-2021-32027 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). \n3.2.2 RELIANCE ON UNCONTROLLED COMPONENT CWE-1357 \nA vulnerability exists when Hitachi Energy MicroSCADA X DMS600 v4.5 uses an affected version of PostgreSQL. When using an “INSERT ... ON CONFLICT ... DO UPDATE” command on a purpose-crafted table, an authenticated database user could read arbitrary bytes of server memory. \nCVE-2021-32028 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n3.4 RESEARCHER\nHitachi Energy reported these vulnerabilities to CISA.\n4. MITIGATIONS\nHitachi Energy recommends users apply the update at the earliest convenience to the following product: \n\nHitachi Energy DMS600: Update to v4.6. \n\nNote: In DMS600, PostgreSQL is deployed and accessible only from the local host. Remote connections are not allowed by default. \nRecommended security practices and firewall configurations can help protect a process control network from attacks that originate from outside the network. Such practices include that process control systems are physically protected from direct access by unauthorized personnel, have no direct connections to the Internet, and are separated from other networks by means of a firewall system that has a minimal number of ports exposed; and others that must be evaluated case-by-case. Process control systems should not be used for Internet surfing, instant messaging, or receiving e-mails. Portable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system. \nFor more information, see Hitachi Energy advisory 8DBD000102. \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. \nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. \nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. \nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. \nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2021-32027",
    "CVE-2021-32028"
  ],
  "techniques": [],
  "advisory": "icsa-22-298-04",
  "title": "Hitachi Energy MicroSCADA X DMS600 | CISA",
  "source": "ics-advisories",
  "id": "b799e7f3aba98005292fd74d029ec1edbf21979c3c38aa0329152c6df7d2d812"
}