{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Moxa\nEquipment: EDS-G516E series, and EDS-510E series\nVulnerabilities: Stack-based Buffer Overflow, Use of a Broken or Risky Cryptographic Algorithm, Use of Hard-coded Cryptographic Key, Use of Hard-coded Credentials, Classic Buffer Overflow, Cleartext Transmission of Sensitive Information, Weak Password Requirements\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could crash the device, execute arbitrary code, and allow access to sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nMoxa reports the vulnerabilities affect the following Ethernet switches:\n\nEDS-G516E Series firmware, Version 5.2 or lower\nEDS-510E Series firmware, Version 5.2 or lower\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STACK-BASED BUFFER OVERFLOW CWE-121\nThe attacker may execute arbitrary codes or target the device, causing it to go out of service.\nCVE-2020-7007 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThe affected products use a weak cryptographic algorithm, which may allow confidential information to be disclosed.\nCVE-2020-7001 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nThe affected products use a hard-coded cryptographic key, increasing the possibility that confidential data can be recovered.\nCVE-2020-6979 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    USE OF HARD-CODED CREDENTIALS CWE-798\nAn attacker may gain access to the system without proper authentication.\nCVE-2020-6981 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.5    CLASSIC BUFFER OVERFLOW CWE-120\nSome of the parameters in the setting pages do not ensure text is the correct size for its buffer.\nCVE-2020-6999 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.6    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nSensitive information is transmitted over some web applications in cleartext.\nCVE-2020-6997 has been assigned to this vulnerability. A CVSS v3 base score of 4.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:N/A:N).\n3.2.7    WEAK PASSWORD REQUIREMENTS CWE-521\nWeak password requirements may allow an attacker to gain access using brute force.\nCVE-2020-6991 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nIlya Karpov and Evgeniy Druzhinin from Rostelecom-Solar and Georgy Zaytsev of Positive Technologies reported these vulnerabilities to Moxa.\n4. MITIGATIONS\nMoxa has developed the following solutions to address the vulnerabilities:\n\nEDS-G516E Series: Download the new firmware.\nEDS-510E Series: please contact Moxa Technical Support for assistance.\nEnable password on configuration file from “Configuration File Encryption” setting to eliminate the potential risk.\nEnable HTTPS from the “Management Interface” setting.\nEnable “Account Login Failure Lockout” functions to eliminate the potential risk.\n\nPlease see Moxa’s security advisory for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-6981",
    "CVE-2020-6999",
    "CVE-2020-7007",
    "CVE-2020-6997",
    "CVE-2020-6991",
    "CVE-2020-6979",
    "CVE-2020-7001"
  ],
  "techniques": [],
  "advisory": "icsa-20-056-04",
  "title": "Moxa EDS-G516E and EDS-510E Series Ethernet Switches | CISA",
  "source": "ics-advisories",
  "id": "5e20bafa48ec1d39a51df8deb3d7b46e90d5225475f9ce61ce53ecb139c447e6"
}