{
  "markdown": "\nOVERVIEW\nSecurity researcher Praveen Darshanam has identified two DLL loading vulnerabilities in Ecava’s IntegraXor SCADA Server. Ecava has produced a patch that mitigates these vulnerabilities. Praveen Darshanam has tested the patch to validate that it resolves the vulnerabilities.\nAFFECTED PRODUCTS\nThe following SCADA Servers are affected:\n\nIntegraXor SCADA Server prior to Version 4.2.4488\n\nIMPACT\nLoading and executing an insecure DLL is equivalent to running malicious code at the privilege level of the application that uses the DLL.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC/ICS-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation.\nBACKGROUND\nEcava Sdn Bhd (Ecava) is a Malaysia-based software development company that provides the IntegraXor SCADA product. Ecava specializes in factory and process automation solutions.\nThe affected product, IntegraXor, is a suite of tools used to create and run a web-based human‑machine interface for a SCADA system. According to Ecava, IntegraXor is deployed across several sectors including Critical Manufacturing, Energy, Water and Wastewater Systems, and others. Ecava estimates that this product is used in 38 countries, with the largest installations based in the United Kingdom, the United States, Australia, Poland, Canada, and Estonia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENTCWE-427: Uncontrolled Search Path Element, http://cwe.mitre.org/data/definitions/427.html, web site last accessed March 31, 2015.\n\nAn attacker could rename a malicious DLL to meet the criteria of the applications, and the applications would not verify the DLL is correct. The attacker needs to have administrative access to the default install location in order to plant the insecure DLL. Once loaded by either application, the DLL could run malicious code at the privilege level of the application.\nCVE-2015-0990NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2015-0990, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to these vulnerabilities. A CVSS v2 base score of 6.8 has been assigned; the CVSS vector string is (AV:L/AC:L/Au:S/C:C/I:C/A:C).CVSS Calculator, http://nvd.nist.gov/cvss.cfm?version=2&vector=AV:L/AC:L/Au:S/C:C/I:C/A:C, web site last accessed March 31, 2015.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThese vulnerabilities are not exploitable remotely without user interaction. These exploits are only triggered when a local user runs the vulnerable application after loading the malicious DLL file.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target these vulnerabilities.\nDIFFICULTY\nCrafting a working exploit for these vulnerabilities would be difficult. Social engineering is required to convince the user to load the malicious DLL file. Additional user interaction is needed to load the malformed file. This decreases the likelihood of a successful exploit.\nMITIGATION\nEcava recommends users download and install the patch at the following location:\nhttp://www.integraxor.com/download/rc.msi?4.2.4488\nICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email ScamsRecognizing and Avoiding Email Scams, http://www.us-cert.gov/reading_room/emailscams_0905.pdf, web site last accessed March 31, 2015. for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing AttacksNational Cyber Alert System Cyber Security Tip ST04-014, http://www.us-cert.gov/cas/tips/ST04-014.html, web site last accessed March 31, 2015. for more information on social engineering attacks\n\nIn addition, ICS-CERT encourages asset owners to take additional defensive measures to protect against this and other cybersecurity risks.\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page at: http://ics-cert.us-cert.gov/content/recommended-practices. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2015-0990"
  ],
  "techniques": [],
  "advisory": "icsa-15-090-02",
  "title": "Ecava IntegraXor DLL Vulnerabilities | CISA",
  "source": "ics-advisories",
  "id": "eb5aef2b99475e51972a793fc0c6da732ab051765343df2a06011e8499ee74b3"
}