{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Remotely exploitable/low-skill level to exploit\nVendor: Schneider Electric\nEquipment: Modicon M340 PLC\nVulnerability: Resource Exhaustion\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-17-054-03 Schneider Electric Modicon M340 PLC that was published February 23, 2017, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may render the device unresponsive requiring a physical reset of the PLC.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 1 of 3 --------\nSchneider Electric reports the vulnerability affects the following products: \n\nM340 CPUs with firmware prior to v2.9\nM580 CPUs with firmware prior to v2.3\nQuantum CPUs with firmware prior to v3.52\nPremium CPUs all versions\nM1E CPUs all versions\n\n--------- End Update A Part 1 of 3 --------\n4.2 VULNERABILITY OVERVIEW\n4.2.1  RESOURCE EXHAUSTION CWE-400\nA stack-based buffer overflow vulnerability has been identified, which may allow remote code execution. \nCVE-2017-6017 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Defense Industrial Base; Energy; Government Facilities; Nuclear Reactors, Materials, and Waste; Transportation Systems; Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: United States, China, Russia, and India\nCOMPANY HEADQUARTERS LOCATION: France\n\n4.4 RESEARCHER\n--------- Begin Update A Part 2 of 3 --------\nJos Wetzel of Midnight Blue, Younes Dragoni of Nozomi Networks, Ezequiel Fernandez and Luis Francisco Martin Liras of SUPPRESS group at the University of Léon, as well as Zhang Xiaoming, Zhang Jiawei, Sun Zhonghao and Luo Bing from CNCERT/CC reported the issue to Schneider Electric.\n--------- End Update A Part 2 of 3 --------\n5. MITIGATIONS\n--------- Begin Update A Part 3 of 3 --------\nSchneider Electric has released fixes for the vulnerability that can be downloaded from:\n\nM340: https://www.schneider-electric.fr/fr/search/V2.9?filters=CAT_PRD_DOC_FIRMUPD\nM580: https://www.schneider-electric.us/en/product-range/62098-modicon-m580-paccontroller/\nQuantum: https://www.schneider-electric.com/en/download/document/OFS_3_50_2905/\n\nSchneider Electric recommends the following workarounds and mitigations for Premium and M1E devices:\n\nSet up a firewall blocking all remote/external access to Port 502\n\nFor more information Schneider Electric has released a security notification that can be found at: https://www.schneider-electric.com/en/download/document/SEVD-2017-048-02/\n--------- End Update A Part 3 of 3 --------\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNCCIC also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2017-6017"
  ],
  "techniques": [],
  "advisory": "icsa-17-054-03",
  "title": "Schneider Electric Modicon M340 PLC (Update A) | CISA",
  "source": "ics-advisories",
  "id": "8702db32dbe9e43c7e6ff781858cfcc327086a9ab12b6c5e5f56dfec4e5db733"
}