{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Low attack complexity\nVendor: Hitachi ABB Power Grids\nEquipment: eSOMS\nVulnerability: Insufficiently Protected Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow access to user credentials that are stored by the browser.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nHitachi ABB Power Grids reports this vulnerability affects the following product:\n\neSOMS: All Versions 6.3 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nThe web application password field allows a browser to store user credentials, which may allow an attacker who gains control of the users’ system, or successfully exploits a cross site scripting vulnerability in another application, to capture stored passwords.\nCVE-2021-35527 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi ABB Power Grids reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi ABB Power Grids recommends users update to Version 6.3.1 or later.\nHitachi ABB Power Grids also recommends implementing security best practices and firewall configurations, which help protect a process control network from attacks that originate from outside the network. Such practices include:\n\nEnsuring critical applications and systems are physically protected from direct access by unauthorized personnel, have no direct connections to the Internet, and are separated from other networks by means of a firewall.\nFirewalls should be configured to have the minimum number of ports exposed and open ports should be justified and documented.\nCritical systems should not be used for Internet surfing, instant messaging, or receiving e-mails.\nPortable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system.\nIt is important to implement robust security awareness training to ensure users can identify common attacks or content such as phishing emails or malicious webpages.\n\nFor more information on this issue, see the Hitachi ABB Power Grid Security Advisory.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-35527"
  ],
  "techniques": [],
  "advisory": "icsa-21-210-01",
  "title": "Hitachi ABB Power Grids eSOMS | CISA",
  "source": "ics-advisories",
  "id": "2968a40918b8647c71fe6b90f648ef1c8074afdc604ea0913dc391b2e565c893"
}