{
  "markdown": "\nCVSS v3 10.0\nATTENTION: Remotely exploitable/low skill level to exploit. Public exploits are available.\nVendor: Schneider Electric\nEquipment: Trio TView\nVulnerabilities: Multiple Vulnerabilities for Java Runtime Environment\nAFFECTED PRODUCTS\nThe following versions of Schneider Electric Trio TView, a management and diagnostics software, are affected:\n\nTrio TView Software, TBUMPROG-TVIEW, Version 3.27.0 and prior.\n\nIMPACT\nExploitation of these vulnerabilities may allow a remote attacker to compromise the Trio TView Management Suite.\nMITIGATION\nThe Java Runtime Environment 1.8.0u131 is provided with TView Version 3.29.0 and is not affected by these vulnerabilities.\nSchneider Electric recommends that users obtain the software with the fix for these vulnerabilities at the following location:\nhttp://www.schneider-electric.us/en/download/document/Trio_TView_Software_/\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nIn addition, ICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nVULNERABILITY OVERVIEW\nA Java Runtime Environment is provided with TView. The Java Runtime Environment 1.6.0u27 is reported to have multiple vulnerabilities which may impact TView Version 3.27.0 and earlier. The breakdown of the vulnerabilities by CVSS score is as follows:\n\n180 vulnerabilities were identified as having a CVSS base score of 7.0-10,\n161 vulnerabilities were identified as having a CVSS base score of 4.0-6.9, and\n24 vulnerabilities were identified as having a CVSS base score of 0.0-3.9.\n\nFor more information on these vulnerabilities, please see Schneider Electric Security Notification SEVD-2017-199-01 at the following location:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-199-01/\nRESEARCHER\nKarn Ganeshen has reported these vulnerabilities.\nBACKGROUND\nCritical Infrastructure Sector: Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Paris, France\n",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-17-213-02",
  "title": "Schneider Electric Trio TView | CISA",
  "source": "ics-advisories",
  "id": "b2b2341e09620749a4b9c5cbcff8137573043361caec5a390737462f03db1e3d"
}