{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.3\nATTENTION: Exploitable from an adjacent network/low skill level to exploit\nVendor: SHUN HU Technology Co., Ltd\nEquipment: JUUKO Industrial Radio Remote Control\nVulnerabilities: Authentication Bypass by Capture-replay, Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow attackers to replay commands, control the device, view commands, and/or stop the device from running.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\n The following versions of JUUKO Industrial Radio Remote Control are affected:\n•    JUUKO K-800 and K-808: Firmware versions prior to numbers ending ...9A, ...9B, ...9C, etc.\nIf you have any questions on what is affected, please contact SHUN HU Technology technical support.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nK-800 is vulnerable to a replay attack and command forgery, which could allow attackers to replay commands, control the device, view commands, or cause the device to stop running. \nCVE-2018-17932 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN A COMMAND ('COMMAND INJECTION') CWE-77\nAn attacker could specially craft a packet that encodes an arbitrary command, which could be executed on the K-808.\nCVE-2018-19025  has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nMarco Balduzzi, Philippe Z Lin, Federico Maggi, Jonathan Andersson, Akira Urano, Stephen Hilt, and Rainer Vosseler working with Trend Micro's Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSHUN HU Technology has released new firmware that mitigates these vulnerabilities and recommends users contact a sales representative or technical support for assistance on updating firmware.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should ensure the product is in a physically secure area.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2018-17932",
    "CVE-2018-19025"
  ],
  "techniques": [],
  "advisory": "icsa-20-301-01",
  "title": "SHUN HU Technology JUUKO Industrial Radio Remote Control | CISA",
  "source": "ics-advisories",
  "id": "5f3e9c7f8a7f16620c2cb10d9b51803e67d02e6b45e66dd4f8e071af1fe383e2"
}