{
  "markdown": "\nCVSS v3 6.5\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Automated Logic Corporation (ALC)\nEquipment: ALC WebCTRL, Liebert SiteScan, Carrier i-VU\nVulnerability: XML External Entity (XXE)\nREPOSTED INFORMATION\nThis advisory was originally posted to the NCCIC Portal on May 30, 2017, and is being released to the NCCIC/ICS-CERT web site.\nAFFECTED PRODUCTS\nThe following ALC web-based building automation applications are affected:\n\nLiebert SiteScan Web Version 6.5, and prior;\nALC WebCTRL Version 6.5, and prior; and\nCarrier i-Vu Version 6.5, and prior.\n\nIMPACT\nThe vulnerability, if exploited, could lead to the disclosure of confidential data, denial of service (DoS), spoofing of a request from an upstream device, port scanning from the perspective of the machine where the parser is located, and other system impacts.\nImpact to individual organizations depends on many factors that are unique to each organization, including but not limited to whether the application was installed and is maintained in accordance with manufacturer’s recommendations. Risk of impact is significantly lower for those systems installed and maintained as set forth in ALC’s system installation and maintenance guidelines.\nMITIGATION\nALC applications should always be installed and maintained in accordance with the guidelines found here:\nhttp://www.automatedlogic.com/Pages/Security.aspx.\nIn addition, ALC has released the following patches:\n\nWebCTRL 6.0, Cumulative Patch #11;\nWebCTRL 6.1, Cumulative Patch #4; and\nWebCTRL 6.5, Cumulative Patch #5.\n\nThese patch releases may be obtained on the Automated Logic accounts web site or calling Technical Support at 770-429-3002:\n\ni-Vu 6.0, Cumulative Patch #11; and\ni-Vu 6.5, Cumulative Patch #5.\n\nThese patch releases may be obtained by calling Technical Support at 800-277-9852:\nICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\nVULNERABILITY OVERVIEW\n\nIMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE ('XXE') CWE-611\n\nAn attacker could enter malicious input to WebCTRL, i-Vu, or SiteScan Web through a weakly configured XML parser causing the application to execute arbitrary code or disclose file contents from a server or connected network.\nCVE-2016-5795 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:L).\nRESEARCHER\nEvgeny Ermakov from Kaspersky Lab has identified the vulnerability.\nBACKGROUND\nCritical Infrastructure Sector: Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Kennesaw, Georgia\n",
  "cves": [
    "CVE-2016-5795"
  ],
  "techniques": [],
  "advisory": "icsa-17-150-01",
  "title": "Automated Logic Corporation ALC WebCTRL, Liebert SiteScan, Carrier i-VU | CISA",
  "source": "ics-advisories",
  "id": "4715dcdaa75891aca01d0dbf96241281c851dff63e2404a94afdd6121c3b6965"
}