{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Mitsubishi Electric\nEquipment: CC-Link IE TSN Industrial Managed Switch\nVulnerabilities: Observable Timing Discrepancy, Double Free\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in disclosure of information stored in the product by sending specially crafted packets or could cause a denial-of service (DoS) condition by getting a legitimate user to import a specially crafted certificate.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Mitsubishi Electric products are affected:\n\nCC-Link IE TSN Industrial Managed Switch NZ2MHG-TSNT8F2: firmware version 05 and prior\nCC-Link IE TSN Industrial Managed Switch NZ2MHG-TSNT4: firmware version 05 and prior\n\n3.2 Vulnerability Overview\n3.2.1 OBSERVABLE TIMING DISCREPANCY CWE-208\nAn attacker could decrypt ciphertext and disclose sensitive information by sending specially crafted packets and performing a Bleichenbacher style attack.\nCVE-2022-4304 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2 DOUBLE FREE CWE-415\nAn attacker could cause a denial-of-service (DoS) condition on the product by leading a legitimate user to import a malicious certificate.\nCVE-2022-4450 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMitsubishi Electric reported these vulnerabilities to CISA.\n4. MITIGATIONS\nMitsubishi Electric recommends the following:\n\nUpdate CC-Link IE TSN Industrial Managed Switch NZ2MHG-TSNT8F2 and NZ2MHG-TSNT4 to firmware version 06 or later\n\nFor specific update instructions and additional details see Mitsubishi Electric advisory 2023-011.\nAdditionally, Mitsubishi Electric recommends that customers take the following mitigations to minimize the risk of exploitation of these vulnerabilities:\n\nWhen Internet access is required, use a virtual private network (VPN) or other means to prevent unauthorized access.\nUse the products within a LAN and block access from untrusted networks and hosts.\nRestrict physical access to your computer and network equipment on the same network.\nAfter you log into NZ2MHG-TSNT8F2 or NZ2MHG-TSNT4 with the web interface, change user name and password from default setting at [Account Management] displayed on the function menu. Also, set the proper access permissions for the users.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nOctober 5, 2023: Initial Publication\nJune 4, 2024 : Update A - Updated affected product version range, updated mitigations.\n\n",
  "cves": [
    "CVE-2022-4450",
    "CVE-2022-4304"
  ],
  "techniques": [],
  "advisory": "icsa-23-278-03",
  "title": "Mitsubishi Electric CC-Link IE TSN Industrial Managed Switch (Update A) | CISA",
  "source": "ics-advisories",
  "id": "a3924bc25291f61ae40f860f0c497e259e49e46ef03604660293c2cdde477858"
}