{
  "markdown": "\nCVSS v3 5.6\nATTENTION: Low skill level to exploit.\nVendor: Schneider Electric\nEquipment: VAMPSET\nVulnerability: Memory Corruption\nAFFECTED PRODUCTS\nSchneider Electric reports that the vulnerability affects the following VAMPSET setting and configuration software products:\n\nVAMPSET, versions prior to v2.2.189\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow a local attacker to cause the software to enter a denial-of-service condition. The Windows operating system remains operational through the attack.\nMITIGATION\nSchneider Electric has updated the VAMPSET tool in order to recognize malformed setting files. A new version of firmware with the fix for this vulnerability is available for download at the following location:\nhttp://www.schneider-electric.com/en/download/document/VAMPSET_v2.2.191/\nAfter the new version of firmware is installed, when a malformed file is loaded VAMPSET will remain operational and report to the user: “Cannot open file.”\nSchneider Electric has issued Security Notification SEVD-2017-061-01, which contains additional information:\nhttp://www.schneider-electric.com/en/download/document/SEVD-2017-061-01/\nICS-CERT recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not remotely exploitable.\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION CWE-20\n\nVAMPSET is susceptible to a memory corruption vulnerability when a corrupted settings file is loaded. This vulnerability causes the software to halt or not start when trying to open the corrupted file.\nCVE-2017-7967 has been assigned to this vulnerability. A CVSS v3 base score of 5.6 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:N/I:L/A:H).\nRESEARCHER\nKushal Arvind Shah from Fortinet's Fortiguard Labs reported this vulnerability directly to Schneider Electric.\nBACKGROUND\nCritical Infrastructure Sectors: Energy\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: France\n",
  "cves": [
    "CVE-2017-7967"
  ],
  "techniques": [],
  "advisory": "icsa-17-136-04",
  "title": "Schneider Electric VAMPSET | CISA",
  "source": "ics-advisories",
  "id": "ff7dea9a4f5eae8ab074fe28ccf75cab3044a8e2544b5ca27e0e883ac881ead6"
}