{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.4\nATTENTION: Exploitable remotely\nVendor: Mitsubishi Electric\nEquipment: FA products\nVulnerabilities: Use of Password Hash Instead of Password for Authentication, Use of Weak Hash, Cleartext Storage of Sensitive Information, Authentication Bypass by Capture-replay\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-22-090-04 Mitsubishi Electric FA Products that was published March 31, 2022, on the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to log in to the affected products and/or alter and obtain sensitive information.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following FA products are affected:\n\nMELSEC iQ-F Series FX5U(C) CPU modules, All models: All versions\nMELSEC iQ-F Series FX5UJ CPU modules, All models: All versions\n\n--------- Begin Update A Part 1 of 2 ---------\n\nMELSEC iQ-R series: All Versions of the following:\n\nR00/01/02CPU:\nR04/08/16/32/120(EN)CPU\nR08/16/32/120SFCPU\nR08/16/32/120PCPU\nR08/16/32/120PSFCPU\nR16/32/64MTCPU\nRJ71GN11-T2\nRJ71GN11-EIP\nRJ71C24(-R2/R4)\nRJ71EN71\nRJ71GF11-T2\nRJ71GP21(S)-SX\nRJ72GF15-T2\n\n\nMELSEC Q series: All Versions of the following: \n\nQ03UDECPU, Q04/06/10/13/20/26/50/100UDEHCPU\nQ03/04/06/13/26UDVCPU\nQ04/06/13/26UDPVCPU\nQJ71C24N(-R2/R4)\nQJ71E71-100\nQJ72BR15\nQJ72LP25(-25/G/GE)\n\n\nMELSEC L series: All Versions of the following:\n\nL02/06/26CPU(-P), L26CPU-(P)BT\nLJ71C24(-R2)\nLJ71E71-100\nLJ72GF15-T2\n\n\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    USE OF PASSWORD HASH INSTEAD OF PASSWORD FOR AUTHENTICATION CWE-836\nThis vulnerability  allows a remote unauthenticated attacker to log in to the product by replaying an eavesdropped password hash.\nCVE-2022-25155 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.2    USE OF WEAK HASH CWE-328\nThis vulnerability could allow a remote unauthenticated attacker to log in to the product by using a password reversed from an eavesdropped password hash.\nCVE-2022-25156 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.3    USE OF PASSWORD HASH INSTEAD OF PASSWORD FOR AUTHENTICATION CWE-836\nThis vulnerability could allow a remote unauthenticated attacker to disclose or tamper with the information in the product by using an eavesdropped password hash.\nCVE-2022-25157 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.4    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nThis vulnerability could allow a remote attacker to disclose or tamper with a file where the password hash is saved in cleartext.\nCVE-2022-25158 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n4.2.5    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nThis vulnerability could allow a remote unauthenticated attacker to log in to the product by replay attack.\nCVE-2022-25159 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.6     CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nThis vulnerability could allow a remote unauthenticated attacker to disclose a file in a legitimate user's product by using previously eavesdropped cleartext information and to counterfeit a legitimate user’s system.\nCVE-2022-25160 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n4.4 RESEARCHER\nAnton Dorfman, Dmitry Sklyarov, Iliya Rogachev and Artur Akhatov of Positive Technologies reported these vulnerabilities to Mitsubishi Electric.\n5. MITIGATIONS\nMitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploitation of these vulnerabilities:\n\nWhen communicating via untrusted networks or hosts, encrypt the communication path by setting up a VPN.\n\n--------- Begin Update A Part 2 of 2 ---------\n\nUse firewalls or IP filter function to restrict connections to the products and prevent access from untrusted networks or hosts. For details on IP filter function, refer to the following product manual: \n\n“12.1 IP Filter Function” in the MELSEC iQ-F FX 5 User’s Manual (Ethernet Communication)\n\"IP filter\" of \"1.13 Security\" in the MELSEC iQ-R Ethernet User's Manual (Application)\n\"IP Filter Function\" of \"6.2 Security Function\" in the MELSEC iQ-R Motion Controller Programming Manual (Common)\n\"IP filter\" of \"1.4 Security\" in the MELSEC iQ-R CC-Link IE TSN User's Manual (Application)\n\"IP filter\" of \"9.5 Security\" in the MELSEC iQ-R CC-Link IE TSN Plus Master/Local Module User’s Manual\n\"14.3 IP Filter Function\" in the Q Corresponding Ethernet Interface Module User's Manual (Basic)\n\"14.3 IP Filter Function\" in the MELSEC-L Ethernet Interface Module User's Manual (Basic)\n\n\n\n--------- End Update A Part 2 of 2 ---------\nFor more information see Mitsubishi Electric’s advisory 2021-031\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a high attack complexity.\n",
  "cves": [
    "CVE-2022-25155",
    "CVE-2022-25157",
    "CVE-2022-25159",
    "CVE-2022-25160",
    "CVE-2022-25156",
    "CVE-2022-25158"
  ],
  "techniques": [],
  "advisory": "icsa-22-090-04",
  "title": "Mitsubishi Electric FA Products (Update A) | CISA",
  "source": "ics-advisories",
  "id": "85d18cd80a85e8ef4f66de1b35ae38b119b055bfe6d972a3abd949dd4586ae57"
}