{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.8\n\n\n--------- Begin Update A Part 1 of 6 ---------\n\nATTENTION: Exploitable remotely/low skill level to exploit\n\n--------- End Update A Part 1 of 6 ---------\n\nVendor: Vecna Technologies, Inc. (Vecna)\nEquipment: VGo Robot\n\n--------- Begin Update A Part 2 of 6 ---------\n\nVulnerabilities: OS Command Injection, Cleartext Transmission of Sensitive Information, Improper Authorization, Improper Access Control, Insufficiently Protected Credentials\n\n--------- End Update A Part 2 of 6 ---------\n2    UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-114-01 Vecna VGo Robot that was published April 24, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\n--------- Begin Update A Part 3 of 6 ---------\nSuccessful exploitation of these vulnerabilities could allow an attacker to capture firmware updates through network traffic, extract credentials from the firmware, record video conversations, and may allow remote code execution with root privileges.\n--------- End Update A Part 3 of 6 ---------\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 4 of 6 ---------\nThe following versions of VGo Robot, a remote controlled robot, are affected:VGo Robot: Versions 3.0.3.52164 and 3.0.3.53662. Prior versions may also be affected.\n--------- End Update A Part 4 of 6 ---------\n4.2 VULNERABILITY OVERVIEW\n\n4.2.1   IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nAn attacker on an adjacent network could perform command injection.\nCVE-2018-8866 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\n4.2.2   CLEAR TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nAn attacker may be able to capture firmware updates through the adjacent network. \nCVE-2018-8860 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n--------- Begin Update A Part 5 of 6 ---------\n4.2.3    IMPROPER AUTHORIZATION CWE-285\nUser accounts may be able to execute commands that are outside the scope of their privileges and within the scope of an admin account. If an attacker has access to VGo XAMPP Client credentials, they may be able to execute admin commands on the connected robot.\nCVE-2018-17933 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n4.2.4    IMPROPER ACCESS CONTROL CWE-284\nIf an attacker has physical access to the VGo Robot they may be able to alter scripts, which may allow code execution with root privileges.\nCVE-2018-17931 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.5    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nIf an attacker has access to the firmware they may be able to extract credentials.\nCVE-2018-8858  has been assigned to this vulnerability. A CVSS v3 base score of 4.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:N)\n--------- End Update A Part 5 of 6 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nDan Regalado from Zingbox reported this vulnerability to NCCIC.\n5. MITIGATIONS\nVecna has released a recommended update to mitigate the vulnerabilities. Vecna recommends the following update process:\n\nBy default, VGo has automatic updates enabled so all updates are performed automatically when Internet access is available. If the VGo is powered off or in use, a message will appear on the screen asking if it can be updated when the VGo is next used.\nIf a VGo unit has automatic updates turned off, the update will not be downloaded (however, a notice about the update will be displayed on the VGo’s screen). Vecna recommends that automatic updates be turned on. Select “settings” from the main menu then “advanced settings” then “automatic updates.”\n\n--------- Begin Update A Part 6 of 6 ---------\nVecna may have released an update for CVE-2018-8858.\nVecna has not addressed CVE-2018-17931 and CVE-2018-17933.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nCreate strong credentials for the VGo XAMPP Client accounts.\nMinimize who has access to the device.\nPlace physical locks over the USB ports. If possible, disable USB ports when not in use.      \n\n--------- End Update A Part 6 of 6 ---------\nNCCIC recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-8858",
    "CVE-2018-17933",
    "CVE-2018-17931",
    "CVE-2018-8866",
    "CVE-2018-8860"
  ],
  "techniques": [],
  "advisory": "icsa-18-114-01",
  "title": "Vecna VGo Robot (Update A) | CISA",
  "source": "ics-advisories",
  "id": "8032c9f2db25e1296f8b81d09bae1ebce1b9740653a6433f85d856e70069f4a2"
}