{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.6\nATTENTION: Exploitable remotely/low attack complexity\nVendor: ThroughTek\nEquipment: Kalay P2P SDK\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could permit remote code execution and unauthorized access to sensitive information, such as to camera audio/video feeds. ThroughTek supplies multiple original equipment manufacturers of IP cameras with P2P connections as part of its cloud platform.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Kalay P2P Software Development Kit (SDK) are affected:\n\nVersions 3.1.5 and prior\nSDK versions with the nossl tag\nDevice firmware that does not use AuthKey for IOTC connection\nDevice firmware using the AVAPI module without enabling DTLS mechanism\nDevice firmware using P2PTunnel or RDT module\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected ThroughTek P2P products may be vulnerable to improper access controls. This vulnerability can allow an attacker to access sensitive information (such as camera feeds) or perform remote code execution.\nCVE-2021-28372 has been assigned to this vulnerability. A CVSS v3 base score 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Communications\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nJake Valletta, Erik Barzdukas, and Dillon Franke from Mandiant reported this vulnerability to CISA.\n4. MITIGATIONS\nThroughTek recommends original equipment manufacturers to implement the following mitigations:\n\nIf SDK is Version 3.1.10 and above, enable authkey and DTLS.\nIf SDK is any version prior to 3.1.10, upgrade library to v3.3.1.0 or v3.4.2.0 and enable authkey/DTLS.\n\nThroughTek recommends device users to avoid accessing their devices from untrusted networks.\nAdditional information can be found in the ThroughTek advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2021-28372"
  ],
  "techniques": [],
  "advisory": "icsa-21-229-01",
  "title": "ThroughTek Kalay P2P SDK | CISA",
  "source": "ics-advisories",
  "id": "12bc6abfce805035801b47ac3bf9fe8587e08abda91775526d257a1dc53daef9"
}