{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Siemens \nEquipment: Polarion Subversion Webclient\nVulnerabilities: Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS), Cross-site Request Forgery (CSRF)\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities where an attacker injects client-side script to induce the victim to issue an HTTP request could lead to a state-changing operation.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Siemens Polarion Subversion Webclient are affected:\n\nPolarion Subversion Webclient, all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SCRIPT-RELATED HTML TAGS IN A WEB PAGE (BASIC XSS) CWE-80\nThe Polarion Subversion Webclient application does not filter user input in a way that prevents cross-site scripting (XSS). If a user is enticed into passing specially crafted malicious input to the web client (e.g., by clicking on a malicious URL with embedded JavaScript), JavaScript code can be returned and executed by the user’s client. Various actions could be triggered by running malicious JavaScript code.\nCVE-2020-15788 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n3.2.2    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nThe web interface could allow a CSRF attack if an unsuspecting user is tricked into accessing a malicious link. Successful exploitation requires user interaction by a legitimate user, who must be authenticated to the web interface. A successful attack could allow an attacker to trigger actions via the web interface that the legitimate user is allowed to perform. This could allow the attacker to read or modify contents of the web application.\nCVE-2020-15789 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Germany \n\n3.4 RESEARCHER\nLi Yifan reported these vulnerabilities to Siemens.\n4. MITIGATIONS\nSiemens has stated that the tool is considered shareware, distributed “as is,” and will be no fix as it is no longer supported.\nSiemens has identified the following specific workaround and mitigation users can apply to reduce the risk:\n\nDo not open unknown links while working on Polarion Subversion Webclient.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens operational guidelines for Industrial Security and following the recommendations in the product manuals.\nFor additional information, please refer to Siemens Security Advisory SSA-436520\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-15789",
    "CVE-2020-15788"
  ],
  "techniques": [],
  "advisory": "icsa-20-252-08",
  "title": "Siemens Polarion Subversion Webclient | CISA",
  "source": "ics-advisories",
  "id": "d5092e7dc2f79eae8188b092cba45eff157b179bdfc02acec6db9f46ec2b4cda"
}