{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: National Instruments Corp. (NI)\nEquipment: CompactRIO\nVulnerability: Incorrect Permission Assignment for Critical Resource\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to reboot the device remotely.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of CompactRIO, a real-time embedded industrial controller, are affected:\n\nCompactRIO: Driver versions prior to 20.5 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\nIncorrect permissions are set by default for an API entry-point of a specific service, allowing a non-authenticated user to trigger a function that could reboot the device remotely.  \nCVE-2020-25191 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing \nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nResearchers of Titanium Industrial Security reported this vulnerability to the Spanish National Institute of Cybersecurity (INCIBE).\n4. MITIGATIONS\nNI recommends the following steps for mitigation:\n1.    Download the NI CompactRIO 20.5 Driver. \n2.    Install the driver on host computer.\n3.    Update the firmware on CompactRIO controllers to v8.5 or higher. Refer to Upgrading Firmware on my NI Linux Real-Time Device for directions on how to update the firmware on current controllers. Updating the firmware patches the Safe Mode where defaults are loaded.\n4.    Format the target to apply the new safemode default permissions. Refer to How to Restore LabVIEW RT Target to Factory Default Configuration for directions on how to format and reinstall software on target.\n5.    Repeat Steps 3 and 4 for each affected CompactRIO target.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. \n",
  "cves": [
    "CVE-2020-25191"
  ],
  "techniques": [],
  "advisory": "icsa-20-338-01",
  "title": "National Instruments CompactRIO | CISA",
  "source": "ics-advisories",
  "id": "3da1ad6e327d5c6b2d09ee48ab453a7f37e78a166c505e147de59bed5c945273"
}