{
  "markdown": "\nCVSS v3 9.8\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: SIMATIC WinCC Add-On\nVulnerabilities: Stack-based Buffer Overflow, Improper Input Validation, Improper Restriction of Operations within the Bounds of a Memory Buffer, Security Features, Improper Access Control.\nUPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-18-018-01 Siemens SIMATIC WinCC Add-On that was published January 18, 2018, on the NCCIC/ICS-CERT website.\nAFFECTED PRODUCTS\nSiemens reports that the vulnerabilities affect the following versions of SIMATIC WinCC Add-On:\n\nSIMATIC WinCC Add-On Historian CONNECT ALARM all versions prior to and including v5.x,\nSIMATIC WinCC Add-On PI CONNECT ALARM all versions prior to and including v2.x,\nSIMATIC WinCC Add-On PI CONNECT AUDIT TRAIL all versions prior to and including v1.x,\nSIMATIC WinCC Add-On PM-AGENT all versions prior to and including v5.x,\nSIMATIC WinCC Add-On PM-ANALYZE all versions prior to and including v7.x,\nSIMATIC WinCC Add-On PM-CONTROL all versions prior to and including v10.x,\nSIMATIC WinCC Add-On PM-MAINT all versions prior to and including v9.x,\nSIMATIC WinCC Add-On PM-OPEN EXPORT all versions prior to and including v7.x,\nSIMATIC WinCC Add-On PM-OPEN HOST-S all versions prior to and including v7.x,\nSIMATIC WinCC Add-On PM-OPEN IMPORT all versions prior to and including v6.x,\nSIMATIC WinCC Add-On PM-OPEN PI all versions prior to and including v7.x,\nSIMATIC WinCC Add-On PM-OPEN PV02 all versions prior to and including v1.x,\nSIMATIC WinCC Add-On PM-OPEN TCP/IP all versions prior to and including v8.x,\nSIMATIC WinCC Add-On PM-QUALITY all versions prior to and including v9.x,\nSIMATIC WinCC Add-On SICEMENT IT MIS all versions prior to and including v7.x, and\nSIMATIC WinCC Add-On SIPAPER IT MIS all versions prior to and including v7.x\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow remote code execution or a denial of service condition.\nMITIGATION\nGemalto has released an updated installer and Siemens strongly encourages users upgrade to the new installer as soon as possible. The new installer is available at:\nhttps://supportportal.gemalto.com/csm/?id=kb_article&sys_id=a459d328dba207c8fe0aff3dbf9619ce\nSiemens also advises that users configure the operational environment according to Siemens’ Operational Guidelines for Industrial Security:\nhttps://www.siemens.com/cert/operational-guidelines-industrial-security\nFor more information on these vulnerabilities and more detailed mitigation instructions, please see Siemens Security Advisory SSA-127490 at the following location:\nhttp://www.siemens.com/cert/advisories\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nMalformed ASN1 streams in V2C and similar input files can be used to generate stack-based buffer overflows. The vulnerability could allow arbitrary code execution.\nCVE-2017-11496 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nSTACK-BASED BUFFER OVERFLOW CWE-121\n\nLanguage packs containing malformed filenames could lead to a stack-based buffer overflow. The vulnerability could allow arbitrary code execution.\nCVE-2017-11497 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nIMPROPER INPUT VALIDATION CWE-20\n\nLanguage pack (ZIP file) with invalid HTML files could lead to NULL pointer access. The vulnerability could cause denial of service of the remote process.\nCVE-2017-11498 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n--------- Begin Update A Part 1 of 1 --------\n\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\n\nA stack overflow flaw in the custom XML parser could allow remote denial of service.\nCVE-2017-12818 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nSECURITY FEATURES CWE-254\n\nRemote manipulation of the language pack updater could allow NTLM relay attacks.\nCVE-2017-12819 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\n\nArbitrary memory read from controlled memory pointer could allow remote denial of service.\nCVE-2017-12820 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nIMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\n\nA memory corruption flaw could allow remote code execution.\nCVE-2017-12821 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n\nIMPROPER ACCESS CONTROL CWE-284\n\nThe administrative interface can be remotely enabled and disabled without authentication. This could increase the attack surface.\nCVE-2017-12822 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n--------- End Update A Part 1 of 1 ----------\nRESEARCHER\nSergey Temnikov and Vladimir Dashchenko from Kaspersky Lab reported these vulnerabilities to Siemens.\nBACKGROUND\nCritical Infrastructure Sectors: Chemical, Energy, Food and Agriculture, Water and Wastewater Systems.\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-11497",
    "CVE-2017-12820",
    "CVE-2017-11496",
    "CVE-2017-11498",
    "CVE-2017-12819",
    "CVE-2017-12818",
    "CVE-2017-12822",
    "CVE-2017-12821"
  ],
  "techniques": [],
  "advisory": "icsa-18-018-01a",
  "title": "Siemens SIMATIC WinCC Add-On (Update A) | CISA",
  "source": "ics-advisories",
  "id": "3d48f51b8c62e95421760dc89275d9846d212dcc19e16f8e44856e8e2d778144"
}