{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 2.3\nATTENTION: Low attack complexity\nVendor: Chirp Systems\nEquipment: Chirp Access\nVulnerability: Use of Hard-coded Password\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to adjust the Beacon configuration settings and/or disable the Bluetooth functionality of doors where non-networked Beacons are deployed.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Chirp Systems products are affected when deployed in non-networked beacon configurations:\n\nChirp Access app (Android and iOS): All Versions\n\n3.2 Vulnerability Overview\n3.2.1 USE OF HARD-CODED PASSWORD CWE-259\nThe Chirp Access app contains a hard-coded password, BEACON_PASSWORD. An attacker within Bluetooth range could change configuration settings within the Bluetooth beacon, effectively disabling the application's ability to notify users when they are near a Beacon-enabled access point. This variable cannot be used to change the configuration settings of the door readers or locksets and does not affect the ability for authorized users of the mobile application to lock or unlock access points.\nCVE-2024-2197 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-2197. A base score of 2.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:L/AT:P/PR:N/UI:N/VC:N/VI:L/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities Sector\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMatt Brown reported this vulnerability to CISA.\n4. MITIGATIONS\nFor additional information, please see Chirp Systems statement here or contact RealPage (Chirp Systems' parent company) via their support page.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nMarch 7, 2024: Initial Publication\nApril 23, 2024: Update A - Mitigations Updated\nApril 25, 2024: Update B - Feedback from Chirp Systems has been integrated in Executive summary, Risk Evaluation, Vulnerability Overview, and Mitigations sections.\nMay 2, 2024: Update C - Risk Evaluation and CVE description updated with clarifying information from Chirp. Link to vendor statement included after changes to statement.\n\n",
  "cves": [
    "CVE-2024-2197"
  ],
  "techniques": [],
  "advisory": "icsa-24-067-01",
  "title": "Chirp Systems Chirp Access (Update C) | CISA",
  "source": "ics-advisories",
  "id": "7a424737d110073b8a392e9bb69b5e59001fbf5de72d070641d089cd5b10d906"
}