{
  "markdown": "\nCVSS v3 7.4\nATTENTION: Remotely exploitable/low skill level to exploit.\nVendor: Siemens\nEquipment: OZW672 and OZW772\nVulnerabilities: Missing Authentication\nAFFECTED PRODUCTS\nSiemens reports that the vulnerability affects the following OZW672 and OZW772 devices for monitoring building controller devices:\n\nOZW672: All versions, and\nOZW772: All versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow attackers to read and write historical measurement data under certain conditions, or to read and modify data in TLS sessions.\nMITIGATION\nSiemens recommends applying the following mitigations:\n\nProtect network access to the affected devices.\nDisable integrated service on Port 21/TCP in the device settings by changing the value of “ACS access” under “Settings > Communication > Services to “Off”. Applying this configuration change mitigates CVE-2017-6872 entirely.\nUse the web portal as described in the product documentation for all applications; Connections to the web portal are not affected by CVE-2017-6873.\nIf use of web portal is not possible, then use the integrated web server only in trusted networks.\n\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens Security Advisory SSA-563539 at the following location:\nhttp://www.siemens.com/cert/advisories\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nICS-CERT also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\nVULNERABILITY OVERVIEW\n\nMISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\n\nAn attacker with access to Port 21/TCP could access or alter historical measurement data stored on the device.\nCVE-2017-6872 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N).\n\nMISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\n\nA vulnerability in the integrated web server on Port 443/TCP could allow an attacker to read and manipulate data in TLS sessions while performing a man-in-the-middle (MITM) attack.\nCVE-2017-6873 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\nRESEARCHER\nStefan Viehböck from SEC Consult reported these vulnerabilities to Siemens.\nBACKGROUND\nCritical Infrastructure Sector: Commercial Facilities\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: Germany\n",
  "cves": [
    "CVE-2017-6873",
    "CVE-2017-6872"
  ],
  "techniques": [],
  "advisory": "icsa-17-187-01",
  "title": "Siemens OZW672 and OZW772 | CISA",
  "source": "ics-advisories",
  "id": "dfa315805516fc419c1d00922dd2ac5895b7b63a94c2e67a0cad5789cc50f058"
}