{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.0\nATTENTION: Exploitable remotely\nVendor: Siemens\nEquipment: TIM 3V-IE and 4R-IE Family Devices\nVulnerability: Active Debug Code\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthenticated attacker with network access to gain full control over the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of TIM communication modules for SIMATIC S7-300 and S7-400 devices are affected:\n\nTIM 3V-IE (incl. SIPLUS NET variants): all versions prior to v2.8\nTIM 3V-IE Advanced (incl. SIPLUS NET variants): all versions prior to v2.8\nTIM 3V-IE DNP3 (incl. SIPLUS NET variants): all versions prior to v3.3\nTIM 4R-IE (incl. SIPLUS NET variants): all versions prior to v2.8\nTIM 4R-IE DNP3 (incl. SIPLUS NET variants): all versions prior to v3.3\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    ACTIVE DEBUG CODE CWE-489\nThe affected versions contain an open debug port that is available under specific conditions. The vulnerability is only available if the IP address is configured to 192.168.1.2\nIf available, the debug port could be exploited by an attacker with network access to the device. No user interaction is required to exploit this vulnerability. The vulnerability impacts confidentiality, integrity, and availability of the affected device.\nCVE-2019-10939 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Food and Agriculture, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens has released updates for the affected products and recommends users update to the new version.\n\nTIM 3V-IE (incl. SIPLUS NET variants) and TIM 3V-IE Advanced (incl. SIPLUS NET variants): Update to v2.8\nTIM 3V-IE DNP3 (incl. SIPLUS NET variants): Update to v3.3\nTIM 4R-IE (incl. SIPLUS NET variants): Update to v2.8\nTIM 4R-IE DNP3 (incl. SIPLUS NET variants): Update to v3.3\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce the risk:\n\nSet the IP of the device to anything other than 192.168.1.2\nLimit access to Port 17185/UDP of an affected device (e.g., cell-protection firewall or corporate firewall) to reduce the risk.\n\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens’ operational guidelines for industrial security and following the recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found at: https://www.siemens.com/industrialsecurity\nFor more information on this vulnerability and more detailed mitigation instructions, please see Siemens security advisory SSA-359303\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-10939"
  ],
  "techniques": [],
  "advisory": "icsa-20-105-09",
  "title": "Siemens TIM 3V-IE and 4R-IE Family Devices | CISA",
  "source": "ics-advisories",
  "id": "0abff4bbca45090ae2af65ebba28ab300969a1c310e53b84d9c256c938473c32"
}