{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Low attack complexity\nVendor: Hitachi ABB Power Grids\nEquipment: System Data Manager\nVulnerability: Cleartext Storage of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker access to sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of System Data Manager are affected:\n\nSDM600: All versions prior to 1.2 FP2 HF6 (Build Nr. 1.2.14002.257)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nThe application does not encrypt backup files. A local operating system user can modify backup files, which may allow an attacker to overwrite system configuration files and gain privileges.\nCVE-2021-35526 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nHitachi ABB Power Grids reported this vulnerability to CISA.\n4. MITIGATIONS\nHitachi ABB Power Grids recommends users apply update Version 1.2 FP2 HF6 (Build Nr. 1.2.14002.257) or newer at the earliest convenience. Users can download the latest SDM600 version from the product website. After successful upgrade, Hitachi ABB Power Grids recommends moving previously created vulnerable backups to a secure location to avoid unauthorized access.\nHitachi ABB Power Grids also recommends the following general security mitigations:\n\nImplement and continuously revise least privileges principles to minimize permissions and accesses to SDM600 related resources.\nFollow security practices as defined in SDM600 security deployment guideline and firewall configurations to help protect process control networks from attacks that originate from outside the network. Such practices include that process control systems are:\n\nPhysically protected from direct access by unauthorized personnel.\nNot directly connected to the Internet.\nSeparated from other networks by means of a firewall system that has a minimal number of ports exposed.\nNot used for Internet surfing, instant messaging, or receiving e-mails.\n\n\nCarefully scan portable computers and removable storage media for viruses before connecting to a control system.\n\nFor additional information, see Hitachi ABB Power Grids security advisory.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-35526"
  ],
  "techniques": [],
  "advisory": "icsa-21-250-02",
  "title": "Hitachi ABB Power Grids System Data Manager | CISA",
  "source": "ics-advisories",
  "id": "8fe975e857276bc8d470279f5dbdd942157ce1af75d3eb73527085a8cd250158"
}