{
  "markdown": "\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit.\nVendor: OSIsoft\nEquipment: PI Data Archive\nVulnerabilities: Deserialization of Untrusted Data, Improper Input Validation, Incorrect Default Permissions\nAFFECTED PRODUCTS\nThe following versions of PI Data Archive, a data storage solution, are affected:\n\nPI Data Archive versions 2017 and prior.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could cause loss of network access to the device or allow escalated privileges that may result in gaining full control of the PI Data Archive server.\nMITIGATION\nOSIsoft recommends that customers upgrade to PI Data Archive 2017 R2.  Obtain the update from OSIsoft.\nOSIsoft has released the following advisory:\nhttps://techsupport.osisoft.com/Troubleshooting/Alerts/AL00339\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on theICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \nVULNERABILITY OVERVIEW\n\nDESERIALIZATION OF UNTRUSTED DATA CWE-502\n\nUnauthenticated users may modify deserialized data to send custom requests that crash the server.\nCVE-2018-7529 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n\nINCORRECT DEFAULT PERMISSIONS CWE-276\n\nInsecure default configuration may allow escalation of privileges that gives the actor full control over the system.\nCVE-2018-7533 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n\nIMPROPER INPUT VALIDATION CWE-20\n\nUnauthenticated users may use unvalidated custom requests to crash the server.\nCVE-2018-7531 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\nRESEARCHER\nOSIsoft self reported these vulnerabilities to NCCIC.\nBACKGROUND\nCritical Infrastructure Sectors: Multiple Sectors\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: USA\n",
  "cves": [
    "CVE-2018-7529",
    "CVE-2018-7531",
    "CVE-2018-7533"
  ],
  "techniques": [],
  "advisory": "icsa-18-072-02",
  "title": "OSIsoft PI Data Archive | CISA",
  "source": "ics-advisories",
  "id": "b33ee1c4f4273ffb76eaf237223a6a79d4ebd8c26977ded4599bb1aab8a0c983"
}