{
  "markdown": "\nAs of January 10, 2023, CISA will no longer be updating ICS security advisories for Siemens product vulnerabilities beyond the initial advisory. For the most up-to-date information on vulnerabilities in this advisory, please see Siemens' ProductCERT Security Advisories (CERT Services | Services | Siemens Global).View CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 7.0\nATTENTION: Low Attack Complexity\nVendor: Siemens\nEquipment: TIA Portal, SIMATIC, and SIRIUS\nVulnerability: Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a type confusion and execute arbitrary code within the affected application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products of Siemens, are affected:\n\nSiemens SIMATIC STEP 7 (TIA Portal) V16: All versions prior to V16 Update 7\nSiemens SIMATIC STEP 7 (TIA Portal) V17: All versions prior to V17 Update 7\nSiemens SIMATIC STEP 7 (TIA Portal) V18: All versions prior to V18 Update 2\nSiemens SIMATIC STEP 7 Safety V16: All versions prior to V16 Update 7\nSiemens SIMATIC STEP 7 Safety V17: All versions prior to V17 Update 7\nSiemens SIMATIC STEP 7 Safety V18: All versions prior to V18 Update 2\nSiemens SIMATIC WinCC (TIA Portal) V16: All versions prior to V16 Update 7\nSiemens SIMATIC WinCC (TIA Portal) V17: All versions prior to V17 Update 7\nSiemens SIMATIC WinCC (TIA Portal) V18: All versions prior to V18 Update 2\nSiemens SIMATIC WinCC Unified V16: All versions prior to V16 Update 7\nSiemens SIMATIC WinCC Unified V17: All versions prior to V17 Update 7\nSiemens SIMATIC WinCC Unified V18: All versions prior to V18 Update 2\nSiemens SIMOCODE ES V16: All versions prior to V16 Update 7\nSiemens SIMOCODE ES V17: All versions prior to V17 Update 7\nSiemens SIMOCODE ES V18: All versions prior to V18 Update 2\nSiemens SIMOTION SCOUT TIA V5.4 SP1: All versions\nSiemens SIMOTION SCOUT TIA V5.4 SP3: All versions\nSiemens SIMOTION SCOUT TIA V5.5 SP1: All versions\nSiemens SINAMICS Startdrive V16: All versions\nSiemens SINAMICS Startdrive V17: All versions\nSiemens SINAMICS Startdrive V18: All versions\nSiemens SIRIUS Safety ES V17: All versions prior to V17 Update 7\nSiemens SIRIUS Safety ES V18: All versions prior to V18 Update 2\nSiemens SIRIUS Soft Starter ES V17: All versions prior to V17 Update 7\nSiemens SIRIUS Soft Starter ES V18: All versions prior to V18 Update 2\nSiemens Soft Starter ES V16: All versions prior to V16 Update 7\nSiemens TIA Portal Cloud V3.0: All versions prior to V18 Update 2\n\n3.2 Vulnerability Overview\n3.2.1 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nAffected applications do not properly restrict the .NET BinaryFormatter when deserializing hardware configuration profiles. This could allow an attacker to cause a type confusion and execute arbitrary code within the affected application.\nCVE-2023-32735 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2023-32735. A base score of 7.0 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:H/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Chemical, Critical Manufacturing, Energy, Transportation, and Water and Wastewater Systems.\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nSiemens reported this vulnerability to CISA.\n4. MITIGATIONS\nSiemens recommends updating the following products to the latest version:\n\nSIMATIC STEP 7 (TIA Portal) V16: Update to V16 Update 7 or later\nSIMATIC STEP 7 Safety V16: Update to V16 Update 7 or later\nSIMATIC WinCC (TIA Portal) V16: Update to V16 Update 7 or later\nSIMATIC WinCC Unified V16: Update to V16 Update 7 or later\nSIMOCODE ES V16: Update to V16 Update 7 or later\nSoft Starter ES V16: Update to V16 Update 7 or later\nSIMATIC STEP 7 (TIA Portal) V17: Update to V17 Update 7 or later\nSIMATIC STEP 7 Safety V17: Update to V17 Update 7 or later\nSIMATIC WinCC (TIA Portal) V17: Update to V17 Update 7 or later\nSIMATIC WinCC Unified V17: Update to V17 Update 7 or later\nSIMOCODE ES V17: Update to V17 Update 7 or later\nSIRIUS Safety ES V17: Update to V17 Update 7 or later\nSIRIUS Soft Starter ES V17: Update to V17 Update 7 or later\nSIMATIC STEP 7 (TIA Portal) V18: Update to V18 Update 2 or later\nSIMATIC STEP 7 Safety V18: Update to V18 Update 2 or later\nSIMATIC WinCC (TIA Portal) V18: Update to V18 Update 2 or later\nSIMATIC WinCC Unified V18: Update to V18 Update 2 or later\nSIMOCODE ES V18: Update to V18 Update 2 or later\nSIRIUS Safety ES V18: Update to V18 Update 2 or later\nSIRIUS Soft Starter ES V18: Update to V18 Update 2 or later\nTIA Portal Cloud V3.0: Update to V18 Update 2 or later\n\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n\nAll affected products: Avoid opening untrusted files from unknown sources in affected products.\n\nAs a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens' operational guidelines for industrial security and following recommendations in the product manuals.\nAdditional information on industrial security by Siemens can be found on the Siemens industrial security webpage\nFor more information see the associated Siemens security advisory SSA-779936 in HTML and CSAF.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nJuly 11, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2023-32735"
  ],
  "techniques": [],
  "advisory": "icsa-24-193-13",
  "title": "Siemens TIA Portal, SIMATIC, and SIRIUS | CISA",
  "source": "ics-advisories",
  "id": "2f6fd7c0db8b3098f388cc10f3bc86a267a0f5219d250b4f03c25d943f11fbb3"
}