{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Advantech\nEquipment: WebAccess\nVulnerabilities: Heap-based Buffer Overflow, Stack-based Buffer Overflow\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of WebAccess, an HMI platform, are affected:\n\nWebAccess Versions 9.02 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    HEAP-BASED BUFFER OVERFLOW CWE-122\nThe affected product is vulnerable to a heap-based buffer overflow, which may allow an attacker to remotely execute code.\nCVE-2021-33023 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nThe affected product is vulnerable to a stack-based buffer overflow, which may allow an attacker to remotely execute code.\nCVE-2021-38389 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Energy, Water and Wastewater Systems\nCOUNTRIES/AREAS DEPLOYED: East Asia, Europe, United States\nCOMPANY HEADQUARTERS LOCATION: Taiwan\n\n3.4 RESEARCHER\nNatnael Samson, @NattiSamson, working with Trend Micro’s Zero Day Initiative, reported these vulnerabilities to CISA.\n4. MITIGATIONS\nAdvantech has released Version 9.1.1 to address the stack-based buffer overflow vulnerability.\nIn order to address the heap-based buffer overflow vulnerability, Advantech recommends users directly add the remote access code to avoid being attacked by unknown requests. This is the remote access code established during installation of the Advantech WebAccess SCADA software (SCADA node, project node, or OPC Service) on the OPC Server computer. The access code you enter here must match the remote access code established during installation on the OPC Server. This prevents unauthorized users from accessing the OPC Server data using the Advantech WebAccess SCADA OPC Service.\nIf you have forgotten the remote access code using during software installation on the OPC Server node, you have two options:\n\nRe-install the Advantech WebAccess SCADA software on the OPC Server node to change it and edit it to match in your database.\nEdit the BWSERVER.INI file on the OPC Server node and edit it to match in your database using UPDATE.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-33023",
    "CVE-2021-38389"
  ],
  "techniques": [],
  "advisory": "icsa-21-285-02",
  "title": "Advantech WebAccess | CISA",
  "source": "ics-advisories",
  "id": "2ace69be980a6408d82ed37de262127c609e4c9c1632e295d5f9512433fffca1"
}