{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: ABB\nEquipment: Drive Composer, Automation Builder, Mint Workbench\nVulnerability: Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following ABB products are affected:\n\nABB Drive Composer Entry: Versions 2.0 to 2.7\nABB Drive Composer Pro: Versions 2.0 to 2.7\nABB Automation Builder: Versions 1.1.0 to 2.5.0\nMint Workbench: Builds 5866 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nVulnerabilities in Drive Composer allow a low-privileged user to create and write to a file anywhere on the file system as “system” with arbitrary content when the file does not already exist. The Drive Composer installer file allows a low-privileged user to run a “repair” operation on the product.\nCVE-2022-31216 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nVulnerabilities in Drive Composer allow a low-privileged user to create and write to a file anywhere on the file system as “system” with arbitrary content when the file does not already exist. The Drive Composer installer file allows a low-privileged user to run a “repair” operation on the product.\nCVE-2022-31217 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.3    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nVulnerabilities in Drive Composer allow a low privileged user to create and write to a file anywhere on the file system as “system” with arbitrary content when the file does not already exist. The Drive Composer installer file allows a low-privileged user to run a “repair” operation on the product.\nCVE-2022-31218 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nVulnerabilities in Drive Composer allow a low-privileged user to create and write to a file anywhere on the file system as “system” with arbitrary content when the file does not already exist. The Drive Composer installer file allows a low-privileged user to run a “repair” operation on the product.\nCVE-2022-31219 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H).\n3.2.5    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nVulnerabilities in Mint Workbench allow a low-privileged attacker to create and write to a file anywhere on the file system as “system” with arbitrary content when the file does not already exist. The Mint Workbench installer file allows a low-privileged user to run a “repair” operation on the product.\nCVE-2022-26057 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\nCRITICAL INFRASTRUCTURE SECTORS: Multiple Sectors\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n3.4 RESEARCHER\nMichael DePlante (@izobashi) of Trend Micro’s Zero Day Initiative reported these vulnerabilities to CISA.\n4. MITIGATIONS\nABB recommends updating to the latest version of their software:\n\nABB Drive Composer: Update to v2.7.1 or later\nABB Automation Builder: Update to 2.5.1 or later\nABB Mint Workbench: Update to Build 5868 or later\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2022-31217",
    "CVE-2022-31218",
    "CVE-2022-31219",
    "CVE-2022-26057",
    "CVE-2022-31216"
  ],
  "techniques": [],
  "advisory": "icsa-22-202-01",
  "title": "ABB Drive Composer, Automation Builder, Mint Workbench | CISA",
  "source": "ics-advisories",
  "id": "f6f3cd84b56e3a34c4707e2425504956081b834ec90b1b146c478a0a128c0194"
}