{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Flexera\nEquipment: FlexNet Publisher\nVulnerabilities: Improper Input Validation, Memory Corruption\n\n2. RISK EVALUATION\nThese vulnerabilities could allow an attacker to deny the acquisition of a valid license for legal use of the product. The memory corruption vulnerability could allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of FlexNet Publisher, a software license manager, are affected:\n\nFlexNet Publisher Version 2018 R3 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nA vulnerability related to preemptive item deletion in lmgrd and vendor daemon components allows a remote attacker to send a combination of messages to lmgrd or the vendor daemon, causing the heartbeat between lmgrd and the vendor daemon to stop and the vendor daemon to shut down.\nCVE-2018-20031 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    IMPROPER INPUT VALIDATION CWE-20\nA vulnerability related to message decoding in lmgrd and vendor daemon components allows a remote attacker to send a combination of messages to lmgrd or the vendor daemon, causing the heartbeat between lmgrd and the vendor daemon to stop and the vendor daemon to shut down.\nCVE-2018-20032 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    MEMORY CORRUPTION CWE-119\nA vulnerability in lmgrd and vendor daemon components could allow a remote attacker to corrupt the memory by allocating/deallocating memory, loading lmgrd or the vendor daemon, and causing the heartbeat between lmgrd and the vendor daemon to stop. This would force the vendor daemon to shut down. The vulnerability could also allow remote code execution. No exploit of this vulnerability has been demonstrated.\nCVE-2018-20033 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.4    IMPROPER INPUT VALIDATION CWE-20\nA vulnerability related to adding an item to a list in lmgrd and vendor daemon components allows a remote attacker to send a combination of messages to lmgrd or the vendor daemon, causing the heartbeat between lmgrd and the vendor daemon to stop and the vendor daemon to shut down.\nCVE-2018-20034 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Information Technology\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nSergey Temnikov of Kaspersky reported these vulnerabilities to CISA.\n4. MITIGATIONS\nFlexera recommends all users using affected versions of FlexNet Publisher upgrade to Version 2018 R4 or newer as soon as possible. The updates can be obtained with a customer account at the following location (login required):\nhttps://flexerasoftware.flexnetoperations.com/control/inst/login?nextURL=%2Fcontrol%2Finst%2Findex\nMore information on this issue can be found at the following location on the Flexera site:\nhttps://community.flexera.com/t5/FlexNet-Publisher-News/FlexNet-Publisher-2018-R4-SP1-is-now-available/ba-p/95063/jump-to/first-unread-message\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-20031",
    "CVE-2018-20032",
    "CVE-2018-20034",
    "CVE-2018-20033"
  ],
  "techniques": [],
  "advisory": "icsa-19-323-01",
  "title": "Flexera FlexNet Publisher | CISA",
  "source": "ics-advisories",
  "id": "075566c1d24e942b04e8ac569bcf37ec372a7ef0b081818778858c41938586b6"
}