{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Siemens\nEquipment: SIMOTICS CONNECT 400\nVulnerabilities: Improper Null Termination, Out-of-bounds Read, Access of Memory Location After End of Buffer, Use of Insufficiently Random Values\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-103-13 Siemens SIMOTICS CONNECT 400 that was published April 13, 2021, on the ICS webpage on www.cisa.gov/uscert. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to poison the DNS cache or spoof DNS resolving.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products and versions are affected:\n•    SIMOTICS CONNECT 400, All versions prior to v0.5.0.0\n•    SIMOTICS CONNECT 400, v0.5.0.0 and later only affected by CVE-2021-25677\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER NULL TERMINATION CWE-170\nThe DNS domain name label parsing functionality does not properly validate the null-terminated name in DNS-responses. The parsing of malformed responses could result in a read past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to cause a denial-of-service condition or leak the read memory.\nCVE-2020-27736 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:H).\n4.2.2    OUT-OF-BOUNDS READ CWE-125\nThe DNS response parsing functionality does not properly validate various length and counts of the records. The parsing of malformed responses could result in a read past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to cause a denial-of-service condition or leak the memory past the allocated structure.\nCVE-2020-27737 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:H).\n4.2.3    ACCESS OF MEMORY LOCATION AFTER END OF BUFFER CWE-788\nThe DNS domain name record decompression functionality does not properly validate the pointer offset values. The parsing of malformed responses could result in a read access past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to cause a denial-of-service condition.\nCVE-2020-27738 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:H).\n4.2.4    ACCESS OF MEMORY LOCATION AFTER END OF BUFFER CWE-788\nThe DNS client does not properly randomize DNS transaction IDs. This could allow an attacker to poison the DNS cache or spoof DNS resolving.\nCVE-2021-25677 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Energy\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nSiemens reported these vulnerabilities to CISA.\n5. MITIGATIONS\nSiemens has identified the following specific workarounds and mitigations users can apply to reduce risk:\n--------- Begin Update A Part 1 of 1---------\n\nSIMOTICS CONNECT 400, All versions prior to v0.5.0.0: Update to v0.5.0.0\n\nFor versions prior to v0.5.0.0, Siemens recommends users follow general security recommendations in SSA-669158\n\n\nSIMOTICS CONNECT 400, All versions v0.5.0.0 or later and prior to v1.0.0.0 only affected by CVE-2021-25677: Update to v1.0.0.0 or later version\n\n--------- End Update A Part 1 of 1 ---------\nFor additional information, please refer to Siemens Security Advisory SSA-669158\nAs a general security measure, Siemens strongly recommends protecting network access to devices with appropriate mechanisms. In order to operate the devices in a protected IT environment, Siemens recommends configuring the environment according to Siemens operational guidelines for Industrial Security, and following the recommendations in the product manuals.\nFor further inquiries on security vulnerabilities in Siemens’ products and solutions, please contact Siemens ProductCERT.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-25677",
    "CVE-2020-27737",
    "CVE-2020-27736",
    "CVE-2020-27738"
  ],
  "techniques": [],
  "advisory": "icsa-21-103-13",
  "title": "Siemens SIMOTICS CONNECT 400 (Update A) | CISA",
  "source": "ics-advisories",
  "id": "595ce6524e51082514f1498a741e191106ba8e1b6826932bea6c36bd95cee347"
}