{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.3\nATTENTION: Exploitable remotely/low attack complexity/public exploits are available\nVendor: Franklin Fueling System\nEquipment: TS-550\nVulnerability: Use of Password Hash with Insufficient Computational Effort\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access the device and gain unauthenticated access.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Franklin Fueling System TS-550, are affected:\n\nTS-550: All versions prior to 1.9.23.8960\n\n3.2 Vulnerability Overview\n3.2.1 USE OF PASSWORD HASH WITH INSUFFICIENT COMPUTATIONAL EFFORT CWE-916\nFranklin Fueling System TS-550 versions prior to 1.9.23.8960 are vulnerable to attackers decoding admin credentials, resulting in unauthenticated access to the device.\nCVE-2023-5846 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nCISA discovered a public Proof of Concept (PoC) as authored by Parsa Rezaie Khiabanloo and reported it to Exploit-db.\n4. MITIGATIONS\nFranklin Fueling Systems released the following to fix this vulnerability:\n\nTS-550: Version 1.9.23.8960\n\nFor more information, contact Franklin Fueling System.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nNovember 2, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-5846"
  ],
  "techniques": [],
  "advisory": "icsa-23-306-04",
  "title": "Franklin Fueling System TS-550 | CISA",
  "source": "ics-advisories",
  "id": "d7680515dceb8a8af8cb14c3bab3c75156c72e526e9fcbcfb9fd554cefe9ef84"
}