{
  "markdown": " Ecava IntegraXor SQL \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events) ICS AdvisoryEcava IntegraXor SQL==================== Last Revised April 30, 2013 Alert Code ICSA\\-11\\-082\\-01Overview-------- ICS\\-CERT has received a report from independent security researcher Dan Rosenberg with Virtual Security Research (VSR) of an unauthenticated Structured Query Language (SQL) vulnerability in the Ecava IntegraXor human machine interface (HMI) product that could allow data leakage, data manipulation, and remote code execution against the backend host running the database service. ICS\\-CERT has coordinated with Ecava, which has verified the vulnerability and developed a patched release of IntegraXor (Build 4050\\) to address this vulnerability. Both ICS\\-CERT and the independent security researcher have validated the patch.Affected Products----------------- This vulnerability affects all IntegraXor versions prior to Version 3\\.60 (Build 4032\\).Impact------ A successful exploit of this vulnerability could lead to arbitrary data leakage, data manipulation, and remote code execution. The exact impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of this vulnerability based on their environment, architecture, and product implementation.Background----------[Ecava Sdn Bhd](http://www.ecava.com/index.htm)  is a Malaysia\\-based software development company that produces the IntegraXor product. Ecava specializes in factory and process automation solutions. IntegraXor is deployed in several areas of process control in 38 countries around the world with the largest installed base in the United Kingdom, United States, Australia, Poland, Canada, and Estonia.Vulnerability Characterization------------------------------### Vulnerability Overview IntegraXor is vulnerable to the execution of an unauthenticated SQL statement. An attacker may execute arbitrary SQL statements against the IntegraXor database by sending a specially crafted HTTP POST request. Exploitation of this vulnerability results in potential data leakage, data manipulation, and remote code execution against the backend host running the database service.### Vulnerability Details#### Exploitability An attacker could exploit this vulnerability from a remote machine.#### Existence of Exploit No known publicly available exploit exists.#### Difficulty An attacker would need a moderate skill level to exploit this vulnerability.Mitigation---------- ICS\\-CERT recommends that users of Ecava IntegraXor take the following mitigation steps:* Use the following link to obtain the patched version of Ecava IntegraXor (Build 4050\\): <http://www.integraxor.com/download/rc.msi> . For more information, customers should contact Ecava support at [support@integraxor.com](mailto:support@integraxor.com)  .* Minimize network exposure for all control system devices; critical devices should not directly face the Internet. Locate control system networks and remote devices behind firewalls and isolate them from the business network. If remote access is required, employ secure methods such as Virtual Private Networks (VPNs). Organizations that observe any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to taking defensive measures. The Control System Security Program also provides a recommended practices section for control systems on the US\\-CERT website. Several recommended practices are available for reading or download, including [*Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies*](/control_systems/practices/Recommended_Practices.html) . This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Ecava-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-advisories/icsa-11-082-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-01### [Mitsubishi Electric MELSOFT MaiLab](/news-events/ics-advisories/icsa-24-200-01) Jul 18, 2024 ICS Advisory \\| ICSA\\-24\\-200\\-02### [Subnet Solutions PowerSYSTEM Center](/news-events/ics-advisories/icsa-24-200-02) Jul 16, 2024 ICS Advisory \\| ICSA\\-24\\-198\\-01### [Rockwell Automation Pavilion 8](/news-events/ics-advisories/icsa-24-198-01) Jul 11, 2024 ICS Advisory \\| ICSA\\-24\\-193\\-01### [Siemens Remote Connect Server](/news-events/ics-advisories/icsa-24-193-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "icsa-11-082-01",
  "title": "Ecava IntegraXor SQL | CISA",
  "source": "ics-advisories",
  "id": "694df0245dd5891094198b86fbaaddc5fc97a147a53002c27f6bbda97eca9c4c"
}