{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 9.1\nATTENTION: Exploitable remotely\nVendor: Baxter\nEquipment: Welch Allyn Connex Spot Monitor (CSM)\nVulnerability: Use of Default Cryptographic Key\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to modify device configuration and firmware data. Tampering with this data could lead to device compromise, resulting in impact and/or delay in patient care.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Baxter (formerly manufactured by Hillrom) medical devices are affected:\n\nWelch Allyn Connex Spot Monitor (CSM): Versions 1.52 and prior\n\n3.2 Vulnerability Overview\n3.2.1 USE OF DEFAULT CRYPTOGRAPHIC KEY CWE-1394\nThe impacted product uses a default cryptographic key for potentially critical functionality. An attacker could modify device configurations and firmware data, resulting in impact and/or delay in patient care.\nCVE-2024-1275 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2024-1275. A base score of 9.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:H/AT:N/PR:N/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMaarten Boone and Edwin Van Andel (CTO of Zerocopter) reported this vulnerability to Baxter.\n4. MITIGATIONS\nBaxter has released a software update for all impacted devices and software to address this vulnerability. A new version of the product that mitigates the vulnerability is available as follows:\n\nWelch Allyn Connex Spot Monitor: Version 1.52.01 (available October 16, 2023)\n\nBaxter recommends users upgrade to the latest versions of their products. Information on how to update products to their new versions can be found on the Baxter disclosure page or the Hillrom disclosure page.\nBaxter recommends the following workarounds to help reduce risk:\n\nApply proper network and physical security controls.\nEnsure a unique encryption key is configured and applied to the product (as described in the Connex Spot Monitor Service Manual).\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nMay 30, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-1275"
  ],
  "techniques": [],
  "advisory": "icsma-24-151-02",
  "title": "Baxter Welch Allyn Connex Spot Monitor | CISA",
  "source": "ics-medical-advisories",
  "id": "abd8c58a1be9f6c0639fb5e5299f42a211d780689995e248f632f02788d84fd2"
}