{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Alaris PCU\nVulnerability: Uncontrolled Resource Consumption\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-170-06 BD Alaris PCU that was published June 18, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to cause a denial of service (DoS) on the target system and could cause the BD Alaris PCU to disconnect from the facility’s wireless network. \nWireless functionality operates independently from the pump system and a disruption in wireless connectivity would not affect pump module functionality. Exploiting this vulnerability would not provide administrative access to the BD Alaris PC Unit or the BD Alaris Systems Manager. An unauthorized user would not be able to gain permissions or be able to perform remote commands for the BD Alaris PC Unit. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of the BD Alaris PCU that has implemented the Linux Kernel v4.4.97 within the Laird Wireless Module WB40N are affected:\n\nAlaris PC Unit: Versions 9.13, 9.19, 9.33, and 12.1\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe affected products incorporate a vulnerable Linux kernel which is vulnerable to uncontrolled resource consumption due to a hard-coded Linux kernel maximum segment size overflow. This could allow an attacker to cause a denial of service, affecting the wireless functionality of the vulnerable devices.\nCVE-2019-11479 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nBD notified CISA that these products are affected by this Linux kernel vulnerability.\n5. MITIGATIONS\nBD recommends the following to help reduce the risks associated with this third-party vulnerability:\n\nConsider stronger network controls for wireless authentication, which are harder to replicate and substitute, such as enterprise versions of WPA2 protocols.\nUsers with Intrusion Detection Systems (IDS) should consider monitoring wireless networks with patient connected devices for possible malicious activity.\nBD Alaris Systems Manger should be considered a critical service. Whenever possible, it should be operated on a secure network behind a firewall, it should be patched regularly, and should have malware protection.\nEnsure that the BD Alaris PC Unit and BD Alaris Systems Manager are separated by a firewall.\n\n--------- Begin Update A Part 1 of 1 ---------\nFor more information on this issue, please see the associated BD product security bulletin on the BD website. \n--------- End Update A Part 1 of 1 ---------\nFor more information on BD’s product security and vulnerability management, contact the BD product security office. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Where additional information is needed, users should refer to existing cybersecurity in medical device guidance issued by the FDA.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-11479"
  ],
  "techniques": [],
  "advisory": "icsma-20-170-06",
  "title": "BD Alaris PCU (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "636ae37cd8b72d0748466d577ea831139c059d9b34c3b18fc5fe728f6f90931c"
}