{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: GE Healthcare\nEquipment: GE Imaging and Ultrasound Products\nVulnerabilities: Unprotected Transport of Credentials, Exposure of Sensitive System Information to an Unauthorized Control Sphere\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could occur if an attacker gains access to the healthcare delivery organization’s (HDO) network. If exploited, these vulnerabilities could allow an attacker to gain access to affected devices in a way that is comparable with GE (remote) service user privileges. A successful exploitation could expose sensitive data such as a limited set of patient health information (PHI) or could allow the attacker to run arbitrary code, which might impact the availability of the system and allow manipulation of PHI.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of GE imaging and ultrasound products are affected:\n\n\n\n\nModality\n\n\nProduct\n\n\n\n\nMR\n\n\n3.0T Signa HDxt / 3.0T Signa HDx, versions HD 16, HD23\n1.5T Brivo MR355 / Optima MR360, versions SV20.1, SV23.0\n1.5T Signa HDx / 1.5T Signa HDx, Signa HDi / Signa VIBRANT, versions HD16, HD23\n\n\n\n\nUltrasound, General Imaging\n\n\nLOGIQ 5 [BT03], LOGIQ 7 (BT03, BT04, BT06], LOGIQ 9 [BT02, BT03, BT04, BT06]\n\n\n\n\nUltrasound, Cardiovascular\n\n\nVivid I [BT06], Vivid 7 {BT02-BT06], EchoPAC (Turnkey) [BT06], Image Vault (Turnkey) [4.3]\n\n\n\n\nUltrasound, Women’s Health\n\n\nVoluson 730 [BT05, BT08]\n\n\n\n\nAdvanced Visualization\n\n\nAW 4.0 to AW 4.6, AWS2.0 to AW3.0\n\n\n\n\nAffected versions of the following can be determined by visiting the GE Customer Portal\n\n\n\n\nInterventional\n\n\nInnova 2000, 3100, 4100, 2100-IQ, 3100-IQ, 4100-IQ, 212-IQ, 313-IQ\nOptima 320, CL320i, CL323i, CL320, 3100\nOptima IGS 320, 330; Innova IGS 5x0, 6x0, 7x0\n\n\n\n\nAdvanced Visualization\n\n\nAW 4.0 to AW 4.6, AWS2.0 to AW3.0\n\n\n\n\nX-Ray\n\n\nBrivo XR118, XR383, XR515, XR575; Definium 5000, 6000, 8000, AMX 700; Discovery XR650, XR656, XR656+; Optima XR640, XR646, XR220amx, XR200amx; Precision 500D, WDR1\n\n\n\n\nMammography\n\n\nSeno 200D, DS, Essential; Senographe Pristina\n\n\n\n\nComputed Tomography\n\n\nBrightSpeed Elite, Elite Select, Edge, Edge Select\nBrivo CT385\nDiscovery CT590RT, CT750HD\nLightSpeed VCT, Pro16, RT16\nOptima Advance, CT520, CT540, CT660, CT580, CT580RT, CT580W, CT670, CT680 Quantum, Expert & Professional\nRevolution EVO,HD,ACT, ACTs, CT, Discovery CT, Frontier, Frontier ES\n\n\n\n\nNuclear Medicine, PET/CT\n\n\nBrivo NM 615\nDiscovery NM 630, NM 750b, NM D530c, NM/CT D570c, NM/CT 670\nInfinia\nDiscovery NM830, NM/CT 860, NM/CT850, NM/CT 870, MI MI DR, IQ\nOptima NM/CT 640\nVentri\nXeleris\nPET Discovery IQ, IQ upgrade\nPETrace 800\n\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNPROTECTED TRANSPORT OF CREDENTIALS CWE-523\nThe affected products may allow specific credentials to be exposed during transport over the network.\nCVE-2020-25175 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    EXPOSURE OF SENSITIVE SYSTEM INFORMATION TO AN UNAUTHORIZED CONTROL SPHERE CWE-497\nThe affected products may allow exposed/default credentials to be utilized to access or modify sensitive information.\nCVE-2020-25179 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nLior Bar Yosef and Elad Luz of CyberMDX reported these vulnerabilities to GE Healthcare.\n4. MITIGATIONS\nGE has identified mitigations for specific products and releases and will take proactive measures to ensure proper configuration of the product firewall protection and change default passwords on impacted devices where possible. GE recommends users refer to the GE Healthcare Product Security Portal for more details on mitigations and how proactive actions may apply to affected devices.\nIn addition to the product specific recommendations, GE recommends utilizing clinical network security best practices. Suggested clinical best practices include:\n\nEnsure proper segmentation of the local hospital/clinical network and create explicit access rules based on source/destination IP/port for all connections, including those used for remote support. Specific ports to consider may include those used for TELNET, FTP, REXEC, and SSH\nUtilize IPSec VPN and explicit access rules at the Internet edge before forwarding incoming connections to the local hospital/clinical network.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-25179",
    "CVE-2020-25175"
  ],
  "techniques": [],
  "advisory": "icsma-20-343-01",
  "title": "GE Healthcare Imaging and Ultrasound Products | CISA",
  "source": "ics-medical-advisories",
  "id": "b450cb95659447e580a56d71cd8ba3f0965c9aa90d7ceb3667b5d0e5b26da23a"
}