{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.4\n\nATTENTION: Exploitable Remotely / Low skill level to exploit / Public exploits are available\nVendors: Silex Technology, GE Healthcare\nEquipment: SX-500, SD-320AN, MobileLink\nVulnerabilities: Improper Authentication, OS Command Injection\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSMA-18-128-01 Silex Technology SX-500/SD-320AN or GE Healthcare MobileLink (Update A) that was published May 31, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow modification of system settings and remote code execution.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following products from Silex Technology are affected. Some are not affected by both vulnerabilities (see Mitigations Section):\n\nGEH-500 Version 1.54 and prior (integrated into GE MobileLink),\nSX-500 All Versions (end-of-life 2011),\nGEH-SD-320AN Version GEH-1.1 and prior (integrated into GE MobileLink), and\nSD-320AN Version 2.01 and prior (end-of-life Nov 2017).\n\nThe following models of GE MAC Resting ECG analysis system may use the vulnerable MobileLink technology:\n\nMAC 3500,\nMAC 5000 (end-of-life 2012),\nMAC 5500, and\nMAC 5500 HD.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1   IMPROPER AUTHENTICATION CWE-287\nAuthentication is not verified when making certain POST requests, which may allow attackers to modify system settings.\nCVE-2018-6020 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:L).\n4.2.2  IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nA system call parameter is not properly sanitized, which may allow remote code execution.\nCVE-2018-6021 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:L).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Healthcare and Public Health\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: United States\n\n4.4 RESEARCHER\nEric Evenchick of Atredis Partners reported these vulnerabilities to Silex and GE and tested pre-release firmware and other mitigations confirming they resolved the vulnerabilities.\n5. MITIGATIONS\nSilex Technologies and GE Healthcare recommend the following mitigations:\nCVE-2018-6020 (GE MobileLink/SX-500) – Enable the “update” account within the web interface, which is not enabled by default. Set the secondary password for the “update” account to prevent unauthenticated changes to the device configuration.\n--------- Begin Update B Part 1 of 1 --------\nCVE-2018-6021 (GE MobileLink/GEH-SD-320AN) – Silex Technology and GE Healthcare have produced an updated firmware image (Version 1.14) for the GEH-SD-320AN, which is now available for download at the following location:  \nhttp://silextechnology.com/geh320an/\nGE Healthcare has released a security notice that can be viewed at:\nhttp://www3.gehealthcare.com/en/support/security\nThe firmware update (Version 2.0.3) for SD-320AN is separate from GEH-SD-320AN and is available for download from Silex Technology at the following link:\nhttps://www.silextechnology.com/connectivity-solutions/device-connectivity/sd-320an\nNote that this update does not pertain to the listed GEH device. Contact Silex Technology for more information regarding download and application of this new firmware.\n--------- End Update B Part 1 of 1 --------\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-6020",
    "CVE-2018-6021"
  ],
  "techniques": [],
  "advisory": "icsma-18-128-01",
  "title": "Silex Technology SX-500/SD-320AN or GE Healthcare MobileLink (Update B) | CISA",
  "source": "ics-medical-advisories",
  "id": "4983f67309a939dfa08b281275dca9fe2d75642cb2cb2014e0c9a47e302fd12e"
}