{
  "markdown": " Biosense Webster Carto 3 System Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events)4. [ICS Medical Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A96) ICS Medical AdvisoryBiosense Webster Carto 3 System Vulnerabilities=============================================== Last Revised April 17, 2018 Alert Code ICSMA\\-18\\-107\\-021\\. EXECUTIVE SUMMARY--------------------- Biosense Webster Inc. (BWI), a Johnson \\& Johnson company, has produced a software update that applies operating system patches and anti\\-virus signature updates to close known vulnerabilities in the operating system of the CARTO 3 System, a 3D cardiovascular mapping platform. This update will be applied to CARTO 3 Systems beginning in April, 2018 as part of the free\\-of\\-charge CARTO 3 Version 6 (V6\\) base software version, which is designed to upgrade compatible CARTO 3 Systems running Version 4 (V4\\) *.* 2\\. RISK EVALUATION------------------- If the system is networked, the network interface for CARTO 3 V4 is sufficiently restricted by a software firewall to provide users reasonable assurance that it will not be exploited remotely or via malware/ransomware. If an attacker has persistent physical access to a CARTO 3 V4 System, the attacker could exploit the vulnerabilities in the operating system. This could allow the attacker to access information stored in the device, including individually identified health information about patients, affect the integrity of CARTO 3, or deny availability of the device. If the CARTO 3 V4 System is networked, an attacker with persistent physical access may also be able to access other systems within the user’s network. Impact to individual organizations depends on many factors that are unique to each organization. NCCIC recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment and specific clinical usage.3\\. TECHNICAL DETAILS---------------------### 3\\.1 AFFECTED PRODUCTS The following CARTO 3 Systems versions are affected: CARTO 3 Systems manufactured before April, 2018\\.### 3\\.2 VULNERABILITY OVERVIEW BWI reported controlled risks in the CARTO 3 System related to operating system vulnerabilities and outdated anti\\-virus signatures. A table providing CVE numbers, Microsoft vulnerability tracking numbers, and titles can be found at the following link:[http://www.productsecurity.jnj.com/CARTO3v4\\-Advisory\\-040918\\.pdf](https://urldefense.proofpoint.com/v2/url?u=http-3A__www.productsecurity.jnj.com_CARTO3v4-2DAdvisory-2D040918.pdf&d=DwMFAg&c=54IZrppPQZKX9mLzcGdPfFD1hxrcB__aEkJFOKJFd00&r=zE5lG3CZZIbdBvT6slVAzQ&m=2A8zuvg_VE745BxzhV5uocONCC3j4PYAnPOPWWFCuU8&s=ScC0qw1UroKQBC9EKEvW6snbfRJmqhXeiyS2oIDZpc8&e=) ### *3\\.2\\.1*  VULNERABILITY DETAILS 3\\.2\\.2\\.1   EXPLOITABILITY These vulnerabilities cannot be exploited remotely. Even if the CARTO 3 V4 System is networked, its network interface is restricted by a software firewall. These vulnerabilities require physical access to the CARTO 3 V4 System to exploit. 3\\.2\\.2\\.2   EXISTENCE OF EXPLOIT Exploits that target these vulnerabilities exist and are publicly available. 3\\.2\\.2\\.3   DIFFICULTY Exploiting these vulnerabilities would be difficult because an attacker must have physical access to the device and knowledge of the public exploits to exploit these vulnerabilities.### 4\\.3 BACKGROUND BWI, a Johnson \\& Johnson company, is a U.S.\\-based company that maintains offices in several countries around the world, including the U.S., Asia, Europe, Middle East, and Africa. The affected product, the CARTO 3 V4 System, is an imaging device that uses electromagnetic technology to create real\\-time three\\-dimensional (3D) maps of a patient’s cardiac structures. According to BWI, CARTO 3 is deployed across the healthcare and public health sector. BWI estimates these products are used primarily in the United States, Asia, Europe, Middle East, and Africa.5\\. MITIGATIONS--------------- Physical security for the CARTO 3 System is a critical control that must be employed by device users to limit the exposure of identified risks and vulnerabilities that can be exploited with persistent physical access to the device. BWI will be contacting users to initiate a software update in the field to address vulnerabilities within the CARTO 3 System. Users with questions regarding the CARTO 3 system are advised to contact their BWI sales representative or service technician. Please see the Johnson \\& Johnson Product Security website for the latest security information for Products of the Johnson \\& Johnson Family of Companies:[http://productsecurity.jnj.com](http://productsecurity.jnj.com/)  NCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure that they are [not accessible from the Internet](/ics/alerts/ICS-ALERT-10-301-01)  .* Locate all medical devices and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. NCCIC also provides a section for [*control systems security recommended practices*](/ics/content/recommended-practices) on the ICS\\-CERT web page. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the [ICS\\-CERT website](/ics/)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Biosense Webster-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-medical-advisories/icsma-18-107-02)  ; Related Advisories------------------ Jul 18, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-200\\-01### [Philips Vue PACS](/news-events/ics-medical-advisories/icsma-24-200-01) Jun 11, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-163\\-01### [MicroDicom DICOM Viewer](/news-events/ics-medical-advisories/icsma-24-163-01) May 30, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-151\\-02### [Baxter Welch Allyn Connex Spot Monitor](/news-events/ics-medical-advisories/icsma-24-151-02) May 30, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-151\\-01### [Baxter Welch Allyn Configuration Tool](/news-events/ics-medical-advisories/icsma-24-151-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [],
  "techniques": [],
  "advisory": "icsma-18-107-02",
  "title": "Biosense Webster Carto 3 System Vulnerabilities | CISA",
  "source": "ics-medical-advisories",
  "id": "2de2753e4a15355a164a05127931b01da5a6d81134d5b6f996e5ae2bcac12103"
}