{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Ypsomed\nEquipment: mylife Cloud, mylife Mobile Application\nVulnerabilities: Insufficiently Protected Credentials, Not Using an Unpredictable IV with CBC Mode, Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to obtain sensitive application information or modify the integrity of data being transmitted.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Ypsomed mylife diabetes management platform, are affected:\n\nYpsomed mylife Cloud: All versions prior to 1.7.2\nYpsomed mylife App: All versions prior to 1.7.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENTLY PROTECTED CREDENTIALS (CWE-522)\nThe Ypsomed mylife Cloud discloses password hashes during the registration process.\nCVE-2021-27491 has been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:N).\n3.2.2    INSUFFICIENTLY PROTECTED CREDENTIALS (CWE-522)\nThe Ypsomed mylife Cloud reflects the user password during the login process after redirecting the user from a HTTPS endpoint to a HTTP endpoint.\nCVE-2021-27495 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:N).\n3.2.3    NOT USING AN UNPREDICTABLE IV WITH CBC MODE (CWE-329)\nThe application layer encryption of the communication protocol between the Ypsomed mylife App and mylife Cloud uses non-random IVs, which allows man-in-the-middle attackers to tamper with messages.\nCVE-2021-27499 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N).\n3.2.4    USE OF HARD-CODED CREDENTIALS (CWE-798)\nThe application encrypts on the application layer of the communication protocol between the Ypsomed mylife App and mylife Cloud credentials based on hard-coded secrets, which allows man-in-the-middle attackers to tamper with messages.\nCVE-2021-27503 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nJulian Suleder, Linda Huischen, and Nils Emmerich of ERNW Research GmbH and Dr. Oliver Matula of Enno Rey Netzwerke GmbH (ERNW) reported these vulnerabilities to the Federal Office for Information Security (BSI, Germany), in the context of the BSI project ManiMed – Manipulation of Medical Devices.\n4. MITIGATIONS\nYpsomed has taken action to update the affected mylife Cloud backend services to mitigate the vulnerabilities affecting the mylife Cloud in versions prior to 1.7.2. Ypsomed recommends users with the affected mobile application to update to the latest available application Version 1.7.5 or later.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n•    Restrict system access to authorized personnel only and follow a least privilege approach.\n•    Apply defense-in-depth strategies.\n•    Disable unnecessary accounts and services.\n•    Where additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2021-27503",
    "CVE-2021-27495",
    "CVE-2021-27499",
    "CVE-2021-27491"
  ],
  "techniques": [],
  "advisory": "icsma-21-196-01",
  "title": "Ypsomed mylife | CISA",
  "source": "ics-medical-advisories",
  "id": "e9e13f919cccfe4c55fbb646a7a07d98d99bc8322df4e34658f7633d0944ca16"
}