{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.8\nATTENTION: Low skill level to exploit\nVendor: Medtronic\nEquipment: Valleylab FT10, Valleylab LS10\nVulnerabilities: Improper Authentication, Protection Mechanism Failure\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to connect inauthentic instruments to the affected products by spoofing RFID security mechanisms. This may lead to a loss of performance integrity and platform availability due to incorrect identification of instrument and associated parameters.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Medtronic Valleylab energy and electrosurgery products, are affected:\n\nValleylab FT10 Energy Platform (VLFT10GEN)\n\nVersion 2.1.0 and lower\nVersion 2.0.3 and lower\n\n\nValleylab LS10 Energy Platform (VLLS10GEN—not available in the United States)\n\nVersion 1.20.2 and lower\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 IMPROPER AUTHENTICATION CWE-287\nThe RFID security mechanism used for authentication between the FT10/LS10 Energy Platform and instruments can be bypassed, allowing for inauthentic instruments to connect to the generator.\nCVE-2019-13531 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:L).\n3.2.2 PROTECTION MECHANISM FAILURE CWE-693\nThe RFID security mechanism does not apply read protection, allowing for full read access of the RFID security mechanism data.\nCVE-2019-13535 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nMedtronic reported these vulnerabilities to CISA.\n4. MITIGATIONS\nA software patch is available now for the affected Valleylab platforms. If you suspect you are in possession of an instrument that is not FDA approved or cleared to be used with Medtronic Valleylab FT10 or LS10, please contact Medtronic or your medical device supplier. If you have concerns about FDA clearance or approval of current or future instruments, please contact your medical device supplier. Please contact Medtronic to obtain the software patch.\nMedtronic has released additional patient focused information at the following location:\nhttps://www.medtronic.com/security\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA at the following location: https://www.fda.gov/medical-devices/digital-health/cybersecurity\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThese vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2019-13531",
    "CVE-2019-13535"
  ],
  "techniques": [],
  "advisory": "icsma-19-311-01",
  "title": "Medtronic Valleylab FT10 and LS10 | CISA",
  "source": "ics-medical-advisories",
  "id": "99dc31bd9d0ff874592032aad6b095c9dfacd6830c53a7a8be19707344cbfe3b"
}