{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Low attack complexity\nVendor: Philips\nEquipment: IntelliBridge EC 40 and EC 80 Hub\nVulnerabilities: Use of Hard-coded Credentials, Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker unauthorized access to the IntelliBridge EC40 and80 Hub. This could allow an attacker to execute software, modify system configurations, or view/update files, including unidentifiable patient data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of IntelliBridge are affected:\n\nIntelliBridge EC 40 Hub, C.00.04 and prior\nIntelliBridge EC 80 Hub, C.00.04 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe software contains hard-coded credentials, such as a password or a cryptographic key, which it uses for its own inbound authentication, outbound communication to external components, or encryption of internal data.\nCVE-2021-32993 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.2.2    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nThe standard access path of the affected product requires authentication, but the product has an alternate path or channel that does not require authentication.\nCVE-2021-33017 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nYounes Dragoni, Andrea Palanca and Ivan Speziale of Nozomi Networks reported these vulnerabilities to CISA.\n4. MITIGATIONS\nPhilips plans to make a new release to remediate these vulnerabilities by the end of Q4 2021.\nAs an interim mitigation to these vulnerabilities, Philips recommends the following:\n\nUsers should operate all Philips deployed and supported products within Philips authorized specifications, including Philips approved software, software configuration, system services, and security configuration.\nThe medical device network should be logically or physically isolated from the hospital network as specified in the Philips Patient Monitoring System Security for Clinical Networks guide, available on Philips InCenter. There is no clinical requirement for these devices to communicate outside of the Philips clinical network.\n\nUsers with questions about their specific EC 40 and EC 80 Hub products should contact the Philips service support team or regional service support. Philips contact information is available on the Philips customer service solutions website, or via phone (U.S.) at 1-800-722-9377.\nThe IntelliBridge EC 40 and EC 80 Hub is intended to transfer medical device data from one format to another according to preset specifications. It performs data transfer without controlling or altering the function or parameters of any connected medical devices. The EC 40 and EC 80 Hub are not intended for use in connection with active patient monitoring. If data is not received from the hub a notification is generated on the PIC iX Central Station and users are advised to refer to the source medical device.\nMore information on these vulnerabilities, as well as the latest security information for Philips products, is available on the Philips product security website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-32993",
    "CVE-2021-33017"
  ],
  "techniques": [],
  "advisory": "icsma-21-322-01",
  "title": "Philips IntelliBridge EC 40 and EC 80 Hub | CISA",
  "source": "ics-medical-advisories",
  "id": "e0b24baab9e0b2fd90a39763e63a75e7eb428599d34d5935e2bb436eb2e6a3a7"
}