{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Pyxis\nVulnerability: Not Using Password Aging\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain access to electronic protected health information (ePHI) or other sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following BD Pyxis products, an automated medication dispensing system, are affected:\n\nBD Pyxis ES Anesthesia Station\nBD Pyxis CIISafe\nBD Pyxis Logistics\nBD Pyxis MedBank\nBD Pyxis MedStation 4000\nBD Pyxis MedStation ES\nBD Pyxis MedStation ES Server\nBD Pyxis ParAssist\nBD Pyxis Rapid Rx\nBD Pyxis StockStation\nBD Pyxis SupplyCenter\nBD Pyxis SupplyRoller\nBD Pyxis SupplyStation\nBD Pyxis SupplyStation EC\nBD Pyxis SupplyStation RF auxiliary\nBD Rowa Pouch Packaging Systems\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    NOT USING PASSWORD AGING CWE-262\nSpecific BD Pyxis products were installed with default credentials and may still operate with these credentials. There may be scenarios where BD Pyxis products are installed with the same default local operating system credentials or domain-joined server(s) credentials that may be shared across product types. Threat actors could exploit this vulnerability to gain privileged access to the underlying file system and exploit or gain access to ePHI or other sensitive information.\nCVE-2022-22767 has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBD voluntarily reported this vulnerability through the CISA coordinated vulnerability disclosure program.\n4. MITIGATIONS\nBD is currently strengthening credential management capabilities in BD Pyxis products. Service personnel are working with users whose domain-joined server(s) credentials require updates.\nBD is piloting a credential management solution initially targeted for specific BD Pyxis product versions and will allow for improved authentication management practices with specific local operating system credentials. Changes needed for installation, upgrade, or to applications are being evaluated as remediations.\nAdditionally, BD recommends the following compensating controls for users of BD Pyxis products utilizing default credentials:\n\nLimit physical access to only authorized personnel.\nTightly control management of system passwords provided to authorized users.\nMonitor and log network traffic attempting to reach the affected products for suspicious activity.\nIsolate affected products in a secure VLAN or behind firewalls with restricted access that only permits communication with trusted hosts in other networks, when needed.\n\nFor more information on this issue, please see the associated BD product security bulletin on the BD website.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-22767"
  ],
  "techniques": [],
  "advisory": "icsma-22-151-01",
  "title": "BD Pyxis | CISA",
  "source": "ics-medical-advisories",
  "id": "6470f9eabd8818ae6bffbf426adf7251059debc5083c617dbe75dac7a8274e46"
}