{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.4\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Alaris GS, Alaris GH, Alaris CC, Alaris TIVA\nVulnerability: Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow a remote attacker to gain unauthorized access to various Alaris Syringe pumps and impact the intended operation of the pump when it is connected to a terminal server via the serial port. BD has determined the affected products are not sold within the United States.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Alaris Plus, medical syringe pumps, Versions 2.3.6 and prior, are affected:\n\nAlaris GS,\nAlaris GH,\nAlaris CC, and\nAlaris TIVA.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe software does not perform authentication for functionality that requires a provable user identity.\nCVE-2018-14786 has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: European Union\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nElad Luz of CyberMDX discovered this vulnerability, and BD reported this vulnerability to NCICC.\n4. MITIGATIONS\nBD reports that this vulnerability cannot be performed if the device is connected to an Alaris Gateway Workstation docking station. Also, an attacker cannot switch the device on remotely, and no PHI or PII can be accessed by exploiting this vulnerability.\nBD recommends the following mitigations and compensating controls in order to reduce risk associated with this vulnerability:\n\nThis attack utilizes a known vulnerability in terminal servers. Users who utilize terminal servers should understand that terminal server use is not supported.  \nUsers should ensure they are operating these devices in a segmented network environment or as a stand-alone device.\nUsers should utilize connections via the Alaris Gateway Workstation docking station, which would inactivate the remote control feature.\n\nFor more information on BD’s product security and vulnerability management, contact their product security office at:\nhttp://www.bd.com/productsecurity\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2018-14786"
  ],
  "techniques": [],
  "advisory": "icsma-18-235-01",
  "title": "BD Alaris Plus | CISA",
  "source": "ics-medical-advisories",
  "id": "b63733e44bb13e276c37eddd239527a72c7861a4ff86ac2177a15bf420260a19"
}