{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.6\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Baxter  \nEquipment: Sigma Spectrum Infusion Pumps  \nVulnerabilities: Use of Hard-coded Password, Cleartext Transmission of Sensitive Data, Incorrect Permission Assignment for Critical Resource, Operation on a Resource After Expiration or Release \n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-170-04 Sigma Spectrum Infusion Pumps (Update A) that was published June 23, 2020, on the ICS webpage on cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in access to sensitive data, alteration of system configuration, and impact to system availability. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Sigma Spectrum Infusion systems, are affected: \n\nSigma Spectrum v6.x model 35700BAX \nBaxter Spectrum v8.x model 35700BAX2 \n\n--------- Begin Update B Part 1 of 6 --------- \n\nBaxter Spectrum v9.x model 35700BAX3 \nSigma Spectrum LVP v6.x with Wireless Battery Modules v9, v11, v13, v14, v15, v16, v16D38, v17, v17D19, v20D29 to v20D32, and v22D24 to v22D28 \nBaxter Spectrum LVP v8.x with Wireless Battery Modules v17, v17D19, v20D29 to v20D32, and v22D24 to v22D28 \nBaxter Spectrum LVP v9.x with Wireless Battery Module v22D19 to v22D28 \n\n--------- End Update B Part 1 of 6 --------- \n4.2 VULNERABILITY OVERVIEW\n4.2.1 USE OF HARD-CODED PASSWORD CWE-259\nSigma Spectrum Infusion System Version(s) 6.x (model 35700BAX) and Baxter Spectrum Infusion System Version(s) 8.x (model 35700BAX2) contain hard-coded passwords which, when physically entered on the keypad, provide access to biomedical menus that include device settings, view of calibration values, and network configuration of the Sigma Spectrum Wireless Battery Module (WBM) if installed. \nCVE-2020-12039 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). \n4.2.2 CLEARTEXT TRANSMISSION OF SENSITIVE DATA CWE-319 \nSigma Spectrum Infusion System Version(s) 6.x (model 35700BAX) and Baxter Spectrum Infusion System Version(s) 8.x (model 35700BAX2) at the application layer uses an unauthenticated clear-text communication channel to send and receive system status and operational data. This could allow an attacker that has circumvented network security measures to view sensitive non-private data or to perform a man-in-the-middle attack. \nCVE-2020-12040 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). \n4.2.3 USE OF HARD CODED PASSWORD CWE-259\n--------- Begin Update B Part 2 of 6 --------- \nThe Baxter Spectrum WBM (v9, v11, v13, v14, v15, v16, v16D38, v17, v17D19, v20D29 to v20D32, and v22D19 to v22D28) operates a Telnet service with hard-coded credentials when connected to specific SSIDs.   \n--------- End Update B Part 2 of 6 --------- \nCVE-2020-12045 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H). \n4.2.4 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732\n--------- Begin Update B Part 3 of 6 --------- \nThe Baxter Spectrum WBM (v9, v11, v13, v14, v15, v16, v16D38, v17, v17D19, v20D29 to v20D32, and v22D19 to v22D28) Telnet Command-Line Interface grants access to sensitive data stored on the WBM that permits temporary configuration changes to network settings of the WBM. This access allows the WBM to be rebooted. Temporary configuration changes to network settings are removed upon reboot. \n--------- End Update B Part 3 of 6 --------- \nCVE-2020-12041 has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H). \n4.2.5 USE OF HARD-CODED PASSWORD CWE-259\n--------- Begin Update B Part 4 of 6 --------- \nThe factor-default wireless configuration of the Baxter Spectrum WBM (v17, v17D19, v20D29 to v20D32, and v22D19 to v22D28) enables File Transfer Protocol (FTP) service with hard-coded credentials. \n--------- End Update B Part 4 of 6 --------- \nCVE-2020-12047 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). \n4.2.6 OPERATION ON A RESOURCE AFTER EXPIRATION OR RELEASE CWE-672\n--------- Begin Update B Part 5 of 6 --------- \nWhen configured for wireless networking, the Baxter Spectrum WBM (v17, v17D19, v20D29 to v20D32, and v22D19 to v22D28) enables FTP service operating on the WBM to remain operational until the WBM is rebooted. \n--------- End Update B Part 5 of 6 --------- \nCVE-2020-12043 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: United States  \nCOMPANY HEADQUARTERS LOCATION: United States  \n\n4.4 RESEARCHER\n Baxter Healthcare has reported these vulnerabilities to CISA. \n5. MITIGATIONS\nBaxter recommends ensuring appropriate physical controls within user environments to protect against unauthorized access to devices.  \nBaxter recommends isolating the Spectrum Infusion Systems to its own network VLAN to segregate the system from other hospital systems, and reduce the probability that a threat actor could execute an adjacent attack such as a MiTM attack against the system to observe clear-text communications. \n--------- Begin Update B Part 6 of 6 --------- \nBaxter recommends using the strongest available wireless network security protocols (e.g., WPA2, EAP-TLS, etc.) to provide authentication and encryption of wireless data sent to and from the Spectrum Infusion System. \n--------- End Update B Part 6 of 6 --------- \nUsers should ensure the WBM is rebooted after configuration for their network(s) by removing the WBM from the rear of the Spectrum device for 10-15 seconds, and then re-attaching the WBM.  \nUsers should always monitor for and/or block unexpected traffic, such as FTP, at network boundaries into the Spectrum-specific VLAN. \nAs a last resort, users may disable wireless operation of the pump. The Spectrum Infusion System was designed to operate without network access. This action would impact an organization’s ability to rapidly deploy drug library (formulary) updates to their pumps. \nFor additional information please see the Baxter Product Security Bulletin. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2020-12043",
    "CVE-2020-12045",
    "CVE-2020-12040",
    "CVE-2020-12047",
    "CVE-2020-12041",
    "CVE-2020-12039"
  ],
  "techniques": [],
  "advisory": "icsma-20-170-04",
  "title": "Baxter Sigma Spectrum Infusion Pumps (Update B) | CISA",
  "source": "ics-medical-advisories",
  "id": "a006c9c8278b023d5ceee1e1ccd77a2ee20cb757e529a08fb3351705c7a492cc"
}