{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: Philips Interventional WorkSpot, Coronary Tools/Dynamic Coronary Roadmap/Stentboost Live, ViewForum\nVulnerability: OS Command Injection\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability makes it possible for someone within the hospital network to remotely shut down or restart the workstation. In the event the workstation is remotely shut down, physicians are still able to use diagnostic imaging from the X-ray system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThis issue affects four Haswell workstations labeled with 12NC identification numbers (4598 009 39471, 4598 009 39481, 4598 009 70861, 4598 009 98531) when running the following versions of interventional software:\n\nInterventional Workspot (Release 1.3.2, 1.4.0, 1.4.1, 1.4.3, 1.4.5)\nCoronary Tools/Dynamic Coronary Roadmap/Stentboost Live (Release 1.0)\nViewForum (Release 6.3V1L10)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nThe software constructs all or part of an OS command using externally influenced input from an upstream component but does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when sent to a downstream component.\nCVE-2020-27298 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nPhilips reported this vulnerability to CISA.\n4. MITIGATIONS\nPhilips has released a software patch to proactively address this vulnerability in the installed base and will schedule service activities with impacted users to implement the correction. As a mitigation for this vulnerability, users with expertise are advised to change the IPMI password for the workstation interface.\nUsers with questions regarding specific Philips Interventional Workspot and/or installations and correction eligibility should contact a Philips service support team, regional service support, or call 1-800-722-9377 with reference to field change order (FCO) number 2019-IGTBST-014.\nPlease see the Philips product security website for the Philips advisory and the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nImplement physical security measures to limit or control access to critical systems.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-27298"
  ],
  "techniques": [],
  "advisory": "icsma-21-019-01",
  "title": "Philips Interventional Workstations | CISA",
  "source": "ics-medical-advisories",
  "id": "fd86f39a4e1ce40c91f99fa5a309c51eaaffc7a41b5c05c1ed7a134cc4b41c07"
}