{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 4.6\n\nATTENTION: Low skill level to exploit\nVendor: Medtronic\nEquipment: 9790 CareLink Programmer, 2090 CareLink Programmer, 29901 Encore Programmer\nVulnerability: Missing Encryption of Sensitive Data\n\n2. RISK EVALUATION\nAs part of the intended functionality of this device, it may store protected health information (PHI) or personally identifiable information (PII). Successful exploitation of the vulnerability may allow an attacker with physical access to an affected programmer to access PHI or PII stored on the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Medtronic CareLink and Encore Programmers, devices used by trained personnel at hospitals and clinics to program and manage Medtronic cardiac devices, are affected:\n\nCareLink 9790 Programmer, all versions,\nCareLink 2090 Programmer, all versions, and\n29901 Encore Programmer, all versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nThe affected products do not encrypt or do not sufficiently encrypt the following sensitive information while at rest:\n\nPII. Some combination of personal data that enables the unique identification of an individual. PII is defined as “information that can be used to distinguish or trace an individual’s identity, either alone or when combined with other personal or identifying information that is linked or linkable to a specific individual.”\nPHI. Some combination of PII and associated health related data.\n\nCVE-2018-18984 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nResearchers Billy Rios and Jonathan Butts of Whitescope LLC reported this vulnerability to NCCIC.\n4. MITIGATIONS\nThe CareLink 9790 Programmer has been placed into end-of-life status and is no longer supported by Medtronic. Medtronic recommends users no longer use the 9790 for any purpose.\nThe CareLink 2090 and 29901 Encore programmers store PHI and PII as part of their normal operating procedure. Medtronic recommends that when devices are storing PHI/PII it should be retained on these programmers for the least amount of time necessary, and should be handled, managed and secured in a manner consistent with the applicable laws for patient data privacy. Please contact a Medtronic representative for proper disposal and PHI/PII retention setting instructions.\nAll affected programmers allow for the manual deletion of programmer-generated reports, which could contain PHI/PII. Medtronic recommends users delete these reports when no longer needed and prior to any disposition of the programmer.\nMedtronic recommends users take additional defensive measures to minimize the risk of exploitation. Specifically, hospitals and clinicians should:\n\nMaintain strict physical control of the programmer.\nUse only legitimately obtained programmers and not ones provided by any third party.\n\nProper disposal of these programmers and the associated electronic media storing data is critical for the continued protection of any PHI and PII residing on the programmer.\nMedtronic has released a security bulletin related to this advisory that is available, with contact information, at the following location:\nhttps://www.medtronic.com/security\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-18984"
  ],
  "techniques": [],
  "advisory": "icsma-18-347-01",
  "title": "Medtronic 9790, 2090 CareLink, and 29901 Encore Programmers | CISA",
  "source": "ics-medical-advisories",
  "id": "f17d7ea3149a5d47d528739d01a6984418c8299802545e6d01545862edff974e"
}