{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Low skill level to exploit/public exploits are available\nVendor: Capsule Technologies\nEquipment: SmartLinx Neuron 2\nVulnerability: Protection Mechanism Failure\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-20-196-01 Capsule Technologies SmartLinx Neuron 2 that was published July 14, 2020, on the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could provide an attacker with full control of a trusted device on a hospital’s internal network.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Capsule Technologies SmartLinx Neuron 2, a medical device platform, are affected:\n--------- Begin Update A Part 1 of 2 ---------\n\nCapsule Technologies SmartLinx Neuron 2: Firmware Versions 9.0.3 and older\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    PROTECTION MECHANISM FAILURE CWE-693\nA restricted environment escape vulnerability exists in the “kiosk mode” function of Capsule Technologies SmartLinx Neuron 2 medical information collection devices running\nVersion 6.9.1. A specific series of keyboard inputs can allow an escape from the restricted environment, resulting in full administrator access to the underlying operating system. An attacker can connect to the device via USB port with a keyboard or other HID device to trigger this vulnerability.\nCVE-2019-5024 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nPatrick DeSantis of Cisco Talos reported this vulnerability to Capsule Technologies.\n5. MITIGATIONS\nCapsule Technologies recommends the following mitigations:\n--------- Begin Update A Part 2 of 2 ---------\n\nUpdate the software to a supported version (v9.0.4 and above) by doing the following:\n\n--------- End Update A Part 2 of 2 ---------\n\n\n\nConnect the Neuron 2 to the Capsule SmartLinx application server.\nEdit the Neuron Software Reference to include the Neuron software the user wants to update.\nTransfer the Neuron Software to the given Neuron.\nSelect Install Neuron Software Reference on the given Neuron.\nThe Neuron will drop offline for approximately 30 minutes for the install to complete.\n\n\nRestrict physical access to the vulnerable devices and ensure they remain outside of the organization’s security perimeter.\nEnsure data communications from the devices are not implicitly trusted by internal systems.\nIf possible, physically disable or obstruct access to USB ports on vulnerable devices.\nMonitor logs for signs of connections of unauthorized peripherals to vulnerable devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThis vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-5024"
  ],
  "techniques": [],
  "advisory": "icsma-20-196-01",
  "title": "Capsule Technologies SmartLinx Neuron 2 (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "685fe02b3403eb345308fa76d4027524d069efc9363abd079a0d8741b676125b"
}