{
  "markdown": " Philips' IntelliView MX40 Patient Worn Monitor (WLAN) Vulnerabilities \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events)4. [ICS Medical Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A96) ICS Medical AdvisoryPhilips' IntelliView MX40 Patient Worn Monitor (WLAN) Vulnerabilities===================================================================== Last Revised September 12, 2017 Alert Code ICSMA\\-17\\-255\\-01OVERVIEW-------- Philips has identified two vulnerabilities in Philips’ IntelliView MX40 Patient Worn Monitor for use with wireless local area networks (WLANs). Philips has produced a software update that fixes one of the identified vulnerabilities and provides mitigations for the other vulnerability. Philips plans to release an additional software update in 2017 to address the remaining vulnerability.AFFECTED PRODUCTS----------------- The following versions of the IntelliVue MX40 Patient Worn Monitor are affected:* IntelliVue MX40 Patient Worn Monitor (WLAN only), all versions prior to Version B.06\\.18 Vulnerabilities only affect MX40 WLAN monitors operating on a user\\-provided 802\\.11 wireless LAN. MX40 monitors with 1\\.4 GHz and 2\\.4 GHz Smart\\-Hopping radios are not affected.IMPACT------ Successful exploitation of these vulnerabilities may allow an attacker to issue 802\\.11 Wi\\-Fi management commands that can impact reporting availability of MX40 device local monitoring to a central monitoring station. If a patient experiences an alarm event and clinical staff expects the MX40 to provide local alarming (local audio\\-on, local screen\\-on) when it is not available from the local device, a delay of treatment can occur. Impact to individual organizations depends on many factors that are unique to each organization. ICS\\-CERT recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment and specific clinical usage.BACKGROUND---------- Philips is a global company that maintains offices in several countries around the world, including countries in Africa, Asia, Europe, Latin America, the Middle East, and North America. The MX40 patient worn monitor is intended to be used primarily as a traditional telemetry medical device as part of a monitoring and alerting system. As such, the MX40 (WLAN) connects to a central monitoring station by way of a wireless network to operate in compliance with required behaviors that ensure the central station maintains device status, and the local MX40 device continues to operate in local monitoring and alarming mode in the event of a Wi\\-Fi network access anomaly. When the MX40 is connected to a central monitoring station, the central monitor provides the primary patient monitoring and alarming function, and the local MX40 device operates in telemetry mode (local audio off, local screen off). The MX40 is designed to:* Operate in telemetry mode (local audio\\-off, local screen\\-off) to communicate status and alerts to hospital staff at the central monitoring station.* Switch from telemetry mode into local monitoring mode (local audio\\-on, local screen\\-on) if certain Wi\\-Fi network management conditions or commands are encountered to de\\-authenticate MX40 from the Wi\\-Fi until either Wi\\-Fi network conditions resume to enable MX40 to reconnect and re\\-associate to central monitoring, or until hospital staff intervene to reset and reconnect the device.* “Blacklist” the Wi\\-Fi access point in response to certain conditions as a security defense from further use until the device is reset by hospital staff. According to Philips, the MX40 is deployed across the Healthcare and Public Health sector. Philips estimates these products are used primarily in the United States with users also in Canada, Europe, Australia, Africa, Latin America, Asia, and the Middle East.VULNERABILITY CHARACTERIZATION------------------------------### VULNERABILITY OVERVIEW### IMPROPER CLEANUP ON THROWN EXCEPTIONCWE\\-460: Improper Cleanup on Thrown Exception, http://cwe.mitre.org/data/definitions/460\\.html, web site last accessed September 12, 2017\\. Under specific 802\\.11 network conditions, a partial re\\-association of the MX40 WLAN monitor to the central monitoring station is possible. In this state, the central monitoring station can indicate the MX40 is not connected or associated to the central monitor, and thus should be operating in local monitoring mode (local audio\\-on, screen\\-on), but the MX40 WLAN itself can instead still be operating in telemetry mode (local audio\\-off, screen\\-off). If a patient experiences an alarm event and clinical staff expects the MX40 to provide local alarming when it is not available from the local device, a delay of treatment can occur. CVE\\-2017\\-9657NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2017\\-9657, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6\\.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3\\.0\\#CVSS:3\\.0/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H, web site last accessed September 12, 2017\\.### IMPROPER HANDLING OF EXCEPTIONAL CONDITIONSCWE\\-755: Improper Handling of Exceptional Conditions, http://cwe.mitre.org/data/definitions/755\\.html, web site last accessed September 12, 2017\\. Certain 802\\.11 network management messages have been determined to invoke wireless access point blacklisting security defenses when not required, which can necessitate intervention by hospital staff to reset the device and reestablish a network connection to the Wi\\-Fi access point. During this state, the MX40 can either connect to an alternative access point within signal range for association to a central monitoring station, or it can remain in local monitoring mode until the device is reset by hospital staff. CVE\\-2017\\-9658NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId\\=CVE\\-2017\\-9658, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 6\\.5 has been assigned; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).CVSS Calculator, https://www.first.org/cvss/calculator/3\\.0\\#CVSS:3\\.0/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H, web site last accessed September 12, 2017\\.### VULNERABILITY DETAILS#### EXPLOITABILITY These vulnerabilities could be exploited via an adjacent network.#### EXISTENCE OF EXPLOIT No known public exploits specifically target these vulnerabilities.#### DIFFICULTY An attacker with a low skill would be able to exploit these vulnerabilities.MITIGATION---------- Philips has released software update, Version B.06\\.18, to fix the improper cleanup on thrown exception vulnerability, and implement mitigations to reduce the risk associated with the improper handling of exceptional conditions vulnerability. The software update implements messaging and alarming on the MX40 and at the central monitoring station, when the MX40 disconnects from the access point. For additional information about the vulnerabilities or the proposed mitigations, please contact Philips. Philips’ contact information is available at the following location:[http://www.usa.philips.com/healthcare/solutions/customer\\-service\\-solutions](http://www.usa.philips.com/healthcare/solutions/customer-service-solutions)  Philips is planning to release an additional MX40 software update in 2017 to address the improper handling of exceptional conditions vulnerability. Please see the Philips product security web site for latest information for this and other Philips products:[https://www.usa.philips.com/healthcare/about/customer\\-support/product\\-security](https://www.usa.philips.com/healthcare/about/customer-support/product-security)  ICS\\-CERT recommends that users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:* Minimize network exposure for all medical devices and/or systems, and ensure that they are not accessible from the Internet.* Locate all medical devices and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. ICS\\-CERT also provides a section for security recommended practices on the ICS\\-CERT web page at [http://ics\\-cert.us\\-cert.gov/content/recommended\\-practices](/ics/content/recommended-practices)  . ICS\\-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. Additional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  , that is available for download from the ICS\\-CERT web site ( [http://ics\\-cert.us\\-cert.gov/](/ics/)  ). Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS\\-CERT for tracking and correlation against other incidents. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Philips-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-medical-advisories/icsma-17-255-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-200\\-01### [Philips Vue PACS](/news-events/ics-medical-advisories/icsma-24-200-01) Jun 11, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-163\\-01### [MicroDicom DICOM Viewer](/news-events/ics-medical-advisories/icsma-24-163-01) May 30, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-151\\-02### [Baxter Welch Allyn Connex Spot Monitor](/news-events/ics-medical-advisories/icsma-24-151-02) May 30, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-151\\-01### [Baxter Welch Allyn Configuration Tool](/news-events/ics-medical-advisories/icsma-24-151-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2017-9657",
    "CVE-2017-9658"
  ],
  "techniques": [],
  "advisory": "icsma-17-255-01",
  "title": "Philips' IntelliView MX40 Patient Worn Monitor (WLAN) Vulnerabilities | CISA",
  "source": "ics-medical-advisories",
  "id": "166699ff5ac67bf75fcbbcd4d2cd1fc758fa6680cd99ec584a8177ec82bab5f6"
}