{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.7\nATTENTION: Low attack complexity\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Synapsys\nVulnerability: Insufficient Session Expiration\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access, modify, or delete sensitive information. This includes electronic protected health information (ePHI), protected health information (PHI), and personally identifiable information (PII).\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of BD Synapsys, a microbiology informatics software platform, are affected:\n\nBD Synapsys: Versions 4.20, 4.20 SR1 and 4.30\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENT SESSION EXPIRATION CWE-613\nThe affected product is vulnerable due to an insufficient session expiration. An unauthorized physical breach of a BD Synapsys workstation would be negligible due to the sequence of events that must occur in a specific order, however successful exploitation could lead to modification of ePHI, PHI, or PII. The result could cause delayed or incorrect treatment.\nCVE-2022-30277 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBD voluntarily reported this vulnerability through the CISA coordinated vulnerability disclosure program.\n4. MITIGATIONS\nBD Synapsys v4.20 SR2 will be released in June 2022 and will remediate this vulnerability. Users receiving BD Synapsys v4.30 will be allowed to upgrade to v5.10, which is expected to be available by August 2022.\nAdditionally, BD recommends the following compensating controls for users working with the impacted versions of BD Synapsys:\n\nConfigure the inactivity session timeout in the operating system to match the session expiration timeout in BD Synapsys.\nEnsure physical access controls are in place and only authorized end-users have access to BD Synapsys workstations.\nPlace a reminder at each computer for users to save all work, logout, or lock their workstation when leaving the BD Synapsys workstation.\nEnsure industry standard network security policies and procedures are followed.\n\nFor more information on this issue, please see the associated BD product security bulletin on the BD website.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov/ics in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nThis vulnerability is not exploitable remotely. No known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-30277"
  ],
  "techniques": [],
  "advisory": "icsma-22-151-02",
  "title": "BD Synapsys | CISA",
  "source": "ics-medical-advisories",
  "id": "de8814c7a30283caccb5240acdbef9d83e12cb1411a7706a3291e86fa90cd1ef"
}