{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 10.0\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Natus Medical, Inc. (Natus)\nEquipment: Natus Xltek NeuroWorks software\nVulnerabilities: Stack-Based Buffer Overflow, Out-of-Bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities require access to the Natus customer network, and could crash the device being accessed; a buffer overflow condition may allow remote code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following version of Natus Xltek NeuroWorks, used in Natus Xltek EEG medical products, are affected:\n\nNatus Xltek NeuroWorks Version 8\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    OUT-OF-BOUNDS READ CWE-125\nA specially-crafted packet may be able to cause an out-of-bounds read, which may result in a denial-of-service condition.\nCVE-2017-2852 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    STACK-BASED BUFFER OVERFLOW CWE-121\nAn attacker may cause a buffer overflow by sending a specially-crafted packet to the affected product while the product attempts to open a file requested by the client.\nCVE-2017-2853 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.3    OUT-OF-BOUNDS READ CWE-125\nA specially-crafted packet may cause an out-of-bounds read, which may result in a denial-of-service condition.\nCVE-2017-2858 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.4    OUT-OF-BOUNDS READ CWE-125\nA specially-crafted packet may cause an out-of-bounds read, which may result in a denial-of-service condition.\nCVE-2017-2860 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.5    OUT-OF-BOUNDS READ CWE-125\nA specially-crafted packet may cause an out-of-bounds read, which may result in a denial-of-service condition.\nCVE-2017-2861 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.6    STACK-BASED BUFFER OVERFLOW CWE-121\nA specially-crafted packet received during the execution of certain commands can cause memory to be overwritten in a way that could allow an attacker to take control of the program.\nCVE-2017-2867 has been assigned to this vulnerability. A CVSS v3 base score of 9.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.7    STACK-BASED BUFFER OVERFLOW CWE-121\nAn error in the way the program parses data structures may allow an attacker to take control of the system by sending it a specially-crafted packet.\nCVE-2017-2868 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.2.8    STACK-BASED BUFFER OVERFLOW CWE-121\nA specially-crafted packet takes advantage of the way the program parses data structures and may cause a buffer overflow, which may allow remote execution of arbitrary code.\nCVE-2017-2869 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Pleasanton, California\n\n3.4 RESEARCHER\nCory Duplantis from Cisco Talos discovered these vulnerabilities and reported them to Natus.\n4. MITIGATIONS\nNatus has released NeuroWorks/SleepWorks 8.5 GMA 3, a software update with security enhancements to address the vulnerabilities identified in NeuroWorks/SleepWorks 8.\nA free software update to NeuroWorks/SleepWorks 8.5 GMA 3 is available to users using NeuroWorks/SleepWorks Version 8.0, 8.1, 8.4, or 8.5. Contact the Natus Neuro Technical support department at 1-800 387-7516 or email Oakville_Technical_Service@natus.com for more details.\nNatus recommends installing this update as quickly as possible on affected systems.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2017-2860",
    "CVE-2017-2853",
    "CVE-2017-2868",
    "CVE-2017-2858",
    "CVE-2017-2869",
    "CVE-2017-2867",
    "CVE-2017-2861",
    "CVE-2017-2852"
  ],
  "techniques": [],
  "advisory": "icsma-18-165-01",
  "title": "Natus Xltek NeuroWorks | CISA",
  "source": "ics-medical-advisories",
  "id": "e4896769557897f54dbaada29b71f50db4becc28fd18d0bc301b8ddff4a0aae8"
}