{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nVendor: Medtronic\nEquipment: MiniMed 508 and Paradigm Series Insulin Pumps\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker with adjacent access to one of the affected products to intercept, modify, or interfere with the wireless RF (radio frequency) communications to or from the product. This may allow attackers to read sensitive data, change pump settings, or control insulin delivery.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Medtronic MiniMed Insulin Pumps are affected:\n\nMiniMed 508 pump – All versions\nMiniMed Paradigm 511 pump – All versions\nMiniMed Paradigm 512/712 pumps – All versions\nMiniMed Paradigm 712E pump – All versions\nMiniMed Paradigm 515/715 pumps – All versions\nMiniMed Paradigm 522/722 pumps – All versions\nMiniMed Paradigm 522K/722K pumps – All versions\nMiniMed Paradigm 523/723 pumps – Software versions 2.4A or lower\nMiniMed Paradigm 523K/723K pumps – Software versions 2.4A or lower\nMiniMed Paradigm Veo 554/754 pumps – Software versions 2.6A or lower\nMiniMed Paradigm Veo 554CM and 754CM models only – Software versions 2.7A or lower\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected insulin pumps are designed to communicate using a wireless RF with other devices, such as blood glucose meters, glucose sensor transmitters, and CareLink USB devices. This wireless RF communication protocol does not properly implement authentication or authorization. An attacker with adjacent access to one of the affected insulin pump models can inject, replay, modify, and/or intercept data. This vulnerability could also allow attackers to change pump settings and control insulin delivery.\nCVE-2019-10964 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nBased on earlier work performed by external researchers including Nathanael Paul, Jay Radcliffe, and Barnaby Jack, and from recent work performed by external researchers Billy Rios, Jonathan Butts, and Jesse Young, Medtronic performed additional variant analysis and reported this vulnerability to NCCIC.\n4. MITIGATIONS\nMedtronic recommends U.S. patients who are currently using the affected products talk to their healthcare provider about changing to a newer model insulin pump with increased cybersecurity protection. Patients outside the U.S. will receive a notification letter with instructions based on the country where they live.\nMedtronic recommends all patients take the cybersecurity precautions indicated below.\nCYBERSECURITY PRECAUTIONS RECOMMENDED FOR ALL PATIENTS:\n\nMaintain tight physical control of the pump and devices connected to the pump\nDo not share pump serial number\nBe attentive to pump notifications, alarms, and alerts\nImmediately cancel any unintended boluses (a single dose of insulin administered all at once)\nDo not connect to any third-party devices or use any software not authorized by Medtronic\nDisconnect CareLink USB devices from computers when not being used to download data from the pump\nMonitor blood glucose levels closely and act as appropriate\nGet medical help immediately when experiencing symptoms of severe hypoglycemia or diabetic ketoacidosis, or suspect an insulin pump settings, or insulin delivery have changed unexpectedly\n\nMedtronic has released additional patient-focused information, at the following location:\nhttps://www.medtronic.com/security\nAdditionally, Medtronic will be sending a letter to all patients who are current known users of these pumps further detailing the risks and defensive measures.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRestrict system access and access to devices able to connect to the affected device to authorized personnel only and follow a least privilege approach.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA at the following location:\n\nhttps://www.fda.gov/MedicalDevices/DigitalHealth/ucm373213.htm\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-10964"
  ],
  "techniques": [],
  "advisory": "icsma-19-178-01",
  "title": "Medtronic MiniMed 508 and Paradigm Series Insulin Pumps | CISA",
  "source": "ics-medical-advisories",
  "id": "6407da41998293dfadebb696b29986702464fb7d522277d2168c54a9f046cca1"
}