{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.5\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Baxter\nEquipment: Phoenix Hemodialysis Delivery System\nVulnerability: Cleartext Transmission of Sensitive Information\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-20-170-03 Baxter Phoenix Hemodialysis Delivery System that was published June 18, 2020, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker with unauthorized network access to view sensitive data.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of the Phoenix Hemodialysis Delivery System are affected:\n\nPhoenix Hemodialysis Delivery System SW 3.36 and 3.40\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE DATA CWE-319\nThe Phoenix Hemodialysis device does not support data-in-transit encryption (e.g., TLS/SSL) when transmitting treatment and prescription data on the network between the Phoenix system and the Exalis dialysis data management tool. An attacker with access to the network could observe sensitive treatment and prescription data sent between the Phoenix system and the Exalis tool.\nCVE-2020-12048 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nBaxter reported this vulnerability to CISA.\n5. MITIGATIONS\nBaxter recommends users apply the following implementation guidance:\n\nEnsure medical device implementations and configurations employ cybersecurity defense-in-depth strategies such as:\nEnsure proper network segmentation as outlined in the operating manual. Ensure Phoenix machines and Exalis Server PCs reside on a dedicated subnetwork (the machines and the Exalis servers must be the ONLY devices present within it).\nIn case of remote connection (WAN), keep the subnetwork dedicated by using a VPN network connection.\nFirewall each network segment, limiting inbound and outbound connections.\nScan for unauthorized network access.\nScan for vulnerabilities and viruses.\n\nUsers should also identify, analyze, evaluate, and control all risks associated with integration of medical devices in an enterprise network. Subsequent changes to the enterprise network could introduce new risks and require new analysis.\n--------- Begin Update A Part 1 of 1 ---------\nFor additional information please see the Baxter Product Security Bulletin.\n--------- End Update A Part 1 of 1 ---------\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-12048"
  ],
  "techniques": [],
  "advisory": "icsma-20-170-03",
  "title": "Baxter Phoenix Hemodialysis Delivery System (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "c072126c42389df16965ee159ab762ce646f2a3cb66e793c300a840d8b69a886"
}