{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Innokas Yhtymä Oy\nEquipment: Vital Signs Monitor VC150\nVulnerabilities: Cross-site Scripting, Improper Neutralization of Special Elements in Output Used by a Downstream Component\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to modify communications between downstream devices or cause some features of the affected devices to become disabled.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Innokas Yhtymä Oy Vital Signs Monitors are affected:\n\nVC150 prior to Version 1.7.15\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nA stored cross-site scripting (XSS) vulnerability exists in the affected products that allow an attacker to inject arbitrary web script or HTML via the filename parameter to multiple update endpoints of the administrative web interface.\nCVE-2020-27262 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:N).\n3.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS IN OUTPUT USED BY A DOWNSTREAM COMPONENT CWE-74\nHL7 v2.x injection vulnerabilities exist in the affected products that allow physically proximate attackers with a connected barcode reader to inject HL7 v2.x segments into specific HL7 v2.x messages via multiple expected parameters.\nCVE-2020-27260 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:C/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Finland\n\n3.4 RESEARCHER\nJulian Suleder, Nils Emmerich, and Birk Kauer of ERNW Research GmbH; and Dr. Oliver Matula of ERNW Enno Rey Netzwerke GmbH reported these vulnerabilities to the Federal Office for Information Security (BSI), Germany, in the context of the BSI project ManiMed (Manipulation of medical devices).\n4. MITIGATIONS\nInnokas Yhtymä Oy recommends users update to the latest Version 1.7.15b or later. Software Version 1.7.15b mitigates reported vulnerabilities. Additionally, the following mitigations are available:\n\nWhere possible, utilize hospital network best practices such as network segmentation utilizing VLANs, and device isolation to enhance existing security measures.\nEnsure there are physical protections in place to prevent the devices from any unauthorized access.\nEncourage security awareness throughout the hospital staff to ensure clinical staff will report any unauthorized person trying to login or otherwise tamper with a medical device.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-27260",
    "CVE-2020-27262"
  ],
  "techniques": [],
  "advisory": "icsma-21-007-01",
  "title": "Innokas Yhtymä Oy Vital Signs Monitor | CISA",
  "source": "ics-medical-advisories",
  "id": "d4bb838076afff25a2f2dee41cb061d3ee38194b9072f8ce65472518191bed37"
}