{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.4\nVendor: Philips\nEquipment: IntelliVue M3002A X2 MMS Transport Monitor/Module and IntelliVue MP monitors (MP2/X2, MP5, MP20-MP90, MX600, MX700 and MX800)\nVulnerabilities: Use of Hard-coded Password, Download of Code Without Integrity Check\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may cause corruption of the IntelliVue WLAN firmware and impact to the data flow over the WLAN Version A and WLAN Version B wireless modules. This would lead to an inoperative condition alert at the device and Central Station.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Philips IntelliVue WLAN, portable patient monitors, are affected:\n\nIntelliVue MP monitors MP20-MP90 (M8001A/2A/3A/4A/5A/7A/8A/10A)\n\nWLAN Version A, Firmware A.03.09\n\n\nIntelliVue MP monitors MP5/5SC (M8105A/5AS)\n\nWLAN Version A, Firmware A.03.09, Part #: M8096-67501\n\n\nIntelliVue MP monitors MP2/X2 (M8102A/M3002A)\n\nWLAN Version B, Firmware A.01.09, Part #: N/A (Replaced by Version C)\n\n\nIntelliVue MP monitors MX800/700/600 ((865240/41/42)\n\nWLAN Version B, Firmware A.01.09, Part #: N/A (Replaced by Version C)\n\n\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED PASSWORD CWE-259\nAn attacker can use these credentials to login via ftp and upload a malicious firmware.\nCVE-2019-13530 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    DOWNLOAD OF CODE WITHOUT INTEGRITY CHECK CWE-494\nThe product downloads source code or an executable from a remote location and executes the code without sufficiently verifying the origin and integrity of the code.\nCVE-2019-13534 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nShawn Loveric of Finite State, Inc., reported these vulnerabilities to Philips.\n4. MITIGATIONS\nWLAN Version B is obsolete. Philips recommends users update to the WLAN assembly Version C wireless module in affected IntelliVue monitors.\nWLAN Version C with current firmware of B.00.31 is not vulnerable to the described attack.\nWLAN Version A is a software patch from Philips estimated to be available in Incenter by the end of 2019.\nWireless network access should be controlled by authentication and authorization (e.g., WPA2), which are supported by Philips.\nAs an additional mitigation measure, Philips recommends implementing a firewall rule on the user’s wireless network to restrict access control via FTP. Users should implement role-based access controls to control physical access to the system. Refer to the Security for Clinical Networks Guide and the IntelliVue Network Configuration Guide for additional security recommendations.\nPlease see the Philips product security website for the latest security information for Philips products:\nhttps://www.philips.com/productsecurity\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\n\nWhere additional information is needed, follow this link to existing cybersecurity in medical device guidance issued by the FDA.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-13534",
    "CVE-2019-13530"
  ],
  "techniques": [],
  "advisory": "icsma-19-255-01",
  "title": "Philips IntelliVue WLAN | CISA",
  "source": "ics-medical-advisories",
  "id": "5cff500080bc64576f465211f5c6062630a0d549df07d7ff0ae0cd03c9c8b64c"
}