{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.8\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: Clinical Collaboration Platform\nVulnerabilities: Cross-site Request Forgery, Improper Neutralization of Script in Attributes in a Web Page, Protection Mechanism Failure, Algorithm Downgrade, Configuration\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to trick a user into executing unauthorized actions or provide the attacker with identifying information that could be used for subsequent attacks.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Clinical Collaboration Platform, an HMI data management platform, are affected:\n\nClinical Collaboration Platform Versions 12.2.1 and prior\n\nNOTE: The product is registered as Vue PACS but was re-branded to Philips Clinical Collaboration Platform when Philips acquired Carestream HCIS.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CROSS-SITE REQUEST FORGERY (CSRF) CWE-352\nThe product receives input or data, but it does not validate or incorrectly validates that the input has the properties required to process the data safely and correctly.\nCVE-2020-14506 has been assigned to this vulnerability. A CVSS v3 base score of 3.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:L/A:N).\n3.2.2    IMPROPER NEUTRALIZATION OF SCRIPT IN ATTRIBUTES IN A WEB PAGE CWE-83\nThe software does not neutralize or incorrectly neutralizes user-controllable input before it is placed in output used as a webpage that is served to other users.\nCVE-2020-14525 has been assigned to this vulnerability. A CVSS v3 base score of 3.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.2.3    PROTECTION MECHANISM FAILURE CWE-693\nWhen an attacker claims to have a given identity, the software does not prove or insufficiently proves the claim is correct.\nCVE-2020-16198 has been assigned to this vulnerability. A CVSS v3 base score of 5.0 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.2.4    SELECTION OF LESS-SECURE ALGORITHM DURING NEGOTIATION ('ALGORITHM DOWNGRADE') CWE-757\nThe software does not properly control the allocation and maintenance of a limited resource, thereby enabling an attacker to influence the amount of resources consumed, eventually leading to the exhaustion of available resources.\nCVE-2020-16200 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.5    CONFIGURATION CWE-16\nThe product exposes a resource to the wrong control sphere, providing unintended actors with inappropriate access to the resource.\nCVE-2020-16247 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nNorthridge Hospital Medical Center reported these vulnerabilities to Philips.\n4. MITIGATIONS\nPhilips released the Clinical Collaboration Platform patch 12.2.1.5 in June 2020 for web portals to remediate CWE-352 and CWE-83.\nPhilips Clinical Collaboration Platform Version 12.2.5 was released in May 2020 to remediate CWE-16, CWE-352, CWE-83, and CWE-693. Philips requires manual intervention to remediate CWE-757.\nUsers with questions regarding their specific Philips Clinical Collaboration Platform installations and new release eligibility should contact Philips service support, or regional service support, or call 1-877-328-2808, option 4.\nThe Philips advisory and the latest security information for Philips products are available at the Philips product security website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nImplement physical security measures to limit or control access to critical systems.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\n\t \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-16200",
    "CVE-2020-14506",
    "CVE-2020-16198",
    "CVE-2020-14525",
    "CVE-2020-16247"
  ],
  "techniques": [],
  "advisory": "icsma-20-261-01",
  "title": "Philips Clinical Collaboration Platform | CISA",
  "source": "ics-medical-advisories",
  "id": "a640dd02f257b6ae33de78028e1156c71d8c56e53add40e0a18bbe66ec789714"
}