{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.8\n\nATTENTION: Low skill level to exploit\nVendor: Becton, Dickinson and Company (BD)\nEquipment: FACSLyric\nVulnerability: Improper Access Control\n\n2. UPDATE INFORMATION\nThis updated medical device advisory is a follow-up to the original advisory titled ICSMA-19-029-02 BD FACSLyric that was published January 29, 2019, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to gain unauthorized access to administrative level privileges on a workstation, which could allow arbitrary execution of commands. This vulnerability does not impact BD FACSLyric flow cytometry systems using the Windows 7 Operating System.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of the FACSLyric flow cytometry solution are affected:\n\nBD FACSLyric Research Use Only, Windows 10 Professional Operating System, U.S. and Malaysian Releases, between November 2017 and November 2018, and\nBD FACSLyric IVD Windows 10 Professional Operating System U.S. release.\n\n--------- Begin Update A Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe system does not properly enforce user access control to a privileged account, which may allow for unauthorized access to administrative level functions.\nCVE-2019-6517 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n--------- End Update A Part 1of 1 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nBD reported this vulnerability to NCCIC.\n5. MITIGATIONS\nBD will follow-up directly with all affected users to perform remediation activities. BD will disable the administrative account for users with BD FACSLyric RUO Cell Analyzer units having the Windows 10 Pro Operating System. BD has contacted and will replace the computer workstations for affected users with the BD FACSLyric IVD Cell Analyzer units with the Windows 10 Pro Operating System.\nFor additional information regarding the reported vulnerability please contact BD for the following support:\nFor technical support, please contact the BD Biosciences General Tech Support - Flow Cytometry via email researchapplications@bd.com or phone 877-232-8995 Option 2 and then Option 2 again.\nFor more information on BD’s product security and vulnerability management, contact BD’s Product Security Office:\nhttps://www.bd.com/productsecurity     \nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all medical devices and/or systems.\nLocate medical devices behind firewalls, and isolate them where possible.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2019-6517"
  ],
  "techniques": [],
  "advisory": "icsma-19-029-02",
  "title": "BD FACSLyric (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "d0feebbdae418dec5ab5c20c7d12eb2de91d9fc91457f805079473a84d6a7890"
}