{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 3.5\n\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: Philips HealthSuite Health Android App\nVulnerability: Inadequate Encryption Strength\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker with physical access to impact confidentiality and integrity of the product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPhilips reports the vulnerability affects all versions of the Philips HealthSuite Health Android App.\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INADEQUATE ENCRYPTION STRENGTH CWE-326\nThe software uses simple encryption that is not strong enough for the level of protection required. \nCVE-2018-19001 has been assigned to this vulnerability. A CVSS v3 base score of 3.5 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: United States, Netherlands, Germany, United Kingdom\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nA security researcher reported this vulnerability to Philips.\n4. MITIGATIONS\nA new release to mediate this vulnerability with be available during Quarter 1 of 2019.\nAs an interim mitigation to this vulnerability, Philips recommends the following:\nPhilips advises against jail-breaking or rooting mobile devices. A jail-broken or rooted device means one that is modified outside the mobile device or operating system vendor supported or warranted configurations. Such devices have been freed from the limitations imposed by the mobile service provider and the phone manufacturer. This may affect the performance of the app, weaken the security of the device, and expose users to additional risks.\nPlease see the Philips product security website for the latest security information for Philips products:\nhttps://www.philips.com/productsecurity\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-19001"
  ],
  "techniques": [],
  "advisory": "icsma-18-340-01",
  "title": "Philips HealthSuite Health Android App | CISA",
  "source": "ics-medical-advisories",
  "id": "b6e0d3179b6a07f26627038b60e68d8c60ae5488335bc2df3081e9505b146f72"
}