{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 4.9\n\nVendor: Medtronic\nEquipment: MyCareLink Patient Monitor\nVulnerabilities: Insufficient Verification of Data Authenticity, Storing Passwords in a Recoverable Format\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker with physical access to obtain per-product credentials that are utilized to authenticate data uploads and encrypt data at rest. Additionally, an attacker with access to a set of these credentials and additional identifiers can upload invalid data to the Medtronic CareLink network.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Medtronic MyCareLink 24950 Patient Monitor, are affected:\n\n24950 MyCareLink Monitor, all versions,\n24952 MyCareLink Monitor, all versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nThe affected product’s update service does not sufficiently verify the authenticity of the data uploaded. An attacker who obtains per-product credentials from the monitor and paired implantable cardiac device information can potentially upload invalid data to the Medtronic CareLink network.\nCVE-2018-10626 has been assigned to this vulnerability. A CVSS v3 base score of 4.4 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:N/S:C/C:L/I:L/A:N).\n3.2.2    STORING PASSWORDS IN A RECOVERABLE FORMAT CWE-257\nThe affected products use per-product credentials that are stored in a recoverable format. An attacker can use these credentials for network authentication and encryption of local data at rest.\nCVE-2018-10622 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nBilly Rios, Jesse Young, and Jonathan Butts of Whitescope LLC reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nMedtronic has made server-side updates to address the insufficient verification vulnerability identified in this advisory. Medtronic is implementing additional server-side mitigations to enhance data integrity and authenticity.\nMedtronic recommends users take additional defensive measures to minimize the risk of exploitation. Specifically, users should:\n\nMaintain good physical control over the home monitor.\nOnly use home monitors obtained directly from their healthcare provider or a Medtronic representative to ensure integrity of the system.\n\nMedtronic has released additional patient focused information, at the following location:\nhttps://www.medtronic.com/security\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nDo not upload and run files without verifying the integrity of the file.\nInteract with, and only obtain files, software, and software patches from trustworthy reputable sources.\nMinimize network exposure for all medical devices and/or systems, and ensure that they are not accessible from the Internet.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-10622",
    "CVE-2018-10626"
  ],
  "techniques": [],
  "advisory": "icsma-18-219-01",
  "title": "Medtronic MyCareLink 24950 Patient Monitor | CISA",
  "source": "ics-medical-advisories",
  "id": "1269d7bd3966ba385308948350dcca0ef2044b3fedc106c144d8f1678d86cbf9"
}