{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nVendor: Philips\nEquipment: Veradius Unity, Pulsera, and Endura Dual WAN Router\nVulnerability: Inadequate Encryption Strength\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could compromise the management interface of the front end router impacting the availability of data transfer via wireless communication.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPhilips reports the following Veradius Unity, Pulsera, and Endura Dual WAN Routers are affected:\n\nVeradius Unity (718132) with wireless option (shipped between 2016-August 2018)\nVeradius Unity (718132) with ViewForum option (shipped between 2016-August 2018)\nPulsera (718095) and Endura (718075) with wireless option (shipped between 26-June-2017 through 07-August 2018)\nPulsera (718095) and Endura (718075) with ViewForum option (shipped between 26-June-2017 through 07-August 2018)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INADEQUATE ENCRYPTION STRENGTH CWE-326\nThe router software uses an encryption scheme that is not strong enough for the level of protection required.\nCVE-2019-18263 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nDaniel Yagudayev from New York Presbyterian Hospital reported this vulnerability to Philips.\n4. MITIGATIONS\nPhilips has a solution available for users who have the wireless or ViewForum option in their product to update the configuration of the Dual WAN router.\nPhilips contact information is available at the following link: Philips Customer Service.\nPlease see the Philips product security website for the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-18263"
  ],
  "techniques": [],
  "advisory": "icsma-19-353-01",
  "title": "Philips Veradius Unity, Pulsera, and Endura Dual WAN Routers | CISA",
  "source": "ics-medical-advisories",
  "id": "7a026e4f071d61d53ecc73b05f9e0ea9d3a6c1587ca23b0c84e7e20d5466ca4c"
}