{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Philips\nEquipment: DreamMapper\nVulnerability: Insertion of Sensitive Information into Log File\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker access to the log file information containing descriptive error messages.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of DreamMapper, a mobile app used to manage sleep apnea, are affected:\n\nDreamMapper Version 2.24 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INSERTION OF SENSITIVE INFORMATION INTO LOG FILE CWE-532\nInformation written to log files can give guidance to a potential attacker. \nCVE-2020-14518 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nLutz Weimann, Tim Hirschberg, Issam Hbib, and Florian Mommertz of SRC Security Research & Consulting GmbH reported this vulnerability to the Federal Office for Information Security (BSI), Germany, in the context of the BSI project eCare – Digitization in care reported this to Philips.\n4. MITIGATIONS\nPhilips plans a new release for the DreamMapper app by June 30, 2021, that remediates this vulnerability.\nUsers with questions regarding their specific Philips DreamMapper installations should contact a Philips service support team or regional service support.\nThe Philips advisory is available at the following URL: http://www.philips.com/productsecurity\nPlease see the Philips product security website for the latest security information for Philips products:\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nImplement physical security measures to limit or control access to critical systems.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2020-14518"
  ],
  "techniques": [],
  "advisory": "icsma-20-212-01",
  "title": "Philips DreamMapper | CISA",
  "source": "ics-medical-advisories",
  "id": "67134e6b17ecdba9c6187fe1bc098be56adddddeea19f65e8591d5db998bd87e"
}