{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.6\nVendor: Philips\nEquipment: Ultrasound ClearVue, Ultrasound CX, Ultrasound EPIQ/Affiniti, Ultrasound Sparq, Ultrasound Xperius\nVulnerability: Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow a non-authenticated attacker to view or modify information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Philips Ultrasound Systems, are affected:\n\nUltrasound ClearVue Versions 3.2 and prior\nUltrasound CX Versions 5.0.2 and prior\nUltrasound EPIQ/Affiniti Versions VM5.0 and prior\nUltrasound Sparq Version 3.0.2 and prior and\nUltrasound Xperius all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nAn attacker may use an alternate path or channel that does not require authentication of the alternate service login to view or modify information.\nCVE-2020-14477 has been assigned to this vulnerability. A CVSS v3 base score of 3.6 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nPhilips reported this vulnerability to CISA.\n4. MITIGATIONS\n \nPhilips released Ultrasound EPIQ/Affiniti Version VM6.0 in April 2020 and recommends users with the Ultrasound EPIQ/Affiniti systems to contact their local Philips service support team, or regional service support for installation information.\nPhilips is currently planning the following new releases:\n\nUltrasound ClearVue Version 3.3 release in Q4 2020\nUltrasound CX Version 5.0.3 release in Q4 2020\nUltrasound Sparq Version 3.0.3 release in Q4 2020\n\nAs an interim mitigation to this vulnerability, Philips recommends customers ensure service providers can guarantee installed device integrity during all service and repair operations.\nUsers with questions regarding their specific Ultrasound installation should contact the Philips service support team or regional service support.\nUsers can contact Philips customer service, and find more details in the Philips advisory (external link). Please see the Philips product security website for the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nImplement physical security measures to limit or control access to critical systems.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-14477"
  ],
  "techniques": [],
  "advisory": "icsma-20-177-01",
  "title": "Philips Ultrasound Systems | CISA",
  "source": "ics-medical-advisories",
  "id": "0255592a0293a52de6c4475ec2e2e57e338d1112de2159d331b84917359408b2"
}