{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: low attack complexity\nVendor: GE Healthcare\nEquipment: Ultrasound Products\nVulnerability: Protection Mechanism Failure, Incorrect User Management\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker with physical access to gain access to the operating system of affected devices.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nGE Healthcare reports that the following ultrasound products are affected:\n\nVivid products, not including EchoPAC: all versions\nLOGIQ, not including LOGIQ 100 Pro: all versions\nVoluson, not including ImageVault: all versions\nVersana Essential: all versions\nInvenia ABUS Scan station, not including VScan product line: all versions\nVenue, not including Venue 40 R1-3 and Venue 50 R4-5: all versions\n\n3.2 Vulnerability Overview\n3.2.1 Protection Mechanism Failure CWE-693\nA restricted desktop environment escape vulnerability exists in the Kiosk Mode functionality of affected devices. Specially crafted inputs can allow the user to escape the restricted environment, resulting in access to the underlying operating system.\nCVE-2020-6977 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2 Incorrect User Management CWE-286\nThese ultrasound products are vulnerable to elevation of privileges via misconfigured access control list.\nCVE-2024-1486 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nThese vulnerabilities were first reported to GE Healthcare by researchers Marc Ruef and Rocco Gagliardi of scip AG. Additional reports were provided to GE Healthcare by Michael Aguilar of Secureworks and Jonathan Bouman of Protozoan.nl and Andrea Palanca and Gabriele Quagliarella of Nozomi Networks.\n4. MITIGATIONS\nGE Healthcare recommends organizations restrict physical access to devices by unauthorized individuals. Additionally, where available, GE Healthcare recommends users enable the \"system lock\" password in the Administration GUI menu if possible. This will require a password to be entered before the system can be accessed. The ‘system lock' would limit non-authenticated users from accessing the application.\nGE Healthcare recommends that users with questions reach out to a GE Healthcare service representative and users with an active support account visit the GE Healthcare product security portal (login required).\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nEnsure there is physical protections in place to prevent the devices from any unauthorized access.\nEncourage security awareness throughout the hospital staff to ensure clinical staff will report any unauthorized person trying to login or otherwise tamper with a medical device.\nEducate employees on social engineering, both online and in-person/on-site. This is often used to gain confidence to unauthorized resources.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nFebruary 18, 2020: Initial Publication\nMay 16, 2024: Update A - Added CVE-2024-1486, updated CVSS score for CVE-2020-6977.\n\n",
  "cves": [
    "CVE-2024-1486",
    "CVE-2020-6977"
  ],
  "techniques": [],
  "advisory": "icsma-20-049-02",
  "title": "GE Healthcare Ultrasound Products (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "6f134763fc549cb733a1aa07121bf2e8f8032d8a3b4c7d5a9cf164920c0daa06"
}