{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.7\nATTENTION: Exploitable remotely\nVendor: Philips\nEquipment: Interoperability Solution XDS\nVulnerability: Clear Text Transmission of Sensitive Information\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to read the LDAP system credentials by gaining access to the network channel used for communication. This risk applies to configurations using LDAP via TLS and where the domain controller returns LDAP referrals.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Philips Interoperability Solution XDS document sharing system are affected:\n\nVersions 2.5 through 3.11\nVersions 2018-1 through 2021-1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CLEAR TEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe affected product is vulnerable to clear text transmission of sensitive information when configured to use LDAP via TLS and where the domain controller returns LDAP referrals, which may allow an attacker to remotely read LDAP system credentials.\nCVE-2021-32966 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been assigned; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nPhilips reported this vulnerability to CISA.\n4. MITIGATIONS\nPhilips has identified the following guidance and mitigations:\n\nAdministrators should disable LDAP referrals on their LDAP servers if LDAP via TLS is used.\nAdministrators should configure their LDAP servers to include a complete structure to search.\n\nUsers with questions regarding their specific installations of the Interoperability Solutions XDS components should contact Philips regional service support online or by phone at 1-800-722-9377.\nSee the Philips advisory for additional details regarding this vulnerability. In addition, users can visit the Philips product security website for the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-32966"
  ],
  "techniques": [],
  "advisory": "icsma-21-175-01",
  "title": "Philips Interoperability Solution XDS | CISA",
  "source": "ics-medical-advisories",
  "id": "c5b09f707b8b936a6d71572a98a0aace009acb273e1abbdfa9f000c81d059271"
}