{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.6\nATTENTION: Low attack complexity\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Totalys MultiProcessor\nVulnerability: Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access, modify, or delete sensitive information, including electronic protected health information (ePHI), protected health information (PHI), and personally identifiable information (PII).\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following BD products and versions are affected:\n\nBD Totalys MultiProcessor: All versions 1.70 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product uses hard-coded credentials, which could allow an attacker to access, modify, or delete sensitive information including ePHI, PHI, and PII. To exploit this vulnerability, a threat actor would need physical or network access to the system and would need to bypass any additional security controls.\nCVE-2022-40263 has been assigned to this vulnerability. A CVSS v3 base score of 6.6 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBD reported this vulnerability to CISA.\n4. MITIGATIONS\nAccording to BD, this vulnerability is scheduled to be remediated in the BD Totalys MultiProcessor version 1.71 software release expected in fourth quarter 2022.\nBD recommends the following compensating controls for users with versions of the BD Totalys MultiProcessor using hard-coded credentials:\n\nEnsure physical access controls are in place; only authorized end-users should have access to the BD Totalys MultiProcessor.\nIf the BD Totalys MultiProcessor must be connected to a network, ensure industry standard network security policies and procedures are followed.\n\nFor additional information, users should see BD’s security bulletin.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-40263"
  ],
  "techniques": [],
  "advisory": "icsma-22-277-01",
  "title": "BD Totalys MultiProcessor | CISA",
  "source": "ics-medical-advisories",
  "id": "6dc60d05d1e91666767e684c79148ab9f89e76c72c10d056fcf08541f00ad88d"
}