{
  "markdown": "\nOVERVIEW\nPhilips reported vulnerabilities in the Philips’ IntelliSpace Portal (ISP), an advanced visualization and image analysis system. Philips is creating a software update to mitigate these vulnerabilities in the affected products. Additionally, they are issuing mitigating controls for some vulnerabilities.\nSome vulnerabilities could be exploited remotely.\nExploits that target some vulnerabilities are publicly available.\nAFFECTED PRODUCTS\nPhilips reports that these vulnerabilities affect the following versions of the ISP:\n\nIntelliSpace Portal, all 8.0.x versions, and\nIntelliSpace Portal, all 7.0.x versions.\n\nIMPACT\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain unauthorized access to sensitive information, perform man-in-the-middle attacks, create denial of service conditions, or execute arbitrary code.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment and specific clinical usage.\nBACKGROUND\nPhilips is a global company that maintains offices in many countries around the world, including countries in Africa, Asia, Europe, Latin America, the Middle East, and North America.\nThe Philips ISP processes clinical images from different modalities and enables advanced visualization of the images. ISP systems are deployed across the Healthcare and Public Health sectors. Philips estimates these products are used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATION CWE-20\n\nThe ISP has multiple input validation vulnerabilities that could allow a remote attacker to execute arbitrary code or cause the application to crash.\nCVE-2018-5474, CVE-2017-0143, CVE-2017-0144, CVE-2017-0145, CVE-2017-0146, CVE-2017-0148, CVE-2017-0272, CVE-2017-0277, CVE-2017-0278, CVE-2017-0279, CVE-2017-0269, CVE-2017-0273, and CVE-2017-0280 have been assigned to these vulnerabilities. The CVSS v3 base scores for theses vulnerabilities range from 5.9 to 8.1\n\nINFORMATION EXPOSURE CWE-200\n\nThe ISP has multiple information exposure vulnerabilities that could allow an attacker to gain unauthorized access to sensitive information.\nCVE-2017-0147, CVE-2017-0267, CVE-2017-0268, CVE-2017-0270, CVE-2017-0271, CVE-2017-0274, CVE-2017-0275, and CVE-2017-0276, have been assigned to these vulnerabilities. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n\nPERMISSIONS, PRIVILEGES, AND ACCESS CONTROLS CWE-264\n\nThe ISP has multiple permission, privilege and access control vulnerabilities that could allow an attacker to gain unauthorized access and in some cases escalate their level of privilege or execute arbitrary code.\nCVE-2018-5472, CVE-2018-5468, CVE-2017-0199, and CVE-2005-1794 have been assigned to this vulnerability. The CVSS v3 base scores for theses vulnerabilities range from 6.4 to 7.8\n\nUNQUOTED SEARCH PATH OR ELEMENT CWE-428\n\nAn unquoted search path or element vulnerability has been identified, which may allow an authorized local user to execute arbitrary code and escalate their level of privileges.\nCVE-2018-5470, has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n\nLEFTOVER DEBUG CODE CWE-489\n\nThe ISP has a vulnerability where code debugging methods are enabled, which could allow an attacker to remotely execute arbitrary code during runtime.\nCVE-2018-5454 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n\nCRYPTOGRAPHIC ISSUES CWE-310\n\nThe ISP has multiple cryptographic vulnerabilities that could allow an attacker to gain unauthorized access to resources and information.\nCVE-2018-5458, CVE-2018-5462, CVE-2018-5464, CVE-2018-5466, CVE-2011-3389, CVE-2004-2761, CVE-2014-3566, and CVE-2016-2183 have been assigned to these vulnerabilities. The CVSS v3 base scores for theses vulnerabilities range from 3.1 to 6.5\nVULNERABILITY DETAILS\nEXPLOITABILITY\nSome vulnerabilities could be exploited remotely.\nEXISTENCE OF EXPLOIT\nPublic exploits exist for some of these vulnerabilities; however, none are known to specifically target Philips ISP.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit these vulnerabilities.\nMITIGATION\nPhilips will release an updated version of the ISP in the coming months that will address these vulnerabilities. Additionally, Philips’ evaluation of Operating System security patches is ongoing, and after appropriate testing , the patches and mitigating controls are posted on Philips’ InCenter. ISP users are recommended to obtain available mitigating controls by accessing their InCenter account at this location:\nhttp://incenter.medical.philips.com\nUsers with questions regarding their specific ISP installations are advised by Philips to contact their local Philips service support team or their regional service support.\nPhilips’ contact information is available at the following location:\nhttps://www.usa.philips.com/healthcare/solutions/customer-service-solutions\nPlease see the Philips product security website for the latest security information for Philips products:\nhttps://www.philips.com/productsecurity\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate all medical devices and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2017-0274",
    "CVE-2014-3566",
    "CVE-2017-0267",
    "CVE-2018-5468",
    "CVE-2017-0271",
    "CVE-2017-0279",
    "CVE-2017-0199",
    "CVE-2017-0280",
    "CVE-2004-2761",
    "CVE-2017-0146",
    "CVE-2017-0277",
    "CVE-2017-0275",
    "CVE-2018-5454",
    "CVE-2017-0143",
    "CVE-2017-0270",
    "CVE-2017-0269",
    "CVE-2016-2183",
    "CVE-2017-0272",
    "CVE-2017-0147",
    "CVE-2018-5472",
    "CVE-2018-5466",
    "CVE-2017-0273",
    "CVE-2017-0144",
    "CVE-2011-3389",
    "CVE-2005-1794",
    "CVE-2018-5458",
    "CVE-2018-5474",
    "CVE-2018-5464",
    "CVE-2017-0145",
    "CVE-2017-0276",
    "CVE-2017-0148",
    "CVE-2018-5462",
    "CVE-2018-5470",
    "CVE-2017-0278",
    "CVE-2017-0268"
  ],
  "techniques": [],
  "advisory": "icsma-18-058-02",
  "title": "Philips Intellispace Portal ISP Vulnerabilities | CISA",
  "source": "ics-medical-advisories",
  "id": "48deb613f8392828816929e0842d6dcae3b4fc3e881b968b26858b58073c0692"
}