{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Medtronic\nEquipment: Valleylab FT10, Valleylab FX8\nVulnerabilities: Use of Hard-coded Credentials, Reversible One-way Hash, Improper Input Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to overwrite files or remotely execute code, resulting in a remote, non-root shell on the affected products. By default, the network connections on these devices are disabled. Additionally, the Ethernet port is disabled upon reboot. However, it is known that network connectivity is often enabled.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Medtronic Valleylab products, are affected:\n\nValleylab Exchange Client, Version 3.4 and below\nValleylab FT10 Energy Platform (VLFT10GEN) software Version 4.0.0 and below\nValleylab FX8 Energy Platform (VLFX8GEN) software Version 1.1.0 and below\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected products use multiple sets of hard-coded credentials. If discovered, they can be used to read files on  the device.\nCVE-2019-13543 has been assigned to this vulnerability. A CVSS v3 base score of 5.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:N).\n3.2.2 REVERSIBLE ONE-WAY HASH CWE-328\nThe affected products use the descrypt algorithm for OS password hashing. While interactive, network-based logons are disabled, and attackers can use the other vulnerabilities within this report to obtain local shell access and access these hashes.\nCVE-2019-13539 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.2.3 IMPROPER INPUT VALIDATION CWE-20\nThe affected products use a vulnerable version of the rssh utility in order to facilitate file uploads. This could provide an attacker with administrative access to files or the ability to execute arbitrary code.\nCVE-2019-3464, and CVE-2019-3463 have been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nMedtronic reported these vulnerabilities to CISA.\n4. MITIGATIONS\nSoftware patches are currently available for the FT10 platform and will be available in early 2020 for the FX8 platform. Until these updates can be applied, Medtronic recommends to either disconnect affected products from IP networks or to segregate those networks, such that the devices are not accessible from an untrusted network (e.g., Internet). Patches can be downloaded at the following location:\nhttps://www.medtronic.com/covidien/en-us/support/software.html\nMedtronic has released additional patient focused information, at the following location:\nhttps://www.medtronic.com/security\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all medical devices and/or systems.\nLocate medical devices behind firewalls and isolate them where possible.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable any unnecessary accounts, protocols and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA at the following location: https://www.fda.gov/medical-devices/digital-health/cybersecurity\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-3464",
    "CVE-2019-3463",
    "CVE-2019-13543",
    "CVE-2019-13539"
  ],
  "techniques": [],
  "advisory": "icsma-19-311-02",
  "title": "Medtronic Valleylab FT10 and FX8 | CISA",
  "source": "ics-medical-advisories",
  "id": "45c8d5341b9b609ce920a3a909f18f51eac8b21e385b441fa646d6a28542aeab"
}