{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Pyxis\nVulnerability: Session Fixation\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-19-248-01 BD Pyxis that was published September 5, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow the Active Directory (AD) credentials of a previously authenticated user to gain access to the device. This could result in an attacker having the same level of privilege previously granted to a user prior to account expiration, and could allow access to patient data and medications. For exploitation to occur, products must be actively using AD for login and be connected to the hospital domain. Users who do not use AD are not impacted by this vulnerability.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of BD Pyxis, a medication management platform, are affected:\n--------- Begin Update A Part 1 of 2 ---------\n\nPyxis ES Versions 1.3.4 through to 1.5.3\nPyxis Enterprise Server, with Windows Server Versions 4.4 through 4.12\n\n--------- End Update A Part 1 of 2 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    SESSION FIXATION CWE-384\nA vulnerability has been identified where existing access privileges are not restricted in coordination with the expiration of access based on active directory user account changes when the device is joined to an AD domain.  \nCVE-2019-13517 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nBD reported this vulnerability to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 2 of 2 ---------\n\n\nBD notes that connecting medication dispensing cabinets to a hospital domain is an uncommon configuration and is not recommended. BD reports this vulnerability was remediated in the latest software release; however, BD has been unsuccessful in reproducing this issue since initially testing and reproducing it earlier in the year. BD recommends the following mitigations and compensating controls to reduce risk associated with this vulnerability:\n\nAlthough BD has not been able to reproduce the vulnerability with a fully patched Microsoft Active Directory controller installed with an outdated functional level of 2008/2008 R2, BD recommends users upgrade Microsoft Active Directory Services Domain Controllers to a functional level of 2012 or higher.\nPyxis ES systems are not recommended to be placed on the hospital domain.\nAs a best practice, users should not rely on expiration dates to remove users from hospital AD system.\nNo upgrades of the BD Pyxis ES suite of products are required to address this vulnerability.\n\n--------- End Update A Part 2 of 2 ---------\n\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all medical devices and/or systems.\nLocate medical devices behind firewalls and isolate them where possible.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable any unnecessary accounts, protocols and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA at the following location: https://www.fda.gov/medical-devices/digital-health/cybersecurity\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-13517"
  ],
  "techniques": [],
  "advisory": "icsma-19-248-01",
  "title": "BD Pyxis (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "41d9add87e4ee2d1e021d41cf8d3853ddf6d7f9f826c9a0779ecd2d9d02f119a"
}