{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\n\nVendor: Medtronic\n\n\n--------- Begin Update A Part 1 of 3 --------\n\nEquipment: Medtronic MiniMed MMT-500 and MMT-503 Remote Controllers\n\n--------- End Update A Part 1 of 3 --------\n\nVulnerabilities: Cleartext Transmission of Sensitive Information, Authentication Bypass by Capture-replay\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-18-219-02 Medtronic MiniMed MMT-500 and MMT-503 Remote Controllers that was published August 7, 2018, to the ICS webpage on us-cert.cisa.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to replay captured wireless communications and cause an insulin (bolus) delivery. This is only possible when non-default options are configured. Additionally, the pump will annunciate this by providing a physical alert, and the user has the capability to suspend the bolus delivery.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 2 of 3 --------\nThe following supported Medtronic products are affected:\nMMT-500 Remote Controller \n\nMMT-508 MiniMed pump\n\nMMT-503 Remote Controller \n\nMMT-511 pump Paradigm\nMMT-512 / MMT-712 Paradigm x12 \nMMT-515 / MMT-715 Paradigm x15  \nMMT-522 / MMT-722 Paradigm REAL-TIME\nMMT-522(K) / MMT-722(K) Paradigm REAL-TIME \nMMT-523 / MMT-723 Paradigm Revel \nMMT-523(K) / MMT-723(K) Paradigm\nMMT-554 / MMT-754 MiniMed Veo \nMMT-551 / MMT-751 MiniMed 530G\n\n--------- End Update A Part 2 of 3 --------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nCommunications between the pump and wireless accessories are transmitted in cleartext. A sufficiently skilled attacker could capture these transmissions and extract sensitive information, such as device serial numbers.\nCVE-2018-10634 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N).\n4.2.2    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nThe models identified above, when paired with a remote controller and having the “easy bolus” and “remote bolus” options enabled (non-default), are vulnerable to a capture-replay attack. An attacker can capture the wireless transmissions between the remote controller and the pump and replay them to cause an insulin (bolus) delivery.\nCVE-2018-14781 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n4.4 RESEARCHER\nBilly Rios, Jesse Young, and Jonathan Butts of Whitescope LLC reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 3 of 3 --------\nThe remote option is turned off in the pump by default.  \nMedtronic is directing all users to stop using their remote controllers, disable the remote option on their insulin pump, and to return the remote controllers to Medtronic. \nMedtronic has released additional patient focused information.\nAdditionally, Medtronic will be sending a letter to patients who may still be actively using the remotes in order to inform patients about these security risks, and request patients stop using the remote and return them to Medtronic. \n--------- End Update A Part 3 of 3 --------\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-14781",
    "CVE-2018-10634"
  ],
  "techniques": [],
  "advisory": "icsma-18-219-02",
  "title": "Medtronic MiniMed MMT-500/MMT-503 Remote Controllers (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "464e2fa3fde54ffdb02b27cad4d4b71f714c70ea6a190f15a5ae1c03c1ea6ceb"
}