{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low attack complexity\nVendor: Santesoft\nEquipment: Sante DICOM Viewer Pro\nVulnerability: Out-of-Bounds Read\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to disclose information and execute arbitrary code on affected installations of the product.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Santesoft products and versions are affected:\n\nSante DICOM Viewer Pro: Versions 14.0.3 and prior\n\n3.2 Vulnerability Overview\n3.2.1 OUT-OF-BOUNDS READ CWE-125\nIn Sante DICOM Viewer Pro versions 14.0.3 and prior, a user must open a malicious DICOM file, which could allow a local attacker to disclose information or execute arbitrary code.\nCVE-2024-1453 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Cyprus\n\n3.4 RESEARCHER\nMichael Heinzl reported this vulnerability to CISA.\n4. MITIGATIONS\nSantesoft released an updated version of their product and recommends updating Sante DICOM Viewer Pro to v14.0.4 or later.\nCISA recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely.\n5. UPDATE HISTORY\n\nFebruary 27, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2024-1453"
  ],
  "techniques": [],
  "advisory": "icsma-24-058-01",
  "title": "Santesoft Sante DICOM Viewer Pro | CISA",
  "source": "ics-medical-advisories",
  "id": "4864f457746558a089b971ddb700d31e29bd189e1e4021bf4b86bcab5f45cd9b"
}