{
  "markdown": "\n1. EXECUTIVE SUMMARY\n--------- Begin Update A part 1 of 3 ---------\n\nCVSS v3 7.5\n\n--------- End Update A part 1 of 3 ---------\n\nATTENTION: Exploitable remotely\nVendor: Baxter\nEquipment: Sigma and Baxter Spectrum Infusion Pumps\nVulnerabilities: Missing Encryption of Sensitive Data, Use of Externally Controlled Format String, Missing Authentication for Critical Function\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSA-21-251-01 Baxter Sigma Spectrum Infusion Pump that was published September 8, 2022, to the ICS webpage on www.cisa.gov/uscert\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in access to sensitive data and alteration of system configuration.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Sigma Spectrum Infusion systems are affected:\n\nSigma Spectrum v6.x model 35700BAX\nSigma Spectrum v8.x model 35700BAX2\nBaxter Spectrum IQ (v9.x) model 35700BAX3\nSigma Spectrum LVP v6.x Wireless Battery Modules v16, v16D38, v17, v17D19, v20D29 to v20D32, and v22D24 to v22D28\nSigma Spectrum LVP v8.x Wireless Battery Modules v17, v17D19, v20D29 to v20D32, and v22D24 to v22D28\nBaxter Spectrum IQ LVP (v9.x) with Wireless Battery Modules v22D19 to v22D28\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nThe Baxter Spectrum WBM (v16, v16D38, v17, v17D19, v20D29 to v20D32, and v22D19 to v22D28) stores network credentials and patient health information (PHI) in unencrypted form. PHI is only stored in Spectrum IQ pumps using auto programming. An attacker with physical access to a device without all data and settings erased may be able to extract sensitive information.\nCVE-2022-26390 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.2    USE OF EXTERNALLY CONTROLLED FORMAT STRING CWE-134\n--------- Begin Update A part 2 of 3 ---------\nThe Baxter Spectrum WBM (v16, v16D38, v17, v17D19, and v20D29 to v20D32) when in superuser mode is susceptible to format string attacks via application messaging. An attacker could use this to read memory in the WBM, potentially accessing sensitive information.\n--------- End Update A part 2 of 3 ---------\nThe Baxter Spectrum WBM (v16, v16D38) and Baxter Spectrum WBM (v17, v17D19, v20D29 to v20D32), when in superuser mode, are susceptible to format string attacks via application messaging. An attacker could use this to read memory in the WBM to access sensitive information.\nCVE-2022-26392 has been assigned to this vulnerability. A CVSS v3 base score of 3.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:L/I:N/A:N).\n4.2.3    USE OF EXTERNALLY CONTROLLED FORMAT STRING CWE-134\nThe Baxter Spectrum WBM (v20D29) is susceptible to format string attacks via application messaging. An attacker could use this to read memory in the WBM to access sensitive information or cause a denial-of-service condition on the WBM.\nCVE-2022-26393 has been assigned to this vulnerability. A CVSS v3 base score of 5.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:L).\n4.2.4    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\n--------- Begin Update A part 3 of 3 ---------\nThe Baxter Spectrum WBM (v16, v16D38, v17, v17D19, and v20D29 to v20D32) does not perform mutual authentication with the gateway server host. This could allow an attacker to perform a machine-in-the-middle attack that modifies parameters, making the network connection fail. Alternatively, an attacker could spoof the server host and send specifically crafted data.\nCVE-2022-26394 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:L/I:H/A:L).\n--------- End Update A part 3 of 3 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: United States, Canada, Puerto Rico, Caribbean\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nDeral Heiland, Principal IoT Researcher at Rapid 7, reported these vulnerabilities to Baxter.\n5. MITIGATIONS\nAccording to Baxter, software updates to disable Telnet and FTP (CVE-2022-26392) are in process. Software updates addressing the format string attack (CVE-2022-26393) are included in WBM version 20D30 and all other WBM versions authentication is already available in Spectrum IQ (CVE-2022-26394).\nInstructions to erase all data and settings on WBMs and pumps before decommissioning and transferring to other facilities (CVE-2022-26390) are in process for incorporation into the Spectrum Operator’s Manual.\nBaxter provides recommended steps for erasing all data and settings on the pump to be decommissioned:\n\nReset the network settings (Biomed->Network Configuration->Transfer Network Settings->Reset).\nDelete the drug library.\nClear the history log.\n\nTo erase all data and settings on the WBM to be decommissioned:\n\nSelect a pump other than the one last used with the WBM.\nReset the network settings and enable networking on the pump.\nPlace the WBM on the pump.\nWait until the network icon turns yellow.\n\nIn conjunction with the user’s own network security policies, Baxter recommends the following mitigations to reduce the likelihood these vulnerabilities will be exploited:\n\nEnsure appropriate physical controls within user environments to protect against unauthorized access to devices.\nIsolate the Spectrum Infusion Systems to its own network virtual local area network (VLAN) to segregate the system from other hospital systems and reduce the probability that a threat actor could execute an adjacent attack, such as a machine-in-the-middle attack against the system to observe clear-text communications.\nUse the strongest available wireless network security protocols (WPA2, EAP-TLS, etc.) to provide authentication/encryption of wireless data sent to/from the Spectrum Infusion System. \nUsers should ensure the WBM is rebooted after configuration for their network(s) by removing the WBM from the rear of the Spectrum device for 10-15 seconds, and then re-attaching the WBM. \nUsers should always monitor for and/or block unexpected traffic, such as FTP and Telnet, at network boundaries into the Spectrum-specific VLAN.\n\nAs a last resort, users may disable wireless operation of the pump; the Spectrum Infusion System was designed to operate without network access. This action would impact an organization’s ability to rapidly deploy drug library (formulary) updates to their pumps.\nFor additional information, see the Baxter Product Security Bulletin.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have a high attack complexity.\n",
  "cves": [
    "CVE-2022-26390",
    "CVE-2022-26394",
    "CVE-2022-26393",
    "CVE-2022-26392"
  ],
  "techniques": [],
  "advisory": "icsma-22-251-01",
  "title": "Baxter Sigma Spectrum Infusion Pump (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "9ce41432cb0b36f823b5f79e36b68839e07eb86a59841bf49f0f434db38423d6"
}