{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 3.7\n\nATTENTION: Exploitable remotely\nVendor: Carestream\nEquipment: Carestream Vue RIS\nVulnerability: Information Exposure Through an Error Message\n\n2. RISK EVALUATION\nAn attacker with access to the network of the affected system can passively read traffic.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Carestream Vue RIS, a web-based radiology information system, are affected:\n\nRIS Client Builds: Version 11.2 and prior running on a Windows 8.1 machine with IIS/7.5\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INFORMATION EXPOSURE THROUGH AN ERROR MESSAGE CWE-209\nWhen contacting a Carestream server where there is no Oracle TNS listener available, users will trigger an HTTP 500 error, leaking technical information an attacker could use to initiate a more elaborate attack.\nCVE-2018-17891 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nDan Regalado of Zingbox reported this vulnerability to NCCIC.\n4. MITIGATIONS\nCarestream has remediated the vulnerability in the current version of the software and have provided the following workarounds for past versions which are affected. Given the mitigation instructions provided, this vulnerability is considered controlled vs. uncontrolled.\n\nRIS v11.3 forward | R&D has addressed the information leakage and enabled SSL.\nFor RIS 11.2 running Windows 8.1 and IIS 7.2:\n\n\nDisable “Show debug messages.”\nEnable SSL for client/server communications.\n\nPlease contact Carestream Support for assistance. Carestream contact information is available at the following location:\nhttps://www.carestream.com/en/us/medical/contact-us/world-wide-contacts.\nUsers can open a request through the eService portal at: https://eservice.carestream.com.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-17891"
  ],
  "techniques": [],
  "advisory": "icsma-18-277-01",
  "title": "Carestream Vue RIS | CISA",
  "source": "ics-medical-advisories",
  "id": "f1c114368513b91eac61ee496be0788e0f51c9cda1c3a818049388e47b4d8ca7"
}