{
  "markdown": "\nOVERVIEW\nMedSec has identified an improper input validation vulnerability in BMC Medical’s and 3B Medical’s Luna continuous positive airway pressure (CPAP) therapy machine. For devices released after July 1, 2017, this vulnerability has been addressed. For devices released prior to July 1, 2017, BMC Medical and 3B Medical offer no mitigations.\nAFFECTED PRODUCTS\nThe following versions of the Luna CPAP Machine are affected:\n\nLuna CPAP Machine, all devices released prior to July 1, 2017.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to cause a crash of the device’s Wi-Fi module resulting in a denial-of-service condition affecting the Wi-Fi module chipset. This does not affect the device’s ability to deliver therapy.\nBACKGROUND\nThe operation of the Luna CPAP can be broken into therapeutic and communication functions. BMC Medical, based in China, manufactures the device and firmware chipset used in delivery of therapy. 3B Medical, based in the United States, manages the Wi-Fi module chipset used in communication.\nThe affected product, the Luna CPAP Machine, is a continuous positive airway pressure therapy machine. It is deployed worldwide across the Healthcare and Public Health sector.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nIMPROPER INPUT VALIDATIONCWE-20: Improper Input Validation, http://cwe.mitre.org/data/definitions/20.html, web site last accessed August 15, 2017.\n\nAn improper input validation vulnerability has been identified, which may allow an authenticated attacker to crash the CPAP’s Wi-Fi module resulting in a denial-of-service condition.\nNote that the vulnerability affects only the Wi-Fi module; the device can continue delivering therapy even after the Wi-Fi module has crashed.\nCVE-2017-12701NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2017-12701, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 4.6 and a has been assigned; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:L, web site last accessed August 15, 2017.\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is exploitable via adjacent network access.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with a low skill would be able to exploit this vulnerability.\nMITIGATION\nThis vulnerability has been addressed in devices released after July 1, 2017. For devices released prior to July 1, 2017, BMC Medical and 3B Medical offer no mitigations.\nNCCIC/ICS-CERT recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nChange default passwords to reduce the risk of unauthorized access to device settings or management pages.\nMinimize network exposure for all medical devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate all medical devices and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nICS-CERT also provides a section for security recommended practices on the ICS-CERT web page at http://ics-cert.us-cert.gov/content/recommended-practices. ICS-CERT reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS‑CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site (http://ics-cert.us-cert.gov/).\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to ICS-CERT for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2017-12701"
  ],
  "techniques": [],
  "advisory": "icsma-17-227-01",
  "title": "BMC Medical and 3B Medical Luna CPAP Machine | CISA",
  "source": "ics-medical-advisories",
  "id": "d2778bc20244f7af32b43a7aeb27a9449b0cc123550e92b703c93e04b87ea7fa"
}