{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.2\nATTENTION: Low attack complexity\nVendor: Philips\nEquipment: MRI 1.5T and 3T\nVulnerabilities: Improper Access Control, Incorrect Ownership Assignment, Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an unauthorized attacker access to execute software, modify system configuration, view/update files, and export data (including patient data) to an untrusted environment.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPhilips reports the vulnerabilities affect the following MRI products:\n\nMRI 1.5T: Version 5.x.x\nMRI 3T: Version 5.x.x\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe software does not restrict or incorrectly restricts access to a resource from an unauthorized actor.\nCVE-2021-26262 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.2    INCORRECT OWNERSHIP ASSIGNMENT CWE-708\nThe software assigns an owner who is outside the intended control sphere to a resource.\nCVE-2021-26248 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nThe product exposes sensitive information to an actor not explicitly authorized to have access.\nCVE-2021-42744 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nMichael Aguilar, a Secureworks Adversary Group consultant, reported these vulnerabilities to Philips.\n4. MITIGATIONS\nPhilips plans a new release to remediate these vulnerabilities by October 2022.\nAs an interim mitigation to these vulnerabilities, Philips recommends the following:\n\nUsers should operate all Philips deployed and supported products within Philips authorized specifications, including physical and logical controls. Only allowed personnel are permitted in the vicinity of the product. Refer to the Philips instructions for use (IFU) available on InCenter.\n\nUsers with questions about their specific MRI product should contact a Philips service support team or regional service support. Philips contact information is available at the Philips customer service solutions website or by calling 1-800-722-9377. \nFor more information regarding these vulnerabilities, see the Philips product security advisory website.\nUsers can also visit the Philips product security website for the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nImplement physical security measures to limit or control access to critical systems.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-26262",
    "CVE-2021-42744",
    "CVE-2021-26248"
  ],
  "techniques": [],
  "advisory": "icsma-21-313-01",
  "title": "Philips MRI 1.5T and 3T | CISA",
  "source": "ics-medical-advisories",
  "id": "eef63095f77dc222a96e5c2a2376b2b31355252c1d813dbde548af9a0351894b"
}