{
  "markdown": "\nOVERVIEW\nJohnson & Johnson, the parent company of Ethicon Endo-Surgery, LLC, reported an improper authentication vulnerability in the Ethicon Endo-Surgery Generator Gen11. EthiconEndo-Surgery, LLC has produced updates that mitigate this vulnerability in the affected product.\nAFFECTED PRODUCTS\nThe following versions of the Ethicon Endo-Surgery Generator Gen11 are affected:\n\nEthicon Endo-Surgery Generator Gen11, all versions released before November 29, 2017.\n\nIMPACT\nImpact to individual organizations depends on many factors that are unique to each organization. ICS-CERT recommends that organizations evaluate the impact of this vulnerability based on their operational environment and specific clinical usage.\nBACKGROUND\nEthicon Endo-Surgery, LLC is a subsidiary of Johnson & Johnson and is a U.S.-based company that maintains offices in several countries around the world.\nThe Ethicon Endo-Surgery Generator Gen11 is deployed across the Healthcare and Public Health sector. This product is marketed globally.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\nIMPROPER AUTHENTICATIONCWE-287: Improper Authentication, http://cwe.mitre.org/data/definitions/287.html, web site last accessed November 28, 2017.\nThe security authentication mechanism used between the Ethicon Endo-Surgery Generator Gen11 and single-patient use products can be bypassed, allowing for unauthorized devices to be connected to the generator, which could result in a loss of integrity or availability.\nCVE-2017-14018NVD, http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2017-14018, NIST uses this advisory to create the CVE web site report. This web site will be active sometime after publication of this advisory. has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been assigned; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:L).CVSS Calculator, https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:P/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:L, web site last accessed November 28, 2017.\nEXPLOITABILITY\nThis vulnerability cannot be exploited remotely.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nAn attacker with high skill would be able to exploit this vulnerability.\nMITIGATION\nEthicon Endo-Surgery, LLC has contacted users and initiated a field cybersecurity update to address the vulnerability in the Ethicon Endo-Surgery Generator Gen11. The update was made available on November 29, 2017. Users with questions regarding the vulnerability or the product update are advised to contact their Ethicon Endo-Surgery, LLC sales representative or Ethicon Customer Support Center at 1-877-ETHICON.\n",
  "cves": [
    "CVE-2017-14018"
  ],
  "techniques": [],
  "advisory": "icsma-17-332-01",
  "title": "Ethicon Endo-Surgery Generator G11 Vulnerability | CISA",
  "source": "ics-medical-advisories",
  "id": "f253e4d5c9d978a76f192371c109bc298e64250691419f8f2a4f9d2b403098a5"
}