{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.1\nATTENTION: Exploitable remotely\nVendor: Hillrom\nEquipment: Welch Allyn Cardio Products\nVulnerability: Authentication Bypass Using an Alternate Path or Channel\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access privileged accounts.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Hillrom cardiology products, when configured to use single sign-on (SSO), are affected:\n\nWelch Allyn Q-Stress Cardiac Stress Testing System: Versions 6.0.0 through 6.3.1\nWelch Allyn X-Scribe Cardiac Stress Testing System: Versions 5.01 through 6.3.1\nWelch Allyn Diagnostic Cardiology Suite: Version 2.1.0\nWelch Allyn Vision Express: Versions 6.1.0 through 6.4.0\nWelch Allyn H-Scribe Holter Analysis System: Versions 5.01 through 6.4.0\nWelch Allyn R-Scribe Resting ECG System: Versions 5.01 through 7.0.0\nWelch Allyn Connex Cardio: Versions 1.0.0 through 1.1.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    AUTHENTICATION BYPASS USING AN ALTERNATE PATH OR CHANNEL CWE-288\nThe impacted products, when configured to use SSO, are affected by an improper authentication vulnerability. This vulnerability allows the application to accept manual entry of any active directory (AD) account provisioned in the application without supplying a password, resulting in access to the application as the supplied AD account, with all associated privileges.\nCVE-2021-43935 has been assigned to this vulnerability. A CVSS v3 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nHillrom reported this vulnerability to CISA.\n4. MITIGATIONS\nHillrom plans to release software updates to address this vulnerability in their next software release.\nIn the interim, Hillrom recommends the following workaround and mitigation to reduce the risk:\n\nDisable the SSO feature in the respective Modality Manager Configuration settings. Please refer to the instructions for use (IFU) and/or service manual for instructions on how to disable SSO.\n\nHillrom recommends users upgrade to the latest product versions when updated products are available. Information on how to update these products to their new versions can be found on the Hillrom disclosure page.\nHillrom recommends the following additional workarounds to help reduce risk:\n\nApply proper network and physical security controls.\nApply authentication for server access.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/uscert/ics. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2021-43935"
  ],
  "techniques": [],
  "advisory": "icsma-21-343-01",
  "title": "Hillrom Welch Allyn Cardio Products | CISA",
  "source": "ics-medical-advisories",
  "id": "9cf38719f95bfee2e2112fad453848023db21243a17ae57a676dfbd8acec7ecd"
}