{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: SOOIL Developments Co., Ltd.\nEquipment: Diabecare RS, AnyDana-i and AnyDana-A\nVulnerabilities: Use of Hard Coded Credentials, Insufficiently Protected Credentials, Use of Insufficiently Random Values, Use of Client-side Authentication, Client-side Enforcement of Server-side Security, Authentication Bypass by Capture-Replay, Unprotected Transport of Credentials, Key Exchange Without Entity Authentication, Authentication Bypass by Spoofing\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to access sensitive information, modify therapy settings, bypass authentication, or crash the device being accessed. These vulnerabilities could affect patient safety.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Dana Diabecare Insulin Pumps and mobile applications are affected:\n\nDana Diabecare RS: All versions prior to 3.0\nAnyDana-i: All versions prior to 3.0\nAnyDana-A: All versions prior to 3.0\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD CODED CREDENTIALS CWE-798\nA hard-coded physician PIN in the physician menu of the insulin pump allows attackers with physical access to change insulin therapy settings.\nCVE-2020-27256 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). \n3.2.2    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nAn information disclosure vulnerability in the communication protocol of the insulin pump and its AnyDana-i and AnyDana-A mobile applications allows unauthenticated attackers to extract the pump’s keypad lock PIN via Bluetooth Low Energy.\nCVE-2020-27258 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3    USE OF INSUFFICIENTLY RANDOM VALUES CWE-330\nThe communication protocol of the insulin pump and its AnyDana-i and AnyDana-A mobile applications use deterministic keys, which allows unauthenticated, physically proximate attackers to brute-force the keys via Bluetooth Low Energy.\nCVE-2020-27264 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L).\n3.2.4    USE OF CLIENT-SIDE AUTHENTICATION CWE-603\nA client-side control vulnerability in the insulin pump and its AnyDana-i and AnyDana-A mobile applications allows physically proximate attackers to bypass user authentication checks via Bluetooth Low Energy.\nCVE-2020-27266  has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.5    CLIENT-SIDE ENFORCEMENT OF SERVER-SIDE SECURITY CWE-602\nA client-side control vulnerability in the insulin pump and its AnyDana-i and AnyDana-A mobile applications allows physically proximate attackers to bypass checks for default PINs via Bluetooth Low Energy.\nCVE-2020-27268  has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.6    AUTHENTICATION BYPASS BY CAPTURE-REPLAY CWE-294\nThe communication protocol of the insulin pump and its AnyDana-i and AnyDana-A mobile applications lacks replay protection measures, which allows unauthenticated, physically proximate attackers to replay communication sequences via Bluetooth Low Energy.\nCVE-2020-27269 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:R/S:U/C:L/I:H/A:N).\n3.2.7    UNPROTECTED TRANSPORT OF CREDENTIALS CWE-523\nThe communication protocol of the insulin pump and its AnyDana-i and AnyDana-A mobile applications does not use adequate measures to protect encryption keys in transit, which allows unauthenticated, physically proximate attackers to sniff the keys via Bluetooth Low Energy.\nCVE-2020-27270 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.2.8    KEY EXCHANGE WITHOUT ENTITY AUTHENTICATION CWE-322\nThe communication protocol of the insulin pump and its AnyDana-i and AnyDana-A mobile applications does not use adequate measures to authenticate the pump before exchanging keys, which allows unauthenticated, physically proximate attackers to eavesdrop the keys and spoof the pump via Bluetooth Low Energy.\nCVE-2020-27272 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N). \n3.2.9    AUTHENTICATION BYPASS BY SPOOFING CWE-290\nThe communication protocol of the insulin pump and its AnyDana-i and AnyDana-A mobile applications does not use adequate measures to authenticate the communicating entities before exchanging keys, which allows unauthenticated, physically proximate attackers to eavesdrop the authentication sequence via Bluetooth Low Energy.\nCVE-2020-27276 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Europe, Asia\nCOMPANY HEADQUARTERS LOCATION: South Korea\n\n3.4 RESEARCHER\nJulian Suleder, Birk Kauer, Raphael Pavlidis, and Nils Emmerich of ERNW Research GmbH reported these vulnerabilities to the Federal Office for Information Security (BSI, Germany), in the context of the BSI project ManiMed – Manipulation of Medical Devices. BSI then provided this report to CISA.\n4. MITIGATIONS\nDana Diabecare recommends users update the Dana Diabecare insulin pumps to Version 3.0 or higher, or to the latest available release. Additionally, users are encouraged to immediately update AnyDana-A and AnyDana-i to Version 3.0 or higher. Also, SOOIL recommends users to apply these mitigating strategies:\n\nIn the case a user cannot update the Dana RS pump to the latest version, always operate the pump in Airplane Mode.\nUsers of any versions prior to 3.0 should operate Dana RS insulin pumps in Airplane Mode continuously.\nUsers can obtain partial mitigation of the vulnerabilities by updating the AnyDana application to the latest Version 3.0 or later.\nUsers of the latest version of the application, Version 3.0 or later, can continue to operate the Dana RS insulin pumps with versions installed prior to Version 3.0.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMaintain tight physical control of the pump and devices connected to the pump.\nBe attentive to pump notifications, alarms, and alerts be aware of anything out of the ordinary.\nImmediately cancel any unintended boluses (a single dose of insulin administered all at once).\nDo not connect insulin pump to any third-party devices or use any software not authorized.\nGet medical help immediately if you suspect any insulin pump settings or the insulin delivery has changed unexpectedly.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2020-27268",
    "CVE-2020-27270",
    "CVE-2020-27272",
    "CVE-2020-27258",
    "CVE-2020-27264",
    "CVE-2020-27269",
    "CVE-2020-27276",
    "CVE-2020-27266",
    "CVE-2020-27256"
  ],
  "techniques": [],
  "advisory": "icsma-21-012-01",
  "title": "SOOIL Dana Diabecare RS Products | CISA",
  "source": "ics-medical-advisories",
  "id": "f995ac5abf5cb26028cf5dbd13d94be21be1da8a9111d7c8dff34c1ae44786c5"
}