{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.9\nATTENTION: Exploitable remotely\nVendor: Hillrom\nEquipment: Welch Allyn medical device management tools\nVulnerabilities: Out-of-Bounds Write, Out-of-Bounds Read\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSA-21-152-01 Hillrom Medical Device Management (Update B) that was published September 8, 2022, to the ICS webpage at www.cisa.gov/ics.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to cause memory corruption and remotely execute arbitrary code.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following Hillrom products, are affected:\n\nWelch Allyn Service Tool: versions prior to v1.10\nWelch Allyn Connex Device Integration Suite – Network Connectivity Engine (NCE): versions prior to v5.3\nWelch Allyn Software Development Kit (SDK): versions prior to v3.2\nWelch Allyn Connex Central Station (CS): versions prior to v1.8.4 Service Pack 01\nWelch Allyn Service Monitor: versions prior to v1.7.0.0\nWelch Allyn Connex Vital Signs Monitor (CVSM): versions prior to v2.43.02\nWelch Allyn Connex Integrated Wall System (CIWS): versions prior to v2.43.02\nWelch Allyn Connex Spot Monitor (CSM): versions prior to v1.52\nWelch Allyn Spot Vital Signs 4400 Device (Spot 4400) / Welch Allyn Spot 4400 Vital Signs Extended Care Device: versions prior to v1.11.00\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    OUT-OF-BOUNDS WRITE CWE-787\nThe affected product is vulnerable to an out-of-bounds write, which may result in corruption of data or code execution. \nCVE-2021-27410 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:N/S:U/C:L/I:H/A:L).\n4.2.2    OUT-OF-BOUNDS READ CWE-125\nThe affected product is vulnerable to an out-of-bounds read, which can cause information leakage leading to arbitrary code execution if chained to the out-of-bounds write vulnerability. \nCVE-2021-27408 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:N/S:U/C:L/I:H/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nItamar Cohen-Matalon of Medigate Research Labs reported these vulnerabilities to Hillrom.\n4. MITIGATIONS\nHillrom has released software updates for all impacted devices to address these vulnerabilities. New versions of the products that mitigate the vulnerabilities are available as follows:\n\nWelch Allyn Service Tool: v1.10\nWelch Allyn Software Development Kit (SDK): v3.2\n\n--------- Begin Update C Part 1 of 1 ---------\n\nWelch Allyn Connex Central Station (CS): v1.8.4 Service Pack 01 (released November 2022)\n\n--------- End Update C Part 1 of 1 ---------\n\nWelch Allyn Connex Device Integration Suite - Network Connectivity Engine (NCE): v5.3 (released September 2021)\nWelch Allyn Spot Vital Signs 4400 Device (Spot 4400) / Welch Allyn Spot 4400 Vital Signs Extended Care Device: v1.11.00 (Released October 2021)\nWelch Allyn Service Monitor: v1.7.0.0\nWelch Allyn Connex Vital Signs Monitor (CVSM): v2.43.02\nWelch Allen Connex Integrated Wall System (CIWS): v2.43.02\nWelch Allyn Connex Spot Monitor (CSM): v1.52\nWelch Allyn Spot Vital Signs 4400 Device (Spot 4400) / Welch Allyn Spot 4400 Vital Signs Extended Care Device: v1.11.00 (available Fall 2021)\n\nHillrom recommends users to upgrade to the latest versions of their products. Information on how to update these products to their new versions can be found on the Hillrom disclosure page.\nHillrom recommends the following workarounds to help reduce risk:\n\nApply proper network and physical security controls.\nApply authentication for server access. \nApply data execution prevention (DEP) where applicable to help prevent shellcode from running. Address space layout randomization (ASLR) is built into standard Windows and Linux distributions.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities have high attack complexity.\n",
  "cves": [
    "CVE-2021-27408",
    "CVE-2021-27410"
  ],
  "techniques": [],
  "advisory": "icsma-21-152-01",
  "title": "Hillrom Medical Device Management (Update C) | CISA",
  "source": "ics-medical-advisories",
  "id": "3a36a8077f3002706f6a99354322a9e8640563f13a9d9ac9b87c2d6bec16b481"
}