{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 10.0\nATTENTION: Exploitable remotely/low attack complexity \nVendor: Illumina \nEquipment: Universal Copy Service (UCS) \nVulnerabilities: Binding to an Unrestricted IP Address, Execution with Unnecessary Privileges\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to take any action at the operating system level. A threat actor could impact settings, configurations, software, or data on the affected product; a threat actor could interact through the affected product via a connected network. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following products using Illumina Universal Copy Service are affected: \n\niScan Control Software: v4.0.0 \niScan Control Software: v4.0.5 \niSeq 100: All versions \nMiniSeq Control Software: v2.0 and newer \nMiSeq Control Software: v4.0 (RUO Mode) \nMiSeqDx Operating Software: v4.0.1 and newer \nNextSeq 500/550 Control Software: v4.0 \nNextSeq 550Dx Control Software:  v4.0 (RUO Mode) \nNextSeq 550Dx Operating Software:  v1.0.0 to 1.3.1 \nNextSeq 550Dx Operating Software: v1.3.3 and newer \nNextSeq 1000/2000 Control Software: v1.4.1 and prior \nNovaSeq 6000 Control Software: v1.7 and prior \nNovaSeq Control Software: v1.8 \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 BINDING TO AN UNRESTRICTED IP ADDRESS CWE-1327 \nInstruments with Illumina Universal Copy Service v2.x are vulnerable due to binding to an unrestricted IP address. An unauthenticated malicious actor could use UCS to listen on all IP addresses, including those capable of accepting remote communications. \nCVE-2023-1968 has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). \n3.2.2 EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250 \nInstruments with Illumina Universal Copy Service v1.x and v2.x contain an unnecessary privileges vulnerability. An unauthenticated malicious actor could upload and execute code remotely at the operating system level, which could allow an attacker to change settings, configurations, software, or access sensitive data on the affected product. \nCVE-2023-1966 has been assigned to this vulnerability. A CVSS v3 base score of 7.4 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nIllumina reported these vulnerabilities to CISA. \n4. MITIGATIONS\nIllumina recommends using the UCS Vulnerability Instructions Guide based on the user’s specific system configuration to mitigate the vulnerabilities. Illumina recommends users read the instructions before downloading any software. \nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2023-1968",
    "CVE-2023-1966"
  ],
  "techniques": [],
  "advisory": "icsma-23-117-01",
  "title": "Illumina Universal Copy Service | CISA",
  "source": "ics-medical-advisories",
  "id": "35cb962a1a644fbec3732902fbc62943c599ac9387f9d877e9b4afa6e4c40a28"
}