{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 2.6\nATTENTION: Exploitable remotely\nVendor: Philips\nEquipment: Engage Software\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow improper viewing (read-only) of business contact information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Engage, a customer support software platform, are affected:\n\nEngage Software Versions 6.2.1 and prior \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected product is vulnerable to an improper access control, which may allow an authenticated user to gain unauthorized access to sensitive data.\nCVE-2021-23173 has been assigned to this vulnerability. A CVSS v3 base score of 2.6 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:R/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nParnassia and S-Unit reported this vulnerability to CISA.\n4. MITIGATIONS\nPhilips released and deployed updated Version 6.2.2 in September of 2021, which mitigated this vulnerability. Engage is a hosted application and users don’t need to take any action.\nUsers with questions about their Engage product should contact the Philips Service support team or regional service support. \nFor additional information, refer to the Philips product security advisory. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has high attack complexity.\n",
  "cves": [
    "CVE-2021-23173"
  ],
  "techniques": [],
  "advisory": "icsma-22-006-01",
  "title": "Philips Engage Software | CISA",
  "source": "ics-medical-advisories",
  "id": "ef307b09e3e05b8276fc342b57ddb2eca1119093a7bdd6b1ffbb8f799e6b4184"
}