{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.0\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Pyxis\nVulnerability: Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to gain access to electronic protected health information (ePHI) or other sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following BD Pyxis products, an automated medication dispensing system, are affected:\n\nBD Pyxis Anesthesia Station ES\nBD Pyxis Anesthesia Station 4000\nBD Pyxis CATO\nBD Pyxis CIISafe\nBD Pyxis Inventory Connect\nBD Pyxis IV Prep\nBD Pyxis JITrBUD\nBD Pyxis KanBan RF\nBD Pyxis Logistics\nBD Pyxis Med Link Family\nBD Pyxis MedBank\nBD Pyxis MedStation 4000\nBD Pyxis MedStation ES\nBD Pyxis MedStation ES Server\nBD Pyxis ParAssist\nBD Pyxis PharmoPack\nBD Pyxis ProcedureStation (including EC)\nBD Pyxis Rapid Rx\nBD Pyxis StockStation\nBD Pyxis SupplyCenter\nBD Pyxis SupplyRoller\nBD Pyxis SupplyStation (including RF, EC, CP)\nBD Pyxis Track and Deliver\nBD Rowa Pouch Packaging Systems\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product is vulnerable due to the use of hard-coded credentials, which may allow threat actors to gain access to the underlying file system and exploit application files for information that could be used to decrypt application credentials or gain access to electronic protected health information (ePHI) or other sensitive information. Credentials are BD managed and are not visible to or used by customers to access or use BD Pyxis devices.\nCVE-2022-22766 has been assigned to this vulnerability. A CVSS v3 base score of 7.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBD voluntarily reported this vulnerability to CISA.\n4. MITIGATIONS\nBD is in the process of strengthening credential management capabilities in BD Pyxis devices.\nAdditionally, BD recommends the following compensating controls for users of BD Pyxis products that utilize the hard-coded credentials:\n\nLimit physical access to the device to only authorized personnel.\nTightly control management of BD Pyxis system credentials provided to authorized users.\nIsolate affected products in a secure VLAN or behind firewalls with restricted access that only permits communication with trusted hosts in other networks when needed.\nMonitor and log all network traffic attempting to reach the affected products for suspicious activity.\nWork with a BD support team to ensure all patching and virus definitions are up to date. The Pyxis Security Module for automated patching and virus definition management is provided to all accounts.\n\nFor more information on this issue, please see the associated BD product security bulletin on the BD website.\nFor product or site-specific concerns, contact your BD service representative.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-22766"
  ],
  "techniques": [],
  "advisory": "icsma-22-062-01",
  "title": "BD Pyxis | CISA",
  "source": "ics-medical-advisories",
  "id": "fb9b67eea9286168f0d5964fd063809d5e45431ad19c54f87363010e5b8bddba"
}