{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.6\nATTENTION: Exploitable remotely/low and high skill level to exploit\nVendor: B. Braun Melsungen AG\nEquipment: SpaceCom, Battery Pack SP with Wi-Fi, and Data module compactplus\nVulnerabilities: Cross-site Scripting, Open Redirect, XPath Injection, Session Fixation, Use of a One-way Hash without a Salt, Relative Path Traversal, Improper Verification of Cryptographic Signature, Improper Privilege Management, Use of Hard-coded Credentials, Active Debug Code, Improper Access Control\n\n2. UPDATE \nThis updated advisory is a follow-up to the original advisory titled “ICSMA-20-296-02 B. Braun SpaceCom, Battery Pack SP with Wi-Fi, and Data module compactplus” that was published October 22, 2020, on the ICS webpage on cisa.gov/ICS.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to compromise the security of the Space or compactplus communication devices, allowing an attacker to escalate privileges, view sensitive information, upload arbitrary files, and perform remote code execution. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of B. Braun products are affected:\n\nSpaceCom, software Versions U61 and earlier (United States), L81 and earlier (outside the United States)\nBattery pack with Wi-Fi, software Versions U61 and earlier (United States), L81 and earlier (outside the United States)\nData module compactplus, software Versions A10 and A11 (not distributed in the United States)\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nA reflected cross-site scripting (XSS) vulnerability in the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows remote attackers to inject arbitrary web script or HTML into various locations. \nCVE-2020-25158 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:L/A:L).\n4.2.2    URL REDIRECTION TO UNTRUSTED SITE ('OPEN REDIRECT') CWE-601\nAn open redirect vulnerability in the administrative interface of the B. Braun Melsungen AG SpaceCom device Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows attackers to redirect users to malicious websites. \nCVE-2020-25154 has been assigned to this vulnerability. A CVSS v3 base score of 5.4 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N).\n4.2.3    IMPROPER NEUTRALIZATION OF DATA WITHIN XPATH EXPRESSIONS ('XPATH INJECTION') CWE-643\nA XPath injection vulnerability in the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows unauthenticated remote attackers to access sensitive information and escalate privileges. \nCVE-2020-25162 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.4    SESSION FIXATION CWE-384\nA session fixation vulnerability in the B. Braun Melsungen AG SpaceCom administrative interface Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows remote attackers to hijack web sessions and escalate privileges. \nCVE-2020-25152 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N).\n4.2.5    USE OF A ONE-WAY HASH WITHOUT A SALT CWE-759\nA vulnerability in the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows attackers to recover user credentials of the administrative interface. \nCVE-2020-25164 has been assigned to this vulnerability. A CVSS v3 base score of 5.1 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n4.2.6    RELATIVE PATH TRAVERSAL CWE-23\nA relative path traversal attack in the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows attackers with service user privileges to upload arbitrary files. By uploading a specially crafted tar file an attacker can execute arbitrary commands. \nCVE-2020-25150 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:L).\n4.2.7    IMPROPER VERIFICATION OF CRYPTOGRAPHIC SIGNATURE CWE-347\nAn improper verification of the cryptographic signature of firmware updates of the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows attackers to generate valid firmware updates with arbitrary content that can be used to tamper with devices. \nCVE-2020-25166 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:H).\n4.2.8    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nA vulnerability in the configuration import mechanism of the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 allows attackers with command line access to the underlying Linux system to escalate privileges to the root user. \nCVE-2020-16238 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.9    USE OF HARD-CODED CREDENTIALS CWE-798\nHard-coded credentials in the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 enables attackers with command line access to access the device’s Wi-Fi module. \nCVE-2020-25168 has been assigned to this vulnerability. A CVSS v3 base score of 3.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n4.2.10    ACTIVE DEBUG CODE CWE-489\nActive debug code in the B. Braun Melsungen AG SpaceCom Version L8/U61, and the Data module compactplus Versions A10 and A11 and earlier enables attackers in possession of cryptographic material to access the device as root. \nCVE-2020-25156 has been assigned to this vulnerability. A CVSS v3 base score of 7.2 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).\n4.2.11    IMPROPER ACCESS CONTROL CWE-284\nImproper access controls in the B. Braun Melsungen AG SpaceCom Version L81/U61 and earlier, and the Data module compactplus Versions A10 and A11 enables attackers to extract and tamper with the devices network configuration. \nCVE-2020-25160 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:L).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n4.4 RESEARCHER\nJulian Suleder, Nils Emmerich, and Birk Kauer of ERNW Research GmbH; Dr. Oliver Matula of ERNW Enno Rey Netzwerke GmbH, reported these vulnerabilities to the Federal Office for Information Security (BSI), Germany, in the context of the BSI project ManiMed (Manipulation of medical devices).\n5. MITIGATIONS\n--------- Begin Update A part 1 of 1 ---------\nB. Braun has released software updates to mitigate the reported vulnerabilities:\nWithin the United States and Canada:\nBattery pack SP with Wi-Fi, software 028U00093 (SN 138852 and lower).\nBattery pack SP with Wi-Fi, software 054U00093 (SN 138853 and higher).\nSpaceStation with SpaceCom 2, software Version 012U000093.\nFor details on acquiring this software, see the B. Braun Advisory.\nUsers in the United States and Canada who need additional support can contact B. Braun Technical Support by calling 800-627-PUMP or by emailing AISTechSupport@bbraunusa.com.\nNote: Facilities in Canada using “U” versions of software should follow the U.S. vulnerability disclosure. Facilities in Canada using non “U” versions (e.g. L) should follow the vulnerability disclosure for outside the U.S.\nOutside the United States and Canada:\n\nBattery Pack SP with Wi-Fi, software 027L000093 (below SN 138853).\nBattery pack SP with Wi-Fi, software 053L00093 (SN 138853 and higher).\nSpaceStation with SpaceCom 2, software version 011L000093.\n\nFor more information, see the B. Braun’s Vulnerability Advisory.\n--------- End Update A part 1 of 1 ---------\nIn addition, B. Braun recommends users of the affected products consider the following best practices:\n\nAll facilities utilizing SpaceCom 2, and Battery Pack SP with Wi-Fi should review their IT infrastructure to ensure a network zone concept has been implemented whereby critical systems, such as infusion pumps, are housed in separate (e.g., by firewalls or VLAN) environments that are not accessible directly from the Internet or by unauthorized users.\nWireless networks should be implemented using industry standard encryption and should be equipped with intrusion detection systems (IDS) and/or intrusion prevention systems (IPS).\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are exploitable remotely. These vulnerabilities have a low attack complexity.\n",
  "cves": [
    "CVE-2020-25156",
    "CVE-2020-25164",
    "CVE-2020-16238",
    "CVE-2020-25154",
    "CVE-2020-25166",
    "CVE-2020-25152",
    "CVE-2020-25162",
    "CVE-2020-25168",
    "CVE-2020-25160",
    "CVE-2020-25158",
    "CVE-2020-25150"
  ],
  "techniques": [],
  "advisory": "icsma-20-296-02",
  "title": "B. Braun SpaceCom, Battery Pack SP with Wi-Fi, and Data module compactplus (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "be1fead1f2d9ca62d30393d4e8c2f8f088a2c6fa2c3667ad365cb445086c4a44"
}