{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 1.9\nVendor: Philips\nEquipment: Philips Holter 2010\nVulnerability: Use of Obsolete Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability under certain conditions can lead to a product feature escalation.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Holter 2010 Plus, a 12-lead EKG analysis software program, are affected:\n\nHolter 2010 Plus, all versions\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF OBSOLETE FUNCTION CWE-477\nA vulnerability has been identified that may allow system options that were not purchased to be enabled.\n\nCVE-2019-10968 has been assigned to this vulnerability. A CVSS v3 base score of 1.9 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nPhilips reported this vulnerability to NCCIC.\n4. MITIGATIONS\nPhilips recommends users implement role-based access controls to control physical access to the system. Further controls are provided by the multiple components required to exploit the vulnerability.\n\nPlease see the Philips product security website for the latest security information for Philips products: https://www.philips.com/productsecurity.\n\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\n\nWhere additional information is needed, follow this link to existing cybersecurity in medical device guidance issued by the FDA.\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-10968"
  ],
  "techniques": [],
  "advisory": "icsma-19-192-01",
  "title": "Philips Holter 2010 Plus | CISA",
  "source": "ics-medical-advisories",
  "id": "ab79b9f22e940d760b8cecfa1951f709e1c4d803be3b158841560185251a1be7"
}