{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nVendor: Becton, Dickinson and Company (BD) \nEquipment: BodyGuard Pumps \nVulnerability: Missing Protection Mechanism for Alternate Hardware Interface \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to change configuration settings or disable the pump. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following BD BodyGuard products are affected: \n\nBD BodyGuard \nCME BodyGuard 323 (2nd Edition) \nCME BodyGuard 323 Color Vision (2nd Edition) \nCME BodyGuard 323 Color Vision (3rd Edition) \nCME BodyGuard Twins (2nd Edition) \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 MISSING PROTECTION MECHANISM FOR ALTERNATE HARDWARE INTERFACE CWE-1299 \nThe affected BD BodyGuard infusion pumps allow for access through the RS-232 (serial) port interface. If exploited, threat actors with physical access and specialized equipment and knowledge could configure or disable the pump. No electronic protected health information (ePHI), protected health information (PHI), or personally identifiable information (PII) is stored in the pump. \nCVE-2022-43557 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: Deployed outside the U.S \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nBD reported this vulnerability to CISA. \n4. MITIGATIONS\nBD recommends the following mitigations to reduce risk associated with this vulnerability: \n\nEnsure physical access controls are in place to ensure only authorized users have access to the affected product.  \nEnsure only BD-approved equipment is connected to the RS-232 interface of the affected pumps. \nWhen the affected pumps are delivering infusions, ensure no equipment is connected to the RS-232 interface. \nProtect connected computer systems with BodyComm software with standard security measures. \n\nFor additional information, users should see BD’s security bulletin. \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. This vulnerability has a high attack complexity. \n",
  "cves": [
    "CVE-2022-43557"
  ],
  "techniques": [],
  "advisory": "icsma-22-335-01",
  "title": "BD BodyGuard Pumps | CISA",
  "source": "ics-medical-advisories",
  "id": "0d3f54a89b0a5fab7d92b3c2227b6b3a66c059ed73845b519409a049c3734a8b"
}