{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.1\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: PageWriter TC10, TC20, TC30, TC50, TC70 Cardiographs\nVulnerabilities: Improper Input Validation, Use of Hard Coded Credentials\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-18-228-01 Philips PageWriter TC10, TC20, TC30, TC50, and TC70 Cardiographs that was published August 16, 2018, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow buffer overflows, or allow an attacker to access and modify settings on the device.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of PageWriter TC10, TC20, TC30, TC50, TC70 Cardiographs are affected:\n\nAll versions prior to May 2018.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe PageWriter device does not sanitize data entered by user. This can lead to buffer overflow or format string vulnerabilities.\nCVE-2018-14799 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n4.2.2    USE OF HARD-CODED CREDENTIALS CWE-798\nAn attacker with both the superuser password and physical access can enter the superuser password that can be used to access and modify all settings on the device, as well as allow the user to reset existing passwords. \nCVE-2018-14801 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n4.4 RESEARCHER\nPhilips reported these vulnerabilities to CISA.\n5. MITIGATIONS\n--------- Begin Update A Part 1 of 2 ---------\nPhilips plans an update to correct these issues in a release scheduled for the third quarter of 2020.\n--------- End Update A Part 1 of 2 ---------\nPhilips has also provided the following information regarding an operating system that is no longer supported by the operating system manufacturer:\n\nWinCE5 is an obsolete operating system, which is no longer supported by the operating system manufacturer and only applies to PageWriter TC20, TC30, TC50 and TC70.\n\n--------- Begin Update A Part 2 of 2 ---------\n\nPageWriter TC50 and TC70 support WinCE7, which is available for download on InCenter by customers. Philips recommends replacing the TC20 and TC30 with the TC50 if customers are concerned about the obsolete operating system. For TC20, there will be an update to a supported operating system released by the third quarter of 2020.\n\n--------- End Update A Part 2 of 2 ---------\nPhilips offers the following additional mitigation advice: \n\nDefense in depth\nPhysical security is a foundational requirement\nFor medical devices such as a PageWriter, controlling access to the system components provides key protection to the medical devices in the system.  \nPhysical security is a combination of policy, procedure and practice to control and monitor who has physical access. \nFor medical devices, physical security provides multifactor authentication (the user physically must be at the device and provide something they know).  \n\nUsers can contact Philips’ customer service, and find more details in the Philips’ advisory (external link). \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-14801",
    "CVE-2018-14799"
  ],
  "techniques": [],
  "advisory": "icsma-18-228-01",
  "title": "Philips PageWriter TC10, TC20, TC30, TC50, and TC70 Cardiographs (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "000e24c6a27781492b75514b43cd040b77ccea12a3f47c96c5e8ffed9a4538b0"
}