{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.3\nATTENTION: Low skill level to exploit\nVendor: Hamilton Medical AG \nEquipment: Hamilton-T1\nVulnerabilities: Use of Hard-coded Credentials, Missing XML Validation\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow attackers with physical access to the device to obtain sensitive information or crash the device being accessed. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Hamilton-T1 Ventilator, are affected:\n\nT1 Ventilator Versions 2.2.3 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nHard-Coded credentials in the ventilator allow attackers with physical access to obtain admin privileges for the device’s configuration interface.\nCVE-2020-27278 has been assigned to this vulnerability. A CVSS v3 base score of 3.5 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N). \n3.2.2    MISSING XML VALIDATION CWE-112\nAn XML validation vulnerability in the ventilator allows privileged attackers with physical access to render the device persistently unusable by uploading specially crafted configuration files.\nCVE-2020-27282  has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n3.2.3    EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nAn information disclosure vulnerability in the ventilator allows attackers with physical access to the configuration interface's logs to get valid checksums for tampered configuration files.\nCVE-2020-27290 has been assigned to this vulnerability. A CVSS v3 base score of 2.1 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Switzerland\n\n3.4 RESEARCHER\nJulian Suleder, Raphael Pavlidis, and Nils Emmerich of ERNW Research GmbH and Dr. Oliver Matula of ERNW Enno Rey Netzwerke GmbH reported these vulnerabilities to the Federal Office for Information Security (BSI, Germany), in the context of the BSI project ManiMed – Manipulation of Medical Devices. BSI then provided this report to CISA.\n4. MITIGATIONS\nHamilton Medical recommends users of affected versions update to a version later than T1 Ventilator Version 2.2.3 where possible. Additionally, Hamilton Medical recommends users: \n\nMaintain tight physical control of the ventilator.\nBe attentive to notifications, alarms, and alerts.\nDo not connect to any third-party devices or use any unauthorized software.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2020-27290",
    "CVE-2020-27278",
    "CVE-2020-27282"
  ],
  "techniques": [],
  "advisory": "icsma-21-047-01",
  "title": "Hamilton-T1 | CISA",
  "source": "ics-medical-advisories",
  "id": "df84f0295d4aef949b51fc10af7984c352914d2017bdd8c513e37e8961e02fe2"
}