{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.4\nATTENTION: Low attack complexity\nVendor: Becton, Dickinson and Company (BD)\nEquipment: FACSChorus\nVulnerabilities: Missing Protection Mechanism for Alternate Hardware Interface, Missing Authentication for Critical Function, Improper Authentication, Use of Hard-coded Credentials, Insecure Inherited Permissions,\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker with physical access to the device to modify system configurations, obtain access to sensitive information, or access components of the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following BD products are affected:\n\nBD FACSChorus (HP Z2 G9 workstation, shipped with FACSDiscover S8 Cell Sorter): v5.0 and v5.1\nBD FACSChorus (HP Z2 G5 workstation, shipped with FACSMelody Cell Sorter): v3.0 and v3.1\n\n3.2 Vulnerability Overview\n3.2.1 MISSING PROTECTION MECHANISM FOR ALTERNATE HARDWARE INTERFACE CWE-1299\nIn BD FACSChorus v5.0, v5.1, v3.0, and v3.1, the respective workstation operating system does not restrict what devices can interact with its USB ports. If exploited, a threat actor with physical access to the workstation could gain access to system information and potentially exfiltrate data.\nCVE-2023-29060 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.4 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:H).\n3.2.2 MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nIn the BD FACSChorus v5.0, v5.1, v3.0, and v3.1 workstation, there is no BIOS password. A threat actor with physical access to the workstation can potentially exploit this vulnerability to access the BIOS configuration and modify the drive boot order and BIOS pre-boot authentication.\nCVE-2023-29061 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.2 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H).\n3.2.3 IMPROPER AUTHENTICATION CWE-287\nIn BD FACSChorus v5.0, v5.1, v3.0, and v3.1, the operating system hosting the FACSChorus application is configured to allow transmission of hashed user credentials upon user action without adequately validating the identity of the requested resource. This is possible through the use of LLMNR, MBT-NS, or MDNS and will result in NTLMv2 hashes being sent to a malicious entity position on the local network. These hashes can subsequently be attacked through brute force and cracked if a weak password is used. This attack would only apply to domain joined systems.\nCVE-2023-29062 has been assigned to this vulnerability. A CVSS v3.1 base score of 3.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:C/C:L/I:N/A:N).\n3.2.4 MISSING PROTECTION MECHANISM FOR ALTERNATE HARDWARE INTERFACE CWE-1299\nIn BD FACSChorus v5.0, v5.1, v3.0, and v3.1, the workstation does not prevent physical access to its PCI express (PCIe) slots, which could allow a threat actor to insert a PCI card designed for memory capture. A threat actor can isolate sensitive information such as a BitLocker encryption key from a dump of the workstation RAM during startup.\nCVE-2023-29063 has been assigned to this vulnerability. A CVSS v3.1 base score of 2.4 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.5 USE OF HARD-CODED CREDENTIALS CWE-798\nIn BD FACSChorus v5.0 and v5.1, the software contains sensitive information stored in plaintext. A threat actor could gain hardcoded secrets used by the application, which include tokens and passwords for administrative accounts.\nCVE-2023-29064 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.1 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n3.2.6 INSECURE INHERITED PERMISSIONS CWE-277\nIn BD FACSChorus v5.0 and v5.1, the software database can be accessed directly with the privileges of the currently logged-in user. A threat actor with physical access could potentially gain credentials, which could be used to alter or destroy data stored in the database.\nCVE-2023-29065 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.1 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n3.2.7 INCORRECT PRIVILEGE ASSIGNMENT CWE-266\nIn BD FACSChorus v5.0 and v5.1 and the respective workstations, the software does not properly assign data access privileges for operating system user accounts. A non-administrative OS account can modify information stored in the local application data folders.\nCVE-2023-29066 has been assigned to this vulnerability. A CVSS v3.1 base score of 3.2 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nMichael Aguilar (v3ga) of Secureworks, Milind Sunilbhai Purswani and BD reported these vulnerabilities to CISA.\n4. MITIGATIONS\nVulnerabilities associated with the BD FACSChorus software and workstations will be addressed in an upcoming release. This bulletin will be updated when more information is available. Check back periodically for updates.\nBD recommends the following mitigations and compensating controls to reduce risk associated with these vulnerabilities. The following recommendations apply to all vulnerabilities listed in this bulletin:\n\nEnsure physical access controls are in place and only authorized end-users have access to the BD FACSChorus Software and respective workstation.\nIf the BD FACSChorus workstation is connected to the local network, ensure industry standard network security policies and procedures are followed.\nAdministrative access to the FACSChorus software and workstation should be strictly controlled by the user in collaboration with their local IT security policy.\n\nThe vulnerabilities impact the BD FACSChorus v5.0, v5.1, v3.0, and v3.1and their workstations. None of the vulnerabilities above impact the operation or instrument functionality of the BD FACSDiscover S8 Cell Sorter or the BD FACSMelody Cell Sorter.\nFor additional information, refer to BD's Security Bulletin.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely.\n5. UPDATE HISTORY\n\nNovember 28, 2023: Initial Publication\n\n",
  "cves": [
    "CVE-2023-29062",
    "CVE-2023-29066",
    "CVE-2023-29065",
    "CVE-2023-29064",
    "CVE-2023-29060",
    "CVE-2023-29063",
    "CVE-2023-29061"
  ],
  "techniques": [],
  "advisory": "icsma-23-331-01",
  "title": "BD FACSChorus | CISA",
  "source": "ics-medical-advisories",
  "id": "e1df75c379948927f14e3476fdcdb5bb697911dcde389a1a590b66163a7d32e0"
}