{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.1\nVendor: Medtronic\nEquipment: 2090 CareLink Programmer, 29901 Encore Programmer\nVulnerabilities: Storing Passwords in a Recoverable Format, Relative Path Traversal, Improper Restriction of Communication Channel to Intended Endpoints\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSMA-18-058-01 Medtronic 2090 CareLink Programmer Vulnerabilities (Update B) that was published October 11, 2018, ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker with physical access to a 2090 Programmer to obtain per-product credentials to the software deployment network. These credentials grant access to the software deployment network, but access is limited to read-only versions of device software applications. \nAdditionally, successful exploitation of these vulnerabilities may allow an attacker with local network access to influence communications between the Programmer and the software deployment network. \nAdditional product security review revealed potential for an attacker to remotely exploit a subset of these vulnerabilities. The SessionSync and RemoteView features associated with the affected products are not affected by the vulnerabilities reported in this advisory.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of the Medtronic CareLink 2090 Programmer, a device used by trained personnel at hospitals and clinics to program and manage Medtronic cardiac devices, are affected: \n\n2090 CareLink Programmer, all versions\n29901 Encore Programmer, all versions\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    STORING PASSWORDS IN A RECOVERABLE FORMAT CWE-257\nThe affected product uses a per-product username and password that is stored in a recoverable format. \nCVE-2018-5446 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:C/C:H/I:N/A:N).\n4.2.2    RELATIVE PATH TRAVERSAL CWE-23\nThe affected product’s software deployment network contains a directory traversal vulnerability that could allow an attacker to read files on the system. \nCVE-2018-5448 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N).\n4.2.3    IMPROPER RESTRICTION OF COMMUNICATION CHANNEL TO INTENDED ENDPOINTS CWE-923\nThe affected product uses a virtual private network connection to securely download updates. The product does not verify it is still connected to this virtual private network before downloading updates. The affected products initially establish an encapsulated IP-based VPN connection to a Medtronic-hosted update network. Once the VPN is established, it makes a request to a HTTP (non-TLS) server across the VPN for updates, which responds and provides any available updates. The programmer-side (client) service responsible for this HTTP request does not check to ensure it is still connected to the VPN before making the HTTP request. Thus, an attacker could cause the VPN connection to terminate (through various methods and attack points) and intercept the HTTP request, responding with malicious updates via a man-in-the-middle attack. The affected products do not verify the origin or integrity of these updates, as it insufficiently relied on the security of the VPN. An attacker with remote network access to the programmer could influence these communications.\nCVE-2018-10596 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is. (AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n4.4 RESEARCHER\nResearchers Billy Rios and Jonathan Butts of Whitescope LLC identified these vulnerabilities and reported them to CISA.\n5. MITIGATIONS\nMedtronic has assessed the vulnerabilities and determined that no new potential safety risks were identified. In order to enhance system security, Medtronic has added periodic integrity checks for files associated with the software deployment network. Additionally, Medtronic has developed server-side security changes that further enhance security. Medtronic reports that they will not be issuing a product update; however, Medtronic has identified compensating controls within this advisory to reduce the risk of exploitation and reiterates the following from the CareLink 2090 Programmer Reference Manual:\n\nMaintain good physical controls over the programmer. Having a secure physical environment prevents access to the internals of the programmer.\nOnly connect the programmer to managed, secure networks.\nUpdate the software on the programmer when Medtronic updates are available.\nAlternatively, disconnect the programmer from the network. Network connectivity is not required for normal programmer operation. \nOffline updates are available, contact your Medtronic representative for more information.\n\n--------- Begin Update C Part 1 of 1 --------\nMedtronic has deployed mitigating patches to address the reported vulnerabilities. Medtronic has also stated that they have increased security controls associated with these vulnerabilities. As a result of the available mitigating patches, Medtronic has re-enabled the network-based software update mechanism.\nMedtronic has stated that the patch for affected products can be obtained by contacting Medtronic Technical Services at 800‑638‑1991.\n--------- End Update C Part 1 of 1 --------\nAfter additional review and risk evaluation of the affected products, Medtronic has disabled the network-based software update mechanism, including both the VPN and the HTTP subservices, as an immediate security mitigation. Users should not attempt to update the affected products over the network as this update mechanism is vulnerable to the attack described in section 4.2.3. Medtronic will continue to implement and deploy increased security protections and mitigations to address the vulnerabilities in this advisory.\nUsers should still obtain and apply updates via controlled USB dongles and should contact their Medtronic representative for more information.\nMedtronic recommends that affected products continue to be used for their intended purpose in the previously described manner.\nMedtronic has released a security bulletin for the 2090 CareLink Programmer.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThese vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-10596",
    "CVE-2018-5448",
    "CVE-2018-5446"
  ],
  "techniques": [],
  "advisory": "icsma-18-058-01",
  "title": "Medtronic 2090 Carelink Programmer Vulnerabilities (Update C) | CISA",
  "source": "ics-medical-advisories",
  "id": "76f49902b3bff1a58b872d87312b99681a2c4871056c1900fbd34ababdb88073"
}