{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.6\nATTENTION: Exploitable with adjacent access/low skill level to exploit \nVendor: BIOTRONIK\nEquipment: CardioMessenger II-S T-Line, CardioMessenger II-S GSM\nVulnerabilities: Improper Authentication, Cleartext Transmission of Sensitive Information, Missing Encryption of Sensitive Data, Storing Passwords in a Recoverable Format\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker with physical access to the CardioMessenger to obtain sensitive data, obtain transmitted medical data from implanted cardiac devices with the implant’s serial number or impact Cardio Messenger II product functionality. Successful exploitation of these vulnerabilities could allow an attacker with adjacent access to influence communications between the Home Monitoring Unit (HMU) and the Access Point Name (APN) gateway network. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the CardioMessenger II, a home monitoring unit, are affected:\n\nCardioMessenger II-S T-Line T4APP 2.20\nCardioMessenger II-S GSM T4APP 2.20\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER AUTHENTICATION CWE-287\nThe affected products do not properly enforce mutual authentication with the BIOTRONIK Remote Communication infrastructure.  \nCVE-2019-18246 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.2    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe affected products transmit credentials in cleartext prior to switching to an encrypted communication channel. An attacker can disclose the product’s client credentials for connecting to the BIOTRONIK Remote Communication infrastructure. \nCVE-2019-18248 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.3    IMPROPER AUTHENTICATION CWE-287\nThe affected products allow credential reuse for multiple authentication purposes. An attacker with adjacent access to the CardioMessenger can disclose its credentials used for connecting to the BIOTRONIK Remote Communication infrastructure.\nCVE-2019-18252 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.2.4    MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nThe affected products do not encrypt sensitive information while at rest. An attacker with physical access to the CardioMessenger can disclose medical measurement data and the serial number from the implanted cardiac device the CardioMessenger is paired with.\nCVE-2019-18254 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.5    STORING PASSWORDS IN A RECOVERABLE FORMAT CWE-257\nThe affected products use individual per-device credentials that are stored in a recoverable format. An attacker with physical access to the CardioMessenger can use these credentials for network authentication and decryption of local data in transit.\nCVE-2019-18256 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Germany\n\n3.4 RESEARCHER\nGuillaume Bour, Anniken Wium Lie, and Marie Moe reported these vulnerabilities to CISA.\n4. MITIGATIONS\nBIOTRONIK reports they will not be issuing a product security update; however, BIOTRONIK has identified compensating controls which have been put place that reduce the risk of exploitation and prevent patient safety risks. BIOTRONIK assessed these vulnerabilities and determined no new potential safety risks exist.\nBIOTRONIK recommends users take the following defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMaintain good physical control over home monitoring units.\nUse only home monitoring units obtained directly from a trusted healthcare provider or a BIOTRONIK representative to ensure integrity of the system.\nReport any concerning behavior regarding these products to your healthcare provider or a BIOTRONIK representative.\n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nWhere feasible, users with concerns about the cybersecurity of their current medical devices should contact their healthcare provider or a BIOTRONIK professional. \nDo not connect unapproved devices to the home monitoring unit by any network or physical connections.\nOnly use the home monitoring units in private controlled environments such as a home, apartment, or otherwise physically controlled environment.\nRestrict system access to authorized personnel only.\nFollow proper disposal procedures of the home monitoring unit for the continued protection sensitive data.\nIn cases where additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-18248",
    "CVE-2019-18252",
    "CVE-2019-18246",
    "CVE-2019-18256",
    "CVE-2019-18254"
  ],
  "techniques": [],
  "advisory": "icsma-20-170-05",
  "title": "BIOTRONIK CardioMessenger II | CISA",
  "source": "ics-medical-advisories",
  "id": "c86d651a7ba40eb68b0f83aea5e3ca59251002ef89b090fea2ddf93fba115afa"
}