{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 5.9\n\nATTENTION: Exploitable remotely/public exploits are available\nVendor: Philips\nEquipment: EncoreAnywhere product used in the Asia-Pacific (APAC) Region\nVulnerability: Information Exposure\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability can result in unencrypted communication and potential improper disclosure of sensitive data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the EncoreAnywhere APAC product, a hosted web application, are affected:\n\nVersion 2.36.3.3 or prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   INFORMATION EXPOSURE CSW-200\nThe HTTP header contains data an attacker may be able to use to gain sensitive information.\nCVE-2018-8863 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Healthcare and Public Health\nCountries/Areas Deployed: Asia-Pacific\nCompany Headquarters Location: Netherlands\n\n3.4 RESEARCHER\nPhilips reported this vulnerability to NCCIC.\n4. MITIGATIONS\nPhilips has identified and put in place mitigations to reduce the risk of exploitation of this vulnerability. They continue to assess additional mitigations and a full implementation and documentation will be available by September 2018.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpages in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nThis vulnerability is exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-8863"
  ],
  "techniques": [],
  "advisory": "icsma-18-137-02",
  "title": "Philips EncoreAnywhere | CISA",
  "source": "ics-advisories",
  "id": "ca7f3fc116f25e0163074e72f1ee300eb88f69f360d7c824aaca9ba925617e51"
}