{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low attack complexity \nVendor: Becton, Dickinson and Company (BD) \nEquipment: Alaris Infusion Central \n\n--------- Begin Update A part 1 of 2 ---------\n\nVulnerability: Storing Passwords in a Recoverable Format\n\n--------- End Update A part 1 of 2 ---------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-23-047-01 BD Alaris Infusion Central that was published February 16, 2023, to the ICS webpage on www.cisa.gov/uscert. \n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to obtain the database installation password and gain access to the Alaris Infusion Central database, resulting in disclosure of resident personal data. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following BD software products are affected: \n\nAlaris Infusion Central software versions 1.1 to 1.3.2, which are not sold in the U.S. \n\nUsers who use BD Alaris PCU 8015 or BD Alaris Systems Manager are not impacted by this vulnerability. \n\n\n\n4.2 VULNERABILITY OVERVIEW\n--------- Begin Update A part 2 of 2 ---------\n4.2.1 STORING PASSWORDS IN A RECOVERABLE FORMAT CWE-257 \n--------- End Update A part 2 of 2 ---------\nAlaris Infusion Central versions 1.1–1.3.2 may contain a recoverable password after installation, which could allow an attacker to disclose or tamper with resident personal data. Patient health data is not stored in the database, although some side installations may choose to store personal data. \nCVE-2022-47376 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L). \n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: Deployed outside the U.S. \nCOMPANY HEADQUARTERS LOCATION: United States \n\n4.4 RESEARCHER\nBD reported this vulnerability to CISA. \n5. MITIGATIONS\nBD is directly reaching out to the small group of customers who may be impacted by this vulnerability to initiate remediation.  \nBD recommends the following mitigations and compensating controls to reduce risk associated with this vulnerability: \n\nChange passwords periodically per best security practice. \nEnsure physical access controls are in place; only authorized administrators should have access to the Alaris Infusion Central server. \n\nFor additional information, refer to BD’s security bulletin.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2022-47376"
  ],
  "techniques": [],
  "advisory": "icsma-23-047-01",
  "title": "BD Alaris Infusion Central (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "9c766f7d4eeb3e882bc672d58ec9e150c8a45b04547e2b7010f3578192383128"
}