{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Fujifilm\nEquipment: FCR Capsula X/Carbon X\nVulnerabilities: Uncontrolled Resource Consumption, Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could result in a denial-of-service condition in affected cassette reader units, causing potential image loss or device unavailability. Attackers could gain unauthorized access to the underlying operating system, allowing arbitrary code execution.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following models and versions of Fujifilm Computed Radiography cassette readers are affected:\n\nCR-IR 357 FCR Carbon X\nCR-IR 357 FCR XC-2\nCR-IR 357 FCR Capsula X\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nThe device is susceptible to a denial-of-service condition as a result of an overflow of TCP packets, which requires the device to be manually rebooted.\nCVE-2019-10948 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.2.2    IMPROPER ACCESS CONTROL CWE-284\nThe device provides insecure telnet services that lack authentication requirements. An attacker who successfully exploits this vulnerability may be able to access the underlying operating system.\nCVE-2019-10950 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Japan\n\n3.4 RESEARCHER\nMarc Ruef and Rocco Gagliardi of Scip AG reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nFujifilm has stated the CR-IR 357 system can be configured with what they call Secure Host functionality. This configuration of the software instructs CR-IR 357 to ignore all network traffic other than from the IP address of the Fujifilm image acquisition console. However, this configuration prevents more than one image acquisition console to share the CR-IR 357 Reader Unit. If the user has not implemented Reader Unit sharing, they may contact Fujifilm to request Secure Host functionality be enabled. If the user has implemented Reader Unit sharing, they should contact Fujifilm to discuss available options. Fujifilm can be contacted at 888-FUJI-MED (888-385-4633). Users outside the United States should contact their Fujifilm contact.\nFujifilm recommends that the first line of defense should be a compensating control of securing the user’s network. Measures should be taken to ensure only authorized devices and personnel have access to the network. Public or guest networks should be segmented, or users should use a VLAN to segregate public traffic from the private network. Administrative and technical controls should also be implemented.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all medical devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate medical systems and networks and remote devices behind firewalls, and isolate them from the business network.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA at the following location:\n\nhttps://www.fda.gov/MedicalDevices/DigitalHealth/ucm373213.htm\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-10948",
    "CVE-2019-10950"
  ],
  "techniques": [],
  "advisory": "icsma-19-113-01",
  "title": "Fujifilm FCR Capsula X/Carbon X | CISA",
  "source": "ics-medical-advisories",
  "id": "30f8a2137a46d1e4991bdf33b49911fc0ae4da56db36b2c8515d2ef9a49c733c"
}