{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.4\nATTENTION: Low skill level to exploit\nVendor: Philips\n\n--------- Begin Update A Part 1 of 3 ----------\n\nEquipment: Brilliance CT Scanners and MX8000 Dual EXP\n\n--------- End Update A Part 1 of 3 ----------\n\nVulnerabilities: Execution with Unnecessary Privileges, Exposure of Resource to Wrong Sphere, Use of Hard-coded Credentials\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-18-123-01 Philips’ Brilliance Computed Tomography (CT) System that was published May 3, 2018, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker to attain elevated privileges and access unauthorized system resources, including access to execute software or to view/update files including patient health information (PHI), directories, or system configuration. This could impact system confidentiality, system integrity, or system availability. Philips has received no reports of exploitation or incidents from clinical associated with these vulnerabilities.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n\nPhilips reports the vulnerabilities affect the following Brilliance CT Scanners:\nBrilliance 64 Versions 2.6.2 and below\nBrilliance iCT Versions 4.1.6 and below\nBrilliance iCT SP Versions 3.2.4 and below\nBrilliance CT Big Bore Versions 2.3.5 and below\n\n--------- Begin Update A Part 2 of 3 ----------\n\nMX8000 Dual EXP Systems (CVE-2018-8857 only)\n\n--------- End Update A Part 2 of 3 ----------\n4.2 VULNERABILITY OVERVIEW\n4.2.1   EXECUTION WITH UNNECESSARY PRIVILEGES CWE-250\nPhilips Brilliance CT devices operate user functions from within a contained kiosk in a Microsoft Windows operating system. Windows boots by default with elevated Windows privileges, enabling a kiosk application, user, or an attacker to potentially attain unauthorized elevated privileges. Also, attackers may gain access to unauthorized resources from the underlying Windows operating system.\nCVE-2018-8853 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:L).\n4.2.2   EXPOSURE OF RESOURCE TO WRONG SPHERE CWE-668\nVulnerabilities within the Brilliance CT kiosk environment could enable a limited-access kiosk user or an unauthorized attacker to break-out from the containment of the kiosk environment, attain elevated privileges from the underlying Windows OS, and access unauthorized resources from the operating system.\nCVE-2018-8861 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:L/A:L).\n4.2.3   USE OF HARD-CODED CREDENTIALS CWE-798\nThe software contains fixed credentials, such as a password or cryptographic key, which it uses for its own inbound authentication, outbound communication to external components, or encryption of internal data. An attacker could compromise these credentials and gain access to the system.\nCVE-2018-8857 has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.3 BACKGROUND\n\nCritical Infrastructure Sectors: Healthcare and public Health\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: U.S.\n\n4.4 RESEARCHER\nPhilips reported these vulnerabilities to NCCIC.\n5. MITIGATIONS\nPhilips has identified the following guidance and controlling risk mitigations:\n\nUsers should operate all Philips deployed and supported Brilliance CT products within Philips authorized specifications, including Philips approved software, software configuration, system services, and security configuration such as firewall operations.\nPhilips also recommends users implement a comprehensive, multi-layered strategy to protect their systems from internal and external security threats, including restricting physical access of the scanner to only authorized personnel, thus reducing the risk of physical access being compromised by an unauthorized user.\n\nPhilips has also remediated hard-coded credential vulnerabilities for Brilliance iCT 4.x and above versions. The Philips iCT-iPatient (v4.x) family Instructions for Use (IFU) refers to the ability to manage credentials and is accessible to entitled users from the Philips InCenter.\n--------- Begin Update A Part 3 of 3 --------\nAs the MX8000 Dual EXP has been out of support since 2017, Philips recommends a replacement based on user need. Please contact a local sales organization.\nPhilips will be further assessing options for remediation with future product introductions and/or upgrades across the CT & AMI modalities to address identified security vulnerabilities. Users with questions about their specific Brilliance CT or MX8000 Dual EXP products should contact a Philips service support team.\n--------- End Update A Part 3 of 3 --------\nThe Philips’ advisory is available at the following URL:\nhttp://www.philips.com/productsecurity (link is external)\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should follow these measures:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\nLocate medical devices behind firewalls, and isolate them from the business network.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-8853",
    "CVE-2018-8857",
    "CVE-2018-8861"
  ],
  "techniques": [],
  "advisory": "icsma-18-123-01",
  "title": "Philips Brilliance Computed Tomography (CT) System (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "d0736ace32048e37abeb529c8be981c015669219717a6fe6147b1526a0bf7b6e"
}