{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.5\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: BeaconMedaes\nEquipment: TotalAlert Scroll Medical Air Systems web application\nVulnerabilities: Improper Access Control, Insufficiently Protected Credentials, Unprotected Storage of Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to view and potentially modify some device information and web application setup information, which does not include access to patient health information. Additionally, BeaconMedaes has stated that a successful attacker would not be able to affect the ability of the device to operate as designed for the purpose of delivering medical air in compliance with the NFPA 99 standard for healthcare facilities.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following TotalAlert Scroll Medical Air Systems web applications are affected:\n\nTotalAlert Scroll Medical Air Systems running software Versions 4107600010.23 and prior.\n\n3.2 VULNERABILITY OVERVIEW\n\n3.2.1   IMPROPER ACCESS CONTROL CWE-284\nBy accessing a specific uniform resource locator (URL) on the webserver, a malicious user may be able to access information in the application without authenticating.  \nCVE-2018-7526 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n\n3.2.2   INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nAn attacker with network access to the integrated web server could retrieve default or user defined credentials stored and transmitted in an insecure manner.\nCVE-2018-7518 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.2.3   UNPROTECTED STORAGE OF CREDENTIALS CWE-256\nPasswords are presented in plaintext in a file that is accessible without authentication.\nCVE-2018-7510 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Healthcare and Public Health\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: U.S.\n\n3.4 RESEARCHER\nMaxim Rupp reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nBeaconMedaes has stated that the vulnerabilities do not compromise either patient health information or compliance with the NFPA 99 standard for healthcare facilities. To address these vulnerabilities, BeaconMedaes has created update 4107600010.24 and recommends that users of the TotalAlert Scroll Medical Air Systems update to this version or the latest release. BeaconMedaes recommends that affected users reach out to BeaconMedaes directly at 1-888-4MEDGAS (463-3427) to obtain this update.\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-7510",
    "CVE-2018-7526",
    "CVE-2018-7518"
  ],
  "techniques": [],
  "advisory": "icsma-18-144-01",
  "title": "BeaconMedaes TotalAlert Scroll Medical Air Systems | CISA",
  "source": "ics-medical-advisories",
  "id": "cfad7a2bd14b10eed75ef4b27f73ca560e3eaf810780d458c65ff90f066b9959"
}