{
  "markdown": "\nOVERVIEW\nPhilips reported an insufficient session expiration vulnerability in the Philips’ IntelliSpace Cardiovascular cardiac image and information management systems. Philips is creating a software update to mitigate this vulnerability in the affected products.\nAFFECTED PRODUCTS\nPhilips reports that the vulnerability affects the following versions of the IntelliSpace Cardiovascular:\n\nIntelliSpace Cardiovascular, Version 2.3.0 and prior.\n\nIMPACT\nSuccessful exploitation of this vulnerability could allow an attacker to gain unauthorized access to sensitive information stored on the system and modify this information.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC recommends that organizations evaluate the impact of this vulnerability based on their operational environment and specific clinical usage. \nBACKGROUND\nPhilips is a global company that maintains offices in many countries around the world, including countries in Africa, Asia, Europe, Latin America, the Middle East, and North America.\nThe Philips IntelliSpace Cardiovascular (ISCV) is both a comprehensive cardiac image and information management system.\nAccording to Philips, ISCV cardiac image and information management systems are deployed across the Healthcare and Public Health sector. Philips estimates this product is used worldwide.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nINSUFFICIENT SESSION EXPIRATION CWE-613\n\nThe ISCV application has an insufficient session expiration vulnerability where an attacker could reuse the session of a previously logged in user. This vulnerability exists when using ISCV together with an Electronic Medical Record (EMR) system, where ISCV is in KIOSK mode for multiple users and using Windows authentication. This may allow an attacker to gain unauthorized access to patient health information and potentially modify this information.\nCVE-2018-5438 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 have been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:L/A:N).\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is exploitable via local access.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability. \nDIFFICULTY\nAn attacker with a low skill level would be able to exploit this vulnerability.\nMITIGATION\nPhilips is adding an additional configuration option to ISCV 3.1. The option to not use Windows authentication when communicating with an EMR in KIOSK mode will become available in this release. Philips is in the process of releasing this version in the coming months.\nUsers with questions regarding their specific IntelliSpace Cardiovascular installations are advised by Philips to contact their local Philips service support team or their regional service support. Philips’ contact information is available at the following location:\nhttp://www.usa.philips.com/healthcare/solutions/customer-service-solutions (link is external)\nPlease see the Philips product security web site for the latest security information for Philips products:\nhttps://www.philips.com/productsecurity (link is external)\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all medical devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate all medical devices and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2018-5438"
  ],
  "techniques": [],
  "advisory": "icsma-18-025-01",
  "title": "Philips IntelliSpace Cardiovascular System Vulnerability | CISA",
  "source": "ics-medical-advisories",
  "id": "802453d79e78f8ba609af2ede3c999a59351b32b374126c18994bb9f88972aff"
}