{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 9.8\n\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: Qualcomm Life\nEquipment: Capsule Datacaptor Terminal Server (DTS)\nVulnerability: Code Weakness\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to execute unauthorized code to obtain administrator-level privileges on the device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Capsule Datacaptor Terminal Server (DTS), part of a medical device information system, are affected:\n\nAllegro RomPager embedded web server versions 4.01 through 4.34 included in Capsule DTS, all versions affected.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    CODE CWE-17\nThis vulnerability allows an attacker to send a specially crafted HTTP cookie to the web management portal to write arbitrary data to the device memory, which may allow remote code execution.\nCVE-2014-9222 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nElad Luz of CyberMDX reported this vulnerability to NCCIC.\n4. MITIGATIONS\nQualcomm Life reports this vulnerability does not affect any other Capsule Technologies products.\nCapsule Technologies has released a firmware update to remediate this vulnerability on the “Single Board” version of the DTS, which was originally released in 2009. Capsule Technologies strongly urges all users with a Single Board version of the DTS to download the firmware from Capsule’s customer portal and apply it to the affected devices following standard patching processes. Access to the customer portal can be found at the following location:\nhttps://customers.capsuletech.com\nDue to technical limitations, the firmware update will remediate only the Single Board version of the DTS, and will NOT remediate these other versions of DTS:\n\nDual Board\nCapsule Digi Connect ES converted to DTS\nCapsule Digi Connect ES\n\nCapsule recommends that users with any of these three versions of DTS disable the embedded webserver to mitigate the vulnerability. The webserver is only utilized for configuration during the initial deployment and is not necessary for continued remote support of the device.\nAdditional information regarding the affected versions of the embedded Allegro RomPager webserver included in Capsule DTS can be found at the following locations:\nhttps://www.allegrosoft.com/allegro-software-urges-manufacturers-to-maintain-firmware-for-highest-level-of-embedded-device-security/news-press.html\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2014-9222"
  ],
  "techniques": [],
  "advisory": "icsma-18-240-01",
  "title": "Qualcomm Life Capsule | CISA",
  "source": "ics-medical-advisories",
  "id": "d08485a45348881115bac594cffd0a23527b19930585e5b32148d56dc2992bb7"
}