{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.8\nATTENTION: Low skill level to exploit\nVendor: Change Healthcare\nEquipment: Change Healthcare Cardiology, Horizon Cardiology, McKesson Cardiology \nVulnerability: Incorrect Default Permissions\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow a locally authenticated user to insert specially crafted files that could result in arbitrary code execution. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Change Healthcare Cardiology Devices, are affected:\n\nHorizon Cardiology 11.x and earlier\nHorizon Cardiology 12.x\nMcKesson Cardiology 13.x\nMcKesson Cardiology 14. x   \nChange Healthcare Cardiology 14.1.x\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    INCORRECT DEFAULT PERMISSIONS CWE-276\nInsecure file permissions in the default installation may allow an attacker with local system access to execute unauthorized arbitrary code.\nCVE-2018-18630 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: United States \n\n3.4 RESEARCHER\nAlfonso Powers and Bradley Shubin of Asante Information Security reported this vulnerability to Change Healthcare. \n4. MITIGATIONS\nChange Healthcare recommends users of the affected versions contact Change Healthcare Support as soon as possible to arrange installation of the supplied patch; To contact Change Healthcare Support please call: \n\nU.S./Canada 1-877-654-4366 \nInternational Toll Free – 972-37698000 ext. 1 \n\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems.\nLocate medical devices behind firewalls and isolate them where possible.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable any unnecessary accounts, protocols and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA at the following location:\n\nhttps://www.fda.gov/MedicalDevices/DigitalHealth/ucm373213.htm \nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nCISA also recommends that users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open unsolicited attachments in email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2018-18630"
  ],
  "techniques": [],
  "advisory": "icsma-19-241-01",
  "title": "Change Healthcare McKesson and Horizon Cardiology | CISA",
  "source": "ics-medical-advisories",
  "id": "b123de1b507cfe4e6ee41fc6281b10952445d1abdd03423b2ca2829f0c0bfcac"
}