{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.4\nATTENTION: Low attack complexity \nVendor: Medtronic \nEquipment: Micros Clinician (A51200) app and InterStim X Clinician (A51300) app \nVulnerabilities: Unverified Password Change \n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could cause the clinician application’s custom password to be reset to default, resulting in unauthorized control of the clinician therapy application. \n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Medtronic Clinician App are affected: \n\nMicro Clinician (A51200) \nInterStim X Clinician (A51300) \n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 UNVERIFIED PASSWORD CHANGE CWE-620 \nMedtronic Clinician (A51200) and InterStim X Clinicain App (A51300) contain a vulnerability that exists under certain reset conditions, which could cause the clinician application’s custom password to be reset to a default password. This could result in unauthorized control of the clinician therapy application, which has greater control over therapy parameters than the patient app. Changes still cannot be made outside of the established therapy parameters of the programmer. To gain unauthorized access, an individual would need physical access to the Smart Programmer. \nCVE-2023-25931 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H). \n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: Worldwide \nCOMPANY HEADQUARTERS LOCATION: Ireland \n\n3.4 RESEARCHER\nMedtronic reported this vulnerability to CISA. \n4. MITIGATIONS\nThe following mitigations have been provided by Medtronic: \n\nAn app update is available as of February 23, 2023 that will fix the vulnerability. \nUsers should refer to the Medtronic Security Bulletin for the correct Medtronic Support contact for help updating the app.  \n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks: \n\nDo not click web links or open attachments in unsolicited email messages. \nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. \nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. \n\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely. \n",
  "cves": [
    "CVE-2023-25931"
  ],
  "techniques": [],
  "advisory": "icsma-23-061-01",
  "title": "Medtronic Micro Clinician and InterStim Apps | CISA",
  "source": "ics-medical-advisories",
  "id": "1661864775c55c418b2794e1c8cbbe5e621c000a56cbf88d86d785791e7c065a"
}