{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 3.0\nATTENTION: Public exploits are available/exploitable from within the same local subnet\nVendor: Philips\nEquipment: HDI 4000 Ultrasound Systems\nVulnerability: Use of Obsolete Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could lead to exposure of ultrasound images (breaches of confidentiality) and compromised image integrity. The vulnerability does not affect patient safety or systems operations (availability).\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Philips HDI 4000 Ultrasound Systems, a diagnostic ultrasound system, are affected:\n\nAll versions running on old, unsupported operating systems such as Windows 2000.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF OBSOLETE FUNCTION CWE-477\nThe HDI 4000 Ultrasound System is built on an old operating system that is no longer supported. Thus, any unmitigated vulnerability in the old operating system could be exploited to affect this product.\nCVE-2019-10988 has been assigned to this vulnerability. A CVSS v3 base score of 3.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:U/C:L/I:L/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nCheck Point reported this vulnerability to Philips.\n4. MITIGATIONS\nUsers should implement controls to limit access to the network and consider replacing the system with a newer technology and supported operating system.\nPlease see the Philips product security website for the latest security information for Philips products:\nhttps://www.philips.com/productsecurity\nThe support life cycle for the Philips HDI 4000 Ultrasound system ended on December 31, 2013. As such, these devices are no longer sold, updated, or supported by Philips.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\n\nWhere additional information is needed, follow this link to existing cybersecurity in medical device guidance issued by the FDA.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nHigh skill level is needed to exploit.\n",
  "cves": [
    "CVE-2019-10988"
  ],
  "techniques": [],
  "advisory": "icsma-19-241-02",
  "title": "Philips HDI 4000 Ultrasound | CISA",
  "source": "ics-medical-advisories",
  "id": "dd1743db0aa74db5035fdf26484a0ff854068b06d65953f0481a66b33635dc6e"
}