{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.2\nATTENTION: Low attack complexity\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Alaris PCU, Guardrails Editor, Systems Manager, Calculation Services, CQI Reporter\nVulnerabilities: Insufficient Verification of Data Authenticity, Missing Authentication for Critical Function, Improper Verification of Cryptographic Signature, Missing Support for Integrity Check, Cross-site Scripting, Cleartext Transmission of Sensitive Information, Improper Restriction of XML External Entity Reference\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to compromise sensitive data, hijack a session, modify firmware, make changes to system configurations, among other system impacts.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of BD Alaris system products are affected:\n\nBD Alaris Point-of-Care Unit (PCU) Model 8015: Versions 12.1.3 and prior\nBD Alaris Guardrails Editor: Versions 12.1.2 and prior\nBD Alaris Systems Manager: Versions 12.3 and prior\nCQI Reporter: v10.17 and prior\nCalculation Services: Versions 1.0 and prior\n\n3.2 Vulnerability Overview\n3.2.1 IMPROPER INPUT VALIDATION CWE-20\nIn BD Alaris Point-of-Care Unit (PCU) Model 8015 v12.1.3 and prior, the firmware update package for the wireless card is not properly signed and can be modified.\nCVE-2023-30559 has been assigned to this vulnerability. A CVSS v3 base score of 5.2 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:H).\n3.2.2 IMPROPER AUTHENTICATION CWE-287\nIn BD Alaris Point-of-Care Unit (PCU) Model 8015 v12.1.3 and prior, the configuration from the PCU can be modified without authentication using physical connection to the PCU.\nCVE-2023-30560 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.3 MISSING ENCRYPTION OF SENSITIVE DATA CWE-311\nIn BD Alaris Point-of-Care Unit (PCU) Model 8015 v12.1.3 and prior, the data flowing between the PCU and its modules is insecure. A threat actor with physical access could read or modify data by attaching a specially crafted device while an infusion is running.\nCVE-2023-30561 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H).\n3.2.4 INSUFFICIENT VERIFICATION OF DATA AUTHENTICITY CWE-345\nBD Alaris Guardrails Editor (GRE) v12.1.2 and prior has a GRE dataset file within Systems Manager that can be tampered with and distributed to the PCUs.\nCVE-2023-30562 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:R/S:U/C:N/I:H/A:H).\n3.2.5 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nIn the BD Alaris Systems Manager (SM) v12.3 and prior, a malicious file could be uploaded into a System Manager User Import Function resulting in a hijacked session.\nCVE-2023-30563 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:L/A:N).\n3.2.6 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nBD Alaris Systems Manager (SM) v12.3 and prior does not perform input validation during the Device Import Function.\nCVE-2023-30564 has been assigned to this vulnerability. A CVSS v3 base score of 6.9 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:R/S:C/C:H/I:L/A:N).\n3.2.7 CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nAn insecure connection between Systems Manager and CQI Reporter v10.17 application could expose infusion data to an attacker.\nCVE-2023-30565 has been assigned to this vulnerability. A CVSS v3 base score of 3.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n3.2.8 IMPROPER RESTRICTION OF XML EXTERNAL ENTITY REFERENCE CWE-611\nA lack of input validation within Apache Log4Net (due to an outdated software version) could allow a threat actor to execute malicious commands.\nCVE-2018-1285 has been assigned to this vulnerability. A CVSS v3 base score of 3.0 has been calculated; the CVSS vector string is (AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare, Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBD reported these vulnerabilities to CISA.\n4. MITIGATIONS\nBD has releaed BD Alaris System 12.3 with the following software, which remediates CVE-2018-1285, CVE 2023-30563, CVE 2023-30564, and CVE-2023-30565 and partially remediates CVE 2023-30562:\n\nBD Alaris Systems Manager Software version 12.5.1\nCalculation Services, version 1.1.1\n\nBD Alaris System 12.3 is no longer compatible with the CQI Reporter version 10.17 and earlier. Therefore CVE-2023-30565 no longer applies.\nBD Alaris System 12.3, which includes BD Alaris Guardrails Editor version 12.1.3, partially remediates CVE-2023-30562 and reduces the CVSS score from 6.7 (Medium) to 3.0 (Low). Additional information is provided under Vulnerability Details. For additional information is please reference the updated CVSS vector string provided: CVSS:3.1/AV:A/AC:L/PR:L/UI:R/S:U/C:N/I:L/A:N\nBD recommends customers update to the BD Alaris System 12.3, where available based on regulatory authorization. Customers who require software updates should contact their BD Account Executive to assist with scheduling the remediation.\nBD also updated the BD Alaris PCU Model 8015 to version 12.3.1 when the BD Alaris System 12.3 was released. The following CVEs are still present on the BD Alaris PCU Model 8015 version 12.3.1: CVE-2023-30559, CVE-2023-30560, and CVE-2023-30561. This bulletin will be updated with additional remediation information when available.\nFor additional information, customers may request a copy of the latest BD Alaris System Product Security White Paper by visiting the BD Cybersecurity Trust Center.\nTo reduce the risk associated with these vulnerabilities, BD recommends users implement the following mitigations and compensating controls:\nProvide appropriate network perimeter security, such as using firewalls, or create Access Control Lists (ACL) to limit network traffic from devices to only the required ports on the required endpoints.\n\nThe PCU only requires access to DNS, dynamic host configuration protocol (DHCP) and SM on port 3613. The PCU does not accept unsolicited inbound traffic.\n\n\nBD recommends segmenting BD Alaris PCUs onto a separate virtual local area network (VLAN) to further enhance the security of BD Alaris PCUs.\n\nUsers should control network access to the SM server image by restricting external access to only those addresses and ports indicated in Chapter 1 of the SM Virtual Machine Deployment Guide.\n\nUsers should apply SSL certificates from valid Certificate Authorities, per Chapter 9 of the same document.\n\nFollow Chapter 1 of the Alaris System Maintenance Software User Manual to enable an authentication challenge password for network configuration changes.\nSee the Network Settings section of the Alaris System Maintenance User Manual for details on how to manage these credentials.\n\nNetwork Settings in the Alaris System Maintenance User Manual details managing these credentials.\nMonitor network traffic for unusual or unexpected traffic and activity. If users suspect credentials have been exposed, change credentials immediately.\n\nUtilize MAC filtering on the network segment containing the BD Alaris System to restrict access to only those approved devices needed.\nPeriodically inspect BD Alaris System components to ensure running the correct software versions.\n\nUse the instructions in Chapter 4 of the SM User Manual or Section 6.2.10 of the BD Alaris PCU and Pump Module Technical Service Manual to find software versions.\n\nAdhere to industry security best practices regarding access control, identification and authorization, personnel security, and physical protection of assets, as recommended by NIST SP 800-171 Rev. 2.\nInspect the BD Alaris System prior to use for signs of tampering as indicated in the FIPS 140-2 Compliance Instructions for BD Alaris System Products Service Manual.\nFor more information, refer to BD's security bulletin.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nCISA also recommends users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open attachments in unsolicited email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJuly 13, 2023: Initial Publication\nOctober 26, 2023: Updates to Mitigations (BD has released BD Alaris System 12.3, which remediates CVE-2018-1285, CVE 2023-30563, CVE 2023-30564, and CVE-2023-30565 and partially remediates CVE 2023-30562)\n\n",
  "cves": [
    "CVE-2023-30560",
    "CVE-2023-30564",
    "CVE-2023-30565",
    "CVE-2023-30561",
    "CVE-2018-1285",
    "CVE-2023-30562",
    "CVE-2023-30559",
    "CVE-2023-30563"
  ],
  "techniques": [],
  "advisory": "icsma-23-194-01",
  "title": "BD Alaris System with Guardrails Suite MX (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "5cf666ae617555f9f89453f37da475706d6474308e68a06977bafefb2ce6bdc6"
}