{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.3\nATTENTION: Exploitable remotely\nVendor: Philips\nEquipment: SureSigns VS4\nVulnerabilities: Improper Input Validation, Improper Access Control, Improper Authentication\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker access to administrative controls and system configurations, which could allow changes to system configuration items causing patient data to be sent to a remote destination.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of SureSigns VS4, a vital signs patient monitor, are affected:\n\nSureSigns VS4 A.07.107 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe product receives input or data, but it does not validate or incorrectly validates that the input has the properties required to process the data safely and correctly.\nCVE-2020-16237 has been assigned to this vulnerability. A CVSS v3 base score of 2.1 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:L).\n\n3.2.2    IMPROPER ACCESS CONTROL CWE-284\nThe software does not restrict or incorrectly restricts access to a resource from an unauthorized actor.\nCVE-2020-16241 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:C/C:L/I:L/A:H).\n\n3.2.3    IMPROPER AUTHENTICATION CWE-287\nWhen an actor claims to have a given identity, the software does not prove or insufficiently proves the claim is correct.\nCVE-2020-16239 has been assigned to this vulnerability. A CVSS v3 base score of 4.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nCleveland Clinic reported these vulnerabilities to Philips.\n4. MITIGATIONS\nAs a mitigation to these vulnerabilities, Philips recommends users change all system passwords on the SureSigns VS4 with unique passwords for each device and secure the device when not in use to prevent unauthorized access, as referenced in the Installation and Configuration Guide available on Incenter. Philips also recommends users consider replacing the SureSigns VS4 device with a newer technology.\n\nUsers with questions regarding specific SureSigns VS4 patient monitor installations and upgrade options should contact Philips service support or regional service support or call 1-800-722-9377.\n\nPlease see the Philips advisory for vulnerabilities discussed in this disclosure, and visit the Philips product security website for the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nImplement physical security measures to limit or control access to critical systems.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. Low skill level is needed to exploit.\n",
  "cves": [
    "CVE-2020-16237",
    "CVE-2020-16239",
    "CVE-2020-16241"
  ],
  "techniques": [],
  "advisory": "icsma-20-233-01",
  "title": "Philips SureSigns VS4 | CISA",
  "source": "ics-medical-advisories",
  "id": "e253c562ee92898452a8f73fb868a02833b628cf1e4d2fcf2ec470503cde57b4"
}