{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.4\nVendor: Medtronic \nEquipment: MyCareLink Patient Monitor\nVulnerabilities: Use of Hard-coded Password, Exposed Dangerous Method or Function\n\n2. RISK EVALUATION\nIf exploited, these vulnerabilities may allow privileged access to the monitor’s operating system. However, physical access to the MyCareLink monitor is required. Additionally, these vulnerabilities may allow a MyCareLink monitor, when operated within close physical proximity of an implantable cardiac device, to read and write arbitrary memory values of that device.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following MyCareLink Monitors are affected:\n\n24950 MyCareLink Monitor, all versions,\n24952 MyCareLink Monitor, all versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED PASSWORD CWE-259\nThe affected product contains a hard-coded operating system password. An attacker with physical access can remove the case of the device, connect to the debug port, and use the password to gain privileged access to the operating system\nCVE-2018-8870 has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been assigned; the CVSS vector string is (AV:P/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.2.2    EXPOSED DANGEROUS METHOD OR FUNCTION CWE-749\nThe affected product contains debug code meant to test the functionality of the monitor’s communication interfaces, including the interface between the monitor and implantable cardiac device. An attacker with physical access to the device can apply the other vulnerabilities within this advisory to access this debug functionality. \nThis debug functionality provides the ability to read and write arbitrary memory values to implantable cardiac devices via inductive or short range wireless protocols. An attacker with close physical proximity to a target implantable cardiac device can use this debug functionality.\nCVE-2018-8868 has been assigned to this vulnerability. A CVSS v3 base score of 6.2 has been assigned; the CVSS vector string is (AV:P/AC:H/PR:L/UI:N/S:C/C:H/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Dublin, Ireland\n\n3.4 RESEARCHER\nPeter Morgan of Clever Security reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nMedtronic will release several rolling over-the-air product updates that will mitigate the vulnerabilities described within this advisory. These updates will be applied to devices automatically as part of standard, reoccurring update processes. In addition, Medtronic has increased security monitoring of affected devices and related infrastructure. \nMedtronic recommends users take additional defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMaintain good physical controls over the home monitor as the best mitigation to these vulnerabilities.  \nOnly use home monitors obtained directly from their healthcare provider or a Medtronic representative to ensure integrity of the system. \nReport any concerning behavior regarding their home monitor to their healthcare provider or a Medtronic representative. \n\nMedtronic has released additional patient focused information, at the following location:\nhttps://www.medtronic.com/security\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2018-8868",
    "CVE-2018-8870"
  ],
  "techniques": [],
  "advisory": "icsma-18-179-01",
  "title": "Medtronic MyCareLink Patient Monitor | CISA",
  "source": "ics-medical-advisories",
  "id": "5d97258e6a863ca0c94d4c2a924af0113b295a657b05be8e8422dd705d2fdd82"
}