{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 8.3\n\nATTENTION: Exploitable with adjacent access/low skill level to exploit\n\n--------- Begin Update A Part 1 of 3 --------\n\nVendor: Roche Diagnostics \nEquipment: Accu-Chek Inform II, CoaguChek Pro II/XS Plus/XS Pro, cobas h 232 POC handheld medical devices\n\n--------- End Update A Part 1 of 3 --------\n\nEquipment: Point of Care handheld medical devices\nVulnerabilities: Improper Authentication, OS Command Injection, Unrestricted Upload of File with Dangerous Type, Improper Access Control\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-18-310-01 Roche Point of Care Handheld Medical Devices that was published November 6, 2018 on the NCCIC/ICS-CERT website. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker to gain unauthorized access to modify system settings or execute arbitrary code. \n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\n--------- Begin Update A Part 2 of 3 --------\nThe following versions of Roche Diagnostics handheld medical devices are affected:\n--------- End Update A Part 2 of 3 --------\n\nAccu-Chek Inform II\nCoaguChek Pro II\nCoaguChek XS Plus\nCoaguChek XS Pro\ncobas h 232 POC\nIncluding the related base units (BU), base unit hubs and handheld base units (HBU).\n\nAccu-Chek Units Not affected:\n\nAccu-Chek Inform II Base Unit Light\nAccu-Chek Inform II Base Unit NEW with Software 04.00.00 or newer\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHENTICATION CWE-287\nWeak access credentials may enable attackers in the adjacent network to gain unauthorized service access via a service interface.\nCVE-2018-18561 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N).\nAffected products:\n\nAccu-Chek Inform II Base Unit / Base Unit Hub – all versions before 03.01.04\nCoaguChek / cobas h232 Handheld Base Unit – all versions before 03.01.04\n\n4.2.2    IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78\nInsecure permissions in a service interface may allow authenticated attackers in the adjacent network to execute arbitrary commands on the operating systems.\nCVE-2018-18562 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:H).\nAffected products:\n\nAccu-Chek Inform II Base Unit / Base Unit Hub – all versions before 03.01.04\nCoaguChek / cobas h232 Handheld Base Unit – all versions before 03.01.04\n\n4.2.3    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nA vulnerability in the software update mechanism allows an attacker in adjacent network to overwrite arbitrary files on the system through a crafted update package. \nCVE-2018-18563 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:H).\nAffected products:\nAccu-Chek Inform II Instrument – all versions before 03.06.00 (serial number below 14000) / 04.03.00 (serial Number above 14000)\n\nCoaguChek Pro II – all versions before 04.03.00\nCoaguChek XS Plus – all versions before 03.01.06\nCoaguChek XS Pro – all versions before 03.01.06\ncobas h 232 – all versions before 03.01.03 (serial number below KQ0400000 or KS0400000)\ncobas h 232 – all versions before 04.00.04 (serial number above KQ0400000 or KS0400000)\n\n4.2.4    IMPROPER ACCESS CONTROL CWE-284\nImproper access control to a service command allows attackers in the adjacent network to execute arbitrary code on the system through a crafted message.\nCVE-2018-18564 has been assigned to this vulnerability. A CVSS v3 base score of 8.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).\nAffected Products: \n\nAccu-Chek Inform II Instrument – all versions before 03.06.00 (Serial number below 14000) / 04.03.00 (Serial Number above 14000)\nCoaguChek Pro II – all versions before 04.03.00\ncobas h 232 – all versions before 04.00.04 (Serial number above KQ0400000 or KS0400000)\n\n4.2.5    IMPROPER ACCESS CONTROL CWE-284\nImproper access control allows attackers in the adjacent network to change the instrument configuration.\nCVE-2018-18565 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:C/C:H/I:L/A:H).\nAffected products:\n\nAccu-Chek Inform II Instrument – all versions before 03.06.00 (Serial number below 14000) / 04.03.00 (Serial Number above 14000)\nCoaguChek Pro II – all versions before 04.03.00\nCoaguChek XS Plus – all versions before 03.01.06\nCoaguChek XS Pro – all versions before 03.01.06\ncobas h 232 – all versions before 03.01.03 (Serial number below KQ0400000 or KS0400000)\ncobas h 232 – all versions before 04.00.04 (Serial number above KQ0400000 or KS0400000)\n\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide \n\n--------- Begin Update A Part 3 of 3 --------\n\nCOMPANY HEADQUARTERS LOCATION: Switzerland \n\n--------- End Update A Part 3 of 3 --------\n4.4 RESEARCHER\nNiv Yehezkel of Medigate reported these vulnerabilities to Roche.\n5. MITIGATIONS\nRoche recommends the following mitigation procedures for connected devices (Ethernet and Wi-Fi):\n\nRestrict network and physical access to the device and attached infrastructure by enabling the device security features.\nProtect connected endpoints from unauthorized access, theft, and malicious software.\nMonitor the system and network infrastructure for suspicious activity and report a suspected compromise according to local policy. \n\nFor non-connected devices:\n\nProtect from unauthorized access, theft and manipulation.\n\nFor all affected products, Roche Diagnostic has scheduled release of new software updates with availability beginning November 2018.\nFor further information or concerns, please contact a local Roche Diagnostics office at the following location: \nhttps://www.roche.com/about/business/roche_worldwide.htm\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2018-18562",
    "CVE-2018-18565",
    "CVE-2018-18561",
    "CVE-2018-18564",
    "CVE-2018-18563"
  ],
  "techniques": [],
  "advisory": "icsma-18-310-01",
  "title": "Roche Diagnostics Point of Care Handheld Medical Devices (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "dc399a2d2995d41d5c5d25163a94dd6120c16e2da94b0c9833c6fffbd92700f8"
}