{
  "markdown": " BD Kiestra and InoquIA Systems (Update A) \\| CISA A A ( Lock ) or[\\#protect2024](/protect2024)  Search Menu Close[Faith\\-Based Community](/audiences/faith-based-community) [High\\-Risk Communities](/audiences/high-risk-communities)* Resources \\& Tools[Resources \\& Tools](/resources-tools) [All Resources \\& Tools](/resources-tools/all-resources-tools)* News \\& Events[News \\& Events](/news-events) [Cybersecurity Alerts \\& Advisories](/news-events/cybersecurity-advisories)[Benefits \\& Perks](/careers/benefits-perks)[Resume \\& Application Tips](/careers/resume-application-tips)[Students \\& Recent Graduates](/students-recent-graduates-employment-opportunities)[Divisions \\& Offices](/about/divisions-offices)[\\#protect2024](/protect2024) 2. [News \\& Events](/news-events)4. [ICS Medical Advisory](/news-events/cybersecurity-advisories?f%5B0%5D=advisory_type%3A96) ICS Medical AdvisoryBD Kiestra and InoquIA Systems (Update A)========================================= Last Revised October 11, 2018 Alert Code ICSMA\\-18\\-142\\-011\\. EXECUTIVE SUMMARY---------------------* **CVSS v3 6\\.3*** **ATTENTION**  : Exploitable from adjacent network* **Vendor**  : Becton, Dickinson and Company (BD)* **Equipment**  : BD Kiestra and InoqulA systems* **Vulnerabilities**  : Product UI does not Warn User of Unsafe Actions2\\. UPDATE INFORMATION---------------------- This updated advisory is a follow\\-up to the original advisory titled ICSMA\\-18\\-142\\-01 BD Kiestra and InoquIA Systems that was published May 22, 2018, on the NCCIC/ICS\\-CERT website.3\\. RISK EVALUATION------------------- Successful exploitation of these vulnerabilities may lead to loss or corruption of data.4\\. TECHNICAL DETAILS---------------------### 4\\.1 AFFECTED PRODUCTS BD reports these vulnerabilities affect applications used by the following BD Kiestra systems:* BD Kiestra TLA,* BD Kiestra WCA, and* BD InoqulA\\+ specimen processor. All three BD Kiestra systems listed above use the following vulnerable applications:* Database (DB) Manager, Version 3\\.0\\.1\\.0,* ReadA Overview, Version 1\\.1\\.0\\.2 and previous, and* PerformA, Version 3\\.0\\.0\\.0 and previous versions.### 4\\.2 VULNERABILITY OVERVIEW### 4\\.2\\.1 [PRODUCT UI DOES NOT WARN USER OF UNSAFE ACTIONS CWE\\-356](https://cwe.mitre.org/data/definitions/356.html) A vulnerability in DB Manager and PerformA allows an authorized user with access to a privileged account on a BD Kiestra system to issue SQL commands, which may result in data corruption.[CVE\\-2018\\-10593](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2018-10593)  has been assigned to this vulnerability. A CVSS v3 base score of 5\\.6 has been calculated; the CVSS vector string is ( [AV:A/AC:H/PR:H/UI:R/S:U/C:N/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:H/PR:H/UI:R/S:U/C:N/I:H/A:H)  ).### 4\\.3\\.2 [PRODUCT UI DOES NOT WARN USER OF UNSAFE ACTIONS CWE\\-356](https://cwe.mitre.org/data/definitions/356.html) A vulnerability in ReadA allows an authorized user with access to a privileged account on a BD Kiestra system to issue SQL commands, which may result in loss or corruption of data.[CVE\\-2018\\-10595](http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2018-10595)  has been assigned to this vulnerability. A CVSS v3 base score of 6\\.3 has been calculated; the CVSS vector string is ( [AV:A/AC:H/PR:H/UI:R/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.0#CVSS:3.0/AV:A/AC:H/PR:H/UI:R/S:U/C:H/I:H/A:H)  ).### 4\\.3 BACKGROUND* **Critical Infrastructure Sectors:**  Healthcare and Public Health* **Countries/Areas Deployed:**  Worldwide* **Company Headquarters Location:**  United States### 4\\.4 RESEARCHER BD discovered these vulnerabilities and reported them to NCCIC.5\\. MITIGATIONS---------------**\\-\\-\\-\\-\\-\\-\\-\\-\\- Begin Update A Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-**  BD has developed a mitigation to prevent authorized users with access to a privileged account on a BD Kiestra system from triggering SQL functions. This mitigation also remediates a limited set of ePHI patient data that can be exposed when a privileged user executes a select SQL statement in the ReadA Overview. BD is in the process of deploying the mitigation remotely or on premise, depending on user preference.**\\-\\-\\-\\-\\-\\-\\-\\-\\- End Update A Part 1 of 1 \\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**  Until mitigations are in place, BD recommends the following compensating controls. These controls require user action in order to reduce risk associated with these vulnerabilities:* DB Manager:\t+ BD Kiestra Laboratory personnel should refrain from using the functionality associated SQL functions in all three BD Kiestra Systems: BD Kiestra TLA, BD Kiestra WCA and BD InoqulA\\+ specimen processor. When configuring new programs through the ‘Configuring Programs’ function in DB Manager, it is advised not to re\\-use current programs through the export\\-import function, but to set up a new program or use the predefined program templates. Please refer to the users manuals for more information.\t+ Ensure only authorized and qualified personnel, such as lab managers and/or lab supervisors, have access control rights to all functions in the DB Manager. This can be configured through the ‘Users’ function in DB Manager. For details about setting the appropriate user access control in DB Manager, consult the respective device manual.* ReadA Overview: Users are advised to set the ‘Users’ function for all users to ‘none’ for access to ReadA Overview, if the application is not used or not commonly used. This can be configured through the ‘Users’ function in DB Manager. If use of ReadA Overview is necessary, users are advised to ensure only authorized and qualified personnel, such as lab managers and/or lab supervisors, have access control rights to all functions in ReadA Overview. This can be configured through the ‘Users’ function in DB Manager. For details about setting the appropriate user access control in DB Manager, consult the respective device manual.* PerformA: Users are advised to ensure access to BD Kiestra servers are closely monitored while continuing to implement best security practices to effectively prevent unauthorized access to BD Kiestra Systems. For product support or site\\-specific concerns, users in North America may contact Lab Automation Regional Phone Support via email [lab\\_automation\\_phone\\_support@bd.com](mailto:lab_automation_phone_support@bd.com)  or by phone (1\\-800\\-638\\-8663\\). Users in EMEA may contact Customer Service Desk via email [csd@bd.com](mailto:csd@bd.com)  or by phone (\\+31 512 540 623\\). For more specific details regarding these vulnerabilities, the associated mitigations, and links to user manuals, please see the BD Product Security Bulletin at the following location:[https://www.bd.com/en\\-us/support/product\\-security\\-and\\-privacy](https://www.bd.com/en-us/support/product-security-and-privacy)  NCCIC recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:* Minimize network exposure for all control system devices and/or systems, and ensure that they are [not accessible from the Internet](/ics/alerts/ICS-ALERT-10-301-01)  .* Locate control system networks and remote devices behind firewalls, and isolate them from the business network.* When remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. NCCIC also provides a section for [control systems security recommended practices](/ics/content/recommended-practices)  on the ICS\\-CERT web page. Several recommended practices are available for reading and download, including [Improving Industrial Control Systems Cybersecurity with Defense\\-in\\-Depth Strategies](/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)  . Additional mitigation guidance and recommended practices are publicly available on the [ICS\\-CERT website](/ics/)  in the Technical Information Paper, [ICS\\-TIP\\-12\\-146\\-01B\\-\\-Targeted Cyber Intrusion Detection and Mitigation Strategies](/ics/tips/ICS-TIP-12-146-01B)  . Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents. NCCIC also recommends that users take the following measures to protect themselves from social engineering attacks:* Do not click web links or open unsolicited attachments in email messages.* Refer to [Recognizing and Avoiding Email Scams](/reading_room/emailscams_0905.pdf)  for more information on avoiding email scams.* Refer to [Avoiding Social Engineering and Phishing Attacks](/cas/tips/ST04-014.html)  for more information on social engineering attacks. No known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely. High skill level is needed to exploit. This product is provided subject to this [Notification](/notification \"Follow link\")  and this [Privacy \\& Use](/privacy-policy \"Follow link\")  policy.Vendor------* Becton, Dickinson and Company (BD)-------------------------- [product survey](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://www.cisa.gov/news-events/ics-medical-advisories/icsma-18-142-01)  ; Related Advisories------------------ Jul 18, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-200\\-01### [Philips Vue PACS](/news-events/ics-medical-advisories/icsma-24-200-01) Jun 11, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-163\\-01### [MicroDicom DICOM Viewer](/news-events/ics-medical-advisories/icsma-24-163-01) May 30, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-151\\-02### [Baxter Welch Allyn Connex Spot Monitor](/news-events/ics-medical-advisories/icsma-24-151-02) May 30, 2024 ICS Medical Advisory \\| ICSMA\\-24\\-151\\-01### [Baxter Welch Allyn Configuration Tool](/news-events/ics-medical-advisories/icsma-24-151-01)* [Resources \\& Tools](/resources-tools)* [News \\& Events](/news-events)[Cybersecurity \\& Infrastructure Security Agency](/ \"Go to the Cybersecurity & Infrastructure Security Agency homepage\")[1\\-844\\-Say\\-CISA](tel:1-844-Say-CISA) * [Equal Opportunity \\& Accessibility](/oedia \"Equal Opportunity & Accessibility\")",
  "cves": [
    "CVE-2018-10595",
    "CVE-2018-10593"
  ],
  "techniques": [],
  "advisory": "icsma-18-142-01",
  "title": "BD Kiestra and InoquIA Systems (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "8480f5c6673336423aeca21de17be826abc61154bb174dda36f3bcf85ef8f38a"
}