{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 2.4\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: Gemini PET/CT Family\nVulnerability: Storage of Sensitive Data in a Mechanism Without Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability involving removable media could allow access to sensitive information (including patient information).\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPhilips reports the vulnerability affects the following Gemini PET/CT products:\n\n882300 Gemini 16 Slice\n882160 Gemini Dual\n882400 Gemini GXL 10 Slice\n882390 Gemini GXL 6 Slice\n882410 Gemini GXL 16 Slice\n882412 GEMINI LXL\n882473 Gemini TF Ready\n882470 Gemini TF 16 w/ TOF Performance\n882471 Gemini TF 64 w/ TOF Performance\n882476 Gemini TF Big Bore\n882438 TruFlight Select PET/CT\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    STORAGE OF SENSITIVE DATA IN A MECHANISM WITHOUT ACCESS CONTROL CWE-921\nThe software stores sensitive information in a removable media device that does not have built-in access control.\nCVE-2021-27456 has been assigned to this vulnerability. A CVSS v3 base score of 2.4 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nJean GEORGE – CHU UCL Namur – Nuclear medicine department reported this vulnerability to Philips.\n4. MITIGATIONS\nPhilips has identified the following guidance and mitigations:\n\nUsers should operate all Philips deployed and supported Gemini PET/CT systems within Philips authorized specifications, including Philips approved software, software configuration, system services, and security configuration.\nPhilips also recommends users implement a comprehensive, multi-layered strategy to protect systems from internal and external security threats, including restricting physical access of the scanner and removable media to only authorized personnel to reduce the risk of physical access by an unauthorized user.\nPatient health related information recorded on removable media may become accessible to unauthorized individuals despite the application of the anonymize function, which could create a security risk.\n\nUsers with questions regarding their specific installations of the Gemini PET/CT Family should contact a Philips service support team. Philips contact information is available at https://www.usa.philips.com/healthcare/solutions/customer-service-solutions or 1-800-722-9377\nThe Philips advisory is available. Please see the Philips product security website for the latest security information for Philips products. \n \nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2021-27456"
  ],
  "techniques": [],
  "advisory": "icsma-21-084-01",
  "title": "Philips Gemini PET/CT Family | CISA",
  "source": "ics-medical-advisories",
  "id": "09bb3d12b97593bd08e0328105cf0df73d1f8fa17847beeb4ea2cb98907792af"
}