{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 8.0\nATTENTION: Low attack complexity\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Viper LT\nVulnerability: Use of Hard-coded Credentials\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker to access, modify, or delete sensitive information.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of BD Viper LT, an automated molecular testing system, are affected:\n\nBD Viper LT system: All Versions 2.0 and later\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    USE OF HARD-CODED CREDENTIALS CWE-798\nThe affected product is vulnerable due to the use of hard-coded credentials, which may allow a threat actor to access, modify, or delete sensitive information including electronic protected health information (ePHI), protected health information (PHI), and personally identifiable information (PII).\nCVE-2022-22765 has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBD voluntarily reported this vulnerability to CISA.\n4. MITIGATIONS\nBD is working to remediate the hard-coded credentials vulnerability in the BD Viper LT system and is providing this information to increase awareness. The fix is expected in an upcoming BD Viper LT system Version 4.80 software release.\nAdditionally, BD recommends the following compensating controls for users of the BD Viper LT systems that utilize hard-coded credentials:\n\nEnsure physical access controls are in place and only authorized end-users have access to the BD Viper LT system.\nDisconnect the BD Viper LT system from network access, where applicable.\nIf the BD Viper LT system must be connected to a network, ensure industry standard network security policies and procedures are followed.\n\nFor more information on this issue, please see the associated BD product security bulletin on the BD website.\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2022-22765"
  ],
  "techniques": [],
  "advisory": "icsma-22-062-02",
  "title": "BD Viper LT | CISA",
  "source": "ics-medical-advisories",
  "id": "e4633376d55ba1ec784a92ec7208304a1bf09fab6f4e5c0e3aff2bcd31cf617b"
}