{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 4.8\nATTENTION: Exploitable from an adjacent network\nVendor: Medtronic\nEquipment: MiniMed 600 Series Insulin Pumps\nVulnerability: Protection Mechanism Failure\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an unauthorized user to deliver too much or too little insulin through delivery of an unintended insulin bolus or because insulin delivery is slowed or stopped.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Medtronic NGP 600 Series Insulin Pumps and accessory components are affected:\n\nMiniMed 620G: MMT-1710\nMiniMed 630G: MMT-1715, MMT-1754, MMT-1755\nMiniMed 640G: MMT-1711, MMT-1712, MMT-1751, MMT-1752\nMiniMed 670G: MMT-1740, MMT-1741, MMT-1742, MMT-1760, MMT-1762, MMT-1762, MMT-1780, MMT-1781, MMT-1782\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PROTECTION MECHANISM FAILURE CWE-693\nA vulnerability exists which could allow an unauthorized user to learn aspects of the communication protocol used to pair system components while the pump is being paired with other system components. Exploitation requires nearby wireless signal proximity with the patient and the device; advanced technical knowledge is required for exploitation.\nCVE-2022-32537 has been assigned to this vulnerability. A CVSS v3 base score of 4.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:N/S:U/C:N/I:H/A:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nMedtronic internally identified and reported this vulnerability to CISA.\n4. MITIGATIONS\nMedtronic recommends users to take the following actions:\n\nTurn off the \"Remote Bolus\" feature on the pump.\nOnly connect or link devices in a private place.\n\nNote: Turning off the remote bolus feature will ensure no remote bolus is possible.\nMedtronic has identified the following precautions to assist users:\n\nEnsure the pump and connected system components are always controlled by an authorized user.\nBe attentive to pump notifications, alarms, and alerts. \nImmediately cancel any boluses not initiated by authorized personnel; monitor blood glucose levels closely and reach out to Medtronic 24-Hour Technical Support to report the bolus. \nDisconnect the USB device from the computer when not downloading pump data. \nUsers should not confirm remote connection requests or any other remote action on the pump screen unless it is initiated by authorized care personnel.   \nAvoid sharing pump or device serial numbers with anyone other than the healthcare provider, distributors, and Medtronic.\nUsers should not accept, calibrate, or bolus using a blood glucose reading not initiated by authorized care personnel.  \nUsers should not connect to or allow any third-party devices to connect to the pump\nDo not use software not authorized by Medtronic as being safe for use with the pump. \nMedtronic advises patients experiencing symptoms of severe hypoglycemia or diabetic ketoacidosis to seek immediate medical attention.\nUsers are encouraged to reach out to Medtronic 24-Hour Technical Support (1-800-646-4633) if they suspect a pump setting or insulin delivery have changed unexpectedly, without proper knowledge.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability has a high attack complexity.\n",
  "cves": [
    "CVE-2022-32537"
  ],
  "techniques": [],
  "advisory": "icsma-22-263-01",
  "title": "Medtronic NGP 600 Series Insulin Pumps | CISA",
  "source": "ics-medical-advisories",
  "id": "837eb969d86288f3f588b7ae3cd0c9beee031710183cab60ea47dd3691cf46d0"
}