{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.8\n\nATTENTION: Public exploits are available.\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Certain BD Pyxis Products\nVulnerability: Reusing a Nonce\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow data traffic manipulation, resulting in partial disclosure of encrypted communication or injection of data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of BD Pyxis products, a medication and supply management system, are affected:\n\nBD Pyxis Anesthesia ES,\nBD Pyxis Anesthesia System 4000,\nBD Pyxis Anesthesia System 3500,\nBD Pyxis MedStation 4000 T2,\nBD Pyxis MedStation ES,\nBD Pyxis SupplyStation,\nBD Pyxis Supply Roller,\nBD Pyxis ParAssist System,\nBD Pyxis PARx,\nBD Pyxis CIISafe – Workstation,\nBD Pyxis StockStation System, and\nBD Pyxis Parx handheld\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1   REUSING A NONCE, KEY PAIR IN ENCRYPTION CWE-323\nAn industry-wide vulnerability exists in the WPA and WPA2 protocol affected by the Key Reinstallation Attacks known as KRACK. The four-way hand shake traffic in the Wi-Fi Protected Access WPA and WPA2 protocol can be manipulated to allow nonce reuse resulting in key reinstallation. This could allow an attacker to execute a “man-in-the-middle” attack, enabling the attacker within radio range to replay, decrypt, or spoof frames.\nThe following CVEs have been assigned to this group of vulnerabilities:\nCVE-2017-13077: Reinstallation of the pairwise key during the four-way handshake.\nCVE-2017-13078: Reinstallation of the group key during the four-way handshake.\nCVE-2017-13079: Reinstallation of the Integrity Group Temporal Key (IGTK) during the four-way handshake.\nCVE-2017-13080: Reinstallation of the group key during the group key handshake.\nCVE-2017-13081: Reinstallation of the IGTK during the group key handshake.\nCVE-2017-13082: Reinstallation of the Pairwise Transient Key (PTK) Temporal Key (TK) during the fast BSS transmission (FT) handshake.\nCVE-2017-13086: Reinstallation of the Tunneled Direct-Link Setup (TDLS) Peer Key (TPK) during the TDLS handshake.\nCVE-2017-13087: Reinstallation of the Group Temporal Key (GTK) when processing a Wireless Network Management (WNM) Sleep Mode Response frame.\nCVE-2017-13088: Reinstallation of the IGTK when processing a WNM Sleep Mode Response frame.\nA CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N).\n3.3 BACKGROUND\n\nCritical Infrastructure Sectors: Healthcare and Public Health\nCountries/Areas Deployed: Worldwide\nCompany Headquarters Location: New Jersey\n\n3.4 RESEARCHER\nMathy Vanhoef of imec-DistriNet, KU Leuven discovered the KRACK vulnerabilities. BD reported to NCCIC that the KRACK vulnerabilities may possibly affect these products.\n4. MITIGATIONS\nBD has implemented third-party vendor patches through BD's routine patch deployment process that resolves these vulnerabilities for most devices. Some devices require coordination with BD. BD is in the process of contacting users to schedule and deploy patches. There is currently no reported verified instance of the KRACK vulnerability being exploited maliciously against BD devices.\nAdditionally, BD recommends the following compensating controls in order to reduce risk associated with this vulnerability:\n\nEnsure the latest recommended updates for Wi-Fi access points have been implemented in Wi-Fi enabled networks\nEnsure appropriate physical controls are in place to prevent attackers from being within physical range of an affected Wi-Fi access point and client\nEnsure data has been backed up and stored according to individual processes and disaster recovery procedures\n\nBD has published a product security bulletin to notify users about this issue and to provide additional mitigation counsel.  It can be found at the following location on their web page:\nhttp://www.bd.com/en-us/support/product-security-and-privacy/product-security-bulletin-for-wpa2-krack-wi-fi-vulnerability\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available in the ICS-CERT Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT website.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nThese vulnerabilities have been publicly disclosed. These vulnerabilities are exploitable from an adjacent network. High skill level is needed to exploit.\n",
  "cves": [
    "CVE-2017-13088",
    "CVE-2017-13081",
    "CVE-2017-13082",
    "CVE-2017-13078",
    "CVE-2017-13079",
    "CVE-2017-13080",
    "CVE-2017-13077",
    "CVE-2017-13086",
    "CVE-2017-13087"
  ],
  "techniques": [],
  "advisory": "icsma-18-114-01",
  "title": "BD Pyxis | CISA",
  "source": "ics-medical-advisories",
  "id": "c3e8c6c10eab79532b8189a471d8386b7ef108d3f02abec03d6b13dc9b1b0ef1"
}