{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Medtronic\nEquipment: Paceart Optima System\nVulnerability: Deserialization of Untrusted Data\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability could result in remote code execution or a denial-of-service condition impacting a healthcare delivery organization’s Paceart Optima system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Medtronic products are affected: \n\nPaceart Optima: Versions 1.11 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nIf a healthcare delivery organization has enabled the optional Paceart Messaging Service in the Paceart Optima system, an unauthorized user could exploit this vulnerability to perform remote code execution and/or denial-of-service (DoS) attacks by sending specially crafted messages to the Paceart Optima system. Remote code execution could result in the deletion, theft, or modification of Paceart Optima system’s cardiac device data, or use of the Paceart Optima system for further network penetration. A DoS attack could cause the Paceart Optima system to slow or be unresponsive.\nCVE-2023-31222 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Ireland\n\n3.4 RESEARCHER\nMedtronic reported this vulnerability to CISA.\n4. MITIGATIONS\nMedtronic recommends updating the Paceart Optima system to v1.12. Contact Medtronic to schedule the update. \nMedtronic has provided some immediate mitigations that users can apply to mitigate the risk. If running a combined Application and Integration Server, contact Medtronic Paceart Optima System technical support for immediate mitigation actions. For all other configurations, Medtronic recommends the following steps: \n\n\nManually disable the Paceart Messaging Service on the Application Server. \n\n\n\nOpen the “Windows Services” application.\nFind the ‘Paceart Messaging Service’\nRight-click the “Paceart Messaging Service” and select “Properties.”\nSelect “Stop” to stop running the service and change the startup type to “Disabled.”\nSelect ”Apply.”\n\n\n\nManually disable message queuing on the Application Server. \n\n\n\nOpen server manager.\nSelect “Add roles and features.”\nSelect “Start the Remove Roles and Features Wizard.”\nBefore you begin–next.\nServer selection–next.\nServer roles–next.\nFeatures section–take action. Select the black box next to Message Queuing.\nWhen the window pops up select the “Remove Features” button.\nSelect “next.”\nConfirmation–select “Remove.”\n\nAs long as the Paceart Messaging Service remains disabled, the vulnerability will remain mitigated. \nPlease refer to Medtronic’s security bulletin for more information.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from business networks.\nWhen remote access is required, use secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage at cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2023-31222"
  ],
  "techniques": [],
  "advisory": "icsma-23-180-01",
  "title": "Medtronic Paceart Optima System | CISA",
  "source": "ics-medical-advisories",
  "id": "c4de488cb419a721bd534f30b459a59b0040e484ac750295b71f6acc0f856223"
}