{
  "markdown": "\nOVERVIEW\nIndependent researcher Mark Cross (@xerubus) has identified an uncontrolled search path element vulnerability in Vyaire Medical’s CareFusion Upgrade Utility application. Vyaire Medical has produced an update that mitigates this vulnerability.\nAFFECTED PRODUCTS\nThe following versions of CareFusion Upgrade Utility, designed to upgrade compatible units to the latest software versions, are affected:\n\nCareFusion Upgrade Utility used with Windows XP systems, Versions 2.0.2.2 and prior versions.\n\nIMPACT\nSuccessful exploitation of this vulnerability may allow an attacker to insert a malicious DLL on the target system and run arbitrary code.\nImpact to individual organizations depends on many factors that are unique to each organization. NCCIC recommends that organizations evaluate the impact of this vulnerability based on their operational environment and specific clinical usage.\nBACKGROUND\nVyaire Medical is a U.S.-based company.\nThe affected product, CareFusion Upgrade Utility, is designed to upgrade compatible units to the latest software versions. According to Vyaire Medical, CareFusion Upgrade Utility is deployed across the Healthcare and Public Health sector. Vyaire Medical estimates these products are used primarily in the United States and Europe, with a small percentage in Asia.\nVULNERABILITY CHARACTERIZATION\nVULNERABILITY OVERVIEW\n\nUNCONTROLLED SEARCH PATH ELEMENT CWE-427\n\nA successful exploit of this vulnerability requires the local user to install a crafted DLL on the target machine. The application loads the DLL and gives the attacker access at the same privilege level as the application.\nCVE-2018-5457 has been assigned to this vulnerability. A CVSS v3 base score of 6.7 has been assigned; the CVSS vector string is (AV:L/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H).\nVULNERABILITY DETAILS\nEXPLOITABILITY\nThis vulnerability is not remotely exploitable.\nEXISTENCE OF EXPLOIT\nNo known public exploits specifically target this vulnerability.\nDIFFICULTY\nHigh skill level is needed to exploit.\nMITIGATION\nVyaire Medical is no longer supporting the CareFusion Upgrade Utility v2.0.2.2 and recommends that users upgrade to the newer Vyaire Upgrade Utility v2.0.3.0. This updated Upgrade Utility will not install on Windows XP and will require updating the underlying system to Windows 7 or later.\nVyaire Medical has released a Product Security Bulletin, available at the following URL:\nhttps://www.vyaire.com/productsecurity\nThe Vyaire Upgrade Utility v2.0.3.0 update is available at the following URL:\nhttps://www.vyaire.com/us/our-products/respiratory-care/pulmonary-function-testing/spirometers/spirometry-software-and-firmware-downloads\nNCCIC recommends that users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nDo not upload and run untrusted files without verifying the integrity of the file.\nInteract with, and only obtain files, software, and software patches from trustworthy highly reputable sources.\nEnsure that employees with access to the CareFusion Upgrade Utility are fully aware of the ongoing potential for social engineering attacks and are trained to identify and avoid social engineering attacks.\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. NCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nAdditional mitigation guidance and recommended practices are publicly available in the NCCIC Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies, that is available for download from the ICS-CERT web site.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nIn addition, NCCIC recommends that users take the following measures to protect themselves from social engineering attacks:\n\nDo not click web links or open unsolicited attachments in email messages.\nRefer to Recognizing and Avoiding Email Scams for more information on avoiding email scams.\nRefer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks.\n\n",
  "cves": [
    "CVE-2018-5457"
  ],
  "techniques": [],
  "advisory": "icsma-18-037-01",
  "title": "Vyaire Medical CareFusion Upgrade Utility Vulnerability | CISA",
  "source": "ics-medical-advisories",
  "id": "8f487cb29afa1fef4a0c05c6a231a3e14712877e1978b6482de182dcd614f4d9"
}