{
  "markdown": "\nView CSAF\n1. EXECUTIVE SUMMARY\n\nCVSS v4 9.3\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Philips\nEquipment: Vue PACS\nVulnerabilities: Out-of-bounds Write, Deserialization of Untrusted Data, Uncontrolled Resource Consumption, Improper Privilege Management, Use of Default Credentials, Weak Password Requirements, Exposure of Sensitive Information to an Unauthorized Actor\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthorized person or process to eavesdrop, view or modify data, gain system access, perform code execution, install unauthorized software, or affect system data integrity to negatively impact system confidentiality, integrity, or availability.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following Philips products are affected:\n\nVue PACS: Versions prior to 12.2.8.410\n\n3.2 Vulnerability Overview\n3.2.1 OUT-OF-BOUNDS WRITE CWE-787\nA third-party product component writes data past the end, or before the beginning, of the intended buffer.\nCVE-2020-36518 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\nA CVSS v4 score has also been calculated for CVE-2020-36518. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.2.2 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA third-party product component deserializes untrusted data without sufficiently verifying that the resulting data will be valid.\nCVE-2020-11113 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2020-11113. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:P/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).\n3.2.3 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA third-party product component deserializes untrusted data without sufficiently verifying that the resulting data will be valid.\nCVE-2020-35728 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2020-35728. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.4 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA third-party product component deserializes untrusted data without sufficiently verifying that the resulting data will be valid.\nCVE-2021-20190 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2021-20190. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.5 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA third-party product component deserializes untrusted data without sufficiently verifying that the resulting data will be valid.\nCVE-2020-14061 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2020-14061. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.6 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA third-party product component deserializes untrusted data without sufficiently verifying that the resulting data will be valid.\nCVE-2020-10673 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2020-10673. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.7 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA third-party product component deserializes untrusted data without sufficiently verifying that the resulting data will be valid.\nCVE-2019-12814 has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N).\nA CVSS v4 score has also been calculated for CVE-2019-12814. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).\n3.2.8 DESERIALIZATION OF UNTRUSTED DATA CWE-502\nA third-party product component deserializes untrusted data without sufficiently verifying that the resulting data will be valid.\nCVE-2017-17485 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\nA CVSS v4 score has also been calculated for CVE-2017-17485. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).\n3.2.9 UNCONTROLLED RESOURCE CONSUMPTION CWE-400\nA third-party product component does not properly control the allocation and maintenance of CPU use upon receiving a large invalid packet frame.\nCVE-2021-28165 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\nA CVSS v4 score has also been calculated for CVE-2021-28165. A base score of 8.8 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N).\n3.2.10 IMPROPER PRIVILEGE MANAGEMENT CWE-269\nPhilips Vue PACS does not properly assign, modify, track, or check actor privileges, creating an unintended sphere of control for that actor.\nCVE-2023-40223 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:N).\nA CVSS v4 score has also been calculated for CVE-2023-40223. A base score of 4.8 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:L/VI:L/VA:N/SC:N/SI:N/SA:N).\n3.2.11 USE OF DEFAULT CREDENTIALS CWE-1392\nPhilips Vue PACS uses default credentials for potentially critical functionality.\nCVE-2023-40704 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2023-40704. A base score of 8.4 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N).\n3.2.12 WEAK PASSWORD REQUIREMENTS CWE-521\nPhilips Vue PACS does not require that users have strong passwords, which could make it easier for attackers to compromise user accounts.\nCVE-2023-40539 has been assigned to this vulnerability. A CVSS v3.1 base score of 4.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:N).\nA CVSS v4 score has also been calculated for CVE-2023-40539. A base score of 4.8 has been calculated; the CVSS vector string is (CVSS4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:L/VI:L/VA:N/SC:N/SI:N/SA:N).\n3.2.13 EXPOSURE OF SENSITIVE INFORMATION TO AN UNAUTHORIZED ACTOR CWE-200\nA validated user not explicitly authorized to have access to certain sensitive information could access Philips Vue PACS on the same network to expose that information.\nCVE-2023-40159 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:N).\nA CVSS v4 score has also been calculated for CVE-2023-40159. A base score of 8.8 has been calculated; the CVSS vector string is (CVSS4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:H/VA:N/SC:N/SI:N/SA:N).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nTAS Health NZ and Camiel van Es reported these vulnerabilities to Philips.\n4. MITIGATIONS\nPhilips recommends the following mitigations:\n\nFor vulnerabilities CVE-2020-36518, CVE-2020-11113, CVE-2020-35728, CVE-2021-20190, CVE-2020-14061, CVE-2020-10673, CVE-2019-12814, CVE-2017-17485, CVE-2023-40223, and CVE-2023-40159, Philips recommends upgrading to the latest Vue PACS version 12.2.8.400* released in August 2023.\nFor CVE-2021-28165, Philips recommends configuring the Vue PACS environment per D000763414 – Vue_PACS_12_Ports_Protocols_Services_Guide available on Incenter. Philips also recommends upgrading to the Vue PACS version 12.2.8.410* released in October 2023.\nFor CVE-2023-40704 and CVE-2023-40539, Philips recommends configuring the Vue PACS environment per 8G7607 – Vue PACS User Guide Rev G available on Incenter.\n\nFor managed services customers, new releases will be made available upon resource availability. Releases are subject to country specific regulations. Users with questions regarding their specific Philips Vue PACS installations and new release eligibility should contact their local Philips Sales representative or submit a request in the Philips Informatics Support portal.\nRefer to the Philips advisory for more details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as:\n\nMinimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet.\nLocate control system networks and remote devices behind firewalls and isolating them from business networks.\nWhen remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nCISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents.\nNo known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.\n5. UPDATE HISTORY\n\nJuly 18, 2024: Initial Publication\n\n",
  "cves": [
    "CVE-2020-36518",
    "CVE-2020-14061",
    "CVE-2021-20190",
    "CVE-2023-40539",
    "CVE-2023-40159",
    "CVE-2023-40704",
    "CVE-2020-11113",
    "CVE-2021-28165",
    "CVE-2023-40223",
    "CVE-2020-35728",
    "CVE-2017-17485",
    "CVE-2019-12814",
    "CVE-2020-10673"
  ],
  "techniques": [],
  "advisory": "icsma-24-200-01",
  "title": "Philips Vue PACS | CISA",
  "source": "ics-medical-advisories",
  "id": "dae92dd5128e074c6830e6fccac4f0fd35913a99d11ef8bc69bda5d76b3cbced"
}