{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.9\nATTENTION: Exploitable remotely/low attack complexity\nVendor: ZOLL\nEquipment: Defibrillator Dashboard\nVulnerabilities: Unrestricted Upload of File with Dangerous Type, Use of Hard-coded Cryptographic Key, Cleartext Storage of Sensitive Information, Cross-site Scripting, Storing Passwords in a Recoverable Format, Improper Privilege Management\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow remote code execution, allow an attacker to gain access to credentials, or impact confidentiality, integrity, and availability of the application.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of ZOLL Defibrillator Dashboard, a Defibrillator device management platform, are affected:\n\nDefibrillator Dashboard: All versions prior to 2.2\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    UNRESTRICTED UPLOAD OF FILE WITH DANGEROUS TYPE CWE-434\nThe web application allows a non-administrative user to upload a malicious file. This file could allow an attacker to remotely execute arbitrary commands.\nCVE-2021-27489 has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). \n3.2.2    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nThe affected products utilize an encryption key in the data exchange process, which is hardcoded. This could allow an attacker to gain access to sensitive information.\nCVE-2021-27481 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).\n3.2.3    CLEARTEXT STORAGE OF SENSITIVE INFORMATION CWE-312\nThe affected products contain credentials stored in plaintext. This could allow an attacker to gain access to sensitive information.\nCVE-2021-27487 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).\n3.2.4    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe affected product’s web application could allow a low privilege user to inject parameters to contain malicious scripts to be executed by higher privilege users.\nCVE-2021-27479 has been assigned to this vulnerability. A CVSS v3 base score of 4.6 has been assigned; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:N).\n3.2.5    STORING PASSWORDS IN A RECOVERABLE FORMAT CWE-257\nThe application allows users to store their passwords in a recoverable format, which could allow an attacker to retrieve the credentials from the web browser.\nCVE-2021-27485 has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N).\n3.2.6    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nThe affected products contain insecure filesystem permissions that could allow a lower privilege user to escalate privileges to an administrative level user. \nCVE-2021-27483 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nThese vulnerabilities were anonymously reported to CISA.\n4. MITIGATIONS\nZOLL recommends users of affected versions mitigate these vulnerabilities by upgrading to the latest version of Defibrillator Dashboard Version 2.2 or later. For upgrade assistance or questions, please contact ZOLL Data Products Technical Support by phone at 800-348-9011 option one, or via email at supportdata@zoll.com\nZOLL recommends users of affected versions keep in mind data on the defibrillator device should be considered the source of accurate data, should there be any discrepancy with the Defibrillator Dashboard.\nUsers should perform frequent local checks to confirm readiness of the devices as per manuals.\nZOLL recommends users disable the password autocomplete function on browsers accessing the Defibrillator Dashboard.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\n",
  "cves": [
    "CVE-2021-27479",
    "CVE-2021-27489",
    "CVE-2021-27481",
    "CVE-2021-27483",
    "CVE-2021-27487",
    "CVE-2021-27485"
  ],
  "techniques": [],
  "advisory": "icsma-21-161-01",
  "title": "ZOLL Defibrillator Dashboard | CISA",
  "source": "ics-medical-advisories",
  "id": "ded4ccd5ec946d1ae2eba68233d5b8fb4a3bb108eac21f2e55af3945015c9b3f"
}