{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable from adjacent network/low attack complexity\nVendor: Philips\nEquipment: Patient Information Center iX (PIC iX) and Efficia CM Series\nVulnerabilities: Improper Input Validation, Use of Hard-coded Cryptographic Key, Use of a Broken or Risky Cryptographic Algorithm\n\n2. UPDATE INFORMATION \nThis updated advisory is a follow-up to the original advisory titled ICSMA-21-322-02 Philips Patient Information Center iX (PIC iX) and Efficia CM Series that was published November 18, 2021, to the ICS webpage on www.cisa.gov/ics. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities may allow an attacker unauthorized access to data (including patient data) and create a denial of service resulting in temporary interruption of viewing physiological data at the central station. Exploitation does not enable modification or change to point-of-care devices.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Patient Information Center iX (PIC iX) and Efficia CM Series are affected:\n\nPatient Information Center iX (PIC iX): Versions B.02, C.02, C.03\nEfficia CM Series: Revisions A.01 to C.0x and 4.0\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nPatient Information Center iX (PIC iX) Versions C.02 and C.03 receives input or data, but does not validate or incorrectly validates that the input has the properties required to process the data safely and correctly.\nCVE-2021-43548 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.2    USE OF HARD-CODED CRYPTOGRAPHIC KEY CWE-321\nThe use of a hard-coded cryptographic key significantly increases the possibility encrypted data may be recovered from the Patient Information Center iX (PIC iX) Versions B.02, C.02, and C.03.\nCVE-2021-43552 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:N).\n4.2.3    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThe use of a broken or risky cryptographic algorithm is an unnecessary risk that may result in the exposure of sensitive information, which affects the communications between Patient Information Center iX (PIC iX) Versions C.02 and C.03 and Efficia CM Series Revisions A.01 to C.0x and 4.0.\nCVE-2021-43550 has been assigned to this vulnerability. A CVSS v3 base score of 5.9 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n4.4 RESEARCHER\nYounes Dragoni, Andrea Palanca and Ivan Speziale of Nozomi Networks reported these vulnerabilities to CISA.\n5. MITIGATIONS\nPhilips released a remediation for CVE-2021-43548 in Q3 2021 in PIC iX C.03.06.\n--------- Begin Update A part 1 of 1 ---------\nPhilips plans to remediate CVE-2021-43552 and CVE-2021-43550 by end of Q2 of 2023. \n--------- End Update A part 1 of 1 ---------\nUsers should operate all Philips deployed and supported products within Philips authorized specifications, including Philips approved software, software configuration, system services, and security configuration.\nAs an interim mitigation, Philips recommends the following actions outlined in the Philips Patient Monitoring System Security for Clinical Networks guide at InCenter:\n\nPhilips provided hardware ships with Bitlocker Drive Encryption enabled by default to protect the data at rest stored on the system. It should not be disabled.\nPhilips recommends customers follow NIST SP 800-88 for media sanitization prior to system disposal.\nBy default, patient information is not included in archives. When exporting archives that contain patient information, users should store information securely with strong access controls.\nThe Philips patient monitoring network is required to be physically or logically isolated from the hospital local area network (LAN). Philips recommends using a firewall or routers that can implement access control lists restricting access in and out of the patient monitoring network for only necessary ports and IP addresses.\n\nUsers with questions regarding their specific Philips Patient Information Center (PIC iX) and Efficia CM Series new release eligibility should contact a Philips service support team or regional service support. Philips contact information is available at the Philips customer service website, or by calling 1-800-722-9377.\nPlease see the Philips product security website for the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2021-43550",
    "CVE-2021-43548",
    "CVE-2021-43552"
  ],
  "techniques": [],
  "advisory": "icsma-21-322-02",
  "title": "Philips Patient Information Center iX (PIC iX) and Efficia CM Series (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "f3e89904b0b980d07f465193d0c70f4471ae7bad1221ad3e5b24adb752a9a094"
}