{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 7.3\n\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: Philips’ IntelliSpace Cardiovascular (ISCV) products\nVulnerabilities: Improper Privilege Management, Unquoted Search Path or Element\n\n2. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an attacker with local access and users privileges to the ISCV/Xcelera server to escalate privileges on the ISCV/Xcelera server and execute arbitrary code.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Philips’ IntelliSpace Cardiovascular (ISCV) products, a comprehensive cardiac image and information management software, are affected:\n\nIntelliSpace Cardiovascular, Version 3.1 or prior, and\nXcelera Version 4.1 or prior.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER PRIVILEGE MANAGEMENT CWE-269\nFor ISCV Version 2.x or prior and Xcelera Version 4.1 or prior, an attacker with escalated privileges could access folders which contain executables where authenticated users have write permissions, and could then execute arbitrary code with local administrative permissions.\nCVE-2018-14787 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:H).\n \n3.2.2    UNQUOTED SEARCH PATH OR ELEMENT CWE-428\nFor ISCV Version 3.1 or prior and Xcelera Version 4.1 or prior, an unquoted search path or element vulnerability has been identified, which may allow an attacker to execute arbitrary code and escalate their level of privileges.\nCVE-2018-14789 has been assigned to this vulnerability. A CVSS v3 base score of 4.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nPhilips reported these vulnerabilities to NCCIC.\n4. MITIGATIONS\nFor ISCV Version 2.x or prior and Xcelera Version 4.1 or prior, this has been mitigated in ISCV 3.1. Users should contact their local Philips service support team of their regional service support for upgrade instructions.\nFor ISCV Version 3.1 or prior and Xcelera Version 4.1 or prior, this will be mitigated in ISCV Version 3.2, scheduled to be released in October 2018.\nAs an interim mitigation to the vulnerabilities until ISCV Version 3.2 can be applied, Philips recommends that users:\n\nReview their file permission policies and where possible restrict available permissions.\n\nUsers with questions regarding their specific IntelliSpace Cardiovascular installations are advised by Philips to contact their local Philips service support team or their regional service support. Philips contact information is available at the following location:\nhttps://www.usa.philips.com/healthcare/solutions/customer-service-solutions (link is external).\nPlease see the Philips product security website for the latest security information for Philips products:\nhttps://www.philips.com/productsecurity (link is external).\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. These vulnerabilities are not exploitable remotely.\n",
  "cves": [
    "CVE-2018-14787",
    "CVE-2018-14789"
  ],
  "techniques": [],
  "advisory": "icsma-18-226-01",
  "title": "Philips IntelliSpace Cardiovascular Vulnerabilities | CISA",
  "source": "ics-medical-advisories",
  "id": "776379723bd7e630093ecf0dc6920719002d6072841dbca71d14fa35c70c025e"
}