{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 6.3\n\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: iSite and IntelliSpace PACS\nVulnerability: Weak Password Requirements\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker with local network access to impact confidentiality, integrity, and availability of a component of the system.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nPhilips reports the following versions of iSite and IntelliSpace PACS are affected:\n\niSite PACS, all versions, and\nIntelliSpace PACS, all versions.\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    WEAK PASSWORD REQUIREMENTS CWE-521\nDefault credentials and no authentication within third party software may allow an attacker to compromise a component of the system.\nCVE-2018-17906 has been assigned to this vulnerability. A CVSS v3 base score of 6.3 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nA user reported this vulnerability to Philips, who then reported it to NCCIC.\n4. MITIGATIONS\nPhilips recommends that users ensure IntelliSpace PACS installations run in a managed service environment that adheres to NCCIC recommendations to minimize the risk of exploitation (Virtual Private Network, Firewall isolation from other networks, no Internet access). In addition, Philips employs an automated Antivirus solution that continuously monitors and remediates threats across all systems in the managed service environment. Philips has a monthly recurring patch program which all IntelliSpace PACS users are encouraged to participate. Users who participate in this program receive all Philips approved operating system and application patches in a timely fashion. The Philips iSite 3.6 platform is currently at its end of life (EoL) and end of service (EoS).\nAs an interim mitigation to the vulnerability, Philips recommends that users:\n\nEnsure only authorized personnel can connect to the controlled network environment.\nReview instructions for use guidelines available with the application interface and follow the security best practices.\n\nPhilips will continue to add cybersecurity vulnerability remediation improvements through their secure development lifecycle (SDL) as threats continue.\nUsers with questions regarding specific iSite/IntelliSpace PACS solutions are advised by Philips to contact their customer success manager (CSM), local Philips service support team, or regional service support. Philips contact information is available at the following location:\nhttps://www.usa.philips.com/healthcare/solutions/customer-service-solutions\nPlease see the Philips product security website for the latest security information for Philips products:\nhttps://www.philips.com/productsecurity\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.NCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable from within the same local device subnet.\n",
  "cves": [
    "CVE-2018-17906"
  ],
  "techniques": [],
  "advisory": "icsma-18-312-01",
  "title": "Philips iSite and IntelliSpace PACS | CISA",
  "source": "ics-medical-advisories",
  "id": "9e85ea6998891835ec8f903fa6f6abb571d70669717832730d3e3c90e3097d6c"
}