{
  "markdown": "\n1. EXECUTIVE SUMMARY\n--------- Begin Update A Part 1 of 7 ---------\n\nCVSS v3 4.3\nATTENTION: Low skill level to exploit\n\n--------- End Update A Part 1 of 7 ---------\n\nVendor: Philips\nEquipment: Tasy EMR\n\n--------- Begin Update A Part 2 of 7 ---------\n\nVulnerability: Cross-site Scripting, Information Exposure\n\n--------- End Update A Part 2 of 7 ---------\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-19-120-01 Philips Tasy EMR that was published April 30, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\n--------- Begin Update A Part 3 of 7 ---------\nSuccessful exploitation of these vulnerabilities could impact or compromise patient confidentiality and system integrity. Philips’ analysis has shown these issues, if fully exploited, may allow an attacker of low skill to provide unexpected input into the application, execute arbitrary code, alter the intended control flow of the system, and access sensitive information.\n--------- End Update A Part 3 of 7 ---------\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Tasy EMR, a clinical and administrative workflow-based information system, are affected:\n--------- Begin Update A Part 4 of 7 ---------\n\nTasy EMR Versions 3.02.1744 and prior\nTasy WebPortal Versions 3.02.1757 and prior\n\n--------- End Update A Part 4 of 7 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79\nThe software incorrectly neutralizes user-controllable input before it is placed in output that is used as a web page that is served to other users.\nCVE-2019-6562 has been assigned to this vulnerability. A CVSS v3 base score of 4.1 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:N).\n--------- Begin Update A Part 5 of 7 ---------\n4.2.2    INFORMATION EXPOSURE CWE-200\nThere is an information exposure vulnerability which may allow a remote attacker to access system and configuration information.\nCVE-2019-13557 has been assigned to this vulnerability. A CVSS v3 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n--------- End Update A Part 5 of 7 ---------\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Brazil, Mexico\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n4.4 RESEARCHER\n--------- Begin Update A Part 6 of 7 ---------\nSecurity researcher Rafael Honorato reported and Unimed de Blumenau Cooperativa de Trabalho Médico IT Department each separately reported a vulnerability to Philips.\n--------- End Update A Part 6 of 7 ---------\n5. MITIGATIONS\n--------- Begin Update A Part 7 of 7 ---------\nPhilips advises users to update to the most recently released versions of the product, following the Tasy EMR release schedule. Update Tasy EMR, to version 3.03.1745 or higher and update Tasy WebPortal, to version 3.03.1758 or higher.\nPhilips also recommends users follow the instructions in the product configuration manual and follow market standard best practices from the application server manufacturer documentation related to security.\n--------- End Update A Part 7 of 7 ---------\nUsers should upgrade Service Packs as soon as possible. Hosted solutions will be patched automatically. Users running the application on premise are always alerted via release notes on changes to the system.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable unnecessary accounts and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA that can be found at the following location:\n\nhttps://www.fda.gov/MedicalDevices/DigitalHealth/ucm373213.htm\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities.\n",
  "cves": [
    "CVE-2019-6562",
    "CVE-2019-13557"
  ],
  "techniques": [],
  "advisory": "icsma-19-120-01",
  "title": "Philips Tasy EMR (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "337b0d1b629080a8018863a5bafaa1a1b3e12c2a4355ca25bb14e244753578a5"
}