{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 9.8\nATTENTION: Exploitable remotely/low attack complexity\nVendor: Philips\nEquipment: Vue PACS\nVulnerabilities: Cleartext Transmission of Sensitive Information, Improper Restriction of Operations within the Bounds of a Memory Buffer, Improper Input Validation, Improper Authentication, Improper Initialization, Use of a Broken or Risky Cryptographic Algorithm, Protection Mechanism Failure, Use of a Key Past its Expiration Date, Insecure Default Initialization of Resource, Improper Handling of Unicode Encoding, Insufficiently Protected Credentials, Data Integrity Issues, Cross-site Scripting, Improper Neutralization, Use of Obsolete Function, Relative Path Traversal\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the advisory update titled ICSMA-21-87-01 Philips Vue PACS (Update A) that was published January 20, 2022, to the ICS webpage on www.cisa.gov/uscert/ics. \n3. RISK EVALUATION\nSuccessful exploitation of these vulnerabilities could allow an unauthorized person or process to eavesdrop, view or modify data, gain system access, perform code execution, install unauthorized software, or affect system data integrity in such a way as to negatively impact the confidentiality, integrity, or availability of the system.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nPhilips reports these vulnerabilities affect the following Vue PACS products:\n\nVue PACS: Versions 12.2.x.x and prior\nVue MyVue: Versions 12.2.x.x and prior\nVue Speech: Versions 12.2.x.x and prior\nVue Motion: Versions 12.2.1.5 and prior\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER INPUT VALIDATION CWE-20\nThe product receives input or data, but it does not validate or incorrectly validates that the input has the properties that are required to process the data safely and correctly.\nCVE-2020-1938 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.2    IMPROPER RESTRICTION OF OPERATIONS WITHIN THE BOUNDS OF A MEMORY BUFFER CWE-119\nThe software performs operations on a memory buffer, but it can read from or write to a memory location that is outside of the intended boundary of the buffer. This vulnerability exists within a third party software component (Redis).\nCVE-2018-12326 and CVE-2018-11218 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.3    IMPROPER AUTHENTICATION CWE-287\nWhen an actor claims to have a given identity, the software does not prove or insufficiently proves that the claim is correct. This vulnerability exists within a third party software component (Redis).\nCVE-2020-4670 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.4    INSECURE DEFAULT INITIALIZATION OF RESOURCE CWE-1188\nThe software initializes or sets a resource with a default that is intended to be changed by the administrator, but the default is not secure.\nCVE-2018-8014 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n4.2.5    USE OF A KEY PAST ITS EXPIRATION DATE CWE-324\nThe product uses a cryptographic key or password past its expiration date, which diminishes its safety significantly by increasing the timing window for cracking attacks against that key.\nCVE-2021-33020 has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N).\n4.2.6    IMPROPER INITIALIZATION CWE-665\nThe software does not initialize or incorrectly initializes a resource, which might leave the resource in an unexpected state when it is accessed or used. This vulnerability exists within a third party software component (7-Zip).\nCVE-2018-10115 has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.7    IMPROPER ADHERENCE TO CODING STANDARDS CWE-710\nThe software does not follow certain coding rules for development, which can lead to resultant weaknesses or increase the severity of the associated vulnerabilities.\nCVE-2021-27501 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H).\n4.2.8    USE OF A BROKEN OR RISKY CRYPTOGRAPHIC ALGORITHM CWE-327\nThe use of a broken or risky cryptographic algorithm is an unnecessary risk that may result in the exposure of sensitive information.\nCVE-2021-33018 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:L/A:N).\n4.2.9    PROTECTION MECHANISM FAILURE CWE-693\nThe product does not use or incorrectly uses a protection mechanism that provides sufficient defense against directed attacks against the product.\nCVE-2021-27497 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:L/A:N).\n4.2.10    DATA INTEGRITY ISSUES CWE-1214\nWeaknesses in this category is related to a software system's data integrity components. This vulnerability exists within a third party software component (Oracle Database).\nCVE-2012-1708 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N).\n4.2.11    CROSS-SITE SCRIPTING CWE-79\nThe software does not neutralize or incorrectly neutralizes user-controllable input before it is placed in an output used as a webpage that is served to other users.\nCVE-2015-9251 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n4.2.12    IMPROPER NEUTRALIZATION CWE-707\nThe product does not ensure or incorrectly ensures structured messages or data are well formed and that certain security properties are met before being read from an upstream component or sent to a downstream component.\nCVE-2021-27493 has been assigned to this vulnerability. A CVSS v3 base score of 6.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).\n4.2.13    IMPROPER HANDLING OF UNICODE ENCODING CWE-176\nThe software does not properly handle when an input contains Unicode encoding.\nCVE-2019-9636 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.14    INSUFFICIENTLY PROTECTED CREDENTIALS CWE-522\nThe product transmits or stores authentication credentials, but it uses an insecure method susceptible to unauthorized interception and/or retrieval.\nCVE-2021-33024 has been assigned to this vulnerability. A CVSS v3 base score of 3.7 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N).\n4.2.15    CLEARTEXT TRANSMISSION OF SENSITIVE INFORMATION CWE-319\nThe software transmits sensitive or security-critical data in cleartext in a communication channel that can be sniffed by unauthorized actors.\nCVE-2021-33022 has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n4.2.16    RELATIVE PATH TRAVERSAL CWE-23\nThe VideoStream function allows authenticated users access to files stored outside the web root.\nCVE-2021-39369 has been assigned to this vulnerability. A CVSS v3 base score of 2.7 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n4.4 RESEARCHER\nAntonio Kulhanek reported CVE-2021-39369 to Philips. Philips reported these vulnerabilities to CISA.\n5. MITIGATIONS\nPhilips has released the following plans to address these vulnerabilities:\n\nPhilips recommends configuring the Vue PACS environment per D000763414 – Vue_PACS_12_Ports_Protocols_Services_Guide available on Incenter.\nPhilips released Version 12.2.1.5 in June of 2020 for MyVue that remediates CWE-693 and recommends contacting support below.\nPhilips released Version 12.2.1.5 in June of 2020 for Vue Motion that remediates CWE-324 and recommends contacting support below.\nPhilips released Version 12.2.8.0 in May of 2021 for Speech that remediates CWE-693, CWE-319, CWE-119, CWE-287, and CWE-1214 and recommends contacting support below.\nPhilips released Version 12.2.8.0 in May of 2021 for PACS that remediates CWE-20, CWE-119, CWE-287 and recommends contacting support below.\nPhilips released a security fix for Speech in Nov 2021 that remediates CWE-665 and CWE-327 and recommends contacting support below.\n\n--------- Begin Update C Part 1 of 1 ---------\n\nPhilips released version 12.2.1.6 in December 2021 for VuePAC (WFM), Vue Motion (Enterprise Viewer), Vue Explorer, and Web System Configuration that remediates CWE-23. \n\n--------- End Update C Part 1 of 1 ---------\n\nPhilips released Version 12.2.8.100 in Q1 / 2022 for MyVue that remediates CWE-665 and CWE-710  and recommends contacting support below.\nPhilips released Version 12.2.8.100 in Q1 / 2022 for PACS that remediates CWE-79, CWE-693, CWE-665, CWE-1188, CWE-327, CWE-176, CWE-522, CWE-710, and CWE-707 and recommends contacting support below.\nPhilips will release a fix for PACS that remediates CWE-522 with low score of 3.7 in Q3 2023.\n\nReleases are subject to country specific regulations. Users with questions regarding their specific Philips Vue PACS installations and new release eligibility should contact a Philips Sales representative or submit a quote request in the eService portal at: Login - eService (philips.com).\nThe Philips advisory is available. Please see the Philips product security website for the latest security information for Philips products.\nCISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target these vulnerabilities. \n",
  "cves": [
    "CVE-2019-9636",
    "CVE-2021-27501",
    "CVE-2021-33020",
    "CVE-2021-27497",
    "CVE-2015-9251",
    "CVE-2018-12326",
    "CVE-2018-11218",
    "CVE-2021-39369",
    "CVE-2021-27493",
    "CVE-2021-33022",
    "CVE-2021-33018",
    "CVE-2020-1938",
    "CVE-2021-33024",
    "CVE-2018-10115",
    "CVE-2020-4670",
    "CVE-2018-8014",
    "CVE-2012-1708"
  ],
  "techniques": [],
  "advisory": "icsma-21-187-01",
  "title": "Philips Vue PACS (Update C) | CISA",
  "source": "ics-medical-advisories",
  "id": "9662a171a94da96be499749ced88ab5ba584ee72df87d59ecd4fcb8eac90964e"
}