{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.8\nATTENTION: Low skill level to exploit\nVendor: Becton, Dickinson and Company (BD)\nEquipment: Pyxis MedStation and Pyxis Anesthesia (PAS) ES System\nVulnerability: Protection Mechanism Failure\n\n2. RISK EVALUATION\nThe affected BD medical devices utilize a method of software application implementation called “kiosk mode.” This kiosk mode is vulnerable to local breakouts, which could allow an attacker with physical access to bypass kiosk mode and view and/or modify sensitive data.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of Pyxis MedStation and Anesthesia (PAS) ES Systems, are affected:\n\nPyxis MedStation ES System, v1.6.1\nPyxis Anesthesia (PAS) ES System, v1.6.1\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    PROTECTION MECHANISM FAILURE CWE-693\nA restricted desktop environment escape vulnerability exists in the kiosk mode functionality of affected devices. Specially crafted inputs could allow the user to escape the restricted environment, resulting in access to sensitive data.\nCVE-2020-10598 has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nBD reported this vulnerability to CISA.\n4. MITIGATIONS\nBD recommends the following mitigations and compensating controls in order to reduce risk associated with this vulnerability:\n\nLimit physical access of the Pyxis Medstation ES and Anesthesia (PAS) ES System to only authorized users.\nIsolate impacted systems and only connect them to trusted systems.\nMonitor and investigate unplanned reboots of systems using network monitoring tools provided by IT departments.\n\nAdditionally, BD is in the process of deploying a security update that strengthens kiosk mode to limit currently known methods of kiosk escape in Pyxis MedStation and Pyxis Anesthesia (PAS) ES System Version 1.6.1. Access to tools for viewing or manipulating local resources will be restricted.\nFor more information on this issue, please see the associated BD product security bulletin on the BD website.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nEnsure there is physical protections in place to prevent the devices from any unauthorized access.\nEncourage security awareness throughout the hospital staff to ensure clinical staff will report any unauthorized person trying to login or otherwise tamper with a medical device.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-10598"
  ],
  "techniques": [],
  "advisory": "icsma-20-091-01",
  "title": "BD Pyxis MedStation and Pyxis Anesthesia (PAS) ES System | CISA",
  "source": "ics-medical-advisories",
  "id": "5174acf2ad5eeb7a4295d488ec7bf764dd912d94d05aa98fdde528b1063e2ed0"
}