{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 6.5\nATTENTION: Exploitable from an adjacent network/low attack complexity\nVendor: Philips\nEquipment: e-Alert\nVulnerability: Missing Authentication for Critical Function\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an unauthorized actor to remotely shutdown the system, if on the healthcare facilities network.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the e-Alert hardware solution are affected:\n\ne-Alert Version 2.7 and prior\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    MISSING AUTHENTICATION FOR CRITICAL FUNCTION CWE-306\nThe software does not perform any authentication for critical system functionality.\nCVE-2022-0922 has been assigned to this vulnerability. A CVSS v3 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n3.4 RESEARCHER\nExternal researcher Andrew Dedmon reported this vulnerability to Philips.\n4. MITIGATIONS\nPhilips plans a new release to remediate this vulnerability before July 2022. As an interim mitigation to this vulnerability, Philips recommends the following:\n\nUsers should operate all Philips deployed and supported products within Philips authorized specifications, including physical and logical controls. Only authorized personnel should be permitted to access the network and the devices connected to it.\n\nUsers with questions about their specific e-Alert product should contact a Philips service support team or regional service support. Users can also reference the Philips advisory for more details.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as its connected devices.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2022-0922"
  ],
  "techniques": [],
  "advisory": "icsma-22-088-01",
  "title": "Philips e-Alert | CISA",
  "source": "ics-medical-advisories",
  "id": "3dd48e3ffcd0966320fd2b9abd22dc615bac54a867b42854982e1db16474a05a"
}