{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 7.3\nATTENTION: Low skill level to exploit/public exploits are known for this vulnerability\nVendor: Insulet\nEquipment: Omnipod Insulin Management System\nVulnerability: Improper Access Control\n\n2. RISK EVALUATION\nSuccessful exploitation of this vulnerability may allow an attacker to gain access to the affected products to intercept, modify, or interfere with the wireless RF (radio frequency) communications to or from the product. This may allow attackers to read sensitive data, change pump settings, or control insulin delivery.\n3. TECHNICAL DETAILS\n3.1 AFFECTED PRODUCTS\nThe following versions of the Omnipod Insulin Management System are affected:\n\nProduct ID/Reorder number: 19191 and 40160\nUDI/Model/NDC number: ZXP425 (10-Pack) and ZXR425 (10-Pack Canada)\n\n3.2 VULNERABILITY OVERVIEW\n3.2.1    IMPROPER ACCESS CONTROL CWE-284\nThe affected insulin pump is designed to communicate using a wireless RF with an Insulet manufactured Personal Diabetes Manager device. This wireless RF communication protocol does not properly implement authentication or authorization. An attacker with access to one of the affected insulin pump models may be able to modify and/or intercept data. This vulnerability could also allow attackers to change pump settings and control insulin delivery.\nCVE-2020-10627 has been assigned to this vulnerability. A CVSS v3 base score of 7.3 has been assigned; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:L).\n3.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health \nCOUNTRIES/AREAS DEPLOYED: United States, Canada, Europe\nCOMPANY HEADQUARTERS LOCATION: United States\n\n3.4 RESEARCHER\nThirdwayv Inc. reported this vulnerability to Insulet; Insulet reported this vulnerability to CISA.\n4. MITIGATIONS\nInsulet recommends patients using the affected products talk to their healthcare provider about the risks of continued use, including the possibility of changing to the latest model with increased cybersecurity protection.\nAdditionally, Insulet recommends all patients take the cybersecurity precautions indicated below.\n\nDo not connect to or allow any third-party devices to be connected to or use any software not authorized by Insulet.\nMaintain tight physical control of the pump and devices connected to the pump.\nBe attentive to pump notifications, alarms, and alerts.\nImmediately cancel any unintended boluses (a single dose of insulin administered all at once).\nMonitor blood glucose levels closely and act as appropriate.\nGet medical help immediately when experiencing symptoms of severe hypoglycemia or diabetic ketoacidosis or if you suspect insulin pump settings or insulin delivery has changed unexpectedly.\n\nInsulet has released additional patient-focused information.\nMore information is available regarding Insulet’s product security and vulnerability management.\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nRestrict system access and access to devices able to connect to the affected device to authorized personnel only and follow a least privilege approach.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA.\n\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nThis vulnerability is not exploitable remotely.\n",
  "cves": [
    "CVE-2020-10627"
  ],
  "techniques": [],
  "advisory": "icsma-20-079-01",
  "title": "Insulet Omnipod | CISA",
  "source": "ics-medical-advisories",
  "id": "5cc9ca628299b4b321a3dd4f848610e861dfc5d46aa483ef83a8b4afedeea8cb"
}