{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\nCVSS v3 5.3\nATTENTION: Exploitable remotely/low skill level to exploit\nVendor: GE\nEquipment: Aestiva and Aespire Anesthesia\nVulnerability: Improper Authentication\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the original advisory titled ICSMA-19-190-01 GE Aestiva and Aespire Anesthesia published July 9, 2019, on the ICS webpage on us-cert.gov.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability could allow an attacker the ability to remotely modify GE Healthcare anesthesia device parameters. This results from the configuration exposure of certain terminal server implementations that extend GE Healthcare anesthesia device serial ports to TCP/IP networks.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of GE Aestiva and Aespire Anesthesia Machines, are affected:\n--------- Begin Update A Part 1 of 1 ---------\n\nGE Aestiva  7100, 7900, MRI\nGE Aespire 7100, 7900, 100, Protiva, Carestation, View\nGE Aisys, Aisys CS2 Avance, Amingo, Avance CS2\nGE Carestation 620, 650, 650c\n\n--------- End Update A Part 1 of 1 ---------\n4.2 VULNERABILITY OVERVIEW\n4.2.1    IMPROPER AUTHENTICATION CWE-287\nA vulnerability exists where serial devices are connected via an added unsecured terminal server to a TCP/IP network configuration, which could allow an attacker to remotely modify device configuration and silence alarms.\nCVE-2019-10966 has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: United States\nCOMPANY HEADQUARTERS LOCATION: United States\n\n4.4 RESEARCHER\nElad Luz of CyberMDX reported this vulnerability to CISA.\n5. MITIGATIONS\nGE Healthcare recommends organizations use secure terminal servers when connecting GE Healthcare anesthesia device serial ports to TCP/IP networks. Secure terminal servers provide robust security features, including strong encryption, VPN, authentication of users, network controls, logging, audit capability, and secure device configuration and management options.\nGE Healthcare recommends that organizations utilize best practices for terminal servers that include governance, management, and secure deployment measures such as network segmentation, VLANs, and device isolation to enhance existing security measures.\nGE Healthcare plans to provide updates and additional security information about this vulnerability for affected users at the following location:\nhttp://www3.gehealthcare.com/en/support/security\nCISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all medical devices and/or systems.\nLocate medical devices behind firewalls and isolate them where possible.\nRestrict system access to authorized personnel only and follow a least privilege approach.\nApply defense-in-depth strategies.\nDisable any unnecessary accounts, protocols and services.\nWhere additional information is needed, refer to existing cybersecurity in medical device guidance issued by the FDA at the following location:\n\nhttps://www.fda.gov/MedicalDevices/DigitalHealth/ucm373213.htm\nCISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\nCISA also provides a section for control systems security recommended practices on the ICS webpage on us-cert.gov. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS webpage on us-cert.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability.\n",
  "cves": [
    "CVE-2019-10966"
  ],
  "techniques": [],
  "advisory": "icsma-19-190-01",
  "title": "GE Aestiva and Aespire Anesthesia (Update A) | CISA",
  "source": "ics-medical-advisories",
  "id": "d30156c2ed29a41601b98686dde750f8d5b6fe4654f5279d38fe8b60894b9572"
}