{
  "markdown": "\n1. EXECUTIVE SUMMARY\n\n\nCVSS v3 5.7\n\nATTENTION: Low skill level to exploit\nVendor: Philips\nEquipment: Philips IntelliVue Information Center iX\nVulnerability: Resource Exhaustion\n\n2. UPDATE INFORMATION\nThis updated advisory is a follow-up to the updated advisory titled ICSMA-18-233-01 Philips IntelliVue Information Center iX (Update A) that was published August 30, 2018, on the NCCIC/ICS-CERT website.\n3. RISK EVALUATION\nSuccessful exploitation of this vulnerability may result in a denial of service, the operating system will become unresponsive due to the network attack, which will affect the applications ability to meet the intended use.\n4. TECHNICAL DETAILS\n4.1 AFFECTED PRODUCTS\nThe following versions of Philips IntelliVue Information Center iX, real-time central monitoring system, are affected:\n\nPhilips IntelliVue Information Center iX Versions B.02.\n\n4.2 VULNERABILITY OVERVIEW\n4.2.1    UNCONTROLLED RESOURCE CONSUMPTION ('RESOURCE EXHAUSTION') CWE-400\nAn attacker may compromise the device’s availability by performing multiple initial UDP requests.\nCVE-1999-0103 has been assigned to this vulnerability. A CVSS v3 base score of 5.7 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n4.3 BACKGROUND\n\nCRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health\nCOUNTRIES/AREAS DEPLOYED: Worldwide\nCOMPANY HEADQUARTERS LOCATION: Netherlands\n\n4.4 RESEARCHER\nA user reported this vulnerability to Philips, who then reported it to NCCIC.\n5. MITIGATIONS\nPhilips has identified and put in place mitigations to reduce the risk of exploitation of this vulnerability. In order for users of affected devices to mitigate exposure to this vulnerability, Philips recommends following the device’s labeling, including instructions for use and service guide(s), which provide compensating controls.\n--------- Begin Update B Part 1 of 1 --------\nPhilips will provide the remediation in the form of a patch by the end of November 2018 for all PIIC iX B.02 users.\n--------- End Update B Part 1 of 1 --------\nPhilips’ contact information is available at the following location:\nhttp://www.usa.philips.com/healthcare/solutions/customer-service-solutions\nThe Philips advisory is available at the following URL:\nhttp://www.philips.com/productsecurity\nNCCIC recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. Specifically, users should:\n\nMinimize network exposure for all control system devices and/or systems, and ensure that they are not accessible from the Internet.\nLocate control system networks and remote devices behind firewalls, and isolate them from the business network.\nWhen remote access is required, use secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPN is only as secure as the connected devices.\n\nNCCIC reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures.\n\nNCCIC also provides a section for control systems security recommended practices on the ICS-CERT web page. Several recommended practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies.\nAdditional mitigation guidance and recommended practices are publicly available on the ICS-CERT website in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established internal procedures and report their findings to NCCIC for tracking and correlation against other incidents.\nNo known public exploits specifically target this vulnerability. This vulnerability is exploitable from within the same local device subnet.\n",
  "cves": [
    "CVE-1999-0103"
  ],
  "techniques": [],
  "advisory": "icsma-18-233-01",
  "title": "Philips IntelliVue Information Center iX (Update B) | CISA",
  "source": "ics-medical-advisories",
  "id": "256e8403ce3cce3b364df3cfe09dbc0def5a4e2916165c6048dfe54a2a8f4520"
}